idx,text
32561,"Just got back from my second cruise with Norwegian. 

* Had terrible flight days -- nightmare drivers on the way there and stranded in airport overnight on the way back. 
* Had one bad shore excursion, one rescheduled excursion, and one cancelled excursion. 
* Had an allergic reaction that kept me basically immobile for 3 days.

With all of that, I still had a freaking fantastic time.  The people are friendly. The food is great. The boat is clean and has tons of entertainment. When there's a problem, they are helpful. 

There's nothing better than sitting on a balcony over the open ocean at sunset, drinking a beer or a cup of hot tea, and reading some trashy genre novel with someone you love. I can't recommend it enough.

LPT: If you are on one of the older boats with mini-suites on the back of the boat, they are worth the upgrade. You'll get way more space, better service and a much better balcony for only 7-8% higher fare."
32562,"I've been on many many carnival cruises, and one NCL. I was probably too young to appreciate the difference, but cruises are my absolute favorite vacation of all time. 

Too bad my gf joined the Coast Guard... wont be going on a cruise...ever."
32563,"...Because now she associates cruises with work, and wants to party as far from the waves as she can?

...Because she wouldn't be able to turn off the part of her brain that would nitpick all the safety regulations the crew would be skimming past?

...Because she's had to watch cruise liners sink, and would never risk it?"
32564,Your username is my favorite coffee/chocolate shop chain here in Seattle. Their mochas blow my mindhole
32565,I really need to know why she won't go on a cruise/ you won't go with her. You can't do this to me
32566,"Because she spents 3 months straight on a small ass boat (well, small relative to a cruise ship). The last thing she wants to do when she gets off is be on a boat."
32567,My dad was in the coast Guard and he loves going on cruises.  He says there is a big difference between being on a boat for work and one for vacation. He's huge on boating for leisure.
32568,On some of NCL's ships they're coming out with The Haven. Check it out. It's awesome.
32569,I'd second the cruise suggestion as well - we did one for our honeymoon and loved it (have done 3 more since then)
32570,We're doing the Mediterranean cruise for my honeymoon in October and I'm so excited. It's going to be on the Princess and I've only been on two Carnival cruises before this.
32571,"Honestly? Get a travel agent. In most cases, you don't pay them, they get a fee from various hotels and airlines that they recommend. Any place with a good reputation (Liberty's pretty decent, don't use AAA) will get you a great vacation. If anything goes wrong, instead of being stuck with whatever you booked online, you can call your agent and they'll fix it for you. You'll have a much better time if you get someone who's job it is to know these things to help you than if you try to get it done online. It surprisingly doesn't cost more than you would book for online, either."
32572,"I may have brought this up in another thread, but consider a non-all inclusive.  I have been going to Cancun for many years, and the all inclusive resorts have been killing off the local restaurants and cultural offerings.  Not to mention, the way many of these resorts offer such low cost, is paying their employees absolute crap and cutting corners on amenities, often times to make up for a bad week, month or quarter.   It's really sad actually."
32573,"Hey good point. Great motivation to dive into the culture on vacation. ""Buy local"" while you're there."
32574,"Is it advisable for tourists to dive into the culture? I have read that it isn't recommended to go off resort in Cancun. SO is in a wedding and wants me to go next year, but I have moral misgivings with the treatment of locals. Do you have any insight?"
32575,"The locals are just like us. They are going to pick the very best jobs avalible to them. Just because it's a crappy, low paying job by your standards doesn't mean it isn't a job they are happy with.

And at the end of the day, the quality of life of the people who live and work there has nothing to do with whether or not LightningReptar chooses to vacation there or not."
32576,"Being able to pick the best jobs assumes there is a diversity of jobs and opportunities.  The boom of all inclusive, reduces the number and diversity of jobs and opportunities, which puts huge downward pressure on wages.   So I would say it matters where LightningReptar chooses to stay in any given destination."
32577,"I know one person doesn't change an industry. But, this is something I personally care about. So, it does matter."
32578,"Yes.  Your patronage in their country is aiding the surrounding community.  Resorts hire locals.  The money you pay a resort is given to the employees.  The employees better their lives with said money.

Is it a 1:1 exchange?  Do the locals get every dime spent when booking a room at a resort?  No.  But I guarantee it's more than they would make if you refuse to go."
32579,"Take sensible precautions just like any city, and you will be fine. The drug cartels stay out of tourist areas because its where they make their biggest business. As for ethical questions having to do with resorts--yeah they probably aren't the best option for the local economy. In these massively scaled up tourist areas (of which Cancun might be the largest I've seen at least), there are plenty of barriers to entry into the market to keep competitors out that might pay better wages.  If you want to be safer and remain in a tourist area but get out of Cancun, Tulum is a nice alternative."
32580,Just got back from a beautiful spot near Tulum a few months ago. Very safe and we had a great time! The resort even sets up a market place on site to support local businesses :)
32581,"I've been to Bogota, all over Costa Rica, and Ramallah (West Bank), never touched an all inclusive, and never had a problem. Beggars in some areas will target you a bit aggressively if your in an area known for resorts and you look like you've come from one but it's not a big deal. Go out and enjoy a culture."
32582,"Agreed. I spent a week at the Radisson resort in Aruba. It was pretty expensive for a Caribbean resort (but Aruba tends to be, in general) and not all-inclusive. 

But, we drank our fill of sugarly umbrella'd drinks and decided we would just have fun, pretend it was all-inclusive, and deal with the bill later. It ended up being about half what we expected. We also walked a block further from the resort than most visitors did, and found amazing restaurants.

Our beach was perfect. White sand, no rocks or seaweed, not over-crowded. The drinks were fast and perfectly delicious every time. The campus was a gorgeous paradise or palm trees, lizards and parrots, with lovely rooms and lit pools for night-swimming.

We walked down the beach to where the all-inclusive resorts that we'd looked at were. For only $500 more we could have had a shitty rocky seaweed filled overcrowded beach. We ended up paying $600 for our nacho and booze tab for the week, plus probably $500 on restaurants we wouldn't have gone to if we'd had all inclusive.

So all in all, we paid about $600 more, but the difference between the resorts was night and day, and we explored the island way more than if we'd felt tied to eat at the resort cause it was paid for already."
32583,You have to love any place where you have a nacho tab
32584,"> Cancun for many years, and the all inclusive resorts have been killing off the local restaurants and cultural offerings


You do realize Cancun and points south were specifically developed and designed to be a tourist and mega-hotel resort destination.  Prior to the hotels it was nothing but a few small fishing villages with not much ""culture"" to speak of.  If you want culture of Mexico you do NOT got to Cancun.  Merida, Guadalajara, Mx City, Puerto Vallarta (to some extent) and many others are destinations for cultural interest.  Going to Cancun and complaining about lack of cultural offerings is like going to Disney World and complaining about all of the pictures of Mickey Mouse."
32585,"My wife and i aren't really into all inclusive resorts. We just got back from our second trip to St. Martin, French side, and had a great time like we did the first time.  It was May, so it was the end of the busy season, got rooms for cheap, had the beach nearly to ourselves, all the places were open, beautiful weather, ate every night in a different gourmet French restaurant or local place within a 10 minutes walk from the hotel. Both vacations were fantastic and quite affordable."
32586,"I kinda agree with this. I don't know if I'll feel different for a honey moon, but currently my gf and I are really into going places and staying at someone's home/apartment rather than a hotel. Services like [airbnb](http://www.airbnb.com) make it really safe, easy and cheap.

We recently finished a trip to Paris, somewhere I thought I'd never see. [This was our apartment view](http://i.imgur.com/1Yh0Wvp.jpg). It was really cool to live like a local, go down to the local cafés and order drinks and breakfast. By the end of the trip, this one cafe knew our orders.

I mean, it's cool to relax and shit, but honestly you pay so much money to get to a far off destination. Do you really want to spend it taking sterile tours and hiding in your hotel's beach front?"
32587,"I came to the same consensus after our honeymoon.  While it's nice to not have to worry about money while on the trip, I don't think it was worth the added expense.  I believe I could've received comparable service and drinks for the same cost at a non-inclusive resort.  Also, I know I would have received much better food.

However, when traveling on hotel points I prefer the all inclusive resorts because I don't have to worry about spending money on food or drinks."
32588,"We stayed at thebodyholiday at Le Sport in St Lucia

The place is incredible, so much to do (or little - you decide!)

Everyday each guest gets a free spa treatment

The food is incredible, and the island is beautiful! We went for two weeks and loved it!

www.thebodyholiday.com"
32589,"Did you check out tripadvisor.com? I use them for all of my bookings to check out customer photos of the places, reviews, ratings, etc. I've never found a place that wasn't listed on there with at least a few ratings and reviews.  You can even sort accomodations/locations by ""good for couples""."
32590,I usually book through Agoda. Sort your results by review score - find something with an average over 8.0 in you price range (provided there are reasonable number of reviews). I have yet to be disappointed this way. Maybe also check the last page of reviews to make sure the place hasn't gone down the tubes recently.
32591,"Consider a cruise. http://www.vacationstogo.com/ 

Dollar for dollar, a cruise can be the single best bang for the buck, especially if you live in or near a port city. Always something fun to do on the ship, no worries about transportation during the vacation, and if you stay away from the buffet and stick with the restaurants on the ship ( not the high-end pricey ones, but the regular ones ) you'll avoid the crowds. Room service was free, last time I was on a cruise. I've had a good experience on Norwegian or Holland-America; mostly newlyweds and nearly-deads, hardly any annoying kids. No need to tip the room service until the end of the cruise. Depending on your budget, you can explore a new town every few days, or you can find a 're-positioning' cruise that crosses an ocean. Don't worry about the level of your room within the ship, you won't spend much time there, just get one near the middle of the ship. If you've never gone on a cruise, you really need to try it."
32592,"Vacations to go agents are some of the most helpful and knowledgeable people to use.  Excellent down to earth people and pretty good rates.  www.funjet.com is an excellent source for resorts as well. 

Source: I work in the travel industry (not at vtg or funjet) 

Also, buy travel insurance!! Especially if you are leaving the country as your medical plan probably only covers you domestically."
32593,"My wife and I got married at Rayavadee in Krabi, Thailand earlier this year. If there's a more amazing place with a better setting and service etc. then I'm yet to see it.

It's a peninsula between 3 beaches, one of which, Railay Beach is the best I've ever been to. Inaccessible by car so you have to get a longboat (or speedboat) from the main part of Krabi. They filmed a James Bond film on an island just off the coast and The Beach was also filmed on another island in the area.

I honestly cannot imagine that anyone could find a better place for a honeymoon, it's that amazing."
32594,"I've only been to one all inclusive resort and coincidentally it was for an october honeymoon. We went to the Sandals St. Lucia Regency (I think that was the name of it, it's the biggest of the three on St. Lucia). We had an incredible time there. From the second we got there till we left, we really felt like a welcomed guest. It's really cool that you can leave your wallet locked in your room for a week and never think twice about it. Beautiful grounds, great staff, delicious food, great activities to do. Even the spa where we got a couples massage was fantastic. Like I said, my experience is very limited but if you're looking for recommendations, we loved it. Another cool thing was that you had full access to all three resorts on the island. Just hop on the shuttle, and when you get there everything is available to you. No check in process or anything. Just step off the shuttle and pony up to the bar. Pretty neat. Anyways, that's my two cents. Congratulations OP and I hope you have a great time wherever you end up."
32595,I know folks who also enjoyed Sandals for their October Honeymoon (at the Jamaica location).
32596,Thanks for the feedback. How was the weather in October?
32597,"Just got back from St Lucia... Check Ti Kaye Resort, very private resort.  Great staff, food, beach, and wine.  Cool excursions nearby if you want.  Or beach it up and snorkel too."
32598,"Gorgeous. Mid 80's to low 90's. Perfect for spending the day in the pool or at the beach. Constant offshore breezes, mild warm nights, no jacket needed, really really nice. YMMV."
32599,"I also vote St. Lucia. A friend of mine just got back from Jade Mountain- an INCREDIBLE place but pretty damn expensive. If you have the money though, totally worth it, just look at it, it is insane. http://www.oyster.com/st-lucia/hotels/jade-mountain-resort/"
32600,"Jade Mountain is an incredible resort. If you want a bit of mountains and a bit of beach, add on Sugar Beach. 10/10"
32601,"[""The wild women, the wild women, the rippin' and the tearin', the rippin' and the tearin'.""](http://youtu.be/YVtEX1J7tXQ)"
32602,"No matter the location, look it up on Google Maps with Street view. Many brochures and websites make the places that you want to look crowded, such as bars and dance floors, crowded, and places you don't want crowded, such as pools & beaches, without few people. There's even [new apps](https://itunes.apple.com/us/app/touchretouch/id373311252?mt=8) out that allow people to instantly ""photoshop"" their vacation photos. 

Starting here is great, word of mouth is the best. Personally, I'd go for the off-season packages."
32603,"Talk to a travel agent. Don't feel you have to book through them, but they are a good resource. They can give you information on lots of different resorts from their previous customers' experiences. Then you can check what they suggest against reviews on tripadvisor or similar site. Who knows they might even give you a better price if you find it cheaper on the web."
32604,they will also recommend whatever resort is paying them the highest commission or running the best incentive program
32605,"The Barcelo resort in Puerto Vallarta, Mexico is uuuunreal if youre looking for that kinda thing. Was there in April with my girlfriend. Beautiful resort, awesome food, gorgeous rooms. Such a prime place that I hope to return to."
32606,"I recently stayed at Capella Pedregal in Cabo San Lucas, Mexico. It was absolutely amazing down to every last detail. The service there is top notch, great food on site at the resort, one of the top rated spas, salt water pools on the balcony of each room, just a 5 minute walk into town. I can't wait to go back, I highly recommend it. Came across it on TripAdvisor.com."
32607,"I can only speak from 2007-2009; but I practically lived at Royal Solaris in cancun for a few years all inclusive for $2000/month; holy fuck it was amazing;

Haven't been in a while so not sure if cartels have impacted that...but if they have, probably cheaper prices."
32608,I went on a trip to Akumal on the Yucatan peninsula a few years ago. There were quite a few of us but we rented a large house that came with it's own cleaning lady/cook who was absolutely fantastic. I don't remember how much it was but in that neighborhood there were various sized houses (mostly all privately owned and for rent as vacation spots). We were right on the ocean and could just walk out the back door and go snorkeling. It was great!
32609,Check out the RIU. It's a European chain. Wifey and I had a good time at the paradise island one in the Bahamas. Good food. European beer.
32610,We just got back from the Andaz Maui. Opened in Sept 2013 so less than 1 year old. Spectacular views. Management even left a bag filled with jams on our door when we asked where we could buy that brand. Now that's taking care of your guests!
32611,"Sandals St Lucia. 

We went there for ours and it was incredible."
32612,"Oyster.com is good.

Also dont set your mind immediately to the all inclusive places. Local cuisine is often a big positive of traveling and you can usually have a room plus food, drink, entertainment for a similar cost to an all inclusive."
32613,"We went to the Hard Rock Hotel and Casino in Punta Cana, Dominican Republic in January. It was easily the best vacation we've ever taken and we're already planning our return.

http://hardrockhotelpuntacana.com"
32614,"The wife and I stayed at a Riu Palace in Aruba and loved it. We only had Wi-Fi in the lobby, but it worked out fine for us. All the rooms are mini suites and we had (included!) room service every morning.  They're very willing to accommodate you and we tested that by ignoring the room service menu and writing notes with what we wanted to eat. They always made it happen! Great experience.

Aruba is just outside of hurricane alley so you don't run the usual Caribbean risk. It's ""One Happy Island!"""
32615,"Try to find a new one...it may be cheaper because they are trying to gain popularity, and by nature less likely to be broken down.  As for reviews, I always find yelp and trip advisor to be helpful."
32616,"I use trip advisor. If you get over a 30 review sample size, it's great."
32617,Fake reviews are out of control. Last vacation I took I picked a few that looked good and then reddit came through. Asked to compare a few and found people that stayed there which was good enough for me. Stayed at the rendezvous couples resort in st Lucia. Think its theromanticholiday.com or some shit that place was cool as shit
32618,"As others have said, tripadvisor and other sites. Look for the bad reviews. If you notice a bad trend that would bother you, stay away. Such as, ""yes, you can swim with dolphins but they are in a tiny depressing cage.""

Remember that costco puts together packages that usually beat the prices of other places. Pick a date you have to have everything booked by then start calling them on different days. Watch the prices fluctuate. Pick the best deal."
32619,"I go on Trip Advisor and look at the photos and reviews on there. A lot of places looked nice in the photos the resort had up and had great reviews.. but once I got on Trip Advisor and saw photos actual guests had taken, it was so different. Its the first place I go to check out resorts now :)"
32620,"My wife and I honeymooned at the Sandals Royal Caribbean in the Bahamas for 9 days. It was fantastic! Great service, good food, beautiful beach and we had a lot of fun exploring town too. 11 restaurants on site offered a lot of variety -  though with any all-inclusive check availability since not all restaurants are open all the time. Definitely plan to do another Sandals trip again."
32621,"Having just come back from Sandals in Montego Bay, Jamaica. .. I enjoyed it. If only for a mindless trip to the beach without having to worry about where to eat etc. My wife won the trip before we got married at one of those bridal shows where vendors/venues/services come advertise.

Further... it is disconcerting to see the slums of Jamaica after I just stuffed my face with sushi and crab legs while wasted off of free drinks."
32622,"Mexico is a train wreck!  How about going to Maui?  Warm breezes, beautiful beaches, palm trees and no third world drug cartel massive poverty crap like you have in cabo.  We went to Cabo on our honeymoon and the next year went to Maui for a do over"
32623,"In a similar vein, try Aruba if you can afford it. When looking up safety tips, the only warning I saw was ""try to avoid the oil refinery at night... there haven't been any incidents but it's been reported that it feels a bit on the shady side""

I know friends who've gone on vacations to resorts in Mexico and Cuba, and how there are armed guards on the beaches. Sounds less than relaxing to me..."
32624,"That's why you should be going to Maui.  All of the beautiful scenery, relaxation, beautiful beaches, delicious food, nice people and fun activities that you would want on a vacation and none if the third world crime BS that you shouldn't have to deal with on a vacation.  I live 200 miles from the Mexican border and instead fly 2500 miles to Maui every summer."
32625,"Have you considered going on a cruise. That would be an ""All-inclusive"" vacation personified. Your fare includes your stateroom, all the food you could possibly eat, entertainment, and travel to your destination. You are required to pay for any cocktails, beer and soda you order, and there is plenty of shopping on board that could bring the tab up, but you can usually be careful and get away with a pretty budget-minded trip. If You are thinking about Cabo, they have a 7 day trip out of Los Angeles that does one day in Puerto Vallarta, and two days in Cabo san Lucas.

Last thing I will add is, make sure to spring the extra couple dollars for the Balcony staterooms. They are not too much more than the other rooms, but absolutely make all the difference in your experience.

Source: Been on eight cruises,....to Mexico, Hawaii, and Tahiti. (all balconies)"
32626,">You are required to pay for any cocktails, beer and soda you order

So, like not ""all-inclusive"" at all.  I would much rather get free drinks and pay for food."
32627,"Slightly off topic and it may be too late for you but my fiance and I are getting married at a Hyatt property. We found a promo that would give us 66,000 Hyatt points if we got married at a Hyatt property in 2014. Couple that with a Hyatt credit card where we get 3x points for all Hyatt expenditures and we will use our points to pay for a (effectively) free all-inclusive week at a Hyatt property.

We are thinking Hyatt Zilara in Cancun because it is adults only."
32628,I am going there tomorrow. Remind me and I will let you know first impressions etc.
32629,"Ok, two days into the adventure I would recommend Hyatt Zilara without reservations.

I will say that they upsell you (and dang it, it worked) but the suites are nice, the pools is awesome - and the surrounding beaches are just beautiful and great for playing in.

The food is all inclusive and has so far been pretty good. The sushi place was so/so but their teppanyaki was good and a fun little show. I recommend that when you book the hotel you make them get you reservations for that, Marie Maria, and Chefs plate (mostly because they are ""hard"" to get reservations at according to reviews and from what we've seen that is right).

Free drinks all around, pool service, free room service, etc is good.

Hope that helps, and congratulations on your upcoming wedding."
32630,"I find Tripadvisor to be a good resource for reviews.

However, don't settle on just one source for reviews.  Also, if you're trying to sort out the fake reviews from the real ones, look for the BAD reviews.  You won't find fake reviewers posting bad reviews, so you know they're real.  One bad review might be a disgruntled customer, but try to see if there's more than one bad review of the same type, then you know to stay away."
32631,Competing resorts/hotels are known for posting bad reviews which can make it hard to identify real ones. The middle of the road ones or ones with photos are the best bet usually.
32632,"they used to make this thing, i know im dating myself a bit here but... a 'Travel Agent' ?"
32633,I asked a travel agent last week to make some suggestions given my budget and a few ideas of locations.  She asked me to let me know what hotels I wanted to stay in and any attractions we wanted to do. She was no fucking help.
32634,"Usually you just have to tell them your budget and what you're expecting from the trip. They may give you a few options of places to stay, but they sort it for you. Also, most people tend to have some sort of idea of what they want to do on a vacation. Like, if you're going to Italy, you may know that you want to do a vineyard tour or go horseback riding. If you're going to India, you may know that you absolutely want to see some tigers. You must have just gotten a bad person or someone who wasn't good at communicating."
32635,"We're still around. You'd be surprised, really. And we're thriving."
32636,How does it work? Who pays you?
32637,"I'm in a similar situation and if anyone could give any good recommendations for some where in Costa Rica, Colombia, Ecuador, or Peru it would be much appreciated."
32638,"I wish I could remember the name of the all-inclusive resort my wife and I went to in Playa Del Carmen, Mexico.  We were there for two weeks. 

Our room wasn't anything better than say, a Sheraton or Mariott, but being on the beach, and not having to toss out any money except for tips was nice."
32639,"Playa is a fun little island. We stayed right on the strip and it was a great time. A bit touristy sure, but orders of magnitude less than Cancun.  If you are there at the right time, you can dive with whale sharks.  Freaking awesome."
32640,"That was why my wife and I went, to stay as far away from Cancun as possible."
32641,My wife and I got everything you're asking for with a cruise.
32642,"I travel a lot, and often on a budget. I have always looked at the bad reviews (3 or less out of 5). Look for consistency in complaints (same thing repeated) and see if they are complaints about things you would care about. An example is that at one resort that we were looking at the consistent complaints were that the bartenders didn't know how to mix good fancy tropical drinks. We drink jack and coke and other simple mixed drinks, I could care less about the fancy umbrella laden ones. Another place complained about lack of cleanliness in the rooms ... We are neat freak germaphobes, so that was a big NOPE!

It takes some time, but it Is usually worth it, especially for a honeymoon (congrats!)."
32643,Try checking groupon. We got an incredible all inclusive room in Cancun for $90 a night.
32644,"I don't have general tips but one specific: I spent my honeymoon (2011) at Bucuti in Aruba (http://www.bucuti.com/)
It's not all inclusive, but I would definitely reccomend it.
Its guests are 90% honeymoon couples.
The island itself is fantastic.
Feel free to reply or contact me for further informations :-)"
32645,Bucuti is awesome.  Eagle Beach is so much better than the high rise area.
32646,trip advisor? :)
32647,"I stayed at [Playa Grande](http://playagranderesort.com/) with some friends and it was quite amazing. I have heard of some the all inclusive actually having alcohol in the rooms which this one did not. The pricing was pretty fair. The food was really good. Our tower had a private pool/bar area with a water slide down to a lower level of it. Then there is a series of  massive pools at the ground level right next to its private beach. I am sure, no matter where you stay though, it will be an amazing honeymoon."
32648,"Pick an all inclusive, make sure it is a brand name.  Hilton in Jamaica was awesome.  I like the Marriott in St. Thomas too.  Costa Rica was nice, but didn't like beach - black sand.  In Mexico, just outside some resorts is dangerous...most actually.  All are fine if you don't leave."
32649,"Check out Jicaro and Hacienda de la Puerta in Nicaragua. All inclusive except for alcohol - which is dirt cheap, so doesn't really matter.
Just did my honeymoon there, completely awesome. Views, food and service were all top notch"
32650,"yo, american citizen here, lived in Thailand for 8 years, worked with lots of hotels, resorts, restaurants, etc there. also a lot of wedding catering etc.

So the thing I'd look for, in your situation, is an 'expat forum'.  for example, Thaliand has the site ""Thaivisa"" (among others) where a large number of English-speaking expatriates congregate online, and they generally have specific areas for specific regions of a country- with people asking where to get a cheap good booking on a hotel, where to get a good american burger or some real italian pasta, and where to find great spots to hang out (tour destinations, restaurants, nice bars, events, etc).

So it depends on where you're going. but if you want to go there, odds are somebody like you wanted to live there before you had the idea, and they'll probably have an internet connection- so find them and ask."
32651,"First of all congratulations for having a reason to go for a honeymoon :)

Second, as a lifelong self organized travler I would say do not go for an all-inclusive! I know it sounds like fun and nothing-to-worry about kind of vacation, but trust me, you miss soooo much!

What is the reason for going to Cancun or Bali if on fact all you get is a kind of golden-bar-prison? You only get to see the place you stay at and something that you can get to with an organized tour?

There is really nothing to be afraid of, I suppose that for the price you get to pay for a all-inclusive honeymoon around classic US destinations you can self-organize a month long tour around Europe? 

Think about places like Sicily, Balearics, Croatia, mainland Italy, Vis island, Amsterdam, Madeira, Canary Islands etc. In all this places you can safely just make a booking through some trivago, booking.com and not really worry about safety or quality :)

Go around scouting for small local restaurants as you are there, taste the culture, see how it looks like outside a resort! :)"
32652,"Especially Bali, which is truly an amazing place to explore. I looked at people cooped up in their little tour buses and felt sad for them. $20/night got me a nice room with a fruit bowl, muesli and coffee for breakfast--perfectly pleasant. Wandered around the city and found an absolutely gorgeous massage place where for $50/each we had quite possibly the best and most relaxing massage I've had in my life..  Got ripped off on a Durian fruit--paid $10.  What a weird fruit.  Keccak fire dancing, local artists (mask makers)...  Learned a lot about their culture, which seems to mix the concepts of commerce and spiritual fulfillment in a particularly effective way.  I definitely learned something from the trip about how to live my own life. The place is just incredible and those poor saps in the tour bus don't see any of it."
32653,"I have had REMARKABLE results with vrbo.com.  We have used them for every occasion, from casual to upscale...from just us to a group of people.  As an added security, I choose the accommodations I want, and cross reference them with Trip Adviser.  I am very pleased with every one I've done. (vrbo stands for Vacation Rentals By Owner)..."
32654,"Not sure if it's been mentioned, but my sister used http://www.unforgettablehoneymoons.com/

They took care of absolutely everything. All they had to do was show up.  I didn't use it because I didn't want to stay at an all-inclusive."
32655,"My wife and I honeymooned in Costa Rica, and Hilton Papagayo in Guanacaste.  It was fantastic. This was about five weeks ago, in late May.

While the resort itself was not the newest or most polished place (a few things could have used a coat of paint, or general refreshing), it was a fantastic experience.  The staff were friendly, the food was good, the drinks were good, the activities were fun (but seriously consider doing nothing).

We decided before leaving that we were going back in a couple of years (probably 2016).

Edit: Added timeframe."
32656,"When looking at reviews, check recent ones. A 3 year old review is almost useless. Some of these places have an incredibly high turnover in staff. You lose a good head chef, your food turns to shit.  And vice-versa, if they fire the head of housekeeping and hire a hard nosed clean freak, you'll suddenly see the cleanliness jump.  

I've seen this a lot in Mexico. Places that I would swear by up and down 1 year, take a sudden dive 2 years later, and no one wants to go there anymore."
32657,"My wife and I went to dreams Los Cabos for our honeymoon and we can't wait to go back for another vacation. It was fantastic! We weren't able to swim in the ocean because of the strong currents, but the food was excellent, the service excellent, the rooms are all excellent. I really have nothing bad to say about the place!"
32658,"I booked for super cheap through a great website you should check out. Luxurylink.com.  It's not for the super wealthy like it may suggest, but they have AMAZING deals on all inclusive resorts all around the world. You can even bid! Have fun checking it out!"
32659,TripAdvisor.com. There are guest reviews and pics a plenty on there.
32660,I'll keep this really short since Google will tell you all you need to know: Go to [Namale](http://www.namalefiji.com/).
32661,"Fiji is dirt cheap.

You can get some very very good all inclusive packages at some top notch resorts, but departing from the US could bump the total up somewhat."
32662,"We found YouTube clips from people who had been to the resorts we liked to get an unvarnished look at them. Also, typically in the resorts on outer islands seem to have poorer food quality for price than ones on mainland Mexico. Makes sense, I suppose since it has to be delivered there."
32663,"I know it's a little crazy and I'm not sure what you and your Fi are into, but my hubs and I did an all inclusive safari resort in South Africa. Absolutely life changing, and different from the normal all inclusive honeymoon. Londolozi was heaven on earth!"
32664,"How much you want to spend?

http://www.tripadvisor.ca

User review site."
32665,"My wife and I went to Sandals in Montego Bay, Jamaica- All inclusive resort and it ran us right around $5,000 including flights. It was the best experience we had ever had. The resort was beautiful and had plenty of variety in food and activities. The people were incredibly friendly and maintained the grounds beautifully. We plan to go back on our 5 year anniversary. I would highly recommend it!"
32666,"I went to a friend's wedding at Beaches, Turks & Caicos. The food was good, the staff were friendly and the beach was the most beautiful I've ever seen. It was a September wedding and the resort was practically empty because it was hurricane season. No lines for food, drinks, water sports, nothing. It was really great. By far the best wedding I've ever been to."
32667,"If you can get to Thailand, I'd recommend it over just about anything else. The whole country is basically centered around the tourism industry and so will do anything to make your time there enjoyable. My girlfriend and I stayed on  [Koh Samui](http://thailandbucksandhens.com/wp-content/uploads/2013/09/13562520912.jpg)  and would go back in a heartbeat."
32668,"Are you a AAA member? If so,  they have a free travel agency service,  just stop by a local office.   My wife and I used them for an all inclusive to the Bahamas earlier this year and they made it super easy and it was exactly as described."
32669,"Mexico has wonderful resorts, but I encourage anyone going there to choose one close to a town instead of going all-inclusive.  My wife and I honeymooned at one on Isla Mujeres that was within a few blocks of a street closed off to traffic that is lined with outdoor cafe's.  Great way to save money and you're not stuck with the resort food if it sucks or you don't want to overeat buffet style every day.  We go back every year now.  
We also go to one along the Riviera Maya for the luxury treatment where we're waited on hand and foot, but we still go out to catch a cheap bus to Playa del Carmen for cafe's and entertainment."
32670,Looking at a couple all inclusive resorts in Belize. Coco may Plum is on the top of the list. Anyone have any suggestions on that one?
32671,"Hello fellow honeymooner. My fiancé and I are honeymooning in Belize this August. I am in your same shoes and I'll share with you some key tips I picked up from trip advisor and misc. forums. 

I tend to stay away from 'all inclusive' hotels because ""sometimes"" it's a way of getting visitors to stay in an area that's not too popular or is lacking some other thing. Ex. Some resorts offer drinks and all day buffets, but are miles away from any authentic food. Basically eating at any other place is a mission. Eating out is part of the experience and I personally get tired of the same thing everyday. If you're on a budget though, take an all inclusive deal. 

Look at hotel pics on expedia. Stay away from hotels with floral linens, they're washed less because they can conceal stains. If you're looking for good rooms and great service, I must recommend any Hyatt. My fiancé and I stayed at the Hyatt in Aruba, Cancun, San Diego, NYC... the service is consistent and phenomenal. The staff will bend over backwards for you, and the concierge will find you the best possible deal to any 'touristy' thing you want to do, without the fear of getting ripped off by locals.

If you're traveling in October, keep in mind it's hurricane season in the gulf/carribean. Aruba, curaçao, and Trinidad/Tobago are not in the hurricane belt, and have consistent weather year round."
32672,You should check to see if it's listed on [TripExpert.com](http://tripexpert.com)
32673,"My wife and I honeymooned at an all inclusive resort in October.  Its all a gamble, since it is hurricane season - a friend of mine was evacuated from his honeymoon the week after us in Cancun.

It seemed that it was less likely the Pacific side would experience heavy weather (but still possible) so we stayed at Dreams - Puerto Vallarta and booked through Apple vacations.  This was nearly 10 years ago thought, so there may be better options.  We enjoyed the amenities and the trip was a success.

Good luck!"
32674,"Some friends of mine (two different couples) have been to Excellence Resorts in Punta Cana more than once and really seem to love it. One of these couples can afford to go anywhere they please yet they go back to this place often. 

Unfortunately I can't tell you from personal experience how this resort is because my first trip there isn't until December. I used bookit.com and was able to secure 7 days with air from Atlanta and airport transfers for under $1400. Yes, it is a lot of money for sure but unlimited alcohol and non-motorized water sports are also included. Too, bookit.com offers the Bill Me Later payment plan if chunking out that much at once is a consideration."
32675,"You're young.  Plan a trip based off of the things you like and live it up.  Save the all inclusive packages for the retired folks.  With the money you save on commission and overpriced food, you can get a much better bang for your buck.

That aside, there is no shortage of all inclusive resorts on islands surrounding wherever it is you are from.  If you happen to be from America: Belize, Puerto Rico (Culebra), and Mexico come to mind as particularly affordable areas that have 'resorts'.  Of course there is always Florida, S. Carolina, California, etc if you don't have a passport."
32676,"I work for a Tour Operator in Canada. Now if you looking for the Caribbean, this will all wind down to what kind of service, beach, entertainment and such....off the top of my head, I would say take a look at the Sirenis La Salinas in Varadero Cuba :) Solid 4* and the food is great beach is great and its bang for buck."
32677,All-inclusive resorts are for people in their 70s.
32678,"Couldn't disagree with this more.

Have done 2 all inclusive trips to Punta Cana and 1 to Cancun and only turned 30 the day before yesterday.  Forget Cancun.  Punta Cana is a great time (and I've also been lucky enough to do Grand Cayman, Grenada and travel much of the rest of the world).

The question is what do you expect out of an all-inclusive?  Are you looking for motorized watersports?  Diving?  Trips?  

In my mind the best part of an all inclusive trip is this:  you know what you are going to pay. If you go to PC you know the food is going to be just fine and your drinks are going to be free.  The value of not having to pull your wallet out nonstop is pretty much invaluable.  

Majestic Colonial and Excellence in PC were pretty darn nice.  The Excellence also have an adults only area which is great.

One other caveat - the above depends entirely on your budget.  If you can spend $3k/person for a week, screw the all inclusive and go to Asia.  If you want to do $3k all in, then try the all inclusive...."
32679,Thanks for the feedback.. I ended up going with a place near playa del carmen Mexico for a great deal.. it seems to offer exactly what we want!
32680,"There is only one all-inclusive resort in the US and it is not oceanfront. It’s actually on a river in Florida. 

Is there a reason you are limiting your choices to within the US?"
32681,"I know which Club you're talking about. It keeps coming up, but it's actually 2 miles from ocean beach.

I've been looking at San Diego and Georgia as well. It seems like all-inclusive doesn't really apply to many places here, and I'm a little curious as to why...

Edit: There are health issues keeping us in the Continental US."
32682,"Yes, like I said Sandpiper Bay is the only all inclusive in the US. if you are looking mainly at all-inclusive resorts in the hopes of saving some cash then I might recommend a vacation home. With a full kitchen you can save considerable on meals over what you would spend at a hotel. 

Other than that, as I said there aren’t any true all-inclusive resorts in the US that are beachfront."
32683,"The US doesn't really have all-inclusive resorts.  You find them in the Caribbean and Mexico.

Drop ""all-inclusive"" and just look for a kid-friendly resort.

Also, many places farther up the coast like Virginia or North Carolina won't have beach weather in March, so southern parts of Florida or California or Texas would probably be your best bet, depending on which of those you are closer to."
32684,"Very true. Thanks =)

Could you make any recommendations?"
32685,"Fort Lauderdale maybe.  Warm in March, family friendly, great food, and worthwhile day trips in the area, like Miami or the Everglades."
32687,"We thought about it, but my father in law wants to be at ""the beach, in sun"" with his grandchildren. He's of the mindset that he wants to pay for everything up front, with known costs. Old-fashioned, maybe...."
32689,Hmmm....looking into it...
32690,"How about the Gulf Coast in Texas, or the Myrtle Beach area of SC?"
32691,"Good idea, but my FIL really want ""all-inclusive"", and I'm trying to explain to him that he might be better to budget for the other expenses, but it's proving difficult. There are health issues that keep us in the states as well. Thanks for your reply =)

Edit...I've been looking at TX, can you recommend anything, even if not allinclusive?"
32692,"What kinds of things is he looking for? All meals included? What kinds of activities, etc.?"
32693,"The all inclusive ""American Plan"" is a very rare animal theses days for luxury hotels.  Let your FIL frustrate himself searching for a beach resort that will provide it.   Otherwise FIL should considered renting a staffed house on the beach.  Can be pricey."
32694,"Agreed , but I don't want to frustrate him. My wife and I are trying to look for a vacation that's within his desires.  Easy access to beach. No worries about additio al costs.

He's starting to see his sun set, and wants to have a last hurrah.

Thank you, though."
32695,"I grew up in Southwest Florida and we often had friends stay at [South Seas Resort](https://www.southseas.com/) on Captiva Island which is beautiful. They have tons of activities for families, in-resort dining, a huge swath of private beach access, a spa... It's pretty nice, you might want to check out their site."
32696,I’m guessing the Virgin Islands are out?  Just trying to figure out the need to be in continental US specifically.  If you can fly (like to FL or TX) then maybe it’s because of insurance? In which case would the US Virgin Islands work?  I thought I saw something about resorts there in my T&L magazine.  Good luck in your search!  It’s such a blessing to have generous in laws!! :)
32697,"TripAdvisor is a good idea for this. 

You can search beach, family friendly, all inclusive, and in the USA. 

 * https://www.tripadvisor.ca/Hotel_Review-g34296-d8796643-Reviews-Casa_Pellegrino_Boutique_Hotel-Hollywood_Broward_County_Florida.html
 * https://www.tripadvisor.ca/Hotel_Review-g552080-d498918-Reviews-Acqualina_Resort_Spa_on_the_Beach-Sunny_Isles_Beach_Florida.html
 * https://www.tripadvisor.ca/Hotel_Review-g51790-d268490-Reviews-The_Ocean_Lodge-Cannon_Beach_Oregon.html
 * https://www.tripadvisor.ca/Hotel_Review-g51790-d95948-Reviews-Surfsand_Resort-Cannon_Beach_Oregon.html
 * https://www.tripadvisor.ca/Hotel_Review-g34347-d7890277-Reviews-Courtyard_by_Marriott_Marathon_Florida_Keys-Marathon_Florida_Keys_Florida.html"
32698,"I think they have their time and place. If you're looking for somewhere you can lie on a beach all day, drink a lot, and not worry about doing any planning yourself, then yeah they can be great. If you're looking for any substance or cultural experience out of your vacation, then you'll be disappointed."
32699,"Yea... its more of a vacation spot then ""travel"".  When I travel... I come home exhausted with a head full of inspiration.

When I get back from a ""vacation"" I have a nice tan and am very relaxed."
32700,"I'm looking for ""vacation""."
32701,"One could always LEAVE the resort to experience some culture. It's not like you're stuck on a ship or anything. I'll admit that you're not putting yourself in the most optimal position to experience culture, but that certainly doesn't mean it can't be done and that you're going to be ""disappointed"".

But to add to the comment, I find resorts are more well-suited to relatively large group, say 8+ (?)."
32702,"I travel extensively for work and usually have to make my own arrangements. I can and have organised complex multi-centre vacations but it is a lot of work.

Going to a good, all-inclusive resort is a way of losing that source of worry. I can't comment on Sandals, but there is something to be said for no having to carry cash around (and worry about it on the beach). General security is better because such resorts do not like freeloaders so no strangers on the territory and the other guests do not petty thieve.

However, you very much get what you pay for. A good resort will have a wide selection of food and drink and buffets tend to be refreshed for the duration rather than running out of goodies. It will often have a kids club so your children are looked after and entertained.

If you do feel crazy, a resort complex is not a ship. You can take organised excursions or just head out by yourself at any time."
32703,I think it has it's time and place. My parents and I went on vacation in Cozumel and stayed in my first all inclusive. We also had a car so we could go to the town and other Mayan ruins. But it was nice for us because we didn't have to worry about dinner or drinks and you could pay a small fee for water activities and scuba all you want ( which is what we went for) they also were able to set up a way to get to chichen itza without going on the big tour bus.
32704,"They're like spring break for adults. If you're just looking to sit on the beach and drink and be around other people looking to do the same, all-inclusive is the way to go. It doesn't matter where you go either because they all look the same from the beach and you're not really going to be getting any cultural experience or local food sampling b/c it's all cookie cutter resort food."
32705,I spent my spring break at a resort... as an adult.
32706,I spent my spring break at a resort... as an adult
32707,"My husband and I have gone to Sandals Whitehouse (Jamaica) and Secrets Maroma (Mexico). If you're looking for a week to relax, all-inclusive is the way to go. If you're looking for adventure, it's probably not the route to take. I also think that it is well worth the money because of all of the inclusions. There's a lot to do on the resorts and we found the food/drinks to be excellent. We spent approximately 4,000 for each of these trips including flight. Here are links to two reviews I posted on tripadvisor for more info: http://www.tripadvisor.com/ShowUserReviews-g1009314-d499965-r98093271-Sandals_Whitehouse_European_Village_and_Spa-Whitehouse_Westmoreland_Parish_Jamaica.html and http://www.tripadvisor.com/ShowUserReviews-g150812-d1007582-r115699879-Secrets_Maroma_Beach_Riviera_Cancun-Playa_del_Carmen_Yucatan_Peninsula.html

PM me if you want more info"
32708,Thank you so much.
32709,We got busted sneaking into a Sandals resort once. Walked up the beach in Negril and one of the guards followed us in.
32710,Seems entirely overpriced to me.
32711,"I really don't understand why you'd go to one. You're essentially trapping yourself on one complex. Half the fun of being on holiday is finding new bars and restaurants. I don't see how it's a hassle. Plus, if you don't really like your hotel, you're pretty fucked because you've already paid for everything. I really don't like the buffet meal service either. I'd much prefer to have a freshly cooked meal brought over by a waiter than piling some cold pasta onto my plate."
32712,"If you just want to stay in a resort, why even leave the country? You're not experiencing any other culture and probably limited to a few off-property excursions. That isn't traveling, it is touring."
32713,"What's wrong with touring?

'Travelling' is touring too."
32714,"We went to the Excellence Playa Mujeres (Cancun) a couple years ago and it was truly all inclusive. We arrived late, around midnight, so all the regular restaurants were closed. We ordered room service, which was no cost. They have 11 restaurants, and indeed they aren't always open all at once, but at least 6-8 are open at any time of day. Alcohol available all the time, minibar included... absolutely no hidden costs. EXCEPT for their spa, which needs to be booked extra and will cost.

Other than that: great beach, great pools, great experience all around :)"
32715,Seconding this. My gf and I went there and had the most amazing time. I'm currently looking for something in the same style for our next vacay!
32717,"Under 3k for the week. I am open to any nice real all inclusive resorts. The biggest thing is I don't want to be told we can't have something or do something. If I want a long island at 9am or food at any given time I want to be able to. I would like a nice pool and beach. My wife and I just want to relax and have fun. 

I see reviews on many where they claim 11 restaurants to choose but they are not open all the time. Or free drinks only served at dinner. Or can't take food with you ect."
32719,Yes under 3k for both for 6 nights and flight. Bookit.com has only 1 or 2 above that price. I live in FL so the flights are cheap.
32720,"The Royal Playa Del Carmen.

The TripAdvisor reviews are legit — it’s a wicked place with a true all-inclusive feel (incl 24/7 room service, wet bar, etc)."
32721,"My wife and I have stayed at Riu Palace in both Riviera Maya and Punta Cana. Although both were great, the one in Mexico seemed to be better. 
In each of the rooms there are liquor dispensers filled with tequila, vodka, whisky and gin. The mini fridges are always stocked with beers, waters, and pops for mixers.
Depending on the time of day there is always at least one buffet open (breakfast, lunch and dinner). Then in the evening there are various themed restaurants open. Most are just walk in welcome, but some you need to make a ""reservation"" which is just going to the concierge and telling them you want to eat here tonight.
They also offered free equipment rental on the beach. You can rent snorkels, kayaks, catamarans and I'm sure some other things that we didn't bother with. 
I can't think of anything that wasn't included or costed extra. The one thing that I recalled that was nice is that if you stay at the Palace, you have access to all of the other Riu restaurants for breakfast, lunch and bars. This is really convenient when you want to take a stroll on the beach and you want another drink. You can walk up and get a drink at any of the other Rius."
32722,"**Notice:** Are you asking for travel advice about Mexico?

Read what redditors had to say in the **[weekly destination thread for Mexico](http://redd.it/2ph1bn)** 

You might also be interested in **[our page about Mexico City](https://redd.it/400xtl)**.


*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/travel) if you have any questions or concerns.*"
32723,"Club Med Punta Can. Hands Down.  EVERYTHING is included. Food, drinks, water sports, trapeze 🤪, entertainment. Incredible!!"
32724,Thank you. I will add that to the list.
32725,"As a travel agent I'd like to disagree. They do have most things included however its a differently style of all inclusive, its very european. Theres no 24 hour food/drinks, very limited options in terms of things to do, entertainment is very limited, no transportation in the actual resort. I'd steer clear if you wanted something truely all inclusive."
32726,I have never had to spend an extra penny at club med and have had so many great things to do that are included. Food and drink all day and night. We always go. I know what club med you are thinking of.
32727,"The Grand at Moon Palace in Cancun is a very high end all inclusive resort, the Hard Rock in Punta Cana is also fantastic. Both come with resort credit which you can use on the spa's or excursions that are offered within the resort."
32728,"I'm not sure you can use the word ""real"" when describing such a trip."
32729,Don't be condescending.
32730,"How am I being condescending?

Dude can take whatever sort of trip he/she fancies but this doesn't change the fact that such a property provides a far from ""real"" travel experience.

I love Taco Bell but I'm fully aware it's not real food."
32731,"You know full well that the word ""real"" was intended to mean ""fully"" rather than ""authentic"". You're just being critical of OP's preferences.


I also like staying at independent hotels and eating at locally owned restaurants when I travel as a matter of preference, but that doesn't mean it's a more ""real"" experience than visiting Disneyland. It's just different.


I visited Antarctica, and every meal I ate was on a cruise ship. (Of course) Does it mean that my experience wasn't ""real"" because I wasn't harpooning seals for dinner?"
32732,"I love you right now! So tired of people judging other people decisions and options.

Mate, do what you want on your real free time and let others do what they want with theirs.

OP is asking for advice on a resort not to be convinced about changing his holidays to go hiking the Annapurna..."
32733,Haha the last thing I want to do on my vacation is hike. I work industrial construction in work boots all day. I stick to keeping my drukin ass on a beach.
32734,"> to go hiking the Annapurna..

Funnily enough...this is on my short list :D

When you post on an internet forum you're bound to get some jackass saying the wrong shit...'tis the nature of the beast!"
32735,"Guess so! I feel silly for giving real advice on things I know about instead of judging everyone! Seems to be the cool trend 😜

Oh and I love Disney!! Maybe because I’m Spanish and go there once in a million years and everything is so pretty and happy!! Yep... maybe you’re right and it is not very real..."
32736,"I don't judge everyone. I wasn't even judging OP. 

I was simply pointing out one flaw in their travel plans that they may or may not have considered."
32737,"Hahaha, sorry I forgot you were pointing out that they are planning an imaginary trip! 

No worries, I’m half joking here. 

I just had a rant in another post where I asked a question about Japan and read this straight away and continued my rant with you. 

It’s late and I’m in Vietnam trying to not be ripped off by everyone, a “fake” resort sounds heaven to me right now 😅"
32738,We lived in Saigon for 7 months so I feel you.
32739,"Thank you and yes this is what I meant. We don't want to have to drive. I'm not looking to discover DR. We are looking to get away from our 3 kids and drink, dance, and unwind without a schedule. I have vacationed a lot in the FL Keys but you have a tiki bar and maybe one restaurant other than that you have to drive. I refuse to drink and drive. The resort with all the food and drink and activities sounds like what we want. We just don't want to be blindsided."
32740,"> but that doesn't mean it's a more ""real"" experience than visiting Disneyland.

Actually yes. Yes, it does.

I've been to Disneyland four times and had a blast 3 of the 4 times - but it's quite literally the fakest place on Earth. It's the antithesis of real.

You can take issue with me providing zero useful information on OP's thread, that's fair enough, but going to a giant fuck-all corporate shit show resort isn't a real travel experience. It may be fun. It may be relaxing. But it's something else."
32741,"Given one of the top rated threads has people saying they prefer the canals in Las Vegas to Venice because they don't smell (of the sea?  IDK I've never managed to get a whiff of what offends people), even this place has issues with 'real' and 'authentic' sometimes ;)"
32742,"To be 100% honest, I actually preferred Las Vegas to Venice...not literally the fake canals at one hotel versus the real deal but just the overall experience. Venice was cool but I felt it was overrated compared to the mystique it garners in the travel community as a whole."
32743,"I unironically loved Vegas too, but ditto Venice (one of the few places I've visited more than once), I just don't get how they can be compared in any meaningful way."
32745,"> Taco Bell may not be quality food, but it's still real food.

> How is it not real?

Dude...

> They both have their purposes.

I didn't tell dude not to go. I merely suggested he not use the word real when describing such a trip."
32747,"> Are you the guy that runs Gecko Rock?

Yes.

And look...I do see how what I said came off as being condescending.

But one thing I have learned working in this business is that the vast majority of the travel market is massively uninformed about all the options available when planning a trip.

We've had so many guests tell us that they've only ever stayed at these giant resorts and they had no idea there were other options. I know it's hard to imagine, given that this forum is jam packed with people who find their own way around the world...but most people still book their overseas travel at Costco or similar and I'm sorry, I don't feel in the slightest bit bad about pointing out the reality that there is, in fact, a better way to see the world.

If you're aware of the options and choose to go with the giant corporate shit show because you honestly prefer it, then that's your prerogative and I hope you have a great time...but seriously, most people getting started with international travel have no clue that they don't have to stay in a giant sterile complex with the only off-site excursions being on a bus emblazoned with the name of the resort they're staying at. 

I don't think there's anything wrong with pointing out the obvious flaws in a mega-resort or cruise vacation...people should have thick enough skin to reply, ""But I like that shit,"" and do their thing.

I've had great times in phony places like Disneyland, Universal Studios and Las Vegas...but if someone tells me they do this crap for every single trip then I suggest that perhaps a break in the routine to Paris or Peru might be a nice change of pace."
32749,"It's too late for me to not look like a dick in this thread...oh, well...but honestly, my initial post to OP was meant to be more of a ""hey, are you fully aware of all the options available?"" more than ""your plans are dumb.""

But to your ""constant flow of beer"" comment...there are a zillion places you can do this for the same price or less without being cooped up in a resort.

Beers are just over $1 here in Puerto Escondido...you can have a more authentic experience while getting shit canned for next to nothing - best of both worlds.

Or look into Lake Atitlan...awesome party scene with incredible opportunities to climb volcanoes and visit gorgeous colonial towns."
32750,"Lots of threads about this on the Trip Advisor forums, so you may want to check there as well. You already have found Secrets the Vine. Also consider LeBlanc, Live Aqua, Sun Palace and Hyatt Zilara. Outside of the hotel zone, look at Excellence Playa Mujeres and Beloved Playa Mujeres.

It really depends on what is best for you. Secrets the Vine doesn't have a swim up bar. LeBlanc probably has the best food, but they don't have full balconies in most rooms and the resort is quiet. Sun Palace has a small pool, and the rooms are not that lux. For me, if I had to be in the hotel zone, I'd pick a suite at Live Aqua. Outside of the hotel zone, I'd pick Excellence if I wanted to party or Beloved if I wanted to chill.

If you really like the Secrets brand, Secrets Maroma is the one you want, but it is a bit farther south. For something less expensive with a fun pool, Valentin Imperial Maya is a great property, but it is a slight step down for food."
32751,"I actually posted today on TA the very same question. But of course thousands ask the same question almost daily there. It's hard to sort through them though but I only had two people trying to help cross off my list. 

I can't believe how hard this is."
32752,"I know what you mean. I only know this stuff, because I have been going to the area about 1-2x per year for the past 20 years.

I think what it boils down to are a couple questions:

Do you want to party or looking for a quiet place to relax?

Are you traveling as a couple or are you traveling with friends?

Also, in the end, you really do get what you pay for with the resorts in the area. All of the ones I listed are pretty similar as far as quality is concerned. It is the vibe that is different. You won't have a bad time regardless of your pick, so don't stress out too much. If you like the vibe at STV, go for it. Keep in mind that one of the pools is for preferred club rooms only, and there is no swim up bar."
32753,"I would like to relax but a bit more lively atmosphere wouldn't be horrible as we are going with friends. Cost is important though, I found that a dozen of the all-inclusive adult only places are 1900 or less for 4 days. Being such a cheap trip I guess giving somewhere a shot is a bit easier in that regard so I shouldn't stress. This isn't super fun though, figured it would be. lol"
32754,"My wife and I came up with this list, many because they a cheap. All of them are 4 nights  for two people. Each one is a ocean view suite.

[Hideaway At Royalton Riviera Cancun](https://www.tripadvisor.co.za/Hotel_Review-g240327-d7085194-Reviews-Hideaway_At_Royalton_Riviera_Cancun-Puerto_Morelos_Yucatan_Peninsula.html) \- 1,300

Excellence Rivera Cancun - 1,900

[TRS Coral Hotel](https://www.tripadvisor.co.za/Hotel_Review-g1229340-d14091089-Reviews-TRS_Coral_Hotel-Playa_Mujeres_Yucatan_Peninsula.html) \- 1,300

Live Aqua Beach Resort - 1,600

[Hotel Riu](https://www.tripadvisor.co.za/Hotel_Review-g150807-d286104-Reviews-Hotel_Riu_Cancun-Cancun_Yucatan_Peninsula.html) Palace Las America's - 1,400

[Haven Riviera Cancun](https://www.tripadvisor.co.za/Hotel_Review-g150807-d13499839-Reviews-Haven_Riviera_Cancun-Cancun_Yucatan_Peninsula.html) \- 1,500

[Hyatt Zilara Cancun](https://www.tripadvisor.co.za/Hotel_Review-g150807-d642781-Reviews-Hyatt_Zilara_Cancun-Cancun_Yucatan_Peninsula.html) \- 1,900

Secrets The Vine - 1,800

[Sun Palace](https://www.tripadvisor.co.za/Hotel_Review-g150807-d152894-Reviews-Sun_Palace-Cancun_Yucatan_Peninsula.html) \- 1,400

&#x200B;

We got the list cut down some but it has been hell trying to narrow things down. It's our first time visiting Cancun and we also want all inclusive / adults only."
32755,Who are these prices booked through? And do you happen to know what websites have the best/most affordable prices?
32756,"These were all priced out direct. I went through Expedia, cheapcaribbean etc but the prices always came back close. I was told that if you can't get a good deal that it's safer to just go direct due to changes, cancellations etc. Southwest vacations did have some OK deals going on with air though, but once again they weren't a huge savings.

But we are having a hell of a time picking. We want to book in the next few weeks so I have been researching as much as possible."
32757,I went to riu las america in October and it was great!
32758,"That is on our list currently. It's been tough and many have removed only to be put back on. RIU looks nice, the reviews are consistent and the placement at the top of the 7 is good. But I get more of a ""hotel"" vibe than a resort one. I think it's due to not really being spread out. But I haven't written it off yet."
32759,I got 4 nights all inclusive ocean view for 2 at Royalton CHIC for $1080 using Tripadvisor.
32760,"I have to be honest here - Your budget is probably too small. It definitely is not going to get you ""the best.""  I don't really know you could do this without a super cheap flight / transport and zero activities. Where are you flying from? Secrets is a mid-to-high range brand and I don't know that you could cut it with that amount.  You could try to book a 'run of the house' room which is usually not a desirable one but cheaper than others.

&#x200B;

try to break down the costs:

flight - If you could get a good deal, $200 maybe? Right now I am looking at prices from ATL (very close to CUN) and they are between 200-400. There is a lot of pent up demand and still reduced capacity.

5 days, 4 nights - so (850-200)/4  = 162 a night.usually rooms are booked for 2 guests maybe you can get a discount if you only have 1 person but I have never investigated that

a room at a Secrets resort right now, even in August, is looking like $250-350 a night.

if you are young/traveling alone and would consider a hostel, you could do that and go to beach clubs. Or go with a less expensive hotel with less amenities.  I will say for myself that I love Secrets and it is worth it to me, but I really get a lot of the amenities (pool, sports, gym, spa, a lot of restaurants, etc.). If you just want to enjoy the beach and drink, you can do that in a less expensive hotel."
32761,"It really is what you are looking for. There are a million. It would help to know ages of who is going, interest, looking to party?, want really quiet?, is beach use important? vibrant pool needed? Different resorts cater to different folks."
32762,Vacation Express.
32763,"Currently at Le Blanc as I type this. Top notch service and food. Amazing place. Definitely a low key place, you dont come here to party. But the party zone is a 10min walk away. Definitely recommend it"
32764,Excellence Playa Mujeres for so many reasons!!!!
32765,My fiancé and I are going to excellence for our first time next week. Any recommendations or must do’s in the area?
32766,"It’s not far from Puerto Morelos. There is GREAT snorkeling there when the seas are calm. The resort can arrange a half day trip for you. Other than that, we simply enjoyed the resort. And don’t hesitate to order multiple lobster tails. If you like Mezcal, the guys behind the bar can do some sampling for you. And ask for a Sangrita in between. Plus, try Agavero. It’s a tequila. For us, there is literally nothing we would change about that resort."
32767,Awesome! Appreciate the response. We can’t wait.
32768,Anytime. Feel free to hit me up if you have any more questions.
32769,"Big vote for zilara!!! Top notch staff, good, snd beaches!
Ohhhhh I just saw your budget. That’s a tough ask for an adults only all inclusive. You might need to cut some days or up the budget."
32770,"Your price point is incredibly low if you are truly wanting the ""Best All-Inclusive Resorts in Cancun"". I'd guess $1200 - $1500 would be more reasonable for the best. I'd head over to [Booking.com](https://Booking.com) and try their filters to narrow down the options with the amenities you want, then sort by price."
32771,"""Best"" is very subjective. You should edit your post to add what sort of vibe you want or something about what you hope for out of the place you stay. Some of the best Adults only AI's probably aren't going to be the best for you. 

I've stayed at Secrets, LeBlank, Live Aqua, and Hyatt Zilara in the Hotel Zone myself. All of them are good but there are trips I just want to chill in a relaxed vibe and Hyatt Zilara fits that for me. Personally if I want excitement I go to Hotel Xcaret just south of Playa and stay in their Adults Only because it includes transport and entry to all the X parks. Just came back from there in January. However if you want a party vibe neither of these will be for you and I would suggest Live Aqua."
32772,"Which Secrets? There are a few I think in that area, but I have stayed at the Secrets Silversands and while I haven't been in a few years, my family and I used to go for Christmas. Granted it was a different experience and pricier, but we always really enjoyed ourselves. It's adults only which is nice, and there were always fun groups of vacationers from all over to meet and chat with during our trip. From the Cancun airport it's about 20-25 mins away, so not sure this is the location or particular Secrets. you are talking about. There is a Maroma, and a couple more but some are much more south."
32773,"The best possible tool, which happens to be free, on the market is learning to find the issues for yourself. Computers aren't reliable editors and can still miss glaring errors. They work for spellchecking, but not much more.

If you're serious about becoming better, there are countless free resources on the Internet. An excellent place to start is with [The Blue Book of Grammar and Punctuation](http://www.grammarbook.com/), by Jane Straus. It's simple, easy to understand, and will give you the tools needed to improve your writing, both stylistically and mechanically."
32774,"The standard (free) Grammarly isn't bad, honestly. I use it regularly at work as a copy writer, and it's way helpful at pointing out things I've overlooked. Plus, you can turn it on and off for different websites, and the download for Microsoft Office is also free."
32775,"http://proofreadbot.com/

http://www.paperrater.com/

https://prowritingaid.com/

https://www.languagetool.org/

I use Grammarly Premium.

//Read a lot :)"
32776,"I'll add my own tool to the list.  It's free.

[https://www.slickwrite.com](https://www.slickwrite.com)"
32777,"This is my approach. 


1. After I write something, I use the read aloud functions in Windows Word, or the really great read aloud function on Apple. Hearing the sentence helps me fix it. 


2. I paste the copy on the [hemingwayapp.com]. (http://hemingwayapp.com/) This is not a grammar checker. It flags sentences that are complicated. It prompts you to rewrite a sentence. To simplify it.  This might solve some of your problems. They also have a version that downloads as a win/apple desktop."
32778,"I like your first tip, I'm going to give it a try."
32779,Have you tried Grammarly's premium product? It seems to do all of this.
32780,I've never tried their premium but if it works for this and it's that much of an issue for you I think it would be a great investment.
32781,"Ah does it? The premium version enforces a compound style guide?

The tips about dictionaries and reading up and whatnot are great for new writers, but this is a different situation for me. I've been writing seriously for almost 20 years, 15 of those professional. It's not an issue of knowledge, *I* know that home buying is still the most formally correct form, homebuying is often used as one of those technically-incorrect-but-growing forms, and home-buying should never be used. But that doesn't matter. My brain wanted to do all three forms in one paragraph, so it did. It's like a game, seeing what words it can chop up or compound for me hiding in plain sight as I write. So I really do need a *tool* that is going to actively enforce things or at least grab my attention better.

It's rough with compounds because a lot of them are legitimately a matter of style or represented in multiple ""correct"" forms across dictionaries, so I just need something that's going to mechanically enforce *a* standard, any standard. Something to crack my neural blind spot."
32782,"If you know you’re going to be using a compound word multiple times in a piece, go into Word options > Proofing > Autocorrect and set up a new autocorrect so that when you type ‘hb,’ or whatever, it automatically corrects to ‘home buying,’’ or whatever."
32783,"It seems to. It’s not something I struggle with frequently enough to give a 100 percent definitive answer, but it certainly seems to flag them. I’d be happy to test a few sentences/words for you if you want!"
32784,"Ah perfect, thanks! Let me PM you the original paragraph that spurred this existential crisis."
32785,"We use Antidote at my work. I’m not sure if it will specifically pick up on these errors, but my boss uses it to proofread all of her emails."
32786,"> Antidote

Oh that looks promising, thanks."
32788,"I think this really addresses OP's problem. Compounds are tricky because the common usage changes over time, and even dictionaries will disagree. First step for me is to check the client's style guide / preference. Next step is to go to a dictionary \(pick one because usage can vary between dictionaries\). If it's an oddball term that the dictionary doesn't clarify, I go by what appears to be the most common usage \(wikipedia, google searches, well\-known competitors, etc.\)"
32789,"I do this same thing. If I'm not comfortable with my usage of a word, I look it up in the dictionary and decide. I then go back and make it consistent throughout my work. I'm a college instructor and used to write full time for a regular job though, so I haven't been brave enough to go back into freelancing yet."
32790,"I don't think any of the available tool can correct each and everything. For example, the meaning can be completely different by changing a comma but no tool can recognize it. 

[ProWritingAid](https://www.writinghelp.net/pro-writing-aid/) will work fine if you are a native writer. Otherwise, learn to write regularly and use Grammarly along with it.

The best way to minimise the mistakes is to read the content loudly and check if something doesn't sound proper but this will only work when you have faced the problem already. I must say tools really save your ass some times.

[5 free Grammar Checker Applications](https://www.writinghelp.net/top-free-grammar-checker-software-download)...

Sorry for the mistakes in the comment. English is my third language."
32791,"[The Punctuation Guide](http://www.thepunctuationguide.com/index.html) (website)

[The Media Writer's Handbook](https://m.barnesandnoble.com/p/media-writers-handbook-george-arnold/1116824929/2678353258904?st=PLA&sid=BNB_DRS_New+Marketplace+Shopping+Textbooks_00000000&2sid=Google_&sourceId=PLGoP164997&gclid=Cj0KCQjw8YXXBRDXARIsAMzsQuU8qHdabvfq7irDA8xiUm4CjVvDmLSXb5NOD4ADflLdrj__Ge7GpAEaAplyEALw_wcB) (book)

The handbook is great and covers a lot of grammar topics simply and concisely, including hyphens."
32792,"I hire a proofreader for nearly all my paid projects. When time or budget doesn't permit, I try to let the work settle for a day before proofing it myself. I also use Grammarly."
32793,"This is my approach. I find that ""sleeping"" on my work allows me to wake up with a renewed pair of eyes and catch things I wouldn't have caught after a full day of writing. Works out great!"
32794,"1. Use Word grammar checker (or grammar checker on whatever I'm using to write)
2. Read it again, from start to finish. Probably aloud to hear if what I wrote actually sounds like it written by a human being.
3. Read it backwards (it's weird and slow, but you can actually concentrate better on words and see if they are misspelled). 
4. Copy the text to hemingway app to check and improve passive/active voice use, sentence structure and length and overall readability."
32795,Free grammarly plugin + Hemingway app. I read aloud if needed.
32796,"For what it's worth, I think you hyphenated your post title perfectly. Rule of thumb with hyphens is only use when adjectival, right?"
32797,"Apparently https://prowritingaid.com is better than grammarly premium, according to a review I read, recently.  Another plus is that the free version is fully featured, but only checks 500 words.  So you can give it a test drive before buying.  Also, it's a lot cheaper than Grammarly."
32798,"Try using something we've been developing at Stanford called Crio: r/https://crio.stanford.edu

We're planning to make it adapt to specific users soon.

If you'd be open to giving us some feedback we can work on customizing it."
32799,"the red squiggly line in Word

You're not alone. The ESLs love their semicolons and commas. Who the fuck needs a period when you can make one big paragraph using semicolons and commas? And make sure you copy/paste an entire dictionary term for a word your audience already knows. Who cares? It's words on the screen for a word count. oh, and don't forget to give us a history of the thing from Wikipedia first and use like half the content for that because getting to the point in the last paragraph is super cool."
32800,"You just described everything I hate about amateur content writing, and it makes me cringe."
32801,"[http://www.hemingwayapp.com](http://www.hemingwayapp.com)

[prowritingaid.com](https://prowritingaid.com)"
32803,"Prowritingaid has a lifetime subscription available, while most others are monthly. 
It's helped me muddle through a Byzantine project of mine, works very well with Scrivener.
The Chrome extension wasn't so great."
32804,I use both Grammarly and Sapling. I found Sapling picks up loads more errors though.
32805,"I'd recommend grammarly. It's better for insight on your writing styles than anything. Study up on AP style writing, and you'll learn the basics of grammar. It's not as complicated once you get plenty of practice in."
32806,Thank you. I used grammarly in the end and it was very good. Very embarrassing how much I had missed. I'm definitely going to do some brushing up!
32807,"No problem. It's got everything that a beginner writer would need. nothing complicated, just simple and to the point. Have a great day!"
32808,Try Grammarly.
32809,There's really no substitute for actual knowledge and skill. These grammar checkers are often wrong.
32810,Fanks but that whasnt wot I asked ( ;
32811,Tough; it's the truth.
32812,"Grammerly: it picks up on easily confused words, preposition errors, and all sorts of sentence problems that most grammar checkers don't catch."
32813,Ditto grammarly. I love that!
32814,Grammarly does not pick up on comma splice run-ons or any of the sentence structure/length issues that crop up so often-- unless you pay for premium features.
32815,"Found: ginger software seems to catch most comma errors, I just tried out a few to test it.  One mistake went undetected, however."
32816,"[No Red Ink](https://www.noredink.com/) 

You can assign different topics for students to work on and it’s free! I use it with my fifth graders. The best part is that the program asks about their interests first (movies, books, celebrities, etc.) so that the sentences are about topics they like!"
32817,"I use Google Classroom (per our district's overall directive) to assign writing. Can students just plug in their writing and get the corrections, or do I have to assign and have them write in that program? I appreciate the suggestion, forgive me for asking questions instead of investigating myself. I have to crank through 35 more essays by end of today, arrgh!"
32818,Grammarly is amazing!
32819,Check mark is great- chrome extension
32820,"The free Grammarly takes care of the spellchecking and grammar stuff. Although in my experience, it either misses some things or marks some perfectly fine things (in context) as mistakes. You've got to double-check everything yourself either way.  The premium subscription \*mostly\* deals with issues regarding form, flow, etc. of the text. Like if your sentences are too long or something like that. If you only want to spellcheck, take care of typos/ blatant grammatical mistakes, I don't think you need a premium account, since you'll have to double-check everything either way.

But, what I suggest is that if you \*really\* want a thorough look at your work and you're willing to spend money on it, try and see if you can find a human editor/proofreader who'll do it for you and see what that'll cost you. A good, experienced professional will be much better than  Grammarly, and you'll have given your money to a person instead of a company.

That is, if it turns out to be cost-effective for you (I don't know how much premium costs, I'm on a plan through my job.)

ETA:  The premium version suffers from the same problems that the free version does. It misses stuff and overcorrects some other stuff."
32821,"Agreed. Ask your advisor, your department office, the Graduate School, or your university's writing center for recommendations, depending on the format of the thesis (APA, MLA, etc.). It's costly to have it done well, but COMPLETELY worth it."
32822,University writing center! Yes! Check for that first OP!
32823,Fiverr is an easy way to hire someone for what this commenter said
32824,Fiverr is how you make it hard for people who do this for a living to do this for a living.
32825,I like your response. Keep America working!
32826,"Not an American; I’m Iranian. :)

 But sure, why not. Better pay a real person with actual expertise and bills to pay than a stupid algorithm."
32827,"Regardless, it's all good! Hope you find yourself a good editor! Merry Christmas!"
32828,Merry Christmas! :)
32829,"Something that was a total game changer for me was using the Read Aloud function on Microsoft word (I’m assuming they have similar accessibility functions on Mac) but it will read your paper out to you and it’s a good way to check for errors. I find it works better than reading it aloud yourself because your brain will naturally fix errors without you noticing. This catches major errors as well as allowing you to see if something sounds weird even if it’s technically grammatically correct. I use grammarly premium and that works nicely, especially if you want to split the fees with peers and share an account. However, I think I’ll find myself using the Read Aloud function more than grammarly, even though it’s a bit more time consuming."
32830,I like this !!!!
32831,"Absolute game changer. I’m in my second year now and I’m genuinely sad I didn’t adopt this earlier, even in undergrad. It’s the BEST way to proof read things in my opinion. And it’s free!!"
32832,"Grammerly free version is fine on its own. The paid one doesn’t make much of a difference, and you still have to proof read it’s suggestions. 

I like to use the free grammarly version, and then use the “read out loud” function on Word to listen to what I wrote to see if anything sounds strange or repetitive."
32833,Try PerfectIt
32834,Try Hemingway Editor
32835,Hemingway Is horrible for writing academic stuff.
32836,"Does your University have a writing center? I had a job as an English tutor in my University and 90% of students needed help proofreading, including grad students. Also your tuition already pays for their time, so it's a resource worth using if you can."
32837,"LanguageTool.com

Is opensource, free (woth a paid version) and works great"
32838,"Perhaps, you may wish to use Google Docs grammar checker. All you need to do is go to [docs.new](https://docs.new) then click on tools and locate spelling and grammar. Following that, you will need to paste your writing there. It will do the job for you. Besides, if you want to check for plagiarism, go to [classroom.google.com](https://classroom.google.com) and create a class for yourself and upload the docs as an assignment. The inbuilt plagiarism checker will give you a hint where you need to paraphrase your work. If you need further help, kindly feel free to DM me."
32839,There are discord servers out there where people offer free grammarly premium accounts. They buy business version and add you as in employee. I'm part of one such server. I've used that service for over a month. Let me know if you want to know more about it.
32840,does it still up?
32841,Can you tell me more?
32842,would you pretty please be able to add me to it?
32843,"I'll put it this way. My employer paid for Grammarly, so I used it. I got logged out one day, it reverted to the free version, and I didn't even notice."
32844,"If you have Microsoft Word, you can use their [Editor](https://support.microsoft.com/en-us/office/microsoft-editor-checks-grammar-and-more-in-documents-mail-and-the-web-91ecbe1b-d021-4e9e-a82e-abc4cd7163d7) feature to automatically check for many issues."
32846,"Grammarly offers a free version. It's not the full version, but its not bad."
32847,Grammarly free version helps enough I would stick to that version
32848,It’s absolutely brilliant to use well worth the student membership I use the long term membership and will continue to use professional once i qualify.  La management will pay it
32849,"Copy + paste into word and compare. What one misses, the other will pick up. Granted, at this level ... just learn the grammar tools behind the mistakes if it’s over correcting, and then make the correction yourself."
32850,http://www.grammarbase.com/check/
32851,There is such a thing as a grammar checker? Does it get confused when you write complex sentences? (that is a serious question)
32852,"A robust grammar checker? No. 

Besides which, if you can't check your own grammar a thousand times more accurately than any computer program, you aren't yet at a point where you need to worry about perfect grammar, because there is no chance your writing will be of sufficient quality to publish. 

Automated grammar checks are a crutch beginning writers cannot afford to use, even if they did actually work. This is something you need to learn how to do on your own."
32853,"Believe me, I'm pretty pretentious about my grammar. I was merely curious about whether or not I could write a grammatically correct complex sentence and trick the grammar checker into thinking it was incorrect. I like to fuck with machines. It's kind of my *thing*. I carry around a bag of quarters with me for the sole purpose of depositing them into expired parking meters. I save people parking ticket fees one meter at a time."
32854,"Reddit. Prepare to be shamed and shunned for your errors, though."
32855,Apparently [hemingwayapp](http://www.hemingwayapp.com/)  is good but I haven’t tried it myself. It’s free.
32856,"Don't depend on them. Instead, go through some English language grammar courses, and learn to do it the right way. Grammar checkers and Grammarly in particular are not, by any stretch of the imagination, completely accurate. They are a tool to use once you already know what you are doing.  An exceptional knowledge of the English language is the best grammar checker available.  I apologise if this sounds a bit harsh, but I am a copy editor/proofreader by trade, which I trained for. I'm not perfect but no one is.  There are way too many non-native English speakers who try to be English speaking ""proofreaders/copy writers/enter-profession-here"" without a basic understanding of grammar, punctuation, and sentence structure. I realize this may or may not be the case with you. If it is, I highly encourage you to take one or two of the MANY FREE English grammar courses available online. I can point you in the right direction if you are interested."
32857,"I am also a copyeditor and second this. You could also check out The McGraw-Hill Handbook of English Grammar and Usage for an accessable guidebook:  https://www.bookdepository.com/McGraw-Hill-Education-Handbook-English-Grammar-Usage-Mark-Lester/9781260121674?ref=grid-view&qid=1604162851700&sr=1-1
  
Good luck!"
32858,"As a computational linguist who has personally worked on a lot of the rules behind grammar checkers I can second this. Language is very tricky so a lot of the time it isn't feasible to write accurate rules for these systems. Machine learning unfortunately isn't very good at this either. What ends up happening is linguists find speech patterns that pop up repeatedly and then write rules that tell the system that the pattern is  correct/incorrect. The problem with this is that there are essentially an infinite combination of patterns that work and don't work for very subtle reasons. The other issue is that there is no giant book of what is/isn't correct. I have spent a lot of time researching certain phenomena only to find that there is no authoritative source on what is correct. Your best weapon in my opinion is to read as much as possible and picking up a style book like Strunk & White. Also, as a Korean L2-learner I would be willing to bet there are materials in your native language that point out common English mistakes for your linguistic background."
32859,"As a fellow language professional, I have to respectfully disagree here. ""Git gud"" is not really a constructive thing to say to someone asking for a simple tool to support their learning and gud-gitting.

Perfecting an L2 takes much time and effort. For the long game, yeah you're right, OP should constantly work to improve their command of the language, frequently check their favorite reference works and guides whenever doubt arises, and so on. But in the meantime, they just want something to help them in their everyday work.

MS Word spellchecker is fine, though I wouldn't rely on it too much for grammar and style. Still, it can be instructional in a general sort of way, as in ""Oh, *in order to* IS a needlessly wordy phrase, I never thought of it that way..."" Grammarly and all the other 3rd-party automatons don't improve much on Word's basic features imo; the only difference is that they cost extra."
32860,"In addition to Grammarly, or maybe some other AI checker, I recommend:

* [Ann Raimes' Keys for Writers](https://www.cengage.com/c/keys-for-writers-8e-raimes/9781305956759/), a grammar/usage guidebook with a good section on what to look out for coming from different language backgrounds, I think including Korean.

* Longman's dictionary, https://www.ldoceonline.com/, which has helpful features like specifying countable vs. uncountable including breaking that down by meaning (some words mean different things in the countable vs. uncountable forms)."
32861,"Grammarly is a great resource that works automatically and teaches you along the way! (Also, I taught EFL in S. Korea! Feel free to DM if you're even in a bind!) Good luck!"
32862,"Before diving into book purchases you need to decide two things: what level of grammar help do you need (beginner, intermediate or advanced like a highly educated native speaker) and do you want English grammar or American grammar because they are different.

Once you have decided, have a look at the many internet reviews of grammar books to choose one appropriate to your needs."
32863,"I dont know much but I'm using Grammarly, you might want to try it out haha"
32864,"""Grammarly"" is a popular online grammar checker tool available as a browser add-on for Google Chrome, Firefox, and even Microsoft Edge. It checks for grammar and spelling errors as you write your posts. I am also using this. Try it out."
32865,"This may be of interest too.  
TextRanch  
– reviewed by experts, not automatically.  

https://textranch.com/"
32866,"I have Ms Word flag the things that I want it too and that's it. All grammar checkers have blindspots and for me to get everything I want. I'll probably have to use two more grammar checkers and I hate using multiple programs when I should only need one. Also, there isn't a grammar checker that will catch this mistake. ""Joe had a god"" when it's supposed to be ""Joe had a dog."" 

That's a type of a spelling mistake I frequently make. The, ""I spelled a noun wrong into a word that happens to be a noun as well"" error. Grammar checkers know nothing about context. The only way that sort of error is caught is through text-to-speech. I rate TTS programs higher than a grammar checker at this point."
32867,"Grammarly premium is a good tool and probably a better solution than the competitors.
But this comes with at least $11 per month (on an annual subscription).
I found [ProWritingAid](https://www.writinghelp.net/pro-writing-aid/) a better and cheaper solution.
I found this post people may find useful on WritingHelp.net...
[5 free grammar checker software](https://www.writinghelp.net/top-free-grammar-checker-software-download/)."
32868,"I write in Word and edit in Google Docs and the Hemingway App, all three of which have slightly different grammar algorithms from what I can tell. By the time I finish my edits there doesn't seem to be many mistakes slipping through."
32869,Would you recommend the Hemingway App?
32870,"I like to use it as a tool. I don't (anymore) blindly follow the suggestions, but I use it as a challenge to my writing. Red sentences are usually convoluted in my experience. I try to have a mix of yellow and unhighlighted sentences to vary the structure, but don't fret too much over it in general. I usually do the purple simpler phrase suggestions, but not always. The blue adverbs and green passive voice are great, though. I check each of them to see if I actually want passive voice / if I can replace it with something better, and check if adverb / verb pairs can be replaced by a better verb or not. Once again, I don't try to get rid of them all, just use it to say ""Hey, is this doing what you want?"" and purposefully choosing how to write it rather than blindly going with my first instinct."
