idx,text
48248,White.
48249,"Really?

I don't think we have a white wall in any home I've lived in so far.  
Sure, some sorts of grey / cream / whatever bright colors, but not white.

(And yes, I live in Denmark)"
48250,There's something rotten in Denmark!
48251,"I ended up doing this for accent walls in my apartment. I got some brown-ish miniblinds to help block out sunlight (my windows face the sunset, not a meth cooker) ended up taking one of the extra bits to hardware store and they colomatched a paint based on them.

Worked out great, so my theme is.. well.. brown. Light brown and wood."
48252,White walls are always nice and simple to work with as well.
48253,"As much as I hate beige, white is even worse."
48254,"I bought a fabric and then I chose a swatch. i put them on my wall somewhere. Slowly i am putting together everything else to match these two things. i MIGHT, at the end, change the paint colour --- but i think you need to choose one to get started."
48255,"However, clients _always_ want to start with the wall color because it's such a prominent and noticeable thing. It's like pulling teeth to convince someone _not_ to start with wall color."
48256,"Also get the undercoat tinted to the same colour, usually no extra charge. Then you might only need 1 coat of each."
48257,"I knew this tip when I started my renovation project, but the problem was I couldn't decide the wall colors before I saw all the walls primed."
48258,BENJAMIN MOORE DOVE WHITE EVERYTHING SONNNNNN
48259,"Just redid my kitchen cabinets in that exact paint!

http://imgur.com/biOIDqg"
48260,Well they look great damnit!
48261,"Wait until I'm finished lol. My shipment of whiteish grey brick wallpaper came in the mail this week. Gonna be doing the back splash and floating wall with the brick. Also, redoing the countertops

but thanks a ton! My wife really loves it"
48262,Sounds like a great project. I'm all about the neutrals... Nice choices friend!
48263,You should post it on /r/DIY when you're finished!
48264,I plan on it. I posted it to woodworking when I finished the cabinets!
48265,"Clean off the top of your vent hood!
p.s. yes the cabinets do look good."
48266,"Haha nice catch.
it is clean now, that's grime from when I cleaned and sanded the top molding of the cabinets, that's part of what had fell down. Its all clean now."
48267,"I agree. *However*, it's interesting that ""they"" always say that painting a room is the least expensive way to freshen or redecorate a room. I just had 3 bids for repainting my LR/DR, a 30x15 area. I'm going with the company that bid $2600. This includes them moving furniture, but I'll be removing all small stuff and wall hangings."
48268,"I always assumed ""they"" meant if you do the painting yourself. You're paying for a lot of labor cost hiring professional painters."
48269,"Painting a room yourself and having it look good, requires a lot more skill and time than the average person has, in my opinion."
48270,Agreed. I've never even tried doing it myself. That cutting in stuff looks horribly tedious.
48271,"Cutting in, you mean like painting near window frames and ceiling? Masking tape to the rescue!"
48272,"$2600, jesus christ. Hope you get a fucking handjob or twelve out of that as well."
48273,"$2600? Is that normal? I know a family in Olympia WA that got quotes of $1200 and $1500 for two rooms of about the same area as yours (LR/FR), for 9' walls and ceilings. The contractors will be moving and replacing everything.

My family (me, hubby, and teen) are repainting about half of our house. So it's not costing us *that* much! The paint, rollers, brushes, tape, and some extension poles aren't cheap but I can see it being the least expensive way to go. 

We're enjoying all the new colour (a change from the builder beige in our previous homes of the past few decades)."
48274,"This sounds like a horrible idea. The primary color of the room will be the wall color... and whatever is gonna be your primary color should be chosen first, then everything else to complement it.

Now maybe it would be a good idea to not choose the exact SHADE of paint until last, but you should know the HUE early on, I would think."
48275,"Just sharing from very recent personal experience dealing with a very particular SO who decided on the wall color first then spent way too much time, energy, and gas driving around trying to find exact fabric matches to the previously mentioned paint. Ended up repainting the walls anyhow."
48276,why would you want the soft furnishings to match exactly? surely you'd just want them in the same colour family or a complimenting colour(s)?
48277,"Not saying that you would want to match it exactly. That's a personal choice. But whether you want an exact match or the perfect complementary color, the flexibility of paint color makes it the easiest to adjust."
48278,Some people really have a thing for matchy matchy interiors...
48279,Which is why you pick the paint first but paint the room itself last.
48280,Then I would just have a bunch of cans of the wrong color paint.
48281,"""Pick the paint"" does not mean ""buy the paint"""
48282,Why would I not buy the paint once I had picked it?
48283,Its called a sample.
48284,So you can take the swatch or a sample can (the little mug size) and go color match it with everything you want to buy.  Then if you get to a certain point and the paint doesn't match what you have found you like you can adjust for minimal cost and zero effort.
48285,And we're back to the beginning of the thread...
48286,"No, we're not, because at the beginning you suggest people don't pick a color and I'm suggesting you pick a color and don't physically buy the paint."
48287,That's not picking a color. That's contemplating a color. You haven't picked it until you've made an irreversible decision and bought it.
48288,"Interior designer working for international firm.

Second that using wall colour to cancel out the poor decisions made in terms of soft furnishings isn't the best solution. 

You'd be much better off if you have lots of reference images of the style you like. And simply copy everything you like about the images, you'll find that since you won't be able to find the exact furnishings in your reference images, you'll start to find things that are close and will portray your own sense of style and taste.

If I had to pick one item that is the easiest to change and has the most impact, i'd pick Art every single time. Whether it's a painting, sculpture or installation. Your choice of art will really change the mood and setting of a space drastically."
48289,Yeah but then you have all this furniture that you have to remove or cover in order to do your painting.
48290,I'm just talking about the order you choose the colors...not the order you put stuff in the room.
48291,"Choose furniture in the shop, paint, buy furniture."
48292,"That's a shitty tip right there. If you find the furniture you absolutely have to have, buy them. Before it's gone. If you get a deal on something, buy it. Don't wait."
48293,"Good point. Perhaps reserve it? Fairly sure that's possible, not sure how long for though."
48294,"I can't tell if people here upvote this shit because they really think this is really a ""Life Pro Tip"" or this sub is satire and its just funny to mock people like me."
48295,"Welp, I'm screwed."
48296,What part of the internet am I on again?
48297,i dont see the logic in letting things are easily changeable influence something that is more dominant and much more work.
48298,"I'd say choosing a paint colour is easy.
But that's because my answer is to always paint white. Because it is the best colour for every room."
48299,"Nooo, you devil!"
48300,I'll be sure to remember this the next time I give a shit about the colors in a room.
48301,Choose white. Problem solved.
48302,"However, if you are a man, paint the room first, then you can go grab a beer and never worry about the rest!"
48303,Who are these rich people that redo a room completely?
48304,"Hey! Is this pintrest?
No. 
Girls are there to do that.
If it was up to guys, everything would be colored awesome shades of black!!! I'm sorry, I've been drinking..."
48305,"wow, first world LPT"
48307,"Here's another life pro tip. 

If you're a man...and you actually give a damn if your paint matches your linens and upholstry....kill yourself."
48308,I will pass this tip down to all my gay friends.
48309,"What a shitty tip. If you have already chosen your furniture, linens and curtains, chances are you have already bought them, since you want to be sure they don't sell out or because you get a good deal on them. Where do you put them? In your new home, where you'll regret not painting BEFORE you start filling the room up."
48310,We used Benjamin Moore Chantilly Lace - we really liked it as it has no strong undertones and have used it both for trim and walls and looks great!
48311,YES. BM Chantilly Lace is my favorite white paint of all time.
48312,"It's basically the standard now.

If you do want a bit of a tone, oxford white has a tiny blue undertone. Good against greys like concrete or grey brick."
48313,"We used this on our walls, looks amazing! 

Used basic white paint, cheap, for the ceiling. It has a slight gray tone to it which really compliments the wall paint."
48314,Came here to say that!
48315,I'm using it right now for an exterior project. Brilliant colour. Crisp.
48316,"For the ceiling, I just did a basic flat ceiling white from Lowes. 

For my walls, I did Sherwin Williams Aesthetic White. It looks beautiful in satin. Enough contrast from the ceiling with no strong undertone. It trends on the warmer side but mostly will reflect the light coming into the room!"
48317,"Ceiling - Sherwin Williams Eminence. 

Walls - we had excellent results with both SW Duration Matte and Emerald Satin. For color you’re going to have to choose your own. Our new house is getting SW Snowfall flat (which is a very light grey). I would recommend against a plain old white and get something with some pigment. But beware of any silvers/greys that have a hint of blue - they all ended up looking way more blue on the wall than we expected - looking at you, SW Silver Strand! It looks like a light blue in our family room!"
48318,"You can’t choose the best white colour because everyone’s taste and situation is different. You’ll want to try several samples. Get a piece of cardboard and layer a thick coat of your ‘top’ paints onto it, then bring it from room to room, natural and artificial light to see it.

When you buy white paint your first thought is the undertone. In bright sunlight it’ll show white, but in North-facing rooms or on cloudy days you will see the undertone. A blue undertone will show as a blue wall.

I didn’t want the undertone stress so used in tinted white and undertone-free grey.

Next is sheen. Ceilings are done in dead flat to hide unevenness, except possibly for bathrooms where you use a slightly higher sheen for a bit more moisture and mildew resistance. Walls are done in matte, eggshell or satin. I recommend matte or eggshell unless it’s a kitchen or bathroom as it hides imperfections.

Next is type of paint. You want something thicker as it takes fewer coats, with a lot of pigment, and that also has self leveller to keep you from messing up. I used SW Duration for kitchen and bath as it cross links well and is very hard wearing and scrub able and fairly mildew resistant. I used Opulence/Cashmere for the other rooms as it looks REALLY nice on the wall and is easy to apply. I used Pro Classic for the trim, easy. I used Eminence for the ceilings and hated it - I recommend you look elsewhere. I later used Emerald for a bathroom and really like it, easy to use, good coverage and looks great on the wall."
48319,"You seem knowledgeable. If I’m after a basic white, any reason to not just use the white straight from the can?"
48320,"Nope, that’s an untinted white and it’ll usually be fine. Some people like whites with a bit of a tone somewhere to warm it up or cool it down, but plain white is fine. It’s your house and your style!"
48321,Benjamin Moore has been the best as far as far as overall quality. The best white is very much depending on an individual opinion and if your decor goes well with warm or cool tones. The best method for choosing your white is to go get some samples of what you think you'd like and find a couple places to paint swatches right on your wall.
48322,"Sherwin Williams’ Emerald in Snowbound. This particular white has a minute touch of blue, which works well against the yellow tint of my floors. Looks cleaner, too. I disagree with anyone who says “white paint is white paint”. Paint without pigment is bland."
48323,Liberty Paints from Ralph Ellison agrees with you. ;)
48324,I'm using Sherwin Williams emerald urethane enamel in pure white for my trim and doors and will use for built in cabinets and shelves at some point. It's a neutral white that looks good with my natural wood floor and decor. I got samples of different whites and painted trim samples to see what it would look like with my lighting. It's worth the extra time
48325,I agree with your statement.  I can’t think of the name of the white I used right now but it has a hint of pink and I think is much better than if I painted the walls the same ultra pure white as the ceilings
48326,"If you have Ikea off-white cabinets or furniture, the matching color is Valspar Dove White, 7002-7.

Personally I like colors on my walls and ceiling, but since I'm slowly installing an Ikea Groemslov kitchen, I've been painting all my trim to match the eventual cabinets."
48327,"I used Sherwin Williams Alabaster and I like it a lot. I used it on both south-facing and north-facing rooms and it looks good in both. I used Benjamin Moore’s Simply White on my kitchen cabinets. I like it a lot in that application, but in my opinion it’s a little too stark white for a whole room, but I’m sure it depends on your taste."
48328,I use Sherwin Williams Pro-Mar 200 for interior walls
48329,"Pro mar 200 low sheen is Definitely the best paint:price ratio and it’s our go to for new construction.  

But for high end repaints/new construction Ben Moore regal is our choice. 

BM Aura is good but I prefer the regal all day!"
48330,+1 on BM Regal/Aura. I use Sherwin Williams Emerald but only because there's an SW store in town and the nearest BM is 40 miles away.
48331,"Yea SW biggest advantage over other brands is convenience.  

For contractors, They do have some really good products for really competitive pricing(you have to buy a bunch tho).  

For consumers, they have great sales pricing during all major holidays , esp spring and summer.

Ben Moore however, is proud of their product!  The only break you get is in your wallet"
48332,"I’m a big fan of BM as well. I’d generally go Regal but I’ve chosen Aura for deeper/more vivid colors. I don’t see much of a difference in lighter/more neutral tones, personally. At least nothing that makes up the price difference…unless you need a higher hide and don’t want to prime (to which I’d say “suck it up buttercup”, 2-in-1 will always be a marketing gimmick and separate primers will always be superior)"
48333,"Couldn’t have said it better myself!  

And yes to Aura for ultra  deep and clear base tints!  IMO, this is where Aura shines!"
48334,Aura is great but kinda hard to justify the price given the quality of Regal
48335,"I'm no interior designer, so I really didn't want to go through all the shades of white, I ended up using Sherwin William's Emerald line in extra white (their base) and matte in a 1/2 bathroom."
48336,This is what I'm using on my new doors and trim.
48337,"Simply white
By Benjamin Moore"
48338,"Benjamin Moore is the only brand of paint I will buy.

The guy who painted my house used it, and the BM dealer near me has a constant stream of professional painters passing through their doors.

He uses their oil based alkyd primer for both interior and exterior applications and latex paint.

I am very happy with how much better my paint game has become since making the switch."
48339,"I also love Benjamin moore paints, but can't figure out how to buy it in 5 gallon buckets."
48340,Sherwin Williams emerald
48341,Simply white by Benjamin moore all the way
48342,"Consumer Reports has at least one article about this. Check your local public library's website, in the magazines section, to see if you can get a temporary subscription using your library card. I know my public library has it."
48343,"In our workspaces we used Sherwin Williams ""spare white"" which is very neutral, no cool or warm at all, without being so bright as to be harsh."
48344,I personally like Benjamin Moore's Swiss Coffee.
48345,"For years, this was my go-to neutral!"
48346,"Ceiling paint!... Matte/flat finish for ceilings, glossier for trim, bathrooms the same, everything else maybe matte"
48347,Ralph Lauren white semi gloss👍
48348,"I like Benjamin Moore Decorator’s White or Dove White. If you like a different brand of paint, the paint folks can tint it to whatever color you want, even if it isn’t the same brand as the base."
48349,"Ceiling pain is a specific paint and is flat. Depending on the room you can go flat or semi. Up steps,,kitchen,bathroom gloss, lots of washing there. Bathroom use a mold retardation paint in the shower ceiling and all. I like paints with low VOC because the smell bothers my lungs and this paint hardly has an odor. I like the paint brand at Lowes or hd. Most favorite paint is oil based."
48350,"I'm currently painting my house with Kelly Moore Premium Professional interior. I can't speak to how well it's going to hold up long term yet, but I'm really happy with the coverage I'm getting from a single coat over primer.

I'm spraying, though - not sure if the result would be the same rolling it."
48351,Sherwin Williams - Steamed Milk
48352,I use a lot of the Behr Ultra Pure White as it is neither too cool or too warm and seems to go with anything. It's also a bright white so makes small rooms seem larger.
48353,"I think the best color for white paint is white.

For brand recommendations from possibly more broadly experienced users, see r/paint/.

Painting success is in the prep work.  Don't bother spending a zillion dollars on some fancy paint it you don't plan to put in time on preparations.

r/paint/ can help you there too if you need it."
48354,"Disagree, plain white out of the can is a very harsh color and there are hundreds of white options for a reason. Something with a bit of depth will keep the room from looking like a hospital. I like Benjamin Moore Swiss Coffee"
48355,"You're right. I was more making a joke with white vs 'color' rather than (bright) white vs tones or shades of white.

BM Swiss Coffee may or may not be wonderful for OP but he can't tell that without knowing what the rest of his palette are going to be."
48356,"There are major differences between shades of white. Cheap paint doesn’t hold up as well no matter how much prep you do. On a ceiling or something that never gets touched, fine. In a high traffic area, not so much."
48357,"I didn't downvote you, but I'm not sure what you think I wrote that disagrees with you."
48358,"I misread, I thought you said don’t spend a zillion on fancy paint if you prep right. My B. 

I do disagree with the white is white though."
48359,"No worries mate.

Also, I said in another comment, which people are having fun downvoting, that I realize the differences in shades and tones of white (or any color). I was making a joke which no one seems to have understood.

Hava good one."
48360,I decided on behr white 52 for my white. It’s white but with a little extra tones so it’s not uncomfortably bright.
48361,"I used Behr sail cloth, it’s an off white for the walls, Valspar bright white matte for the ceiling."
48362,It really depends on the tone of your flooring/features. I prefer Benajamin Moore white’s but use a different white for different spaces.
48363,"Former painter here.  My 3 favorite paint brands are Benjamin Moore, Sherwin Williams...and Ace Hardware also sells an excellent paint. I would happily use any of those 3"
48365,That's grey not white
48366,Just don't get the water based paint even if it's from the brands mentioned. it oxidizes faster than latex. I'd also look into getting ceiling paint from whatever brand you pick and not just regular white. for for bathrooms use the kitchen and bath paint instead of just regular semi gloss
48367,"I am not usually a fan of white because it always seems to look dingy. That being said, we are painting on a budget and ended up getting Lowes Valspar in Ultra White satin for a closet and loved it so much we are also using that in our bedroom."
48368,White Dove by Benjamin Moore is a very clean and versatile classic.
48369,Always used the natura line of BM
48370,Benjamin Moore Decorator’s White - classy and modern white. Goes with everything in all types of sunlight or lack thereof
48371,"Our go-to is Marshmallow by Sherwin Williams. It’s got red undertones so it’s very warm. If you like a bright white it won’t be for you, but I find it very cozy!"
48372,"Skip the brands sold as home depot and lowes. Use Benjamin Moore or Sherman Williams etc. Listen to the pro painters responding here. Experience is everything.

I loved my SF apartment color so much I asked the management which color it was and used it in my house when I moved out of state. Kelly Moore 14 Frost, which SW matched in eggshell. It's a great warm off-white. Amazing in my dark basement. Everything feels soft and the white semi gloss trim pops."
48373,"For ceilings, I like CHB (Chicago Home Builders) from Sherwin-Williams. I believe it's a regional (midwest) product though. Eminence is garbage.

For walls, I like Sherwin-Williams Superpaint in satin. I've also tried and liked Benjamin Moore's Ben. Can't comment on a white color for walls as I've only ever done colors.

For trim, Benjamin Moore Advanced Semi in Simply White. It's a waterborne alkyd paint, so it has the durability and hardness of an oil-based, but cleans up with water. The only downside is the time until recoat is like 16 hours or something ridiculous.

Whatever you do, don't try to get Simply White mixed in a Sherwin-Williams paint. It won't match. I had a gallon of Pro Classic mixed in Simply White, and after the first coat, realized it had a greenish hue to it. When I took it back, the manager at the SW store said the employee shouldn't have mixed it for me because they just can't seem to match Simply White."
48374,Ceiling paint!
48375,If you're going for white just use primer. It's cheaper and does the same thing
48376,"Off the rack base white eggshell from PPG at Home Depot is great. We went through 15 different samples of whites, blind tested them in the light of several different rooms at different times and it was the overall winner. And there's no waiting. You just walk in and it's there. 

It will also save you hundreds of dollars from the Benjamin Moore fan club here, which I'm surprised to see. I never really thought their paint was any good. I guess I'll have to try it out again sometimes, it's been a while."
48377,"Benjamin Moore or Sherwin. 

I’d go flat white for the ceiling. Any sheen will show any reflection on the ceiling. Obviously wouldn’t use the flat on the walls."
48378,3050
48379,Try Repose Gray from Sherwin Williams. My husband and I flip homes and we put this in all of the houses. We always get tons of compliments on it!
48380,"I've seen praise for this color online, as well. Glad to hear it's so highly recommended IRL. We'll definitely try it out. Thanks so much!"
48381,Haha I just posted this.
48382,Gray minds think alike.
48383,"I have repose grey. I do like it, but sometimes it looks dingy to me."
48384,"Interesting... Do you think it's because it's so light, it comes off as white that's just dirty?"
48385,"Honestly, it could just be because I live in an older home that isn’t very bright in each room. I think? It could also just be that I see it that way. Lol. Everyone loves that color, though."
48386,Repose looked pretty brown on my walls.
48387,no. more. repose. gray....no!!!!
48388,"I've been looking for a gray for my new (EEEE) house! We close Monday and will (probably) start paint next week. This gray looks perfect!!

I have a small wall with a sliding glass door (can get a pic if needed) and was thinking about doing a darker gray to compliment. Do you have a dark gray that would go with this?

Also, I've been unsure about doing the WHOLE house in one color (the kitchen walls (few) and breakfast/eating nook are a navy, which I intend to keep), which would include bedrooms.... I like grays, but I also like colors. BUT this gray seems so faint enough that I could literally change textiles and patterns and it'd go with anything. Is that the same feeling you get?"
48389,"FYI this is from the listing. Not my furniture! Just looking for a fresh color (maybe some kind of light gray) to complement these dark, shiny hardwood floors. TIA!"
48390,I would suggest a light grey or greige (grey-beige).  I think the blog Young House Love has a good post on grey shades.  nice space!
48391,Great resource! Thank you for sharing.
48392,Repose Grey is the color we have used in both our houses.
48393,A light blue.  Everyone is doing grey.
48394,"Agree -- there's some very beautiful lighter versions of ""steel blue"" with a touch of grey in them that would lend well to neutral furniture, always look crisp/clean, and still holds popular for resale later."
48395,"There's a lot of open space to this room, I honestly think white would make it look that much larger.  Are you wanting something different in color? How would you like to style this room I guess would be the first question."
48396,"I totally 2nd this 

The floors are so dark it can be really easy to make the room dark as well, depending on the furniture. 

I’d stick with white and use artwork to make the walls interesting"
48397,"Thanks for your input! I guess in terms of style, we're looking for something clean and contemporary, yet comfortable. We have two young kids, so maybe scratch the ""clean"" part lol."
48398,"I completely understand trying to keep a house clean with small children. I think white is always a safe choice. It’s easier to take care of with touch ups and it most definitely make that already large living space appear that much larger. If it were me I would consider a very light blue, just something that compliments that room. You have a great canvas to work with, good luck!"
48399,"If you want color, I'd suggest a light green sage!"
48400,"I LOVE sage green... My husband, on the other hand, is not a fan. What a weirdo!"
48401,What a bummer 😫
48402,[Benjamin Moore revere pewter ](https://www.benjaminmoore.com/en-us/color-overview/find-your-color/color/hc-172/revere-pewter?color=HC-172) it’s a nice greige that creates a neutral canvas.
48403,"Ooh I like this one, too!"
48404,Second this one!
48405,"I think the floor would look better with a paint color that has cooler undertones. It seems like it's clashing with the current warm color. We wanted white for our main living space that wasn't too cold or off-colored and we LOVE the shade we chose--Benjamin Moore simply white. It has slightly green and brown undertones that you can't really see just looking at it, but it looks amazing with wood and plants."
48406,Blue!
48407,my house is painted sherwin williams agreeable gray. it goes with everything. it’s a city row house so we don’t get a ton of natural light in some rooms and it looks nice regardless.
48408,It goes with everything because it's agreeable!
48409,">city row house 

Philly?"
48410,Hi! This is such a beautiful space. The furniture you’ll be putting in it- is it more browns/ black or whites and grey?
48411,"Excellent question! We have temporary furniture now, but when we buy permanent pieces, they'll probably be more in the white/grey palette. This is why I'm starting with the paint color: to set a blank canvas around which I can decorate. Let me know if you have any ideas!"
48412,"Ah awesome! Okay I’d do a light grey. This way it gives you a lot to work with on the walls and you can incorporate any ‘cool’ colors you want / blue pallets. And can use accents color like yellow.  [this](https://st.hzcdn.com/simgs/f4a1dfb602a9e1ca_4-0527/home-design.jpg) would look gorgeous, or even something like [this](https://media.architecturaldigest.com/photos/560c37dd7da26e3235ad995e/4:3/w_1200,h_900,c_limit/gray-living-room-01.jpg) with an accent wall. Either way, you’re gonna knock it out of the park with a space like that"
48413,Those pics are gorgeous. Thank you for the inspiration!
48414,Our house was painted Benjamin Moore Balboa Mist when we moved in and we really like it (we have medium dark floors). It's very neutral greige color that isn't too grey and seems to go with everything.
48415,How about Silvermist from Sherwin Williams? It's one of the ones I am considering for my place.
48416,Hirshfields blue period. It will make the fireplace stand out! Its dark but will look stunning!
48419,I like it! I might try a lighter shade due to the floors being so dark. Thanks for the suggestion!
48420,"Whatever color you go with, I would do a couple shades darker and paint the TV cove, and I would do 30-50% of the wall color for the ceiling color."
48422,Your house looks just awesome. I wonder why you are onto change color? If your job includes stress and tension then you may go with stress reducing color like light blue. With that color and some good beautiful [window coverings](https://www.usshuttersandblinds.com/orangecounty/) can do magic in relaxing your mind.
48423,Beige please
48424,A light cool toned grey
48425,Grayish blue
48426,Silvery blue 1647 Ben Moore
48427,Thanks!  I can see why [that color](https://www.benjaminmoore.com/en-us/color-overview/find-your-color/color/1647/silvery-blue?color=1647) would work.  My only concern is that it seems a bit lighter than I was hoping for.
48428,[Knock it down a few shades.](https://www.benjaminmoore.com/en-us/color-overview/find-your-color/color/1649/polaris-blue?color=1649&source=%2Fen-us%2Fcolor-overview%2Ffind-your-color%2Fcolor%2F1647%2Fsilvery-blue)
48429,"I'm digging that new one, Polaris Blue.  Ill get a sample.  Thanks!"
48430,Repose Gray
48432,[SW - Bagel](https://www.sherwin-williams.com/homeowners/color/find-and-explore-colors/paint-colors-by-family/SW6114-bagel)
48434,"Ash greyyy! :D Also, you can add up some wall art on your walls.  [https://panelwallart.com/products/tags/exclusive-design/](https://panelwallart.com/products/tags/exclusive-design/)"
48435,"I actually have a bit of art already, my wife thinks I have too much for the size of the space.  It's just not shown here :)."
48436,Oh! How big is your home office by the way?
48437,"I’m buying a house that’s completely painted a really dark beige (no thank you) so I’ve been looking into this a lot! I’m seeing a lot of really light greens and grayish greens heavily featured in 2019 paint brochures. 

I actually decided to go with ‘White Dove’ by Benjamin Moore. I like it because a creamy white that’ll go with both warm and cool tones depending how you decorate, but isn’t a stark, bright white. The window frames in the new house are actually black, as are the kitchen cabinets and counters, so I think it’ll create a clean, modern look."
48438,Great color choice. Creamy whites are my favorites.
48439,"White. I phased out gray about a year ago. I've been painting all my interiors white now. Provides a nice, clean look.

My history with paint colors in my market over the last decade, we've come full circle.

&#x200B;

White --> Off White -->Tan/Beige --> Greige -->Gray -->White"
48440,"Go with a soft cream?  Please, anything but gray. I’m shopping for a home now, and gray just screams “I watch HGTV and there an amateur tile job somewhere on this property. Something is strange with the circuit breaker, and I considered painting the door orange.” I’m immediately suspicious that a gray house has been flipped by an eager beaver.

Edit to add: A gray interior also means a high probability of butcher block counter tops, with a 40% chance of open shelving."
48441,"My husband and I learned pretty quickly to avoid greige houses at all costs because they were always badly done flips. 

Even now, he'll groan or grumble about it if we pass/drive by a greige house."
48442,"Exactly this. Those houses look like every single episode of Flip of Flop, gray walls, white trim, shaker cabinets, subway tile backsplash, whatever flooring they could get for cheap that passes for wood, same with the discount counter tops, oh and don’t forget the light fixture above the kitchen sink that someone got with a coupon at the home depot. They all look identical, and they all look boring as hell. There’s nothing wrong with any of the elements that I listed, but at this point they’re so generic as to signal to me that someone either a) flipped the house quickly and probably missed important details, or b) flipped the house poorly because they’re new to flipping and want to make a profit without really knowing what they’re doing. Either way, someone wants me to pay for their boring, generic “upgrades” that I’ll have to redo to make the house into something that I actually want to live in."
48443,"Or quartz countertops with a butcher block island! But agreed. 7/10 grey houses I looked at were flips, which I’m wary of."
48444,"Oh God, the butcher block island.  I’ve always wanted a kitchen prep surface that shows wear and tear within the first fifteen minutes of use. /s 🙄 

At this point, I almost always walk away from houses that I suspect to be flips. Best case scenario is that I’m paying for someone else’s cheap upgrades. Worst case is that I’m buying a pile of shoddy diy projects that will have to be fixed for years to come."
48445,"This. I would click on a listing, see gray and know exactly what to expect the rest of the way. No thanks."
48446,"As someone with grey interior and quartz countertops and island, HOW DARE YOU!"
48447,[https://magazine.realtor/daily-news/2019/06/11/the-top-choice-for-2020-color-of-the-year?AdobeAnalytics=ed\_rid%3D2951445%26om\_mid%3D925%7CRealtorMagNews\_2019\_06\_11%26om\_nytpe%3DREALTOR%20MAG%20NEWS](https://magazine.realtor/daily-news/2019/06/11/the-top-choice-for-2020-color-of-the-year?AdobeAnalytics=ed_rid%3D2951445%26om_mid%3D925%7CRealtorMagNews_2019_06_11%26om_nytpe%3DREALTOR%20MAG%20NEWS)
48448,That is absolutely gorgeous. House we are buying has paintable walls only in laundry where it would look weird. Sad I can’t use it.
48449,"I go with a gray with white trim in all of my flips. If they’re bigger I have a beige I sprinkle into all the bedrooms. 

I don’t do it because it’s trendy. I do it because it’s neutral. When you’re flipping, it’s not about appealing to a certain buyer, it’s about not being unappealing to any buyer. 

That being said I don’t do anything crazy with design. Every house gets white trim, mocha or white hardwood shakers, and granite counters. Around here a mid level house is 30 years outdated so just slapping white trim on the walls excites buyers."
48450,Agreeable Gray! Sherman Williams.
48451,Nah I’m a mindful gray guy myself
48452,Repose grey!
48453,SF fog!!
48454,One of the reasons that grey/greige has been popular is because it's neutral.  If you paint it a non-harsh white that would serve the same purpose and the owner can imagine their own color choice in there.
48455,Agreeable grey and Accessible beige
48456,"I still use gray because it photographs the best and shows well on all types of screens. a couple darker or colored accent walls happen in higher end houses.

any beige, cream....anything with a brown tone can look yellow or orange on different types of screens. gray is also a good backdrop for more colorful accessories and artwork.

white is OK, but then there's no contrast interest with white trim."
48457,"I mean, if it wasn't for HGTV, Revere Pewter would be a great color...

I like Behr Irish Mist although it can be a bit too bright for some rooms.  SW Canvas Tan was a pretty good choice too."
48458,"Exterior?  A creamy yellow has been a color I have seen making an splash. 

It's not beige, it's not yellow, there is a Valspar color called Like Butter is one and the Magnolia Homes line of paints has a few nice ones."
48459,Can’t go wrong with grey and white
48460,"Just do a neutral gray or whatever. I like it when viewing homes because it shows detail well and it's easy to gauge the sizes and layouts of rooms from photographs. 

People should really repaint a home once they buy it anyway. Few really should look at neutral gray walls and think ""this is me""."
48461,"I still like grey for walls and white for trim.  It photographs well, is clean and neutral to buyers.  Paint is one of those things buyers will change anyway so dont overthink it - keep it neutral and dont worry about it.  I will say to me accent walls are out and I dont use them anymore."
48462,"Whatever you pick, please do not paint every room the same color. Nothing screams ""flipped house"" like every room being the same shade of grey."
48463,Our entire house was painted in Benjamin Moore’s Soft Chamois before we moved in. The house was built in the 1920s and I think the color fits a vintage vibe. It’s a warm off white that’s classic and doesn’t look dull or dingy.
48464,"I like it a lot, like a warm plaster color! Thank you."
48465,"[Clothesline Fresh](https://www.myperfectcolor.com/paint/384863-valspar-ci14-clothesline-fresh) by Valspar is one of my favorites!  Depending on lighting, it pulls different shades - sometimes more blue, sometimes more green."
48466,"Pale Blue/Green: We are selling our 1950s home and painted all interior walls (except bathrooms) Sherwin Williams Sea Salt. Makes our medium-toned woodwork more charming and the rest of the house, which has plaster walls, look fresh."
48467,">Sherwin Williams Sea Salt

Oh I love that. Thanks for finding my living room color for me :)"
48468,My go-to paint the whole house” is Benjamin Moore Dove White.  After you can decide on which walls/rooms you would like paint colors. They have really cool virtual paint things now too!
48469,Ooh thanks looks like a great go-to!
48470,"Our whole house is painted compatible cream and I really like it. 


https://www.sherwin-williams.com/homeowners/color/find-and-explore-colors/paint-colors-by-family/SW6387-compatible-cream"
48471,"PPG Dapper Tan is a nice warm beige, Sherwin Williams Pillowcase (I think this might be exclusive to the Lowe's Sherwin Williams line -- I got it color matched in PPG) is a warmer khaki cream shade."
48472,"I did most of the main living area of my home in BM Abalone. It’s beautiful. It changes with the lighting. Sometimes it’s a light grey, sometimes slightly beige, and other times it has a very light lavender undertone but it never looks purple. It seems to glow."
48473,I love Benjamin Moore Pale Oak.
48474,"Yellow SW Napery
Warm white SW Greek Villa"
48475,Spanish Sand Behr.
48476,Alpaca from Sherwin Williams
48477,"Sherwin Williams: Amazing grey and shoji white. We built a new house and I did trim grey and white walls.... contractor thought I wrote it backwards.  Its been 6 years and I still love it. And get lots of compliments. 

A tip when looking for white/cream/beige paint.... they all have a definite undertone whether that is cool (blue) or warm (red/yellows). I found it very enlightening to learn about the color wheel and how colors compliment or conflict with each other. Saved me a lot of money repainting too."
48478,We are using the Chalk color by Clark and Kensington. It’s white but with justtt enough cream to make it warm! We are accenting it with peak of the mountain and it looks great so far
48479,We went to Sherman Williams and for $75 you get an in home consultation with a designer and a $50 store credit. We had an idea what we wanted to do but the designer had great ideas we didn’t think about and really helped refine our color choices. Great end result and I would highly recommend.
48480,"Oh, this is a great idea. I think I knew they did this, and forgot. 

My main challenge is I know what I want, but nobody actually *makes* the color I want. I wonder if a designer would be able to help figure out how to appropriately tint a white to be the off-white that I want. . . . 

Edit - according to their website, the in-home consultation is now $95. Still would be worth it!"
48481,"That’s a great idea. If by the time I close I haven’t made up my mind, I’ll pay someone else to do the work for me."
48482,"Perfect! We had the consultation, she gave us the paint recommendations, we bought the paint and then did all the painting ourselves. It was a great experience since there was no pressure to buy from SW. Enjoy the ride! We are 36 days in since our close and we finally see the light at the end of the tunnel."
48483,"I’m not sure painting will make any difference with the smell, but it’ll help with the overall vibe.

We moved into a new house in June and just painted last week because I wanted time to get a feel for the living areas and the style direction we wanted to go in. 

Things to think about: 
1. How much light comes into the room and do you want to emphasize that or downplay it?
2. Colors of your furniture and accents. Is this the beginning of full-on redecorating, or do you want to complement the stuff you already have.
3. What vibe do you want in the room. Should it be calming, invigorating, neutral? What colors give you the feeling you want?

I used Pinterest to get an idea of room styles and to look at a bunch of color palettes and decide what appealed to me overall. It’s also a good way to incorporate what you already have."
48484,"I like the idea of painting after I’ve been in there a while, but wasn’t it a pain with your stuff there? As for the paint going with my things, it’ll be a redecorating because I’m coming with a bed and dresser lol studio living to a split level house. I’ve been pinning rooms on Pinterest, it’s just so hard to visualize it, I’m hoping that comes easier once the seller’s things are gone."
48485,"If you don’t have a lot of stuff, moving it won’t be too difficult. But we just pulled it to the center of the room for a day or two. It was kind of a pain, but worth it to take the time to really know what I wanted."
48486,"I guess since I’m the only one living there, there’s no reason why I can’t sleep in the middle of the room, huh? Lol."
48487,"Lol, or move your mattress from room to room until you’re done painting."
48488,Well my frame has wheels for a reason!
48489,"> I’m not sure painting will make any difference with the smell, but it’ll help with the overall vibe.
> 
> 

definitely... I didn't mind the colors that the house had before we bought it, but painting everything fresh and new really helped it feel like ours instead of an AirBNB rental."
48490,"> painting everything fresh and new really helped it feel like ours

So true! The color wasn't bad in our main living areas before we painted, but when we finished, I loved it so much more. My mom's wisdom at that moment was ""because it's yours now and you have pride in it."""
48491,"My favourite tip for testing the paint after you’ve decided on a few options:

Get a piece of drywall, or a stiff board. Drywall is best. About 2’x2’ is the largest you need. 

Get sample pots of the colours you like and paint the drywall pieces. It’s nice to leave a 1” white border, in case the existing colour “interrupts” the sample colour. Get two coats if possible. 

This way you have giant paint samples that you can move to different rooms. 

Don’t just slap a couple brush strokes on a variety of walls to test it out. It doesn’t give you a good idea for one, and I’ve also seen colours go really funny because of the existing colour (a grey went totally purple tested on a bright yellow wall)."
48492,"If you are painting the whole house for smell it might be good to prime the whole house with something like killz after washing the walls(I think it’s TSP for really bad smells, but you could start with just some soapy water.)

Then a few generic cream/off white/gray until you get your flooring/furniture.  And don’t just do one color through the whole place, it will feel too generic/apartment like. 

Or you can get samples and paint it on the primed walls to get a feel for the color."
48493,"What’s TSP?

Would keeping to a beige/off white trend be too generic? I’ve only lived in rentals so the walls have always been white.

Floor will be darker wood laminate throughout since I’ll have pets and want to avoid smells for the same reason there are smells now."
48494,"TSP is a degreaser that you wash your walls with before you paint so the paint will stick evenly. Go to the paint stores and take home all the chips they have, tape them up on your walls and leave them there for a couple days, you’ll see what sticks out to you. Anytime you walk past and don’t like one, take it down, soon you’ll be left with just a few. Get testers of those and see which one you like. Be sure to put them on different walls and look at them in different lights (morning, afternoon, night, lights on, lights off, etc.) as they will look different throughout the day. Even whites have an undertone that will get pulled out in certain lights.

Look to Pinterest for inspiration and don’t be afraid of colour, it’s just paint and can be repainted if you end up not loving it! Good luck!"
48495,"Trisodiun phosphate cleaner. 
It a paint prep cleaner(I don’t know that much about it besides helping my parents use it in a rental after some people moved out).


I think that beige/off white are a great place to start! There is a reason they use those so often. My personal opinion is it doesn’t look as good when people pick one single color and use it throughout the entire house. Even a slight shift in color between the kitchen and living room and bedrooms makes a space feel more homey to me. 
And you can always add more color once you settle in."
48496,"You're safe to start with something generic. Then one day after living there for a few months or a year, once you get to know the patterns of sunlight and shadow in the rooms, you may suddenly realize you need a dark blue kitchen, robin's egg/lavender bedroom and spicy office. Well, that's [what I chose](https://imgur.com/a/PJitufE). Or maybe you'll stay with fashionable grey or that warm sandy tone that makes pasty skin white look great. I had that on the other office walls. I agree with other people that if you don't have very strong feelings about colours, as I do, then neutral and then changing the accents when you feel like it are a great way to go."
48497,"Beige, off-white, light gray are all good choices. Your walls should be neutral and light. Colors and personality should come in your furniture and accessories. Most of your furniture should be neutral too, but darker colors are ok. A little color goes a long way."
48498,"I was planning on accenting with fabrics like throws and bedding or with artwork, things that are easily changeable."
48499,"This is precisely what I'm doing, and I'm in the middle of it now.  We've settled on some off-white grey/beige-ish colors for the main walls with a few accent walls that are just a shade or two darker in the same general tone.  We tried to get creative when we first moved into the house and had some serious misses with colors that were way too bold and loud (despite not looking so on the swatches).  So maybe we're a little gun-shy, but we're playing it safe with softer tones and let our artwork be the accent colors.  Easier to not go bold enough and spice it up than it is to overdo it and try to reel it back.

One note, make sure to prime everything before throwing color on the walls.  IF there's already paint on the walls the color will be completely off.  Both in the actual color of the paint and how it looks from the colored light reflecting off it."
48500,"This is by far a better approach, than putting bright or unusual colors on your walls."
48501,"There are some phone apps to test paint colors. You take a picture, select a region, pick any color. Sorry I don’t remember any names."
48502,Oh cool! I hope someone replies with a name of it so I can test it out. I’ll search on the App Store though just in case. Thank you!
48503,The Behr app works pretty well for visualizing different colors in the rooms in your house ... but their colors are waaaay off on the app vs. the paint chips at Home Depot (even the actual website is better than the app). So that's pretty disappointing.
48504,Sherwin Williams makes a good one. You can even see how it looks during the day or at night in their test rooms. I believe it’s called color burst.
48505,"I have horrible visualization skills! But I manage to pick good wall colors somehow (or so I've been told). Here's what I do.

First, what kind of 'feel' do I want the room to have? What colors do I associate with that feel?

What kind of room is it? Are there any colors I associate with that kind of room? Are those associations positive or negative?

Does the room feel 'cool' or 'warm'? Pick a color accordingly.

I like yellow for kitchens, b/c it makes them feel sunny, and I like a sunny kitchen. I avoid blue fr bedrooms because I hate blue bedrooms. Love blue, but for some reason it depresses me if I sleep in a blue room. I prefer green for bedrooms - gives me a more peaceful feel.

Another trick is also to pick a wallpaper border (if that works for your house/room, and then pick a paint that goes with the border. You can literally point to a spot on the border and say 'I want the paint that color' and they will do that. It's what I/my mom did when my bedroom needed repainting, and we couldn't agree on a color (she wanted pink...for her 15yr-old girl, who hated being girly)."
48506,"For the smell:

Pull the carpet like you stated.  If possible open windows and doors to get fresh air in.  If the house has duct work (central heat or AC) have the ducts PROFESSIONALLY cleaned.  I had a house I bought cleaned, and it seemed like a gimmick for but for an extra 100$ they sprayed this stuff in the ducts that was supposed to kill bacteria and be a odor neutralizer.  It took the house from smelling a little funky (it was a vacant house for a while) to smelling like nothing.

I also have a air filter that is HEPA with ozone and UV.  That thing can really clear up the smells in a room.  Depending on room size, it can take a while, but it does help.

As others said, you can paint, and that can help, but washing the walls might work too before you paint (if they are nasty anyway, you will need to at least hit them with sand paper to remove grime before you paint.  It is much easier to paint an empty house, but you may not know what you want.

Places like Sherwin Williams offer assistance with picking colors.  If you are getting new furniture, some furniture stores will send out a design expert that can help you pick colors (I think Ethan Allen and Lazyboy)."
48507,"1. SO and I debated about the overall scheme... I wanted earth tones, she wanted grays; we went with grays.

2. we went to Home Depot together and independent picked out a bunch of swatches for rooms (loosely agreeing that we wanted something dark and cool-toned for the bedroom, bright in the common areas, and we'd each do whatever we wanted in our home offices)

3. after Home Depot, went out to lunch and compared paint swatches. settled on 2-3 colors for each room.

4. bought samples of each color, painted them on the walls (on a sunny day with all the lights on), and went from there.

ultimately doing a very dark gray (accent wall) + white in the entry hallway, silver and gray in the living room/dining room, white in the kitchen, and a grayish blue in the bedroom... to accent the brick fireplace, we decided on a warmer gold for the basement den. I went with a pale green for my office, and I have no clue wtf color the other office is going to be."
48508,"In general, it's a good idea to pick no more than 5 colors for the entire house. If you do each different room a different color, it can feel overwhelming. It's also a good idea to choose either a ""warm"" or a ""cool"" color scheme. Paint specialists are your friends. It's worth spending the time going in to talk to someone at like a Benjamin Moore or somewhere similar because you don't know what you don't know! They can also probably help with the smell question - there might be a formula that helps?"
48509,"Highly recommend trying out repose gray 25 percent brighter, it works with different windows directions/sun/light."
48510,"I would push them on the price. Also, we went with Dover White and it looks great as an off White choice."
48511,My dream kitchen would look just like this with buttery yellow walls.  Just my two cents.
48512,Thanks for the input! We are keen to look down every route and I love the idea of the room being bright and fresh feeling!
48513,"Very much depends on your taste and the color of rooms it is adjacent to. A rich coral could work if you're not afraid of something a little playful, or a soft dusty blue would be more muted.
You can try Sherwin William's Paint Color Visualizer to see what some options are. 

 https://www.sherwin-williams.com/visualizer/"
48514,Awesome thanks for the tips! We are definitely wanting to try something new with the kitchen!
48515,There is a App I used for Sherwin Williams where you can upload a room photo and paint the walls. I found it helpful painting my house and ended up picking colors i would not have considered otherwise. I would suggest a minty green- blue or a light smokey gray that has a hint of blue in it.
48517,"Hey thanks, we would definitely love to take you up on your offer if you have a minute to spare. We are still unsure as to the exact colours, although we quite liked something warm. We quite like the idea of a very light brown/beige. Not sure if this helps at all?"
48519,I really like the last one!
48520,Oo I'm a huge fan of the second (green color - fern?) - OP can I have your kitchen pls?
48521,The fern is fantastic.
48522,Thanks for the suggestion my fiancee has been glued to the app for the last hour!!!
48523,Do you know what the app is called? I can't find it and it would be a lifesaver!!
48524,"I think it's called ""chip it"""
48525,I looked it up and I was using color collect and paint harmony
48526,Thank you! I'm moving into a new house in 3 weeks and this is going to be my best friend pretty soon!
48527,"I remember seeing [this](http://media-cache-ak0.pinimg.com/736x/bc/60/27/bc60271309a7d12d5bf55275277c6dd5.jpg) image somewhere on reddit recently, i think any of those colours would work well, and gives you options for your own personal preference"
48528,This is amazing! Definitely keeping this close to hand for decorating the rest of the house!
48529,What type of flooring do you plan on installing? That could very well set the color tone for the kitchen as well.
48530,We are having a walnut floor installed.
48531,I would keep it light. Something that compliments the cabinets and counters. Gray would be nice. Even white would be nice and then doing a colored glass tile backsplash
48532,http://i.imgur.com/MAStSPt.jpg?1 Here is the kitchen from a different angle. We are also having a neutral brick effect tile back splash and walnut wood floors. Any suggestions/advice would be greatly appreciated!
48533,"Thanks everyone for your suggestions and advice, you guys are amazing!!!"
48534,"My kitchen also has white cabinets with black countertops.  We painted the walls stonington grey from Benjamin Moore and are happy with it.  Here's a photo, but it's not a great view of the walls:
http://www.houzz.com/discussions/280949/Selecting-a-backsplash-for-our-new-kitchen"
48535,Pale green. Like a soft spring green.
48536,"Cranberry   
http://www.lauraashley.com/uk/paints/water-based-paint-pale-cranberry/invt/palecranberrypa  
  
or a   

Golden yellow  
http://www.lauraashley.com/uk/paints/water-based-paint-gold/invt/goldpa

got for a yellow ivory on the coving and white celing"
48537,"We have a very similar kitchen the walls are off white. This is the only picture I have and its a bad one. 

http://imgur.com/zZRRhQ7"
48538,"Whatever color you end up using, I don't think you should paint the wall or the divide in the middle of the room. I think it would pull the ceiling down and make the room feel smaller. I think that wall needs to stay white or be multiple shades lighter than the wall color."
48539,"Agreed, we opened the room but putting in the steel beam as the room was more divided before. I am definitely wanting to make sure it still feels like the room is whole and not make the ceilings seem smaller than they actually are!"
48540,Any of the farrow and ball classic colors. I am partial to elephants breath.
48541,I always liked canary yellow for kitchens.
48542,"Honestly? White is good. If you add a good amount of black trim where the walls connect to the ceiling, cabinets above your stove, and a lot of lighting to light up your counters, I think you'd have a pretty great looking kitchen."
48543,http://media-cache-ak0.pinimg.com/736x/bc/60/27/bc60271309a7d12d5bf55275277c6dd5.jpg
48544,"I'd go with whites and greys. They give you a classic, modern look, keep the kitchen looking open, and will go with your cabinetry and counters. 

Something like the Jubilee (SW 6248) or Misty (6232) on the Sherwin Williams website contrasted with white trim.

Edit: I just came back from painting someone's house, and the kitchen had similar countertops and cabinetry. The walls were painted a darker grey, which complimented the hardware and stainless steel in the appliances and contrasted with the white cabinets nicely. It was beautiful."
48545,"I would say I lighter gray would contrast stunningly.

Kind of like the subway tile here.

http://houzz.com/photos/2026051"
48546,I'd personally go for a light taupe grey or off-white.
56307,"I'm a big fan of the [LG 27GL850](https://reddlink.tech/lg-27gl850) personally, I believe it fits all your requirements and isn't crazy pricey either."
56308,"I love love love the razer monitor I bought and it's the best I ever had in terms of overall quality, value for money, performance and style. I absolutely adore it, and I have much more expensive unite before but still I would not trade it for any of them.  Also for me 27"" is just the sweet spot imo for single player games and also for general productivity for me at least.

edit: not sure if i am allowed to post amazon links, the exact model is the number 1 on this list: https://digitalaquarius.com/best-gaming-monitors-reviews/"
56309,"If you win the IPS glow lottery, maybe the LG 27GN950-B for SDR.
 
Hard to beat it: 
27"" 4k 144hz (160hz w/ update) IPS (1440p upscales on it just fine) 

But it's only HDMI 2.0, but how many console games actually push 4k/120hz? You can run some of the others at 1080p/120. 

For HDR, your best bet is to just go for the 48"" LG CX OLED - this one would be everything you could ask for were it not for the size."
56310,"I hate the antiglare coating on the 27GN950 :( 

To be fair I've had this issue with most IPS monitors, but I wasn't expecting it to be as noticeable on this monitor. It's most noticeable on white backgrounds.

I'm seriously considering selling it to get the CX OLED."
56311,"What do you hate about it?

The 27GN950 has a semi-gloss screen. It's way clearer than the typical matte coating on most monitors."
56312,"Idk. I hate how it looks on white backgrounds. I have everything on dark mode because seeing the antiglare coating is infuriating. I've had this issue with other matte monitors.

Does no one else have this issue with white backgrounds? I just want to rip of the antiglare coating for it to go away or get a glossy oled."
56313,"Everyone is used to it, although the intensity of the matte anti-glare coating does vary quite a bit from display to display.

I've wanted to buy a high refresh rate glossy monitor for a long time, but *everything* has matte AG.  Less than 1% of the monitors available for purchase right now have glossy AG, it's just not an option."
56314,Isn't the 2.1 refresh supposed to release sometime soon?
56315,"Yes - and that would make that next release closer to 'holy grail' for the year with HDMI 2.1, but to be fair, even without 2.1, this one is still a fantastic choice for all platforms. 

The new PS5 update enabled the 120hz for 1080p so you can still get those fast frames on this monitor.

Same with Xbox Series X/S - you can run those at 1440p/120hz on this. 

For consoles, the few games that do target 120hz will probably be bumping the resolution down anyway. 

If you're on PC, you're already getting the best this monitor has to offer through DP."
56316,"I'm in the same boat as you OP. Have a 7 year old BenQ monitor that I have been looking to upgrade for the last couple of months but it seems like 99% of monitors out there now have some fault with them after reading reviews on this subreddit.

I am just after any 27"" screen that is a minimum 144hz that has nice colours. I have narrowed it down to the following but I can't make up my mind:

* Dell S2721DGF (this is what I am leaning towards as its around €420 where I live)
* LG 27GL850B
* MSI MAG274QRD-QD
* Samsung G7 (27"")

I don't use my PC for watching movies or anything else. Just for playing games and working, but I can't make up my mind on what one to go for."
