idx,text
34442,"I didn't say any?  I'm sorry, but a touchdown when you need a touchdown is more clutch than a kicker when you don't need a touchdown.  It is entirely circumstantial though, and there's no need to get defensive about Brady since no one is saying he is anything other than great.  I just said he was similar to Joe Montana, and simply mentioned a few things that may get glossed over in favor of statistics that are inflated in this day and age.  The salary cap argument is a fallacy because teams like the Redskins, Giants, 85 Bears ect were ridiculously stacked as well.  The 49ers just drafted to perfection the year they won their first Super Bowl and continued to reap the benefits throughout the decade."
34443,Salary cap decreases parity by a large margin... the whole reason the salary cap became a thing because there was only 4 teams dominating the game. Please don't try and say the non salary cap era is harder than the salary cap era lmao.
34444,"And the Patriots get around the salary cap by having players paid less than they would elsewhere.  Let's not pretend that the NFC of the 80's was weaker than the AFC of the 2000's, so the parity argument is a very thin one."
34445,"How is that a bad thing if the patriots get players for cheap and still win? And quit acting like the 80s NFC was miles ahead of the 2000s AFC. The 2000s AFC had Peyton, the great Ravens defense, the great steelers team, and along with the Pats dynasty there was the Chargers who have 2 potentially 3 Hall of Famers all on the same offense. It is indisputable that the salary cap makes it easier to win... otherwise the league would have never started using the salary cap in the first place."
34446,"Maybe a team would do well in the salary cap era if they drafted the greatest of all time QB, safety, and WR all within the span of a few years.  You think maybe the talent scouting and revolutionary coaching had a lot more to do with their Super Bowls than the salary cap?  Look at what year the salary cap was implemented, and look which team won that Super Bowl if you want to take that route."
34447,"Both have a benefit from the rules.

Brady the new passing rules. Montana the salary cap."
34448,"Ask Brady if he'd rather play with a salary cap or no cap but the defense can basically have their way with him without being penalized.  I think I know how he would answer.  I think I know how Joe would answer as well, and they're both probably the same."
34449,"It's disingenuous to point out one benefit without mentioning the other. 

/point

But you knew that, and neither of us are going to be objective about this. We both have our horse in this race."
34450,It's also disingenuous to point out that defensive nerfing rules put in place to protect QB's like Brady has less of an affect than a lack of salary cap did for a team who drafted better than anyone else that decade.
34451,"I am going to disagree on the point that no position can impact like a QB.  A GOAT candidate WR or RB can be more valuable and more impactful in the right situation. 

Edit:  Y'all can't think of any situation that ever happened where the #1 WR or RB was more important than any QB in the league?

In case you need help, RB has been MVP 14 times since 1975.  Jerry Rice is the only receiver to have won MVP, and Lawrence Taylor has also won."
34452,"if we're starting an organization from the ground up, I'll take the 10th best QB before I take the very best WR or RB. AP was the best RB in the league for a number of years, do you think that the equivilant of AP at the QB position wouldn't have accomplished significantly more as far as wins."
34453,"Thurman Thomas - Buffalo Bills - NFL League MVP 1991

2000+ yards from scrimmage.  12 TDs.

The 10th most TDs by a QB that year was 15.  The 10th most yards was 3100...but only 64% (1984 yards) of that was Air Yards, the rest was Yards After Catch.  In this very case, a player from your team was comparable to the #10 QB in the league."
34454,The very best WR makes the 10th best QB look a whole lot better.
34695,Lawrence Taylor
34456,Devin Hester.
34457,Moss
34458,Jim Thorpe
34459,Peyton Fucking Manning.
34460,Why the downvotes?
34461,Pats
34462,Massholes
34782,Tom Brady
34464,Tom Brady is the best player in league history at the game's most important position.
34465,"Nah, Peyton manning is the best qb, he may not have as many rings as Brady, but just look at Peytons stats, he has like 30k more passing yards"
34466,"Manning has more games played and played most of his career indoors. 

you can't look at the player Brady has been since 2007 and seriously say that Manning was better. At best they've been equal, but if you care about ball security Brady is better."
34467,Tom Brady has like 2 more rings.
34525,Jay Cutler
34469,Tom Brady.  I don't think you can really compare the value a good QB has to a team compared to any singular position.
34470,"Offensive: Brady
Defensive: LT"
34471,LaDanian Tomlinson played defense?
34472,Rice.
34473,"Tim Riggins

Clear eyes"
34474,"Are greatest and best synonymous for this question? For me, winning is part of greatness, but it doesn't necessarily make you the best. Brady is pretty unarguably greater than Peyton imo, but I still believe Peyton is/was better.

There is no such thing as a Best Football Player every I don't think, but Greatest could be any of, Brady, Montana, Jerry, and then my pick, Otto Graham."
34475,Walter Payton.  Jim Brown and Barry Sanders rolled into one
34476,Jerry Rice or the real LT
34477,"Walter Payton. I've just never seen anybody do more with less for longer (Hello, Chicago of the 70's). And his more was more that anybody else's more than I've ever seen. Ever down he played like it was the last play of the Super Bowl."
34478,Elway
34479,I'll up vote that
34481,"Lawrence Taylor and Barry Sanders.

I'm torn between the two."
34482,Barry for sure!
34483,LT never came off the field for weaknesses like Barry did. My choice is Ray Lewis.
34486,Derrick Thomas
34487,I wanna hang out with Arian Foster.
34488,"Foster and Larry Fitz for me, those guys are my faves."
34489,"He's just trying to be the best friend he can be, man."
34490,"I think ochocinco is a cool dude. 

A fan followed him on twitter and tweeted at him numerous times over the course of two years and never got a response.

He tweets something like ""hey man I've followed and tweeted you for two years, you never replied, what's up with that?""

Ochocinco said ""my bad man, want to come to my game on Saturday?"" 

and then flew the fan out to see the game and hooked him up with a bunch of gear. 

http://www.cbssports.com/mcc/blogs/entry/22475988/34370994

That's cool."
34491,Didn't he also headbutt his wife in the face though? Not so cool in my book.
34492,"I am partial to Pat McAfee. Not to borrow from the side bar but I assume Gronk is a cool guy. 

I base this all on off the field coolness."
34493,Zoltan Mesko
34494,Matty Ice
34495,Von Miller
34496,[What a Vonster](http://i.imgur.com/HhqVlLK.jpg)
34497,Anthony Davis seems to be a funny guy
34498,Chris Cooley.
34499,Golden Tate
34500,Matt Stafford
34501,[Who doesn't wanna hang with this?](https://www.youtube.com/watch?v=WOa3ErcT--w)
34502,Marshawn Lynch:  [Marshawn Lynch goes to Applebee's](https://www.youtube.com/watch?v=h2uN28EJRlA)
34504,Connor Barwin is such a huge hipster. It's incredible to witness the first time you meet the guy.
34505,Gronk
34506,"I might be a little biased, but Gronk or Edelman."
34507,Gronk is the type of guy you wanna have a beer with
34508,"For me he's the kind of guy I'd like to punch in the face. But he's 6'7"" so if I tried I would just piss my pants in fear"
34509,You'd get pussy just by association.
34510,How so? He seems like the bro who says the most annoying shit all of the time in your discussion classes.
34511,"I watched a cooking show with my mom and they had a segment where the contestants cooked sausage for Gronk. He hit on the host, made a big penis reference when talking about sausage, and referenced his ""big muscles"" three times. Normally I'd hate someone like that, but if I looked like Gronk, I would probably act the same way."
34512,"In other words, Gronk is not someone I care to have a beer with tbh."
34513,"I mean he seems like a good wing-man at a bar, but a one-on-one beer might be a little weird and intense."
34514,The host was bout it
34515,Ya she was all about that Gronk.
34516,"The funniest part was the Redskins fan who said he hates Gronk. I was like why? I mean he did have that game against them where he shook off three guys and ran up the sideline, but Id hardly call that a reason to hate him."
34517,"I'd rage so hard with gronk. 

You know he has to be a fun motherfucker to be around."
34518,Or 15 beers with tequila shots dropped in them while doing cocaine off a midget strippers taint
34519,Gronk catch ball. Gronk drink beer
34520,You forgot one Gronk fuck girl.
34521,One? Gronk gets more than 1 at a time.
34522,"Probably not. 

He'd take off shirt, kick you in the nuts, and then body slam you."
34523,Ike Taylor
34524,I hope he does The Top 100 again.
34526,Smokin' Jay
34527,Not NFL but probably Ted Williams right now.
34528,Chris long seems like a really cool dude.
34529,No mention of Jared Allen?  Seems like a real prankster and would be a total bro to hang out with.
34530,JJ watt
34531,He's an awesome player and awesome character but the get off my lawn vibe towards the rookie mettinberger took away some of his cool...and let's not forget the letterman jacket fiasco
34532,"Letterman jackets were Kubiak's idea IIRC

Kubiak's letterman jacket is in the Texas Sports Hall of Fame in Waco."
34533,Dominic Raiola
34534,Are you saying that Gene Upshaw and Eugene Upshaw are different people?
34535,Same with Crazy Legs Hirsch and Elroy Hirsch.
34536,"Yeah, when I saw he was taken off the list I was annoyed. Then I saw Eugene Upshaw made the list and didn't know what the fuck was going on."
34537,Wait till the list in 2032 when both of them are replaced with that Highway 63 fella
34538,[well....](https://www.youtube.com/watch?v=UZDcDJda3qg)
34539,"> Basically Brady added Joe Montana's career over the past 11 years.

Insane.

And he is still going."
34540,All in the face of “two way threat QB” >
34541,Wow that's crazy that they excluded Elroy Hirsch in favor of Crazy Legs Hirsch ;)
34542,"Thank goodness, Night Train didn’t replace Dick!"
34543,Or that Gene Upshaw was replaced with this Eugene fella!
34544,Fuck…..
34545,And gene Upshaw for Eugene Upshaw
34546,Wow no respect for Jim Thorpe
34547,"> Thorpe

Yeah, I'm confused by that one. He and Red Grange are pretty well indelible icons. Did The Athletic forget they existed?"
34548,"Um, isn't Red Grange specifically known for being the first celeb NFL player but his play was nothing special?"
34549,Basically this Grange was an extremely famous college player and him coming to the NFL gave pro football a ton of credibility.
34550,"That, and the game was a bit different back then. His time wasn't huge, but his influence was."
34551,"Everybody on this list either has or will have a bust in the Hall of Fame one day.

[Jim Thorpe's statue guards the entrance.](https://www.seathelights.com/thestore/images/postcards/6667a.JPG) 

As someone who hasn't been closely following this list, the fact that Jim Thorpe isn't on it is a pretty big oversight IMO. Unless there's a rules-related reason, like excluding players from a certain era, Jim Thorpe needs to be included on any list of great football players."
34552,"That's a bit hyperbolic.  Thorpe has a lot of goodwill in Canton specifically because he played there, but let's not go crazy. He was a running back who played 57 games before the NFL was really anything like what the NFL is today."
34553,"I'm not saying he's the GOAT, but he's undeniably one of the greatest American athletes of all time. He was in the very first class of pro football Hall of Famers. 

There's a good reason he was ranked 37th on the first list. 

Yes, he played at a time when football was very different. So did Jim Brown, so did Red Grange, so did Otto Graham. 

In a list of all-time greats, you need to compare players to their contemporaries, otherwise you just end up with the top 100 players from the last 20 years. The game is constantly evolving, so the only metric we have to compare is how they compared to their peers, and Jim Thorpe was arguably the sport's most important player when the sport was in its infancy."
34554,The 100 anniversary team left Thorpe off as well. they had a 1920's all decade player and 5 1930's all decade players.
34555,I thought they had him at 37?
34556,"The Top 100: NFL's Greatest Players from 2010 had him at 37.

The 100 anniversary team from 2019, that left the 100 players unranked, didn't have him among the members."
34557,Oic
34558,"Also, regarding the 57 games thing, he was already 33 when the NFL even started being a thing and there weren't that many games in a season back then, so he inherently won't have played too many games. Doesn't stop him from being one of the most influential players of all time, though."
34559,"> In a list of all-time greats, you need to compare players to their contemporaries, otherwise you just end up with the top 100 players from the last 20 years.

The older I get the more I realize just how susceptible sports is to recency bias. I mean I get it, very few people are going to read books on players from a bygone era or watch old games outside of the occasional highlight reel."
34560,Jim Thorpe was one of the few people who gave the NFL credibility back in those days.
34561,"He gave the league legitimacy.  Without Jim Thorpe, the NFL might never have gotten off the ground, and there might not be any NFL Top 100 to even discuss."
34562,"For real. It’s arguable he’s the greatest athlete ever. Not all of that is football mind you so it could make sense why he dropped off the list but still, let’s all put some respect on his name."
34563,"Greatest athlete of last century, damn shame."
34564,There is no NFL without him
34565,"Quick visual aid:

Https://imgur.com/a/jA7rC4a"
34566,"I find it interesting over time they decided to swap spots between Rice and Brown. You’d think if Brady is 1, they’d both slide back 1 spot."
34567,"Different voters, different values. 

Brown and Rice both have compelling cases. I prefer Rice, though not enough to get emotional about it and start claiming disrespect or criminality (if you saw the post when Rice was 3rd)."
34568,"Still think it's dumb that the athletic put brown ahead of Rice, he's objectively a better player and played for much longer."
34569,"There a lot of players, and a few RBs, who should be ahead of Brown"
34570,They didn't have Walter Jones on the first list? WTF. He has a good argument for 2nd best LT ever.
34571,"Like both lists, not many OL."
34572,"I'm not sure if this is a stupid question because I didn't watch football when he was playing, but why is Michael Strahan not more highly regarded? He's top 10 all time in sacks and has the single season record, but he was 99 on the NFL's list and not ranked on the Athletic's? Why is he not treated as one of the great defenders?"
34573,"I was thinking the same. I'd understand being in the back half a bit, but 17+ people leaping him in the past 10 years? I don't know about that.

But like someone else said somewhere, different voters this time around and maybe they just value you different things."
34574,"He's right there, but I would guess it would be because sacks aren't everything for that position (and all time lists are skewed due to the recency of logging them). For instance, Kevin Greene is 3rd all time in sacks and he was a solid player but nowhere near sniffing these lists. And while Strahan was much better than Greene and one of the best ever at getting after the quarterback, it's a pretty loaded position for the top 100 and he was never seen as the ""bigger than life"" type of game changer like LT or Reggie White or even Bruce Smith. 


I think there's a very strong argument to be in the 90-100 range though. But just missing top 100 ever in a sport with as many positions as football, especially when trying to contextually include players from pre 1960s, isn't a bad thing."
34575,Strahan was arguably the best run defending DE in NFL history.
34576,">Peyton Manning only moved up one spot from 2010 to 2021, regardless of the fact that between both years he had a 55 touchdown season in which he won the MVP and added another Superbowl a few years later.

The 55 TD season is what moved him up a slot, but only someone just reading accomplishments off a stat sheet who never watched the games would say 2015 adds to his legacy on a list with other top all-time players."
34577,"Yeah when OP said Manning ""added another Superbowl"", I think he forgot the manner in which Manning added that Superbowl"
34578,"Utterly baffled that Kurt Warner made the original list, but glad he won’t make any future ones."
34579,"It’s interesting that young took such a leap. He probably deserves it too, but kinda shows how much more statistically-literate the voters on lists like this are now. Growing up, I knew young was great but didn’t really know how insanely efficient he was. PFR got us woke on some of these guys"
34580,Gene Upshaw was #67 on the new list.
34581,How was Walter Jones not on the first list?
34582,"Red Grange going from 48 to off the list is kinda sad from a historical significance perspective. Obviously a rb from the 20's cant compare physically with todays players, but he was instrumental in changing the perception of and growing the popularity of professional football in America."
34583,"Wow, Gronk was just starting his career and Aaron Donald was like a freshman in college and now they're both super high on this list. Insane careers"
34584,"Joe Namath? Yeah, I don’t know about that one even in 2010."
34585,I remember when they talked about it and they were aware that it was not a particularly popular take.
34586,"He's hella iconic, but was never very good."
34587,"Obvious NY sports beat bias here. Namath was NOT a great QB. Not on camera, not on the stat sheet. Super Bowl III was a monumental event in NFL history, and Namath gets way too much career cred for that one game."
34588,Love all the threads recently about Jerry Rice being the GOAT when Tom Brady exists.
34589,"I mean, if there's a single player that has a case over him, it's Jerry Rice."
34590,"if WR was the most important position in football, then there's no debate, but someone had to throw him all those balls"
34591,"Conversely, someone has to catch those passes, and no one was as dominant as Jerry Rice when it came to that. Not saying that he's the GOAT over Brady, but if any one player has a case over him, I'd go with Rice."
34592,"> Conversely, someone has to catch those passes

Which is exactly what makes the QB position more important. Brady’s thrown to over 100 players in his career, and has succeeded all the time."
34593,"Conversely, Jerry Rice has caught passes from 17 quarterbacks."
34594,"I think it's definitely a fair argument, but it's not like the guys tossing him the balls were some shlubs either."
34595,"He had HoF QBs throwing him the ball on 64% of his passes. For comparison, Randy Moss only had 19% of his passes from HoF QBs. A massive difference."
34596,"Rich Gannon was pretty solid too, won an MVP. Rice @ 40 led the Raiders in receiving that year though, so I imagine he deserves some credit for that MVP nod lol"
34597,Oh totally. It was a good match — both benefitted from each other.
34598,Shout out to Charlie Garner who almost put up 1000/1000 that year.
34599,"Having HOF QBs is what allowed Rice to rack up 3 rings and so many wins. It's not something that helped his stats. He played with 2 efficient but not-high-volume passers for his entire career, he would have put up the same or better numbers with worse QBs who threw more. It's been proven time and time again that worse QBs will lean on their #1 target more often and the #1 target will put up better statistical numbers."
34600,"The other thing to note however, is that Rice didn't have as much WR competition the way other HoF's had (Moss + Carter, Fitzgerald + Boldin, etc).

Every WR had a unique situation that affected their stats one way or another. For instance, Fitzgerald certainly didn't benefit from having an extremely low caliber of QBs for the majority of his career.

Do you have any articles about the worse QB equating to better stats for a WR? I'd love to know more about that!~"
34601,"Rice had a HOF WR next to him for 6 years (T.O and then Tim Brown). Carter and Moss played together for 4 years. Rice also had great receiving threats on his earlier teams, thats why those 49er teams were so good. Roger Craig was putting up WR1 reception numbers, John Taylor."
34602,"That's a *little bit* disingenuous though. TO was not a household name until 1998 when he put up 14(?) TDs. Brown was also in the tail end of his career (though I guess you can sort of compare that with Carter). Moss also had Welker, maybe the best slot receiver ever (and Moss was the main part of the two highest scoring offenses of the time).

those early 49ers years also benefitted from the new WCO, which I'd argue did the heavy lifting for many of those players.

Either way, I find it hard to argue that HoF QBs don't benefit WRs. Sure, they're better at spreading the ball around, but they also allow WRs to do more. It certainly works both ways, and there's definitely cases that would support both sides of the argument. I wonder if there's some definitive research around the topic."
34603,"I mean, at 40 Rice had 1k yards with Rich fucking Gannon."
34604,"There's a reason he's #3 on this list and #1 on the previous top 100. Comparing bars of gold to other bars of gold here, the margins are thin."
34605,"Rich Gannon was a very, very good QB. Better than a Daunte Culpepper and comparable to a Carson Palmer."
34606,He was MVP that year though.
34607,Gannon was first team all pro the year before Rice joined the team and Rice had just come off back to back 800 yard seasons. IMO Gannon deserves way more credit for Rice’s career resurgence than people like to admit.
34608,He wasn't the only one catching those passes.  Rice joined a dynasty in-progress that was already the best offense in the league and had won two Super Bowls.
34609,And was on that team for half his long career pre-salary cap
34610,"Sure but I think it's a little unfair to other positions I would say was Jerry rice better at playing wr than tom Brady is at qb. I think yes, based on direct comparisons between Jerry and his competition and Brady and his competition. Rice is just so far ahead statistically from other wideouts it's insane. 



Now realize before we go downtown his road were splitting hairs over the best players in history and Brady is very deserving of the number 1 spot but I hate how people downplay other positions greatness because qbs are more integral to the team."
34611,"Rice had an argument that countered the QB narrative by his longevity. At 40 he was still a good to great receiver. Brady has now taken the longevity crown as well. Rice should have been 2, and there was still a sliver of an argument that the gap between Rice and the next best WR is significantly more than Brady and the next best QB. 

/s Also they had to put Brady at 1 or he'll play for another 10 years."
34612,"Yeah that's a fair statement, but also it's inherently an unfair comparison because positions in football aren't on an even playing field--QB is undoubtedly more important, and Tom is the best QB. 

It's splitting hairs, sure--Jerry Rice was #1 and now #3 for a reason--but great QB play elevates a team way more than great WR play, and I don't think that can be ignored as well."
34613,"> I hate how people downplay other positions greatness because qbs are more integral to the team.

Really doesn't feel like anybody is downplaying it at all. Ultimately, on a list when deciding between #1 and #2 who are arguably equally great at what they do, if one (either by virtue of position value or anything else) is better at winning football games, that's a pretty good arbitration metric."
34614,"Well said. QBs by default have a greater outcome on the game, but I really dislike the automatic degradation of every other position by some folks simply because that position is not QB. They're already the most important position, we don't need to pretend like they do everyone else's jobs, which are also important.

Edit for a since deleted response:

>And if nobody is blocking for the QB, their job becomes a lot harder. When receivers aren't getting open or catching passes, their job becomes a lot harder. If the RB can't get going, the QB's job gets a lot harder. If the defense isn't getting stops, their job gets a lot harder. If Special Teams isn't establishing good field position, then everyone's job gets a lot harder.

>Like I said, the QB is probably the most important. But that doesn't mean everyone else isn't important. Its bad enough that basically nobody but QBs can win an MVP, with rare exceptions, but Jerry Rice is reduced to ""Not a QB""."
34615,"The most important person is the head coach. If we're detracting from Rice for having Hall of Fame QBs for most his career, then you should detract from Brady for having Hall of Fame coaching most of his career

If you're looking at this without a positional bias for QBs, Jerry Rice is the obvious #1 player in NFL history."
34616,"Rice started with Bill Walsh, and it's not like George Seifert was some chump. I think Seifert should be in the hall tbh"
34617,"If you wanted to build a case around championships, I think there's a coherent case that could be made for Otto Graham. I doubt it would convince anyone, and you have to consider the AAFC + NFL stats or else you only have six NFL seasons.... but highest career winning percentage by a QB, 10 championship appearances and 7 wins + 5 MVPs in a ten year career, and still owning the record for highest career yards per attempt is an interesting foundation to try to stand a case on. Did *Brady* win a pro basketball championship? I thought not."
34618,"Otto Graham is Bill Russell and no one has
Bill Russell as the Goat"
34619,"Brady’s individual passing records will probably be beaten when it’s all said and done, jerry rice’s will probably never be topped. Larry fitz is as close as we’ve come and he’s still far behind rices records."
34620,Fitz maybe could've pulled it off with better QBs throughout his career. Rice had a massive 64% of his passes thrown from HoF QBs. Fitzgerald had less than 4% of his passes thrown from HoF QBs.
34621,"Just for fun: Jerry’s 36% coming from non HOF QBs equates to 557 receptions, Larry’s 96% is 1374 receptions, and Moss’ 81% comes out to 795 receptions."
34622,"Passing records and receiving records are nice, but I don't think anyone is winning seven super bowls again unless it's some Robert Horry type stuff."
34623,Did Brady hold the Rams offense to like 3 points? And intercept that ball on the goal line? Don’t think that I’m hating or don’t acknowledge Brady being incredible but championships are team efforts and it helps winning so many with one of the greatest coaches of all time. Individual stats also require teamwork but are a bit more indicative of individual greatness.
34624,Yea because Brady's individual passing stats are totally pedestrian
34625,No one said they’re pedestrian but they’re not unattainable like Jerry rices records are.
34626,I think 7 (and counting) superbowls is a lot less attainable than Rice's stats.
34627,Again missing the entire point
34628,Not really.  Rings are a more important stat than receiving yards lmao.
34629,“Rangz eurneh”
34630,I think it's a really fair debate on if QB positional value and championships outweigh the absurd statistical dominance Rice has on his position.
34631,They absolutely do. Look at any Patriots SB and tell me which they’re winning by swapping Brady for Rice
34632,"Well yes, but swap Rice for most Super Bowl winners' starting QB and they're probably in trouble, so I'd argue that's a bad criterion, unless you think the top 30ish players all time are Super Bowl winning QBs"
34634,No? I’m using it as an example of the relative value of each position. Brady is absolutely the GOAT because his contributions are more impactful to each game.
34636,"No, I do not. 

Brady and Rice are a 1a 1b sort of situation, and I think that Brady’s accolades push him ahead of Rice, because he more earned them directly with his play.

Just when comparing the two of them, not everyone."
34638,Okay now I know to stop responding. The troll came out of its cave
34639,"Steve Young is really interesting to see him move up so much his career was well over before the last list.

I wonder if Aaron Rodgers ""carried"" him up the list since Rodgers has always been compared to him."
34640,Wasn't there also a NFL Network 100 greatest players list in 2020?
34641,"USA today did a 100 in 2019. The NFL did a 100th Anniversary Team in Nov/Dec 2019, though voting was done before the 2018 season."
34642,Ozzie getting kicked off was some bullshit
34643,Any players that made both lists but did not make the NFL 100th anniversary all-time team? Or conversely players that made the 100th anniversary team but did not appear on both lists
34644,"100th anniversary but missed NFL N and Athletic 100: 

Marvin Harrison, Rosey Brown, Largent, McDaniel, Guy, Fitzgerald, Larry Wilson, Jack Christiansen, John Randle, Stenerud, Ken Houston, Fortmann, Dutch Clark, Vinatieri, Hewitt, White Shoes Johnson, Doug Atkins, Cal Hubbard, Hester, Dwight Stephenson

On Athletic and NFL N but not 100th Anniversary Team:

Tarkenton, Willie Davis, Singletary, Faulk, Steve Young, Adderley, Bradshaw, Tomlinson, Starr, Nitschke, Luckman, Bronko (all players were finalist but not team members)"
34645,i dont get how polamalu isnt on this
34646,"(basically Brady added Joe Montana's career to his resume over the past 11 years).

LOL ."
34647,"Here goes my rant: I hate these lists. They reduce careers, teams and games into cogs in the ""Where does \_\_\_\_\_\_\_\_ \_\_\_\_\_\_\_\_\_\_\_ rank all time?"" debate. These guys played different positions on different teams with different schemes in different eras with different rules under different coaches for different lengths of time with different injuries. Comparing them is literally impossible.

Can't we just watch and appreciate the games without these pointless ""GOAT"" arguments?"
34648,It's just people doing something fun between seasons; basically shitposting.  You can ignore it or downvote it and move on instead of throwing shade on something other people enjoy.
34649,"I know and I will just scroll past it. I'm just annoyed because I subscribed to the Athletic a few weeks ago because I was tired of this type of content and wanted ""meatier"" coverage of my teams. Now, when I go to the latest Giants articles, the featured article is Lawrence Taylor's ranking. I just think this type of content should be reserved for free sites"
34650,"In the Athletic's defence, I've really enjoyed the actual quality of writing about the various players on the list. You can have bar arguments about whether they got the list and the order right, but taken as 100 articles about great players I think it's been a success.

It's been interesting how they've chosen to write about each player: some focus on an individual game, or even a particular play; some talk about the player's influence on his teammates, or his influence on the sport as a whole; the more historical articles make an attempt to highlight how that player was so good compared to those around him at the time.

All-in-all, I've found it a really enjoyable project, and I've certainly learnt a lot about so many players. And it finishes literally the day before the season starts, so it won't interfere with actual analysis of the games/teams."
34651,"I agree with you on the quality of the product. I just don't like the product in the first place. I vastly prefer the articles that highlight a player's place in history for what he brought to the table and how that affected his team and, in the case of the top ranked players, the sport as a whole.

And you're right about the historical aspect of this type of content. As a fan of NFL history, I'm glad that fans are getting this opportunity to read about people like Jim Brown, Walter Payton, Johnny Unitas, etc. I just hope that readers, especially younger ones, keep their focus on learning about the players instead of caring who they rank ahead of or behind."
34652,Didn't the NFL have a more updated list a few years ago for the league's 100th anniversary?
34653,"They did but the rules were quiet a bit different. 

They had spots for punters, kickers, and returners. Also, only a little bit of the voting was leaked so it's mostly here's 100 players with very little information on who is 1 or 100."
34654,AD is born is the 90s lol that never registered with me.
34655,Adrian Peterson was born in 85. Check your facts.
34656,AD=Aaron Donald
34657,"AD was Peterson's nickname far before Aaron Donald, so you could understand the confusion."
34658,"Man, I feel old. AD is AP to me."
34659,"For sure, just clarifying."
34660,"So you’re saying AD used to be Adrian Peterson, but then it switched."
34661,"AD will be Peterson for most of us that have been NFL fans since he has been in the league.  Donald is seldom referred to as AD, so it's confusing to refer to him as such when there is a more established user of the nickname.  (Not better player or more famous, just more closely associated with the abbreviation AD)."
34662,"Lol, I was just making a garbage joke about Peterson hitting his son with a switch. This is totally the response my comment deserved."
34663,Right over my head
34664,Ballsy.
34665,"I mean, amongst Rams fans he is only AD"
34666,That’s annoying because AD has been Peterson since before Donald was in the league
34667,"I think it's ridiculous that Peterson gets both AD and AP. He has an earlier claim but if he's going to go by a two letter moniker I think it has to be AP.

And while we're on the subject, I'd just like to say that I'm not okay with Jonathan Taylor being referred to as JT, when he's not even the most accomplished JT in the NFL. If anyone is going to steal JT away from Justin Timberlake, it's Justin Tucker."
34668,So should we not refer to Donald by his initials because it was a running back's nickname?
34669,Well when you’re discussing a list with multiple people called AD on it then no. Aaron Donald isn’t known for being referred to as AD where as Adrian Peterson is so…yea. Don’t call him AD when discussing a list that has an established AD on it.
34670,"You should use his name or nickname. 

By calling him AD, you’re putting a new nickname no one ever really uses onto him, that’s also being used by another HoF type player."
34671,"I guess it’s weird, because amongst rams fans it’s almost always AD"
34672,This makes me believe Aaron Donald could enter the top 10 by the time he's done
34673,For sure. He's right on pace.
34674,But Brady hasn’t been included in the 2021 list yet
34675,Michael Irvin is 3rd all time in playoff yards despite having less games than the rest of the top 10. The disrespect is ridiculous. He played in the hardest era for receivers due to rules and talent at CB.
34676,Both lists have too many qbs
34677,"Isn't NFL's list more canonical than Athletic, which is just another sports new site.

And I do mean, just another sports news site, they aren't exactly considered standard or anything."
34678,"Seeing this made me realize Kurt Warner kinda got shafted.  The greatest undrafted player ever.  He won two league MVPs, one Super Bowl MVP, and led his teams to 3 Super Bowls (including being the QB of the “Greatest Show on Turf”).  

He was really only 90th on the 2010 list and off the list this year completely?  I get that his career didn’t have the longevity or sustained success of the others, but his peaks were some of the best!"
34679,"Warner doesn't even belong in the HOF, neverminded in the top 100 layers of all time. Such an over-rated flash in the pan."
34680,Is there a place to read the pieces without a subscription?
34681,"I know it's early, but how many more seasons before Mahomes makes the list? If he's MVP \*and\* Super Bowl MVP this year, would that do it?"
34682,The only list Joe Namath belongs on is who wants to bang Suzie Kolber the most
34683,Who was the previous #1?
34684,Lol Tom Brady isn't the GOAT
34686,Cause that title belongs to someone else
34687,"Ya, ok, but why?"
34688,Because what Tom Brady did is an accomplishment of the organization. The patriots Dynasty is the GOAT dynasty. NOT tomtholomew
34689,"Who is the GOAT, then?"
34690,"Aaron rodgers, but yall aren't ready for the truth yet🥱🥱🥱"
34691,Why is Champ Bailey so low? He should be way higher than 87. At least top 50
34692,"This thread has been marked Serious. Please post accordingly, and remain on-topic. 

Any off-topic or joke replies will be deleted.

Please report any inappropriate comments for moderation.


*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nfl) if you have any questions or concerns.*"
34693,"when i think of football, i think of lawrence taylor"
34694,"I agree. I don't think there's anyone as iconic as LT. The dude single handedly revolutionized the game. Coaches had to adapt- to him. Linemen had to adapt- to him.

Put one person against LT? Enjoy your sack. Put two against him? He's still got a hand on your QB. Guy was an absolute monster, and I don't think we'll ever see someone impace the game the way he did, ever again."
34698,Otto graham.
34699,It's Jerry Rice. The gap between him and the next best wr compared to the top at any other position to the next best at that position is by far the largest.
34700,Jerry Lee Rice.
34701,Rice
34702,LT
34703,"How do you define greatest?

 Some go by best overall, which would probably be Rice (more margin from Rice to 2nd best WR than any other major position)

Some go by legacy, which would be Montana or Brady with their playoff success combined with the aura about them (as in...when the game is on the line, who do you want with the ball) 

Others go by statistics, which would for now be Peyton Manning or Rice.

And some go by talent, which would be Rodgers OR young or Manning or anyone really."
34704,Steve Young was soooo talented
34705,"Don Hutson > Jerry Rice, Fite me IRL"
34706,I think all time greats should be separated pre and post merger. Really hard to compare guys who played in the 1930's to guys today.
34707,"Why? We count NBA before their merger, we count MLB before reintegration, why shouldn't we count pre-AFL"
34708,"Just such a different game, rules players schemes and overall football gameplay has evolved so damn much"
34709,"> We count NBA before their merger

We really don't. There's a reason nobody brings up Wilt in GOAT discussions. It's always MJ, Kareem and LeBron, and then some hipster always brings up Hakeem."
34710,I love Don. But there’s no way.
34712,"Jerry Rice. He is the only unanimous best player at his position. His stats are unbreakable, his longevity, and arguably his prime was the best the NFL has ever seen among the WR position. 

But if there was an all-time NFL draft and I had #1 overall pick I'd take Peyton Manning since I think you'd be foolish not to take a QB  in that situation and he would be the sure fire dominant player regardless of whatever team he would be stuck with."
34713,"I'd go Rodgers over Manning with the prevelant of bootleg like plans today, but otherwise totally agreed. Rice is virtually unchallenged (though the homer in me hopes AB catches him)"
34714,People may downvote you but I agree with both your points.
34715,"Jim Brown, Jerry Rice, Lawrence Taylor, and Tom Brady would likely be my Mt. Rushmore."
34716,I agree though I’d prefer Montana on that monument over Brady.
34717,"In all seriousness though, how can you put Montana over Brady anymore? I wasn’t around to watch Montana, but I’ve seen Brady since day 1 and the accomplishments just seem to overshadow Montana in every way."
34718,I just like him better
34719,"LT, Rice, Reggie White, and maybe Rodgers rounding up my Mt. Rushmore"
34720,first 3 sure Rodgers is going to have to win some more before getting his face carved on any mountain not in Green Bay.
34721,"LT on defense because he is from another world. Tom Brady on offense... depending on what you mean by greatest, my offense voice my be different."
34723,Nice.
34724,https://i.imgur.com/apNvKbT.png
34726,"https://imgur.com/a/gS2yO

https://imgur.com/a/sQXlN"
34728,2nd in which one?
34729,lol the manning face
34730,After Jerry Rice?
34731,Walter Payton /end
34732,"Jerry Rice or Joe Montana, yes there is no arguing with Rice's stats but (in my opinion, as the question states) Joe was, inspirational. The memories I have as a child, the energy, watching him, he is what made me a football fan."
34733,"Jim Brown, I'd say. Jerry Rice, Johnny U, Tom Brady, and LT probably round out my top 5."
34734,Listen to Shannon Sharpe last year after SB. He’s the top Patriot Hater since he was playing and now. He would say is Tom Brady.
34735,"If we're going by championship presence and winning, Otto Graham is pretty much is your guy.  Career 114-20-4 record (0.814%), championship appearances in NINE straight years, still hold the record for yards per pass attempt at an incredible 8.98 YPA."
34736,"It's honestly weird to me that hes never mentioned. The guy was putting up numbers that would look great today, all the way back in the 40's."
34737,"Jim Brown. Also, as unpopular as it may sound, Peyton Manning is a close second."
34738,Manning over Brady?
34739,"It's a hard sell I know. Brady has the rings.

But I view it this way: in the 16(?) seasons the two played in together, how many of them was Brady better? The undefeated season, the year Peyton was out with the injury, and Peyton's last two seasons. 4 out of 16/17 seasons.

Is Brady the most successful player ever? Absolutely. But it's hard for me to say he's the ""greatest"" if you're taking playoff success, awards, AND individual talent all into account."
34740,"That's a very hard way to compare tho. Brady is two years younger, so Peyton had more experience at the beginning and hit his prime sooner. 

Comparing each year of playing (year 1 of Brady's career verse mannings year 1) would still go to manning, but it would be closer than 4/16. Plus brady is still going and played 2 mvp type seasons verse mannings ending then."
34741,Manning has 5 MVP's to Tom's 3. 7 first team all pros to Brady's 3 and all those all pros were when Brady was in the league.
34742,Brady is the starter on the all 2000s team and Manning is the backup.
34743,Yes that is correct. Doesn't change the fact that the way of comparing seasons would be more fair and more accurate by years in the league side by side.
34744,go look at the stats and values of those players for their team when manning won those mvps. half of those are sure thing for the other guys. mvps are just some guys' opinions
34745,"That's fair, but even if you compare them age vs age or 1st year vs 1st year, it's still not that close.

I wouldn't say that Peyton ""hit his prime sooner"" than he was just better coming into the league obviously, 1st overall vs. 6th round pick. 1 year age difference isn't much when comparing two players over the course of 15 years."
34746,"I agree it would still be in mannings favor by a decent amount( regular season purposes)
My point was more that toms play at the end of his career(last 2 years) has been incredible and it's being left out of that thinking because manning has been retired. 
Also the chance he has a year or two left of good play."
34747,Dick Butkus
34749,Deion Sanders
34750,Jerry and I think Montana is in the convo as well but I’m biased
34751,"Rice, Taylor, White are probably the three most dominant players to ever play."
34752,On and off field Walter Payton
34753,"I believe this conversation is basically Jerry Rice, Walter Payton, and now Tom Brady. Being a Bears homer, I’m goin’ Walter."
34754,"Respect to the other greats, but it has to be Tom Brady"
34755,"Does it?  The question isn't QB, or recent and the QB position wasn't always as important as it is now given rule changes (even then, this question lends itself to a lot of debate.  Given how others paved the way for Tom)

Taking into consideration importance to a position, Montana is more important than Brady to the sport, so Montana > Brady, but some might say player X is > Montana, and we have ourselves a debate but I'm okay with then having without regency bias."
34756,"Excellent points. I do believe that in a salary cap driven league where it’s harder to hold onto impactful players and winning systems that Tom stands alone. 

He has the rings, personal/franchise records, MVPs, AFC champion and division titles, absurd win/loss ratios especially at home, ridiculous sustained QBR, high level consistency and longevity across a decade and a half, coming back from serious injury, and has managed to separate himself in an era of HOF QBs (both Mannings,  Brees, Rodgers, Favre, Warner etc). 

All this is made more impressive by the fact that he really isn’t that special of an “athlete”. He’s never been the fastest, strongest QB with the most powerful arm. 

Just my humble 2 cents from watching him his entire career"
34757,"If Tom doesn’t marry Gisele, he doesn’t take a pay cut and their entire franchise is different"
34758,This is dumb every single QB that has signed a major contract never needs to work again. Look at Jimmy G just signed massive contract for next 5 years so 6 years from now he could play for free and still have Fuck you money. So this whole he is married to Gisele he can take a discount is dumb every top guy at the top of pro sport is earning money for grand kids not money they will ever need.
