idx,text
11341,"The best gift I ever received from my little one was a card with a recorded message from her, given to me when she was about 4.  I still open it just to her her say ""I love you daddy"" in her little voice."
11342,I've been raising my girlfriends child for four years. His dad is a deadbeat and hasn't seen him in two years much less pay for anything  from formula to diapers to daycare but I've always just a wanted a card. That's all.
11343,Anyone can father a child but it takes a real man to be a dad.
11344,"Not trying to toot my own horn too much, but I nailed the gift that I gave to my dad 13 years ago.

I was headed into my junior year of high school and had no money since I played baseball all summer instead of getting a job. On the way to a game one Sunday afternoon, my dad brought up that it was Father's Day (I think that I remembered, but we never made a big to-do about those minor holidays). He gave me a hard time about not getting a gift since he knew that I had no cash and that macaroni art would be a little creepy coming from a 15 year old.

I joked right back that it was my day to pitch and that I'd throw him a no-hitter. I was always a decent player, but had never done anything like that before...

...and damned if I didn't throw my only no-hitter that day.

Neither of us are too emotional, but I could see in his eyes how cool of a moment it was when we hugged after the game. Maybe someday I'll make some money and buy him all of the gadgets that he really wants, but I don't think I'll ever top that day.

TL;DR - My dad and I are both baseball nuts. I threw a no-hitter with him in the crowd on Father's Day. I think it was a pretty awesome gift."
11345,That's awesome!
11347,"Yup. That's the thread. You did something that less than 1% of pitchers have ever done. Congratulations dude, best gift ever."
11349,"Dude I don't know about you, but my cat bats a solid .350+ whenever I try to slide something sly by him."
11350,Damn son that's cute as fuck
11351,As an English guy that has never played/hardly seen baseball: What's a no-hitter and why is it so important?
11352,Show-off.
11353,"I know, right? I just had to make it all about me. 

Honestly, I wasn't thinking much about it (knew that I hadn't given up a hit, but was trying to just forget about it) until the next to last inning. Some dude rifled one to left that landed about 2 feet foul. I gave a big sigh and then heard my dad trying to calm me down. That's about when I put the gravity of the moment together.

Throwing strikes and getting people out is tough. It's WAY tougher when you're about to throw up from being so nervous."
11354,"Your a Jackson Pollock painting dude 

edit... Dont know what i was thinking. Totally meant Norman Rockwell."
11355,Good ol' jack the dripper
11356,"Wow, that is amazing."
11357,"That's fucking awesome, dude."
11358,a beer and some silence.
11359,"says someone who is a dad, rather than someone who has a dad"
11361,"Ever since I turned 21 I've given my dad beer for Father's Day and his birthday (it's also in mid-June, grew up with Sunday visitation so I always celebrated them together). He likes things that are different, I have fun picking out micro brews and imports."
11362,"I am surprised this is way down the list. I want a cooked breakfast served to be in bed, then everyone has to GTFO of the house and let me sit in front of the TV watching movies, reading a book, playing games or staring at the wall until it's beer time. Then you can come back in and we can have pizza and watch some Disney together. Then you all go to bed and I watch another movie and blissfully fall asleep.

I might get the breakfast. Then I will have to 'do' something.

Bah. Humbug."
11363,"So I got this idea from a blog, and it actually works better for a birthday, but you could use it for any special occasion.  For my dad's 60th we did this thing called ""60 Years of Memories.""  Basically, we documented 60 separate memories from his life, typed them all up, pasted them on card stock, and put each one in an envelope, labeled 1-60.  Everyone in the immediate family (mom, sister, brother, me) wrote a few each, and then we got the rest from my dad's family and friends.  We also used some pictures from his childhood, so he could tell us the memory.  We then all sat around with my dad as we read through them all.  It was an amazing experience--probably one of the best nights I can remember as a family.  He really loved it, and so did we--it let us all say things we had always wanted to say, but never had a reason to.  You could do something like this--""X Years of Father's Days"", one memory for every year you've been born?

EDIT:  I'm not a father, but I have one."
11364,"My sister planned this for my mom.  She turned 50 so we had a few less cards.  She read though about 10 of them before she asked for a new beer and my sister (the concept was her idea) was the one who cried.

Oh, the memories."
11365,"I hope you'll forgive me for passing on what my dad once told me.He died the day before father's day two years ago, or I would ask him to answer directly.  

I didn't get a lot of time alone with my dad, as mom and my siblings were always there, but we were usually the first ones up in the morning , jokingly fighting over the paper. Once I got a bit older, and no longer lived with my folks , I started a tradition of getting up early, driving to see my Dad and I would take him out to breakfast. We talked about whatever we wanted without mom interrupting or my phone ringing. 

He told me, more than once, that those breakfasts made him feel like he was as needed as my mom, and he used to brag to everyone that his baby was taking him to breakfast. 

I still miss him most in the morning. If you can, find a way to talk with your dad. Ask him about his childhood, the biggest mess he ever made, what he sees of himself in you. Tell him what you love and admire about him. There are so many things I wish I had asked my dad....and I used to ask him a lot. 

My kids don't see their dad. (his choice) we are going to spend the day with a dear friend who missed out on having kids. So..if there's no dad in your lives..maybe borrow one. 

Edit: you're all very kind. I hope those of you missing dads, for whatever reason, get through the advertising blitz with minimal heartache. Than you, anonymous benefactor , for the gold."
11366,How dare you give me the 3am feels.
11367,"I'm sorry! He would have laughed and said,""you're okay. It's too far from your heart to kill you.""

It's pretty damn close sometimes, you know ?"
11368,"My dad doesn't really talk with me or my siblings at all really anymore, but just talking with him and enjoying his hobbies was always a great time. He loved to hike and play video games (from what recall) so whenever I got to do that with him I was so happy. Nothing will ever replace me waking up early when I was probably 8 or 9 so that I could watch him play video games, only to have him pass me the controller and play the game I had wanted for months. I miss him a lot, but my memories of him will always be great. 

Seriously, enjoy your dads hobbies/interests. Not only will he love it, but you'll learn a lot about him and enjoy it a lot yourself."
11369,"I was watching TV with my dad a little while ago and we saw a commercial for this universal wrench that does any sized nut or bolt. It was probably the first time that a commercial said 'innovation' and I agreed with them.

I looked at my dad and he looked back. No words were needed, only a few manly grunts and I knew it would be a good gift."
11370,"My father passed away about 5 years ago. My mother has been hanging on to some of his possessions over the years, instead of giving them to me and my sisters. A couple months ago, my mother asks me if I want his collector beer steins, so I take the lot of them. 

As I'm washing the years of collected dust off of tops of the steins, I open one up and see a piece of paper. I soon realize that it's a picture I drew for my dad when I was young. It stated ""Happy Fathers Day"" in big (ugly) block type font, with several other tiny drawings of things he liked, like cowboy guns, and Stetson hats). 

As a man in his mid 30's, I broke down and wept like a child. I've gone through most of my dad's possessions he left behind, and I haven't found any of the other gifts I gave him throughout the years. Maybe he used them up, and wore them out. Like a shirt or hat or something. But he held of to the one drawing I gave him, for at least 25 years after I gave it to him.

**TLDR:** Make something original. The sentimental factor goes up, exponentially."
11371,"That's amazing. When growing up, you think those trivial drawings done as a kid are just silly, who would think that they'd be meaningful. This really made me think. Very sorry for the loss of your father."
11372,Thanks. [Here's a pic of the drawing I found.](http://i.imgur.com/1uOsNvA.jpg)
11373,"I got to celebrate my very first fathers day last year. My wife put pictures of herself, and our daughter onto a coffee mug for me. I fucking love that coffee mug.

My suggestion in light of this? find something that can fit into his everyday life and remind him of you."
11374,"As a recently divorced dad with his son living in a different state (with a really mean ex-wife), just a drawing, or hell, even a card signed by my four year old would make me cry like a baby.

I miss him so much :("
11376,I wonder if this sort of thing actually started with corporate PR employees but redditors just assumed OP was being silly.
11377,You can't tame the hivemind. Or use it to sell your junk.
11378,"Don't forget the [Harley Davidson^TM branded tool storage solutions.](http://www.craftsman.com/shc/s/dap_10155_12602_DAP_Harley-davidson-tool-storage?i_cntr=1370655254483)  Nothing says Father's day, like our normal storage but with the Harley Davidson brand name written on it."
11379,"I want my kids to sit down and eat a meal with me that they help their mom prepare. Without phones,iPods/iPads, or the TV being on. Just them telling me stories about their day and if they discovered anything magical. We are always a very busy family, and they are growing up so fast, (7 &15) I just don't want to miss anything they are experiencing. I want them to be happy, and I want to be there to see that happiness on their faces."
11380,"The best Father's Day gift I ever received was the year my wife set up a golf foursome with my three sons and I. She faked me out and told me to make sure I had my fishing license with me then delivered me to the golf course where my three boys were waiting. We had a wonderful day. And while a hammock would make a nice gift, your father will appreciate some of your time more than anything. Crap - now I'm crying just thinking about it."
11382,"My Dads bday is right after Father's Day every year, last year was his 60th. His girlfriend asked him what he wanted and all he said was, ""for all my kids to be in the same place so I could see them together."" He lives in San Diego. I'm in Colorado, my bro is in Seattle and my sis is in San Diego too. But not too close to my dad... We all pulled our money together and moved mountains to make it happen, and when he saw us all there at his surprise, my father, someone who has never cried in front of any of us, buckled to the ground in tears. It is legitimately the thought that counts."
11383,"Give me ONE MORNING.  Just *one* that I get to sleep in.  I work nights, so I get the kids up.  My days off? I get the kids up.  LET. ME. SLEEP.

And let me play some games.  

I've suffered your Dora, Diego, Yo Gabba Gabba, Justin Time, Martha Speaks, Sesame Street, Beethoven's Fifth, Stewart Little 1 and 2, that stupid show about crayons that get a magic hat and get to color first, Jake and the Pirates, The Backyardagains, Dinosaur Train, and all the other sugary, gooey, rhetorical question asking shows she watches with her brother.

I want a day where I *don't* hear ""Do *YOU* see the rabid bear about to eat us?  Where is he?""

I want to play Marvel Heroes.  Minecraft.  Attempt my first game of DOTA 2.  LET ME PLAY SOMETHING!!"
11384,"My wife and I are very much partners in our marriage, so the best gift is to be king for a day(or queen on mother's day). I'll get a card or something, but I'm really looking forward to sleeping in a bit, maybe a special lunch, no chores, etc."
11385,"If you really want to get him a meaningful gift, this thread won't help. The best gift you can possibly get someone is going to be unique to that person. My recommendation is to think hard about what he does in his free time and try to shop in that category. For example my dad (before passing away) knew more about computers than me, which is very rare for a parent, so I might have gotten him something having to do with older computers that would give him a feeling of nostalgia."
11386,"So a tie with a couple floppy disks on it? Oh, the memories."
11387,"Forgot to answer the OP's question, as I was too busy bitching about my life like a whiny little shit.

Don't buy him anything. Make him something. It sounds cliche, but do it. Dads are crazy proud of that stuff. I have a pen holder my son made for me (obviously with a lot of help as he was 4) and someone asked me what that retarded thing was for.

No joke, I broke his god damned nose. That pen holder is possibly the best present I've ever received from anyone. Completely useless, pink (my son's favorite color) and covered in glitter (he likes shiny things). But he made that shit for ME. It's MY fucking pen holder and nobody will talk shit on it without immediately coming to terms with how violent I can get.

So yeah, make him something or cook him something, but do it to the BEST of your ability. Not some cheesy shit. If you absolutely suck at wood working but know he likes wooden things, make him a small box that is sanded really well. Even if it's constructed like shit, and isn't straight, as long as you put your effort into it, he'll like it. It's a reflection of the effort he put into you.

Tl;Dr I LOVE my fucking pen holder."
11388,">and someone asked me what that retarded thing was for.

""Well, as far as I can tell, nothing; but right now it's asking me a really stupid question."""
11389,"You seem like a good dad. A little intense, but only because you love your kid a lot. That made me happy. I'm gonna go hug my dad."
11390,"Breaking someone's nose...

Maybe you could have explained how much it meant to you and they would have apologized as they realized what they said."
11391,Breaking a nose sounded manly. Don't ruin this.
11392,One fucking day to watch arrested development in peace without having to sit through real housewives or fucking dora.
11395,My mom got bunch of flowers. My dad a wheel barrow. Wonder who will get more use out of their gift.
11396,"I want an official Red Ryder, carbine action, 200 shot range model air rifle!"
11397,You'll shoot your eye out!
11398,"A hug.  

Not So Ninja edit: not one dad cares about 'presents', all we want is a 'gift', and there's a big difference !  
We just want what we want every day: a hug, a kiss, an 'I love you'.  

To me fathers day has no meaning, because it'd be sad if your kid would only think about you on that one day. Luckily, no kid ever does that, they love you all year around, so just give us a hug, a kiss, an 'I love you'.  

And they almost all do.  
That's what being a dad and your child is about.  

And, Michelle, if you read this: I love you too."
11399,"Exactly. Except Michelle, I don't know her."
11400,I know a Michelle. But I don't like her anymore.
11401,You and me both
11402,"If only my dad used reddit. My name is Michelle, and my daddy is my world."
11403,thank god i'm black
11404,"Last year, I got my dad a copy of the ship manifest that listed his father's name (and signature) from when he came to America in 1916. He loved it! It's a pretty meaningful, inexpensive gift. My grandfather came through Ellis Island which has a database you can search [here](http://www.ellisisland.org/search/passSearch.asp)."
11405,"My dad likes edible things, so this year I bought him an exquisite chocolate truffle collection for his birthday/fathers day since it lands around the same day. He lives too far to visit and I don't have enough funds for a plane ticket. As a college student myself I'm pretty broke. He'll love it though."
11406,I received a personalized mug with my favorite sports team logo on it and engraving about how loved I am as a dad and stuff. Its heartwarming and useful. I use it most days and love it.
11407,I'm 33 and I would love to get a certificate to a barber for a real shave since I've never been to one.
11408,"You know what I want?  Mow the lawn without me having to remind you.  Do well in school.  Be motivated enough about your future that you *do* something other than waste your life on Reddit.  Damn it get passionate about something and master it.  Learn that accomplishment feels much better than something ""fun"".  Their success is best gift I can ever receive and that is not something that can be purchased to make *them* feel better that they got me some BS material possession.

Damn, you'd think my kids weren't doing well but, so far, I've gotten what I've wanted every year (minus the lawn mowing).

edit: some pronoun agreement stuff.  I was not passionate about grammar."
11410,"That's why I always make my own cards. Whether it contains humor or feels, it came from the heart, not from a shelf.

And it's unique!"
11411,"It's kind of sad that you have to make yourself cards. Sorry bro.

""Hope I have a very special day. I mean so much to me. Love, me."""
11412,"I decided to get my Fiance a tent and camping gear and our daughter wants to make him a bookmark so hopefully I can get a craft kit and make a nice one.

I hope this is a good idea :)

Edit: I will call my Dad up and tell him how much I love him for everything he's taught me and how proud I am to be his daughter."
11413,I live 600 miles from home these days and only get to see my folks about once every few months.  My dad's response is just to have me home.
11414,"Well, my family has always played cribbage (both sides) and I learned when I was like 6. Anyway my parents are divorced and my dad moved out of town so I'd see him a few times a year at most. but every time I'd see him we'd play cribbage. So a year or two ago I made him a cribbage board. It was pretty special I got this gorgeous redwood (paduca) and chiseled out a place for cards and pegs when you opened it. I made it all myself and it took nearly 2 weeks but he loved it. It was tied to something we both loved and did together as well as handcrafted. He has said more than once it is one of his most prized possessions."
11415,"- A quality wallet, belt, briefcase, or really anything from [Saddleback Leather](http://www.saddlebackleather.com/). All of this stuff lasts literally a lifetime.

- A quality safety razor or a new badger hair shaving brush. 

- A new pair of Red Wing boots. These also last a lifetime. Dark brown goes with everything. 

- A new knife. Gerber blades are good quality. If he's an outdoors kind of guy get him a fixed-blade survival knife. If not then get him a folding knife. Don't get a small knife, and don't get a ridiculous knife.

- A leather bound journal. Find one that has acid-free paper. Get a nice pen with it too.

- An engraved flask, or an engraved zippo lighter. Get the bourbon or cigar to go with it.

- Don't get him a card. Write a hand-written note instead. It can be short and to the point, but make it genuine. Trifold it."
11416,"I'm not a father yet, but there is only one gift I got my dad for Father's Day that he still owns and uses. My dad has done maintenance and carpentry my whole life, so I got him a plain grey and black toolbox when I was around 10 years old. Fast forward to 2005 and Hurricane Katrina floods my entire home town. The only thing my dad was interested in salvaging was that toolbox. He found it, cleaned it out, and still uses it to this very day. I got him a good gift."
11417,"Over a year ago, I started dating a fantastic woman, who has a fantastic daughter that I care about more than I ever thought I could care about somebody else's kid. She announced to her mother about a month ago that she wants to get me a father's day present. I don't care what it is, it will be amazing regardless."
11418,My radio told me to get him the giant green egg.
49555,What?
11420,It's a grill.
11421,I graduate with my Masters on the day before Fathers day...
11422,Well hello Mr. Fancypants.
11423,FANCYPANTS AS A FATHER'S DAY PRESENT! GENIUS!
11424,"Last year, my son's daycare made a foam board picture of him with his handprints on the back. Being a newborn, we have tons of pictures of him, but this one is special to me for reasons that are tough to explain. When I changed jobs, it was the last thing I took off of my old desk and the first thing I put up at my new one."
11425,"I want my dad to focus on his damn health. I want the crazy go anywhere guy. Unless I smoked a ton and wanted to watch Law and Order repeatedly,we wouldn't hang out. It is horrible. I want my dad back. Not for me and my selfish ideations. For my mom. She's hurting without him. Sure he there physically but her husband isn't. Her lover is gone. I want them to be the couple that I was to model my marriage after. I want my dad to want another year of life. It's too much to ask but damnit, I want my father, my daddy back. F.M.L."
11427,"I usually just clean up my dads truck for him since he is always talking about how he wants to really detail his truck. Maybe bring him some dairy queen and hang with him all day. If its nice, go hits some baseballs."
11428,"Growing up, I never really knew why, but all my father wanted on Father's Day was to watch the US Open. It always fell on Father's Day.... and my dad just wanted to watch the finish instead we always dragged him out to lunch and what not...

it wasn't until I was older and loved watching golf and realized that the US Open is one of the best of the majors because they consistently make it difficult for the professionals... so now, all I want to do on Father's Day is watch the US Open."
11429,Actually most don't want anything but to see you guys try and succeed in life. An occasional hug and I love you dad from my boys goes a long way for me...
11430,I actually want a new tie but my family won't buy one because it's too cliche.
11431,"My dad is an intimidating man. He is covered in tattoos, and sports a handlebar mustache and a mullet. Lat year I bought a wolverine action figure. I used for paint and tape to build his facial hair and fill out the mullet. After I drew on some tattoos, it was a pretty close resemblance. He still has it in his workspace.


The year before that I got him 20 lighters (because I have a tendency to pocket his). I spelled out ""I <3 U "" in lighters and then hid the rest in unlikely places like in the toliet paper roll and in the coffee pot."
11432,For my kids to stop growing up so fast.
11433,"Na.

This is going to get dark really quick.

I remind my wife that there are people who wish they could see their kids grow so fast, and be moving ahead. That them growing and changing means im doing my job, and that they are able to.

Our countries lockdown sucks, but my kids can go to school and learn now as we struggle to get ahead in our careers.

Im getting wrinkles, and waking up with new pains every day. But spending your life together means growing old together. Your kids growing up means things are right."
11434,"I agree there just so damn awesome atm, 11, 9, 6 and 2. I’m 45."
11435,"8, 4, and 7 months who thinks its play time."
11436,Awesome! Good ages for family times.
11437,"Just a reminder to spend much, much time with them."
11438,"A simple personal text or message would suffice. This will be year 3 spending holidays by myself with no delicious food, conversations or gifts. I'd be happy just getting a conversation as my gift :-)"
11439,I’m so sorry to hear that I hope you can still have a happy holiday
11440,Thank you kind human
11441,If you DM me you number I’ll send you a text on Christmas
11442,Ditto. Amen to that
11443,I will too!
11444,"Thank you guys for your kind words, helped me start my day off pretty awesome :-)"
11445,"I would too!  Anyone want that, just DM me your number and I'll text you on Christmas and maybe send you some pics of the fam."
11446,"You know, there are pen pal type groups you could join. I know its not the same as from your family, but its something you might wanna do: send and receive some Christmas mail."
11447,Just started looking at some thank you.
11448,"Sweet Jesus, I just wanna give you a hug, man."
11449,Hugs are definitely underrated!
11451,Sorry! 😬 I promise it wasn't my intention and I'm quite optimistic :-)
11452,A Schitts Creek t-shirt and a 20v Porter cable grinder
11453,healthcare
11454,"More socks and underwear, I've almost made it through last years supply!"
11455,I knew I was officially on my way to being old when I didn't get any last year and was super disappointed
11456,"My oldest saw me doing a bit of backyard engineering on the lower air dam of my car and asked why I don't ask for a new one for Christmas. I told him I wanted socks. He said he always gets me socks. And I told him that's because I always want socks, so he's doing it right.

BTW: Both my boys say they want socks for Christmas...so they must have turned out OK."
11457,"Dad's what?  
Dad's inner conscience?  
Dad's sense of responsibility?"
11458,Damn I didn't think dads gonna require gifts for each of this lol
11459,"Honestly, the rules of written English are confusing as fuck and my German autocorrect makes it even worse.

How about we all just give our best and point out mistakes in a friendly and helpful way, so that others are more likely to learn?"
11460,"Oh, was I supposed to prepare a picnic lunch and sing a little song?  I didn't think I was 'unfriendly' or 'unhelpful' the first time.  

Americans, can't speak for Germans, fuck up apostrophes CONSTANTLY these days.  Almost everyone under 30 puts an apostrophe on a plural s, where there should be none.  It is a stupid basic mistake that contributes to making us look like a country of idiots.  As an English teacher, rather than killing them, I simply point it out.

So maybe you should avoid butting in (or in German, being a Besserwisser) in a situation that doesn't involve you (or Germans).  You are not the OP."
11461,"I asked my dad and this is the list he gave me: 

1. Reading glasses, constantly breaking them. 
2. Good work boots
3. Belt
4. Sweater
5. Seahawks sweater
6. Seahawks hat
7. Bluetooth plug so he can listen to music in his car
8. New tires for his car"
11462,"I want a Seahawks sweater and hat too, Go Hawks!!"
11463,"I'd like to get my husband a pair of Red Wings. Alas, he has monstrous feet that are wide with the biggest big toe I've ever seen on a person. So I can't surprise him. We'll have to go to a store so he can get the right fit, and get the style he wants. Mr. Fix-it has saved us literally tens of thousands of dollars throughout the years. He deserves comfy feets."
11464,"If you husband has never had custom boot you can probably get buy doing this game/keepsake even better if you have kids. Make a foot memories gift for Grandparents. Photocopy his foot and a custom boot can be made close to those dimensions. If he wears half mid calf they will probably want other dimensions, but an idea to at least get you started."
11465,Excellent idea!!! Thank you!
11466,I wouldn't have ever thought of that! Great idea! Thank you!
11467,I could use a new set of drill bits ngl
11468,How about a few 10mm sockets and wrenches?
11469,"Lmfao id ask for them if I didn't have a stockpile of them (I bought a 10pack at a flea market, all new or close enough to render the difference irrelevant)"
11470,Cobalt bits
11471,"I am going to answer for my dad, he wants a new grill it is easy to notice he already has 4 I think"
11472,Beer and silence
11473,Family being together. No greater gift for me.
11474,"Hmmm I think.......

I want 
#Bunch of Chocolates!"
11475,This is so cute i
11476,"One bottle of Laphroaig Scotch. I guess because of some  Scottish Isles magic, it always shapeshifts into a sweater in Santa's sleigh."
11477,Ice fishing rod and reel.
11478,I've recently been wanting to get into solo board games and lock picking... So that stuff would be cool.
11479,"Oh yeah, I went through a lock picking phase.  It passed, but I still love watching [TheLockpickingLawyer](https://youtu.be/k9VewWKfH_0)."
11480,He just launched his own web store of picking supplies and it has me seriously tempted. www.covertinstruments.com
11481,"Security guard here. I’ve cracked two locks at work that the client desperately needed into thanks to a basic picking set and his videos. 

It’s shocking to me that major corps routinely lose keys with zero backups."
11482,A pair of bib overalls so I don’t have to hear about my ass crack showing when I’m doing chores around the house.
11483,"I just want my kids to have gifts and know they are loved, I don't need anything"
11484,I like getting dad holiday shirts. I have one for every Father's Day since my first kid.
11485,"Peace on Earth and Goodwill towards Men. 

Oh and an AR 15."
11486,Quest 2
11487,Ya!
11488,A reverse pepper grinder.
11489,"You want a brass magnet and some blinker fluid, too?"
11490,"Is this a real thing, or are you messing with me?"
11491,Just messing with you. Lol. Look it up please.
30009,Username checks out
11493,A Slow Riot for New Zero Kanada sweater is all I want
11494,A fresh pair of sneakers would be nice
11495,Bamboo back scratcher.
11496,They have telescoping metal ones at Walmart for $1.
11497,I want you to be winning son
11498,"Nothing. I have everything I need. I’ve got a beautiful, sweet wife who’s given me the three most precious children a man could ever want. What more do I need!"
11499,A pizza stone
11500,"A PS5. Fuck your kids, they don't know the difference."
11501,Sloppy top all day and a big feast
11502,A threesome
11503,Granted. 2 guys are coming over to your house tonight. Merry Christmas.
11504,Hell yeah
11505,awwws what a cute post.
11506,"Videogames, neat nerdy pins, gift cards, fantasy novels, gift cards to Amazon or Nintendo...  Whiskey..."
11507,"Mmm, whiskey. Adults should be required to get other adults an alcoholic gift for Christmas."
11508,My dad asked for a turtleneck 🤷🏼‍♀️
11509,tackleneck!
11510,Hugs
11512,"As a dude half the age of my dad, this is also what I want."
11513,"Pin spots in the rumpus room, a day with just me and the bottle."
11514,Peace and liquor
11515,"Ryzen 5950x, cyberpunk 2077, and some time to assemble the PC and play the damn game."
11516,"A longsword. I have a collection of other weapons, some fantasy based, but mostly katanas. I’ve not been able to find a more historically based longsword I’m actually happy with. It’s only really gaudy looking “Templar” sword and stuff. Of course, I haven’t really looked very hard yet."
11517,I’d like some new trainers or a gadget
11518,2 days quiet
11519,Red onesie with a ass flap
11520,a blonde twink :D
11521,For my family to remain healthy and cyberpunk 2077.
11522,I tell my wife the same thing every year. I don't want anything. Give the kids gifts and let them enjoy the day.
11523,A PS5 or a set of congas.
11524,Kids not fighting and a simple Merry Christmas I love you.
11525,Blowjob
11526,For Muscular Dystrophy to be cured and for the cure to restore all muscle function.
11527,"If it is for dad. I recommend sending a watch. Believe me, men are interested in watches. This is a gift that can't go wrong. The Megalith men's watch is the best choice for dad. There are mechanical watches, digital watches and so on. The watches are very affordable and of good quality. Is a very cost-effective watch brand. All watches have 3ATM waterproof daily life, which means it can withstand the occasional splash of water or the rain, but refrain from wering it when showering or if you plan on swimming. The design is simple and classic, and the appearance is stylish and versatile. Very suitable for wearing in daily life.

This is the best Christmas gift！"
11528,"*dadz

it dadz"
11529,"As a child my sister and i started buying him walking sticks every year for Father's day. Don't know why. I think maybe he wanted one, and we just kept buying them, every Father's day for about 32 years (I was 4 when we started doing it). Even in to adulthood my sister and I would confer on what one to buy and go in half and half for it, even though we had to order online. After she died, I kept it going. The first one was just a classic Shillelagh that our dog gnarled the end of, but there were ones with knifes hidden in them, flasks, sundials, compasses, and just ones that were pretty. He kept all of them, even had a custom stand built for them. After he died his girlfriend told me that when they would go for walks, as they did frequently, he would always pick one, and if ever they went on trips he had to have one with him just in case they might go for a walk.

They are mine now, and I think my wife intends on introducing the tradition to my newborn daughter when she is old enough..."
11530,"Dude, before you die you should make a catalogue that has as much information as you can remember about them. That'll help solidify it as a tradition."
11531,Also create a relational database so that future AI can do this with their children.
11532,Keep this going as a tradition. It would be the coolest thing.
11533,"Why is my house so dusty all of a sudden? I mean, that must be it. Or allergies..."
11534,It's the Ninjas cutting onions.
11535,wow usually stories on reddit don't get me like that
11537,Your sister needs to take up leatherworking.
11538,WTB cow hides.
11539,I get free elk and deer hides from neighbors who hunt. It's worth looking into.
11540,We all know green dragon hide is where it's at
11541,"I made a duct tape wallet for myself not very long ago, actually.    
They are pretty good if you loose or break one and need a quick replacement."
11542,"Except it's almost guaranteed that purchasing a new one is cheaper, at least one of those velcro ones."
11543,"I got my dad a build kit for a 3D printer that I saw on Kickstarter. 

We now have a room full of 3D printers where we used to have a dining room. It's definitely become a huge hobby for him :)"
11544,is he 3D-printing 3D-printers?
11545,That is the first thing you print is extra parts.
11546,Self servicing!
11547,"Wow, this made me chuckle :)"
11548,"It's actually true. There are some projects for 3D printers which are made in a way that you can print a large portion of the parts yourself. 

Of course the expensive parts are going to be circuits and electronics and for a high-end printer you'd want aluminium anyway, but it's still a good idea."
11549,"Every year for Father's Day, my mom would get a t-shirt made with a picture of my sister and me for him. My mom stopped doing it when we were in high school, but my dad still has all of the shirts we ever gave him. He still wears them sometimes, too. It's kind of funny, since my sister and I are both now in our 20s, but to be honest, I find it very touching that he's kept them all these years. I love my dad."
11550,"You and your sister should totally make him a new one this year.  That would be hilarious, and he would probably love it."
11551,Love this idea!
11552,Bonus points if you can match up your outfits to one of the original ones!
11553,That would be hilarious! Hopefully we can arrange it next time we're together.
11554,"In the future when some of those shirts start to get too worn, think about making a tshirt quilt for him. It will give your gifts a new life with continued use :)"
11555,"My dad is a master of dad jokes and last year I found him the perfect gift, a [World's Okayest Dad coffee mug](http://www.worlds-okayest.com/product/world-s-okayest-dad-mug). He took it to work and uses it every day."
11556,"Im gonna buy a worlds best dad mug and give it to my dad, then buy one of these and swap it out after a week or so lol"
11557,Hahaha I wish I had thought of that.
11559,Lol sounds about right
11560,"I should get my dad a ""world's best mom"" mug"
11561,"Twenty five years ago when I was in fifth grade I got my dad a Sandra Boynton coffee mug at my school book fair. It has a polar bear wearing glasses on it and says ""DAD: One very cool guy.""  Corny, but cute. He used it every weekend from then on for his Sunday coffee.  

Dad passed away 15 years ago last month, but the mug is still around and my mom still uses it now when she's missing him. 

Best $5 I ever spent."
11562,"I got my grandpa one of those ""[college name] Grandpa"" mugs, and when he passed away, I got it back. It was so well used the colors of the design were faded where he held it. I think of him every time I use it (and try to hold it the way he did). Miss him so."
11563,"I bought my dad a medium sized storage box for stuff. The top had his favorite sports team and was signed by some of the players. It was mostly a gift for him because he liked football. I got it handcrafted and the storage was just for important papers and stuff since it came with a good strong lock. 

When my dad passed away, he wrote his will he wanted to be cremated and dumped into the lock box. 

So....He's still technically using it to this day. 7 years later."
11564,"Im not crying, my emotions are leaking"
11565,stop cutting onions :(
11566,"My dad was adopted and I was the first person he ever met he was blood related to which he would remind me of all the time. I was even born the day before Father's day. One year I made a heart out of that foam paper and cut it in half. He used to commute when I was younger and I gave him one half and I kept the other. He kept it in his wallet and took it all over the world with him until he died two years ago. If anyone asked him, he said his number 1 daughter gave him his heart (I'm also his only daughter.)
Another year I found a tiiiiiny pocket sized version of his favorite book as a kid- The Pokey Little Puppy. He read it to me almost every night as his mom did for him. I gave it to him so when he was away he could read it and not get homesick. He also took it with him everywhere he went. I really miss him."
11567,I'm sorry for your loss. The bond you guys had sounds amazing
11568,"A combination nose hair/ear hair trimmer.

Mom says it's the best present he ever received!"
11569,That gift was really for your mom.
11570,"Mom was always a looker, but that nose hair, sheesh. Now? Total babe again."
11571,Jesus Sarah stop roasting OP's mom
11572,I got that for my dad last year. My mom loves using it on my dad. He puts up with it.
11573,"My dad's father died in June, 7 years ago. For Father's Day that year, I asked an artistic friend to sketch a picture from an old photo. It's a charcoal drawing of my grandfather holding a 2-year-old me on our family's favorite beach, and it's been prominently displayed in the house ever since."
11574,Love this.
11575,"Not sure if this counts because he doesn't really ""use"" it like a tool, but I'm in a ""father's day"" mood (I just went looking a few hours ago) and have a really cute story about my dad's favorite father's day gift

Context: I was always a... strange kid about money and presents. Like, I used to get *seriously* depressed that I couldn't buy my parents ""real"" gifts- I'd get stressed out and nearly cry over it (I'm still like that a bit tbh, couldn't tell ya why). This was when I was in elementary school.

So, one summer break when I was about 10yo, I was going to day camp. Now, father's day had already passed, and I was still reeling from my residual ""not getting him a ""real"" gift"" emotions (despite repeated assurances that it was perfectly alright). One day, one of the camp activities was woodburning. I decided that I ""could get dad a real present!"". Since he's a huge Denver Broncos fan, I found the right stencil to make him a horse. 

That thing *sucked ass*. The burning was uneven, and the lines were so thick that you could barely tell what it was. I tried to sign my name at the bottom, and it was so light that you couldn't read the last half. Nonetheless, I was proud of my first ""real gift"" (not a card), gave it to him after camp, and was content.

Fast forward a few years: it's father's day and I'm playing around with some ideas, maybe some Broncos merch... How about something for his car! I go to ask: ""Nope, I've already got something. Remember the Bronco you made me?"" I laugh about that crap thing, and ask if he would like some *real* merch. ""It *is* real"". 

To this day, the man won't budge. My mom and I have both bought him all sorts of team-related items, from all his favorite teams. But he won't accept anything for his car.

A few months ago he got a new car, and brought all his junk inside. He left it right on the counter- I thought he was finally gonna throw it out. Nope- the second he brought the new car home, he walked in, grabbed that horrible excuse for a horse, and proudly but it back where it had been in the old car.

TL;DR: My dad refuses to put any other team merch in his car- apperently, I've got it covered."
11576,">  I laugh about that crap thing, and ask if he would like some real merch. ""It *is* real"".

I'm crying, so *thanks!*."
11577,TBH I almost cried too at the time!
11578,We need a picture of this thing asap!
11579,What does it look like?
11580,Aaaand I'm crying. Thanks for sharing!
11581,"No! This is the second time a comment about my dad has made someone cry! But if you liked it, I suppose it's alright 😊"
11582,"That's a real fathers pride, cause you hand made it and thought of what he liked he will always carry it with him as it will remind him that he did a good job in raising you.  To you it might be ugly and worthless but to him it is more precious than gold and not something you would understand until your own child gives you something handmade without help and being told too."
11583,A goofy ass statue that holds your glasses. You set them on the statues nose and it completes a face.
11584,I have one. Scared the shit out of me the first time i woke up to them.
11585,"My kids got me that last year. I put my glasses on it every night. 

We just got back from a short camping trip and I was mildly bummed each night trying to put my glasses somewhere where they wouldn't get broken. Never really cared before they gave me that nose."
11586,I want to see this.
11587,Picture?
11588,http://www.drunkmall.com/wooden-statue-eyeglasses-holder/
11589,I imagined an ass statue and I was very confused. Thanks for the link!
11590,I imagined a statue of Goofy's ass.
11591,"My grandmother has one of these, it's a horse and it sits on her bathroom counter. First time I saw it I had to pause for a real moment."
11592,A good automatic watch with the sapphire crystal face and gold case and band.  Matches his wedding ring and is durable enough to stand up to his work environment and hobbies.
11593,Well look at you Mr. Lovesyerdad.
11594,Yeeeaaah. He's aight sometimes.
11595,Read this in a lamb's voice
11596,I got mine a pocket knife 5 or 6 years ago. He's carried it daily sincethen.
11597,"> sincethen.

i read this as sinceth and it made me laugh"
11598,Daffy duck level pronunciation we've got thereth
11599,Anything r/EDC related is always a good way to go when giving a gift.
11600,"He's always carried a folder as far back as I can remember, but it was always some el cheapo gas station Buck knockoff. So I bought him an actual Buck in S30V."
11601,"For a year everyone I know got a Victorinox Swiss Army knife as a present for whatever celebration I would be obligated to give a gift. For Fathers Day I gave one to my dad. They all still carry it, including my father.

edit: clarity."
11602,"I get my dad 4 dark chocolate bars every year, two for his birthday, and two for father's day(they're close together). He's an extremely healthy guy, and has a square whenever he's feeling a bit tired. His supply lasts him until the next year. It's not one thing, but a similar idea."
11603,"My daughter has two dads and for shits and giggles she gave me Worlds Best Mom mug for fathers day.

I use it every morning."
11604,Haha rub it in their faces i like it
11605,Guys... should we tell 'em?
11606,"There is this salsa (more like some sort of taco sauce) called Lizano that is made in Costa Rica. Years ago, some friends bought a bottle for our family while they were there, and we all became addicted to the stuff. We found it in our local grocery store and used it on almost everything. 

Eventually, it stopped being sold in the United States. However, a couple years ago, I found it on Amazon and bought a couple large bottles for my Dad. I swear I had never seen him quite so excited about a present in years. Now, he keeps a full stock available in the house."
11607,How thoughtful. My dad would probably be scared to use it and it would go bad lol. I love him
11608,"I loved cross-stitching as a kid. I cross-stitched the word ""Dad"" along with flowers surrounding it and then I made a small, pink pillow out of it. He still keeps the pillow as decoration in his car."
11609,:')
39337,Same.
11611,"A t-shirt that says ""Bank of Dad"". Wears it constantly."
11612,I might get my dad something like this. He helped me in a tight financial spot a few weeks ago.
11613,"My father left when I was one, so he's had that guilt now for 26 years."
11614,Probably re-gifted it by now.
11615,"my dad left when i was 8 mo, found him on FB, can confirm regifting"
11616,"I don't ""like"" that he did this to you, but boy, this is a helluva great response."
11617,"I painted a lawnmower, put it in a clear frame, then decorated the frame with puff paint that said ""Time to mow.""

It's been on his dresser for 16 years."
11618,"I had to read that at least three times.  I kept picturing a painted, full-sized lawnmower sitting on a dresser and wondering...how."
11619,Ha. I painted a *picture* of a lawnmower.
11620,"I'm such a dummy, I also was picturing a full sized lawnmower. I have no idea why. I have 19 years worth of knowledge and my brain came up with the mental image of a big ol push lawnmower proudly displayed on your dad's dresser."
11621,"A water carbonation machine. He'd waste loads of money buying carbonated water at the grocer's, so he's been very happy being able to carbonate tap water himself. I bought it for him over a decade ago, and it's so well-used it's down to bare plastic, but it's still going strong."
11622,"I was always upset that I didn't have money to buy gifts. When I was around 8 or 9, I took a piece of scrap wood and wrote ""World's Greatest Dad"" and 
""#1 Guy!"" and drew pictures of a globe (for the world) and an airplane (because he likes airplanes) and colored them in with markers.

That hideous thing has been in a prominent place on a wall in my parent's house since the day I gave it to him (35 years). I have asked him several times when he's going to put that ugly thing away. ""Never."""
11623,My grandpa still uses the pocket watch I gave him one year.  He has Alzheimer's and has no Idea who I am anymore.
11624,Yeah alzheimers is terrible hope yall are doing ok
11625,I'm sorry. It's such a tough disease.
11626,I bought my dad a beef jerky subscription last year. He still receives monthly packages so I think my answer applies.
11627,That's actually a thing?
11628,I... I thought it was only a dream!
11629,"Yes, please share."
11630,"I buy my dad replacements for things that he always uses, but that are really outdated and/or malfunctioning. For instance, I bought him some nice new binoculars that you don't have to focus, and his mind was blown."
11631,How do you not have to focus them? Never saw those those before.
11632,"The most common approach is to just set them to a fixed hyperfocal distance so your own eyes do the actual focusing work, which would make them tolerable to use at medium to long distances for someone with decent eyes.  
  
I've also seen binoculars with a digital rangefinder, but I don't think those are very common among civilians."
11633,"Kind of silly and I doubt it'll be read because I'm so late commenting. When I was about err- lets say nine I made my dad this big card from yellow posterboard. It was the foam kind and I drew this big smiley face on it and wrote in HUGE letters ""Happy Father's Day"" but wait it gets better, well at least for you. I misspelled Father as Farther. I spelled Happy Farthers Day and he didn't have the heart to tell me. So he just put the year and stored it in the closet. Every year I pull it out and we sign the year. I didn't even catch it until I was about twelve. So it's sweet, but I still see that spelling mistake every 'farther's' day"
11634,Fuck you for making me panic for five seconds while I googled how close Father's Day is
11635,Echo this. I thought I had missed it. Whew!
11636,Not a goddamn thing. He's impossible to shop for same as I am.
11637,Buy him some Beef Jerky. Dad's love beef jerky.
11638,"Can confirm am dad,  impossible to shop for, love beef jerky."
11639,Proven by Aku.
11640,"I made him a list of his most common phrases in Spanish so he can communicate the way in his own idiosyncratic way with the maid.  For example, as a former infantryman he would always say ""The world is my latrine"" (Todo el mundo es mi baño.)"
11641,"And the maid goes, ""I know, I have to clean it up""."
11642,My dad shares a lot of the same hobbies as Hank Hill so I bought him a BBQ a few years ago. This year I'm thinking about getting him something for the lawn.
11643,Get him one of those push carts that lets you fertilize or seed your grass. A couple years ago I caught my dad doing it by hand and rented him one and he loved it.
11644,I don't need your nancy-pancy push cart! I killed 50 men!
11645,"What if someone wants their steak Well Done? We'll ask them politely, yet firmly to leave."
11646,Especially if they also ask for ketchup.
11647,A BBQ as in a grill or as in a smoker? AFAIK Hank Hill only had a grill.
11648,Has to be Sweet Lady Propane.
11649,my dad wears the Liverpool hat I got him a few years ago pretty much every time he leaves the house.
11650,I hope that hat keeps the sun out.
11651,Lmao this is so good
11652,I wouldn't say he uses them all the time but one father's day my Dad was stuck in the hospital getting one of his hernias removed. I was like maybe 9 and I thought he was going to die for some reason. We didn't have a lot of money at the time so i stole some rubber bands from the dollar store and made my dad some rubber band balls.i don't think he knows this but In the middle of the balls I put a piece of paper that listed all the reasons I loved him and how he was the greatest dad. I gave him about 5 of the each varying in different sizes. he has them on his desk at home and sometimes I'll see him just messing around with them when he's bored.
11653,"So many sad gifts on here, I'm glad I read down to yours. Made me smile"
