idx,text
39669,I really enjoy [The Curious Cases of Rutherford and Fry](https://www.bbc.co.uk/programmes/b07dx75g/episodes/player)
39670,Big Picture Science should be on that list
39671,"I'm really digging Brave New Planet right now.  Dr. Eric Lander explores the impact of science, technology and engineering on society.  Excellent food for thought!"
39672,Yes! Gastropod is absolutely my FAVORITE!!!!!!!!!!!!! (I'm not sure I've conveyed my excitement enough so: !!!)
39673,Science Friday!!
39674,Clear and Vivid with Alan Alda is great!
39675,"Thank you
I'll have to check this out.

Saved!

Thx again"
39676,You're welcome!
39677,"Quirks and Quarks. 

Canadian weekly radio show interviews scientists and PhD candidates on the latest discoveries at an accessible level. It’s been on the air for DECADES. Tons of great content."
39678,No Stupid Questions!
39679,"My favorite is Mendelspod. Highly relevant topics and focus on the “ up and comers” in bio-research 

https://mendelspod.com/podcasts/new-way-phenotype-life-chris-mason-talks-spatial-biology-his-new-book/"
39680,Really good so far thanks!
39681,TWIV (this week in virology)
39682,Also This Week in Evolution
39683,also TWIM
39684,Talking biotech by Kevin Folta
39685,Two Scientists Walk Into a Bar!
39686,"Just dropping this here, its a friend's podcast and I am pretty sure you will enjoy it :)

https://open.spotify.com/show/7KlVTCV97pdFzQ7P9AgqJA"
39687,Natural Prodcast
39688,I’m gonna listen to this!
39689,"Thank you so much for this! I'm doing research this coming semester on the effects of Gossypol on the catalytic inhibition of topo-II and the potential role it may play in tumor suppression as a topo-II inhibitor (it's my first bit of research as an undergrad so I have no idea what I'm getting into, I'm excited though) so this is right up my alley! I've got a long drive ahead of me in a couple days- I'll add a few episodes to my playlist."
39690,"It's so interesting how many mechanisms of actual, physical DNA interaction interfere with chemotherapeutics. The amount of DNA changes in cancers like these is almost impossible to control, but research like this gives us one of the best tools we can hope to start with. Very cool!"
39691,The name of the podcast is genius.
39692,Instant subscribe! Do you have an episode that discusses your research with lymphoma specifically?
39694,"It certainly opens a lot of doors! CRISPR makes changes to existing DNA but sadly can't introduce full, fresh genes. It can however fix small mutations. However, it is still incredibly hard to control. Even in cell lines that we've tried this exact process in lab for, it took over 1000 tries to get one cell with both DNA strands changed :( People don't want to release it in humans because of the lack of control and because the CRISPR could go and hit other areas of DNA and makes things work. Even worse, we still can't target it to the right cells with 100% accuracy yet, so the CRISPR could go accidentally wreak havoc on the wrong cells. 

&#x200B;

We did try inserting tumor suppressors about a decade ago and called it Gene Therapy. We used plasmids, viruses, and other delivery mechanisms, but we failed to control it, and the process harmed a lot of patients. I think that with more research and better control, we'll eventually be able to re-introduce tumor suppressor genes. Some epigenetic inhibitors can by causing the ON/OFF switch that silences a tumor suppressor to go away, thus releasing the gene to help against the cancer. 

&#x200B;

Sorry for the massive answer, but as an undergraduate I always wanted to pursue gene therapy. I was too late by a decade unfortunately, but hopefully we keep getting better at it. Thank you for the listen and feedback!"
39695,"I started by your podcast on domestication, a topic I know well, and it was a really cool introduction to the importance of tameness in domestication.

But I wanted to say, the concept of ""wolf pack"" is irrelevant. Wolves don't gather together, they live in family units, two adults with several litters until the subadults leave."
39696,"Thank you for the help! As much as I enjoy Ecology/Evolution and the subsequent relationships, it's definitely something I need to learn more about. Applying these concepts to cancer therapy is slowing but surely starting to take hold."
39697,Ecology and Evolution are really important in the understanding of cancer and their development. I am glad you are interested in !:)
39698,This is cool! Thanks
39699,Thank you very much for this! Saved for listening later.
39700,"Just started watching this. It's amazing, thank you."
39701,"Awesome, it sounds like a great listen in lab! I work in a lab that does cancer research using drosophila as a model organism as an undergraduate intern."
39702,Thank you. Reading paper is always daunting to me
39703,Great initiative! :)
39704,"Is it weird that each month that passes for me clean of cancer just gets me more and more excited that we’re getting closer and closer to finding subtle cures and better treatments here and there for the off chance I develop it at some point in my life? 

I’m 21, have never had any mental issues of any kind whatsoever, except I’ve had horrible health anxiety for the past couple years. Apparently I pulled a muscle clearing a bunch of brush for a neighbor over the winter and have had slight pain in the lower right oblique and I always have random uncomfortable moments when resting or sitting and my first thought is always cancer.  Doctor keeps telling me over and over that it’s a strained muscle and that it can often times take a long ass time to heal but I can never shake that fear. And this is only one example. I have random things all over me that just spark anxiety and I can’t stop it."
39705,It would be really cool if you could discuss the alleged connection between lymphoma and glyphosate. (I haven’t listened yet but intend to!)
39706,"Yes I'm very interested to see how this whole RoundUp issue plays out. I'm not sure if the genetics in those with Glyphosate-founded tumors will be different from those that arise normally. If so, they would almost be a new, distinct population, and it would all but verify that the chemical was a root cause. We'll see."
39707,"This seems very interesting. A lot of my research is about mathematical oncology and I often [blog about it](https://egtheory.wordpress.com/tag/mathematical-oncology/), but always wanted there to be a good podcast on cancer research. I am glad that you made one! I am looking forward to listening to it and happy to connect if you have interests in math onco."
39708,"I just spent the past our reading all your posts, RIP productivity."
39709,"Your game assay is incredible. I've always tried to envision cancer as an ecological process with many players, but this is something completely different ([https://www.nature.com/articles/s41559-018-0768-z](https://www.nature.com/articles/s41559-018-0768-z)). Is it possible to predict every outcome based on the environment, initial drivers, and their propensity towards developing a heterogeneous population? I definitely need to read about this. If we can predict and treat the game, we can win. That's super powerful work - thank you so much! I'll share this article with the lab if you don't mind?"
39710,"Thanks! 

I definitely think it is good to be thinking more and more about the evolution and ecology of cancer. I don't think we are currently at a stage where we can predict much about the game without measuring it directly. This is mostly because we've measured so few of them (our paper might be the only measurement, maybe one or two prior works can be recast as similar measurements in hindsight). Our hope is that we will be able to say something more general and empirically grounded about games in the near future; especially how games transform under therapy.

There is, however, a lot more theoretical work on evolutionary game theory in cancer. A key name to look for there is David Basanta. As a random side node, he is also into podcasting, and is part of the team behind the [2Scientists podcast](https://2scientists.org/). It is a different format (interviews) from yours and a bit less focused, but also fun.

You should definitely share the game assay paper with the lab. I'm eager to hear any feedback you might have. Feel free to reach out to me by email or [twitter](https://twitter.com/kaznatcheev)."
39711,Subscribed! Looking forward to how it will pan out.
39712,Awesome! I’m also a Cancer biologist (currently developing a novel therapy for multiple myeloma) will check your podcast out!
39713,Loved it so far :)
39714,"Since you work with Cancer Biology, it would be cool if you could talk about some possible/ researched mechanisms of actions for chemo drugs."
39715,I love your podcast. Thank you for making this!
39716,Hope you get a chance to cover chromothripsis!
39717,"It is such an interesting process - I may try someday, but I probably can't do it justice yet. It's such a massive event in terms of physical DNA change. The shattering is such a strange phenomenon to observe (or least see illustrated). Rampant DNA keeps the argument for cancer therapeutics that target these processes going!"
39718,Your podcast is the best one I have found for trying to learn cell science audibly. Thank you for the work you do!!! My only complaint is that I can't listen to it to fall asleep because I hang on every word. Your students are lucky to have you.
39719,Thank you so much for this! A much needed podcast :)
39720,I failed my biology test
39721,Thank you for the feedback! I took Im\_That\_Guy21's advice to do an intro episode on my work in B-cells and lymphomas and published it tonight ([https://open.spotify.com/show/6KySzlxOJT2blYQbiMoPa2](https://open.spotify.com/show/6KySzlxOJT2blYQbiMoPa2)) ([https://itunes.apple.com/us/podcast/for-whom-the-cell-tolls/id1439942541](https://itunes.apple.com/us/podcast/for-whom-the-cell-tolls/id1439942541)). I'll try and answer some of the questions and would love to continue discussing. I'll post when new episodes are published. Thank you for listening!
39722,"I saw that episode and was wondering if it was a crazy coincidence or not haha. I was curious because lymphoma is the cancer I had in my teens (~10 years ago), and I'm now also involved in cancer research (but on the medical physics side of things; radiation interaction with tissue for diagnostics/therapy). I've read up on what I could of this cancer from my own field, but would love the expert bio descriptions. Looking forward to listening, thanks!"
39723,"I'm loving your podcast, I've been listenening to it while I prep microscope slides at my internship! Can't wait to hear the next episode 👍"
39724,Need a sub for this podcast
39725,"Yo, I love this!  I wanna add you to our network page, ( [https://www.straightfromascientist.com/sfs-network/](https://www.straightfromascientist.com/sfs-network/) ), we're trying to help people find other podcasts like ours, and this is right up our alley! Check the page and send us an email with comparable bio info if interested.  Can always talk collabs too!"
39726,"The great suspender. It will automatically freeze tabs you haven’t been using for a while and brings you back to the page you were on once you refresh the page.  It saves your computers memory so you dont overload it on browser tabs. 

I leave dozens of tabs open at work and it’s saved me from having my computer crash at or freeze on me weekly"
39727,Pixelblock is a must install for me. It's an extension that blocks trackers in emails. You'd be surprised about how many trackers are in emails these days.
39728,What are trackers?
39729,"In most emails, most of the time it's a 1 pixel large picture that is able to tell the sender when you open the email containing the picture"
39730,"Stupid question, but my gmail (not sure if it's a default) won't load images unless you explicitly give permission. 

Do the trackers not work as long as I don't load the images?"
39731,"Gmail also does other stuff under the hood to block those, even if you enable images, afaik."
39732,"Yeah, gmail caches the images and delivers them to you, so the spammer doesn’t get a notification that you opened the mail."
39733,Good guy google?
39736,"I can't say for sure 100% of the time, but in my experience, yeah :)"
39737,My old boss would put trackers in his emails and then use that knowledge against you if you said you hadn't looked at it yet. He was a little micromanaging shitbag.
39738,Higher up is a plugin for sending those trackers.
39739,"The extension that adds ""View image"" back to Google images is pretty nice

Edit: [Here](https://chrome.google.com/webstore/detail/make-google-images-great/kjlaimldplcbblpgenlhfjpobmolcblj)"
39740,[Make Google Image Search Great Again](https://chrome.google.com/webstore/detail/make-google-images-great/kjlaimldplcbblpgenlhfjpobmolcblj)
39741,"Absolutely. It sucks that Google had to remove that option, I can't use chrome without it lol"
39743,[Decreased productivity](https://chrome.google.com/webstore/detail/decreased-productivity/nlbpiflhmdcklcbihngeffpmoklbiooj?hl=en-US) removes formatting on websites to make them look like plain text so you can browse at work without attracting attention. You mostly look like you're reading serious boring sites.
39744,"Honestly, if I walked by a subordinate's desk and saw something that looked like Geocities or an old hacker bbs from the 90s, I'd be ten-times more concerned. 

""Is this guy reading the anarchist's cookbook or some shit?"""
39745,"Just looking at the pictures, it's much more suspicious than just normally browsing text posts on Reddit."
39746,It does sound like something to hide your porn sites.
39747,Plain text porn!
39748,"lol, ASCII porn

8=====D ~o ~o ~o ( . Y . )"
39749,The [FuckOverlays extension](https://chrome.google.com/webstore/detail/fck-overlays/ppedokobpbdajgiejhnjfbdjlgobcpkp). A website wants you to turn off adblocker to continue browsing? right click and fuck that shit. pop out ad ruining your browsing experience? right click and fuck that shit. annoying elements of a page you want removed? right click and fuck that shit.
39750,Upvote just for the sales pitch.
39751,"[Fakespot](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain). Gives you an easy way to test the authenticity of reviews on Amazon (and a few other sites, not sure which). Edit: It can be used for free, the paid features just adds the fakespot grade on the page as you browse. Free opens a new tab.

[The Camelizer](https://chrome.google.com/webstore/detail/the-camelizer/ghnomdcacenbmilgjigehppbamfndblo) (from camelcamelcamel) to easily check price history on Amazon, and set up price alerts

[Lastpass](https://chrome.google.com/webstore/detail/lastpass-free-password-ma/hdokiejnpimakedhajhdlcegeplioahd). I've had sites be hacked and my info stolen before, and had a bad habit of reusing passwords. Lastpass generates secure passwords and saves/autofills them. Unlike chrome's password saver, it's encrypted too, and with the app can be used cross-platform.
Edit: since a couple of people asked, I'll add that you can apparently import from chrome Password manager with lastpass (Account Options -> Advanced -> Import -> Google Chrome Password Manager).

~~Google translate. Allows you to quickly translate stuff/autotranslate pages.~~
Edit: some people have pointed out that chrome can autotranslate pages without the extension now, so I guess this one isn't needed.

[Momentum](https://chrome.google.com/webstore/detail/momentum/laookkfknpbbblfpciffpaejjkokdgca) for a pretty new tab page.

[IE Tab](https://chrome.google.com/webstore/detail/ie-tab/hehijbfgiekmjfkfjpbkbammjbdenadd). Basically turns the tab you use it on into a virtual internet explorer tab. I had something I used a while back that could only run in IE for whatever reason, so rather than subject myself to that I could just run IE Tab and it would work perfectly within chrome.
Edit: tested it and it will run stuff like Silverlight that Chrome won't. Fairly sure it essentially opens an instance of IE in a chrome tab somehow so everything works natively.

Also, this isn't an extension but I strongly recommend running your email through [haveibeenpwned](https://haveibeenpwned.com/). It's a site that keeps a database of emails from website hacks and dataleaks and will tell you if your email was ever in one (and allow you to sign up for alerts for future ones). Obviously it's not foolproof and only has what the guy running it has managed to get his hands on but it's a really great tool! Goes hand in hand with lastpass imo."
39752,"Ok, but can i import all the passwords i have saved in chrome? Cus god knows im not remembering all of those."
39753,"You can! I didn't know this actually, since I used it as an opportunity to go through and delete old accounts on services I didn't use and change my passwords from old, insecure, reused ones to new, secure ones. After you install it, just click the extension then: Account options -> Advanced -> Import -> Google Chrome Password Manager

Also, whenever you log into a site lastpass will pop up to save it just like chrome does, which is great for new accounts. They also add a little button on new password fields to autogenerate and fill secure passwords."
39754,Clipboard History 2. It saves everything you recently copied to your clipboard into a convenient tab. Very useful if you need to copy over a lot of information quickly.
39755,*Too* *dangerous*
39756,I know.  I got the sweats just reading about it.
39757,"There used to be an extension called Lazarus that people were using to recover work when they accidentally closed a page or Chrome crashed. Fortunately, Google removed it from the store because it was just capturing everything you typed while you were online."
39758,But what if I *want* a keylogger
39759,"Exactly. I found out that my android phone had this feature, and when I opened it i realized that at least 20 different porn links were copied"
39760,"Your computer has it built in too.   It's just not commonly available.

EDIT:

* For windows: http://clipdiary.com/clipboard-articles/view-windows-clipboard-history.php
* For Mac: https://setapp.com/how-to/how-to-view-clipboard-history-on-mac
* For linux: I'm sure there's a terminal command :P

Disclaimer: It's been years since I've used any of these features. Not sure if the articles are actually accurate."
39761,Remembr does the same thing except works outside of Chrome too.
39762,Not a chrome extension but a desktop app for Windows that does it called Ditto. The application runs in the system tray and  records your history across all apps and has a quick toggle that brings up your history anywhere. You can also sync history across multiple PC's. https://ditto-cp.sourceforge.io/index.php
39763,Google Earth New Tab. It's cool because it provides something different for you to look at while you type in your Google search. It turns the new tab page into a revolving satellite picture of something on Earth every time a new tab is opened.
39764,"I absolutely love that add-on, it's so interesting and beautiful. So many people ask what it is and how they get it when they see it."
39765,https://chrome.google.com/webstore/detail/earth-view-from-google-ea/bhloflhklmhfpedakmangadcdofhnnoh?hl=en
39766,"You would like  Google's Arts n Culture too, then. It opens a new art piece every time you open a new tab"
39767,"ahh man, it would have been perfect if it used the google earth background but still gave me the 8 common tabs...."
39768,"Yeah, i tried it but i prefer having those quick links"
39769,I just got it. It's beautiful
39770,I'm randomly opening tabs now
39771,[I don't care about cookies](https://chrome.google.com/webstore/detail/i-dont-care-about-cookies/fihnjjcciajhdojfnbdddfaoknhalnja?hl=en) removes the cookie popup dialogues that destroyed the internet for the last few months.
39772,But does it accept them or not?
39773,"I'm pretty sure the ""accept"" button on those disclaimers doesn't do anything other than hide the disclaimer; you continuing to use the site is your acceptance. My guess is this extension just hides the HTML page element that has the disclaimer."
39774,"If you have uBlock Origin, you can just install Fanboy's Cookiemonster List and that should take care of the cookie popups."
39775,"[PanicButton](https://chrome.google.com/webstore/detail/panicbutton/faminaibgiklngmfpfbhmokfmnglamcm?hl=en)

makes it easier for you to hide all of your tabs at once just by clicking on a button. They are then saved as bookmarks in a separate folder. Afterwards, the PanicButton turns green and shows you how many tabs are currently hidden.

I use it for.. Reasons.."
39776,"Isn’t it easier to just close out the entire window?

It’ll show up in your history as it’s own folder if you close them out at the same time. Just go to your history and it’ll have a drop down menu that you can open them all at once."
39777,More suspicious to be on your desktop when someone walks in
39780,"Reddit has NSFW subs, so it's not entirely out of the question"
39781,And I've got some pretty hot friends on Facebook
39783,I'd rather be caught masturbating than browsing Facebook
39784,"Don't mind me. Just checking to see if my static wallpaper changes. Can never be too careful of viruses these days. 

^^^^Sweats ^^^^Profusely"
39785,"[Block Site](https://chrome.google.com/webstore/detail/block-site-website-blocke/eiimnmioipafcokbfikbljfdeojpcgbh) and [StayFocusd](https://chrome.google.com/webstore/detail/stayfocusd/laankejkbhbdhmipfmgcngdelahlfoji).

They're both really good at helping you  staying productive and not getting distracted while working online. Obviously, Block Site blocks any site you want, and StayFocusd sets a time limit (of your choosing) when browsing certain sites. The only thing is that you need a little bit of self-control not to unblock or extend the timing for any site.

edit: a word"
39787,Now you can instinctively go to Reddit like the rest of us!
39788,"“That’s enough reddit for me today! Let’s see what’s going on in the world...”

*closes reddit window*

*opens new window*

*goes to reddit*"
39789,"damn

we can't be saved can we"
39790,"Haha, you were happy with an increase of productivity so you made a Reddit post"
39791,">The only thing is that you need a little bit of self-control not to unblock or extend the timing for any site.

But if I could do that...I wouldn't need these addons.  :("
39792,"Can you set it to block sites during certain hours?  Say I want to block social media sites from 8pm to 6am, for instance?"
39793,"**Reddit**:

[Reddit Enhancement Suite:](https://chrome.google.com/webstore/detail/reddit-enhancement-suite/kbmfpngjjgdllneeigpgjifpgocmfgmb) A suite of modules that enhance your Reddit browsing experience

[Karamel](https://chrome.google.com/webstore/detail/karamel-view-reddit-comme/halllmdjninjohpckldgkaolbhgkfnpe): View Reddit comments on YouTube.

[Epiverse](https://chrome.google.com/webstore/detail/epiverse/cdfaehimknljceodkdojchgefegjkclk): Reddit comments for any webpage. suggested by /u/taulover

[Reddit New Comments Highlighter](https://chrome.google.com/webstore/detail/reddit-new-comments-highl/ajdilinnnkbmpoegibgacadjlblmpjad): Lets you view new comments in a reddit thread. 

EDIT: Suggested by /u/iVarun

[Reddit check](https://chrome.google.com/webstore/detail/reddit-check/mllceaiaedaingchlgolnfiibippgkmj?hl=en), it will check if a link has already been posted & which subs it has been posted in. 

**Youtube**:

[Search on YouTube](https://chrome.google.com/webstore/detail/search-on-youtube/nldmhmdlcadllplilaojhbdpknchcmec/related?hl=en): Adds a search on YouTube in the right click menu, like how you can highlight text and search on google in chrome. 

Suggested by /u/StitchesandPsychos 

[Iridium for YouTube](https://chrome.google.com/webstore/detail/iridium-for-youtube/gbjmgndncjkjfcnpfhgidhbgokofegbl?hl=en): Adblocker specifically for YouTube, which lets you whitelist specific channels.

**Twitch**:

[BetterTTV:](https://chrome.google.com/webstore/detail/betterttv/ajopnjidmegmdimjlfnijceegpefgped) BetterTTV enhances Twitch with new features, emotes, and more. 

**Utility**: 

Suggested by /u/Kasey89878

[Dark Reader:](https://chrome.google.com/webstore/detail/dark-reader/eimadpbcbfnmbkopoojfekhnkhdbieeh) Dark mode for every website. Take care of your eyes, use dark theme for night and daily browsing.

[Imagus](https://chrome.google.com/webstore/detail/imagus/immpkjjlgappgfkkfieppnmlhakdmaab?hl=fr): Lets you hover your cursor over images to view them instead of clicking on them. 

[Google Search ""View Image"" Button](https://chrome.google.com/webstore/detail/google-search-view-image/hgngncnljacgakaiifjcgdnknaglfipo): Adds the removed view image back into google images.

[Full Page Screen Capture](https://chrome.google.com/webstore/detail/full-page-screen-capture/fdpohaocaechififmbbbbbknoalclacl): Will take a screenshot that you can edit of the entire web page and turn it into a single image. 

[Volume Master:](https://chrome.google.com/webstore/detail/volume-master/jghecgabfgfdldnmbfkhmffcabddioke) lets you boost chrome tab volume by up to %600, very useful for quiet youtube videos.

[RightToCopy:](https://chrome.google.com/webstore/detail/righttocopy/plmcimdddlobkphnofejmeidjblideca) Enable right clicking, selecting, and copying text on pages that prevent these features. Also, prevent clipboard text injection.

[Season Buddy:](https://chrome.google.com/webstore/detail/session-buddy/edacconmaakjimmfgnblocblbcdcpbko) Lets you manage and save browser sessions for later.

[The Great Suspender](https://chrome.google.com/webstore/detail/the-great-suspender/klbibkeccnjlkjkiokjodocebajanakg): Suspends tabs after an hour, you can change it to longer or even whitelist sites. 

EDIT: About the great suspender, apparently [there is a bug](https://www.reddit.com/r/AskReddit/comments/96p1fv/what_are_the_best_most_useful_musthave_google/e43054q/) with the current version. 

Edit 2019: this might be patched now from when i posted this comment with a more recent version but i can't verify, maybe skip this one or look for a alternative if you're not sure. I still use it though. 

[Chrome Remote Desktop](https://chrome.google.com/webstore/detail/chrome-remote-desktop/gbchcmhmhahfdphkhkmpfmihenigjmpp): lets you remote into or from any PC or phone with chrome installed that you're signed in to. Works with multiple monitors as well. Similar to teamviewer. Make sure to get the Android or IOS app if you want to use your phone with it. 

Enhanced steam replacement suggested by /u/Nijntje1994

[Augmented Steam](https://chrome.google.com/webstore/detail/augmented-steam/dnhpnfgdlenaccegplpojghhmaamnnfp): A fork of the now deprecated enhanced steam but works as of June 2019. Adds an extensive list of features listed on it's page, some are things like adding price history to page of the product on the steam website.

[Tampermonkey](https://chrome.google.com/webstore/detail/tampermonkey/dhdgffkkebhmkfjojejmpbldmpobfkfo?hl=en): for more advanced features, you can create your own scripts or use other peoples to run in chrome. 

EDIT: Check out [ViolentMoneky]
(https://chrome.google.com/webstore/detail/violentmonkey/jinjaccalgkegednnccohejagnlnfdag?hl=en) as an alternative to Tamper monkey suggested by [wildthing202](https://www.reddit.com/r/AskReddit/comments/96p1fv/what_are_the_best_most_useful_musthave_google/e42dk1z/)

**Privacy & Security**:

[Lastpass](https://chrome.google.com/webstore/detail/lastpass-free-password-ma/hdokiejnpimakedhajhdlcegeplioahd): Secure password manger that works across multiple devices. 

[Ublock Origin](https://chrome.google.com/webstore/detail/ublock-origin/cjpalhdlnbpafiamejdnhcphjbkeiagm): The best and lightest adblocking extension.

[HTTPS Everywhere](https://chrome.google.com/webstore/detail/https-everywhere/gcbommkclmclpchllfjekcdonpmejbdp): Will try to use HTTPS vs HTTP whenever possible. 

Privacy Badger and No coin can/might be redundant in some cases when using other extensions like Ublock Origin and also can break some websites unless you disable it for them. You can probably skip these if your using an adblocker already.   

[Privacy Badger](https://chrome.google.com/webstore/detail/privacy-badger/pkehgijcmpdhfbdbbnkijodmdjhbjlgp): Blocks trackers from websites. 

[No Coin - Block miners on the web!](https://chrome.google.com/webstore/detail/no-coin-block-miners-on-t/gojamcfopckidlocpkbelmpjcgmbgjcl): Blocks websites from running cryptomining scripts.

**Fun**: 

[Cloud to Butt Plus](https://chrome.google.com/webstore/detail/butt-to-butt-plus/apmlngnhgbnjpajelfkmabhkfapgnoai): Changes all mentions of ""the cloud"" to ""my Butt"" , including alternative ways/context to reference/type phrases. 

[Millennials to Snake people](https://chrome.google.com/webstore/detail/millennials-to-snake-peop/jhkibealmjkbkafogihpeidfcgnigmlf): Will change all references of ""Millennials"" to ""Snake people"", including alternative ways/context to reference/type phrases. 

EDIT: There is also [Word Replacer II](https://chrome.google.com/webstore/detail/word-replacer-ii/djakfbefalbkkdgnhkkdiihelkjdpbfh?hl=en) suggested by /u/MOONGOONER if you want to add you're own custom words.

[Earth view:](https://chrome.google.com/webstore/detail/earth-view-from-google-ea/bhloflhklmhfpedakmangadcdofhnnoh) Whenever you open a new tab it replaces the background with a random satellite picture from google maps/earth."
39794,"> Butt to Butt Plus: Changes all mentions of ""my Butt"" to ""my Butt""

Lol, I forgot I had that installed.  I was slightly confused for a minute after reading that."
39795,"CamelCamelCamel extension for Amazon price tracking. 

Many a times Amazon ""discounted"" prices are higher then regular and the extension gives you a price history of the product with the ability to send you a notification when it reaches a desirable price."
39796,"[Keepa](https://chrome.google.com/webstore/detail/keepa-amazon-price-tracke/neebplgakaahbhdphmkckjjcegoiijjo) is like CamelCamelCamel, except it embeds itself in the page below the item. It's very good."
39797,"This one is so weird to me because when I was a kid and had just discovered the internet I was typing in random strings of words to see if they got anywhere, and one of them was CamelCamelCamel.com. It didn’t go anywhere at the time (2007ish) but my friends all thought it was hilarious. We spent a week laughing about CamelCamelCamel and wondering what the website would do.

Now it’s an actual thing. What the fuck.

EDIT: To those of you asking if my friends were somehow involved, nope. Just a massive coincidence. I don't remember most of the kids' names, since I haven't seen them for years, but the website was founded in 2008. The OLDEST they could've been is 10. Knowing the kind of kids at that school, that actually wasn't entirely impossible (tech geeks, young coding prodigies), so I looked into it more. There's practically no information on Daniel Green, the founder. I had to scroll all the way to the bottom of the his Twitter feed to be sure. In 2012 he was selling a house in Utah. I live in Minnesota, and anyway if he was one of the kids there he couldn't've been older than 14 by then. [This](https://twitter.com/camelfarmer/status/258964977581424640) is not a 14-year-old's tweet."
39798,"OneTab! It consolidates tabs for you, sorted by windows. Helpful for when I have a lot of unnecessary but interesting stuff open and don't want to clutter my bookmarks, or for when I'm restarting my laptop and/or need a clean slate with the browser."
39799,[Dark reader](https://chrome.google.com/webstore/detail/dark-reader/eimadpbcbfnmbkopoojfekhnkhdbieeh?hl=en-US) it changes all web sites to have a dark color palette. It is amazingly useful for browsing websites that don’t have a dark theme at night.
39800,I just had laser eye surgery and the first 2 weeks of recovery my eyes were super sensitive to contrast. This extension ensured that I could continue redditing for 7 hours a day in my underwear.
39801,What a world we live in. Wild.
39803,"I have seen people getting gilded for less

EDIT: I have become the very thing I swore to destroy"
39804,Have literally seen a person gilded for an empty comment.
39805,^^^^^^^^^.
39806,Almost
39807,To be fair sometimes a period just sneaks up on you
39808,"Those aren't the ones you need to worry about, its the ones you expect that never come that are the issue"
39809,"I'm so disappointed this wasn't gilded...  

EDIT:  Thank you for the gold to whoever did it!

P.S.  Nobody will ever know if I gilded myself, or if someone gilded me to be “That guy” ...   but thanks to that one person who knows."
39810,"Reddit has a built in dark theme, but I acknowledge the ease of having it automatically."
39811,That’s a 5 star review if ever I heard one
39812,oh shit you have laser eyes now?
39813,"Looks like no one else has done it yet, so I guess I'll do it, here's a big list of a bunch of the extensions in this thread with links. I will try to update as needed. - 

* [Reddit Enhancement Suite](https://chrome.google.com/webstore/detail/reddit-enhancement-suite/kbmfpngjjgdllneeigpgjifpgocmfgmb?hl=en) - Gives Reddit a ton of new features, no clue how I ever reddited without it

* [Boomerang for Gmail](https://chrome.google.com/webstore/detail/boomerang-for-gmail/mdanidgdpmkimeiiojknlnekblgmpdll?hl=en) - Lets you schedule emails

* [Privacy Badger](https://chrome.google.com/webstore/detail/privacy-badger/pkehgijcmpdhfbdbbnkijodmdjhbjlgp) - Blocks trackers on websites

* [Dark Reader](https://chrome.google.com/webstore/detail/dark-reader/eimadpbcbfnmbkopoojfekhnkhdbieeh?hl=en-US) - Gives websites a dark color pallette

* [CamelCamelCamel](https://chrome.google.com/webstore/detail/the-camelizer/ghnomdcacenbmilgjigehppbamfndblo?hl=en-US) - Gives you price history of products on Amazon

* [Ublock Origin](https://chrome.google.com/webstore/detail/ublock-origin/cjpalhdlnbpafiamejdnhcphjbkeiagm?hl=en-US) - The best ad blocker

* [Earth View from Google Earth (Google Earth new tab)](https://chrome.google.com/webstore/detail/earth-view-from-google-ea/bhloflhklmhfpedakmangadcdofhnnoh?hl=en-US) - Changes your new tab page to a cool picture from Google Earth

* [Millennials to snake people](https://chrome.google.com/webstore/detail/millennials-to-snake-peop/jhkibealmjkbkafogihpeidfcgnigmlf?hl=en-US) - Replaces millenials with snake people

* [Never Ending Netflix] (https://chrome.google.com/webstore/detail/never-ending-netflix/hdadmgabliibighlbejhlglfjgplfmhb?hl=en-US) - Automatically skips show intros and immediately plays the next episode on Netflix

* [Imagus](https://chrome.google.com/webstore/detail/imagus/immpkjjlgappgfkkfieppnmlhakdmaab?hl=en-US) - Enlarges pictures without having to open them

* [Bananatag](https://chrome.google.com/webstore/detail/bananatag-email-tracking/jpbnpbfpgjkblmejlgkfkekajajhjcid?hl=en-US) - Lets you see if someone has opened an email from you

* [Block Site](https://chrome.google.com/webstore/detail/block-site-website-blocke/eiimnmioipafcokbfikbljfdeojpcgbh) - Blocks websites to help increase productivity

* [StayFocused](https://chrome.google.com/webstore/detail/stayfocusd/laankejkbhbdhmipfmgcngdelahlfoji) - Limits time on websites to help increase productivity

* [Clipboard History 2](https://chrome.google.com/webstore/detail/clipboard-history-2/ajiejmhbejpdgkkigpddefnjmgcbkenk) - Keeps a history of your clipboard

* [Lastpass](https://chrome.google.com/webstore/detail/lastpass-free-password-ma/hdokiejnpimakedhajhdlcegeplioahd) - Password manager

* [Fakespot](https://chrome.google.com/webstore/detail/fakespot-analyze-fake-ama/nakplnnackehceedgkgkokbgbmfghain?hl=en-US) - Helps you find fake Amazon reviews

* [Google Translate](https://chrome.google.com/webstore/detail/google-translate/aapbdbdomjkkjkaonfhkkikfgjllcleb?hl=en-US) - Quickly translate

* [Momentum](https://chrome.google.com/webstore/detail/momentum/laookkfknpbbblfpciffpaejjkokdgca?hl=en-US) - Nice new tab page

* [IE Tab](https://chrome.google.com/webstore/detail/ie-tab/hehijbfgiekmjfkfjpbkbammjbdenadd?hl=en-US) - Lets you open tabs as if they were in internet explorer

* [OneTab](https://chrome.google.com/webstore/detail/onetab/chphlpgkkbolifaimnlloiipkdnihall?hl=en-US) - Puts all your tabs into one tab

* [Google Dictionary](https://chrome.google.com/webstore/detail/google-dictionary-by-goog/mgijmajocgfcbeboacabfgobmjgjcoja?hl=en) - Quickly find definitions for words

* [HTTPS Everywhere](https://chrome.google.com/webstore/detail/https-everywhere/gcbommkclmclpchllfjekcdonpmejbdp?hl=en) - Uses https encryiption instead of http on sites. More info [here](https://www.reddit.com/r/AskReddit/comments/96p1fv/what_are_the_best_most_useful_musthave_google/e43276g/?context=3) about it from /u/pcjonathan

* [TabSaver](https://chrome.google.com/webstore/detail/tabsaver/fmjkkhoegfianolbdbceddpgnidbfpmo?hl=en) - Saves your open tabs after a browser restart

* [The Great Suspender](https://chrome.google.com/webstore/detail/the-great-suspender/klbibkeccnjlkjkiokjodocebajanakg?hl=en) - Suspends tabs to save RAM

* [Ebates](https://chrome.google.com/webstore/detail/ebates-the-free-cash-back/chhjbpecpncaggjpdakmflnfcopglcmi?hl=en) - Coupons for online shopping

* [Disconnect](https://chrome.google.com/webstore/detail/disconnect/jeoacafpbcihiomhlakheieifhpjdfeo) - Blocks trackers on websites

* [Clacks Overhead](https://chrome.google.com/webstore/detail/clacks-overhead-gnu-terry/lnndfmobdoobjfcalkmfojmanbeoegab?hl=en) - Keeps Terry Pratchett's name alive

* [Iridium for YouTube](https://chrome.google.com/webstore/detail/iridium-for-youtube/gbjmgndncjkjfcnpfhgidhbgokofegbl?hl=en) - Adds features to YouTube, [full list here](https://github.com/ParticleCore/Iridium/wiki/Features)

* [Honey](https://chrome.google.com/webstore/detail/honey/bmnlcjabgnpnenekpadlanbbkooimhnj?hl=en) - Coupon codes for shopping online

* [Tabby Cat](https://chrome.google.com/webstore/detail/tabby-cat/mefhakmgclhhfbdadeojlkbllmecialg?hl=en) - Shows you a different cartoon cat in every new tab

* [Tab for a Cause](https://chrome.google.com/webstore/detail/tab-for-a-cause/gibkoahgjfhphbmeiphbcnhehbfdlcgo?hl=en) - Raise money for charities by opening a new tab

* [BetterTTV](https://chrome.google.com/webstore/detail/betterttv/ajopnjidmegmdimjlfnijceegpefgped?hl=en) - Gives Twitch more features and emotes

* [Panic Button](https://chrome.google.com/webstore/detail/panicbutton/faminaibgiklngmfpfbhmokfmnglamcm?hl=en) - Hide all your tabs then reopen them later

* [Curiosity](https://chrome.google.com/webstore/detail/curiosity-smart-tab/lfgogjeffbicjdjbjmnopokneomjdjig?hl=en) - Learn new facts every time you open a new tab

* [I don't care about cookies](https://chrome.google.com/webstore/detail/i-dont-care-about-cookies/fihnjjcciajhdojfnbdddfaoknhalnja?hl=en) - Removes annoying cookie warnings on websites

* [Make Google Images Great Again](https://chrome.google.com/webstore/detail/make-google-images-great/kjlaimldplcbblpgenlhfjpobmolcblj) - Brings back the view image and search by image buttons in Google images results

EDIT: More!

* [AlienTube](https://chrome.google.com/webstore/detail/alientube-for-youtube/opgodjgjgojjkhlmmhdlojfehcemknnp) - Adds Reddit comments to YouTube videos

* [Reddit New Comments Highlighter](https://chrome.google.com/webstore/detail/reddit-new-comments-highl/ajdilinnnkbmpoegibgacadjlblmpjad/related) - Highlights new comments in Reddit threads

* [Cloud To Butt](https://chrome.google.com/webstore/detail/cloud-to-butt-plus/apmlngnhgbnjpajelfkmabhkfapgnoai) - Changes cloud to butt

* [Search on YouTube](https://chrome.google.com/webstore/detail/search-on-youtube/nldmhmdlcadllplilaojhbdpknchcmec?hl=en) - Allows you to search on YouTube from the right click menu

* [Pushbullet](https://chrome.google.com/webstore/detail/pushbullet/chlffgpmiacpedhhbkiomidkjlcfhogd?hl=en) - Share files between your phone and computer and sms from your computer

* [Speed Dial 2](https://chrome.google.com/webstore/detail/speed-dial-2-new-tab/jpfpebmajhhopeonhlcgidhclcccjcik?hl=en) - Simple new tab page

EDIT 2: Even more! Also [some more info on HTTPS everywhere](https://www.reddit.com/r/AskReddit/comments/96p1fv/what_are_the_best_most_useful_musthave_google/e43276g/?context=3).

* [PixelBlock](https://chrome.google.com/webstore/detail/pixelblock/jmpmfcjnflbcoidlgapblgpgbilinlem?hl=en) - Does the opposite of Bananatag, allows you to block from tracking when you open emails

* [Decreased Productivity](https://chrome.google.com/webstore/detail/decreased-productivity/nlbpiflhmdcklcbihngeffpmoklbiooj?hl=en-US) - Helps you make webpages look like you want them to look so you can browse at work

* [f*ck overlays](https://chrome.google.com/webstore/detail/fck-overlays/ppedokobpbdajgiejhnjfbdjlgobcpkp) - Lets you easily block ad block disabling requests on websites from the right click menu

* [Black Menu for Google](https://chrome.google.com/webstore/detail/black-menu-for-google/eignhdfgaldabilaaegmdfbajngjmoke) - Every Google service in one menu

* [SimpleUndoClose](https://chrome.google.com/webstore/detail/simpleundoclose/emhohdghchmjepmigjojkehidlielknj) - Open your last 10 closed tabs easily

* [Turn Off the Lights](https://chrome.google.com/webstore/detail/turn-off-the-lights/bfbmjmiodbnnpllbbbfblcplfjjepjdn) - Darkens everything on a YouTube page except the video

* [DuckDuckGo Privacy Essentials](https://chrome.google.com/webstore/detail/duckduckgo-privacy-essent/bkdgflcldnnnapblkhphbgpggdiikppg) - Blocks trackers and gives info on how safe sites are

* [Google Arts & Culture](https://chrome.google.com/webstore/detail/google-arts-culture/akimgimeeoiognljlfchpbkpfbmeapkh) - Changes your new tab page to a different work of art every time

* [Chrome Remote Desktop](https://chrome.google.com/webstore/detail/chrome-remote-desktop/gbchcmhmhahfdphkhkmpfmihenigjmpp?hl=en) - Not an extension, but still can be run with Chrome. Allows you to access your computer with another computer or your phone with a code, similar to TeamViewer

* [RightToCopy](https://chrome.google.com/webstore/detail/righttocopy/plmcimdddlobkphnofejmeidjblideca) - Lets you select and copy text on sites that you normally can't on

* [Ghostery](https://chrome.google.com/webstore/detail/ghostery-%E2%80%93-privacy-ad-blo/mlomiejdfkolichcflejclcbmpeaniij) - Ad and tracker blocker

* [Old Reddit Redirect](https://chrome.google.com/webstore/detail/old-reddit-redirect/dneaehbmnbhcippjikoajpoabadpodje) - Automatically redirects to old reddit

* [Recipe Filter](https://chrome.google.com/webstore/detail/recipe-filter/ahlcdjbkdaegmljnnncfnhiioiadakae) - Puts the recipes on recipe sites at the top of the page"
39815,Privacy Badger. It blocks trackers (so companies can't get your web browsing history and build a profile on you) and is a solid privacy extension.
39816,"Be aware if a website breaks, privacy badger is the most common cause. It's also really easy to turn off and back on."
39817,Ublock origin
39818,Definitely. I forgot YouTube had adds until I went to work in a place with employee computers. God there’s so many of them.
39819,"Then you hit those videos with like three ads spaced out in the middle of the content, usually cutting the video in the middle of a sentence.  It's ridiculous and just begs you to use an adblocker."
39820,And don't you fucking love when a video refuses to start because the ad server that's meant to play the ad has shat the bed and the content won't start until he ad has played.
39821,This is the worst
39822,"With uBlock Origin, now you wont have to suffer!"
39823,Wait...is *THIS* an ad?
39824,Everyone on reddit is an ad except you.
39826,"Static banner ads are perfectly fine. Even animated ads that stop after a few seconds are fine by me; it when the ads never ever stopped moving, when they started yelling at you the instant the page loaded, and when they literally covered the entire fucking browser window that I downloaded my first adblocker. 

The sad thing is that since adblockers have gotten common, they've only doubled-down on the invasiveness of the ads."
39828,"They started sticking them *in* the videos nlw too.

I dont mind the 5 sec clip at the start but Wish is a garbage store and forcing me to have to watch their shit ads multiple time isnt gonna make me change my mind. In fact, cutting so adburptly to it only reinforces my negative sentiment towards the brand."
39829,I've downvoted every single ad I've ever seen since they've introduced the voting feature. It's my own silent rebellion
39830,"It's been letting reddit ads slip through lately. Kind of annoying. Also, use it in conjunction with uBlock Origin Extra. Picks up more things and specifically the things that get annoyed you're using an adblocker."
39831,"The difference as far as I can tell is that Reddit ads are actually hosted by Reddit, so it's harder to block them. Most websites load ads externally, which is honestly even worse because they don't have to worry about bandwidth on their servers when loading up tons of ads.

It's probably still possible to block Reddit ads, so just give it some time I guess."
39833,Disconeeeeeecccct
39834,whatamigunadoooooooooo
39835,My wiiiiiife still doesnt believe in meee
39836,^[deleted ^82]
39837,"Millennials to snake people.

It literally replaces all mentions of the word ""millennial"" with the words ""snake people"".

uBlock Origin 

It's an ad blocker."
39838,Snake people are killing the flip flop industry. Here’s why.
39839,At least they are not ruining taking the socks with sandals industry :)
39841,"That reminds me of the ""cloud to butt"" extension lol

Edit: I love these stories everyone!"
39842,"Funny story about the cloud to butt extension. One day at work I received a client list from a third party, when I was parsing the list I got a bunch of failed email addresses, all ending in `@ibutt.com`. Turns out the third party I got this from copied and pasted from their browser which had the cloud to butt extension installed thus turning all of the `@icloud.com` to `@ibutt.com`.

To this day both of our respective companies use that as a cautionary tale to new employees: we tell everyone to always double check third party provided files; they tell everyone to be cognisant of what browser extensions are installed."
39843,Snake people are using butt services more and more.
39845,"I've had this one for so long that it doesn't even get me anymore. Butt just means cloud now. I'm afraid that one of these days I'm gonna be out with people and accidentally say ""ooh it's butty out today"""
39846,It surprises me every time I see snake people but damn it's great for an unexpected laugh.
39847,Here's some other word replacement apps. Herp Derp for YouTube and Alientube. The first one replaces YouTube comments entirely so if you ever forget that they are literally cancer to read it helps remind you. The latter one blends Reddit comments into the YouTube comments if the video has been linked on Reddit
39849,Hmm. Is there an extension where I can make it look as though I emailed them yesterday???
39850,"There was a SNL skit of a delivery company for this. They'd back date your delivery date and take the blame.

https://www.nbc.com/saturday-night-live/video/jiffy-express/n10315"
39851,It's an extension of sorts. Just get yourself a Phone Microwave (name subject to change) and you should be good to go.
39852,But I don't want to change timelines.
39853,El Psy Kongroo.
39854,"Is there anything like this for Whatsapp ~~messaged~~ messenger?

Edit: Thanks for your suggestions, everyone."
39855,"Yes, just send your message at 7am instead of 1am."
39856,Thanks Brian
39857,My name is Brian. I feel personally attacked.
39858,Sorry Brian
39859,Good going Steven.
39860,"I guess it depends on what you're sending, I get the sentiment but my thought is always ""yeah motherfucker I was up at 2:30 AM fixing shit for you, sorry if I misspelled a word but let me repeat that I was doing work in the middle of the night for your lazy ass"".  I don't think I've ever wanted to send an email later, you'll take my email you lazy sleeping piece of shit."
39861,"Bro plot twist you can also write/schedule an email at 5pm but have it send at 2am, and everyone thinks you’re a hard worker but you’re straight snoozin"
39862,"""How to Get a Raise from Your Gen X Boss 101"" followed by ""Pivot Tables and Why It Takes Everyone Else a Week to do this Task""."
39864,The secret no one is willing to admit.
39865,I'm an analyst. I accidentally automated out a co-workers job with about 1000 lines of VBA.
39866,"Been there. We had someone quit and we were expected just to absorb the extra job, they weren't hiring anyone else. Managed to automate a good 70% of what he did."
39867,"On a scale of $0 to Nothing, how much of a raise did you get for being 70% more efficient?"
39868,I once automated my own job. But I kept my fucking mouth shut and just enjoyed getting paid to Half-Life 2.
39869,"Programmer here. I've literally replaced jobs with Excel.      
    
Luckily, I work for a company that doesn't fire people for being worthless; they instead try to train them to be less worthless."
39870,Never Ending Netflix: automatically skips show intros and goes straight to next episode (no 10-second countdown)
39871,Does it work with shows that have cold opens?
39872,"Today, smoking is gonna save lives."
39873,"I saw you in the parking lot earlier, that’s how I know you!"
39874,Five thousand three hundred dollars for a dummy?
39875,Gotta have those Nine-Nine cold opens.
39876,"""You are, my fire..."""
39877,"""The one, desire..."""
39878,Believe... When I say
39880,Title of your sex tape
39881,*gasp* Title of OUR sex tape!
39882,"I would imagine it just hits the ""Skip Intro"" button, so assuming that Netflix itself doesn't put that button up for the cold intro, then it wouldn't skip it."
39883,Coinblock! It blocks websites from secretly mining cryptos
39884,Just wait until an update rolls out and it starts mining coins on peoples computers
39886,"Yeah, don't forget to the 


>x, it is basically a better version of y"
39887,"Imagus, a better version of Hoverzoom"
39888,"Been using hover zoom for a while now, what does imagus do better?"
39889,What are both? Like what do they do?
39890,Basically what it says on the tin. Hover over a picture or a link to a pic and it will show it to you. Pretty handy for reddit.
39891,Hoverzoom was caught keeping track of history/data and imagus doesn't
39892,One severely underrated feature of Imagus is the hold right click to keep the picture/video on screen. Great for videos especially.
39893,"uBlock Origin is a must.  I've always had ABP, but uBlock is so much better."
39894,"Bananatag. It tracks emails you send via Gmail.

I work from home and freelance. I cold email people or send finished projects...etc.

I used always be in the dark of whether or not people had gotten my emails or checked out what I sent...etc.

With Bananatag I can see when they opened it, which links they clicked, how many times they opened it...etc.

Now if I don't get a response in a couple of days but I know for a FACT they opened the damn email and clicked the links or opened the attached I feel much more justified in a follow up.

Sometimes I will see someone open my email...reopen it....re-re-open it over the course of a couple of days and know they must be on the fence.

Or I can see when someone opens an email convo we had like...8 months ago. So maybe I should reconnect with that person..etc.

**EDIT** I am genuinely surprised how many people seem to be ignorant about email tracking that has been around for nearly 2 decades.

Every type of marketing email uses it. You could go get a simple service like Aweber and use it or Mailchimp.

This extension simply eliminates the need for specific software and lets you track directly from Gmail, which is good for casual daily use and correspondence beyond large email campaigns.

**EDIT 2** Gmail doesn't block this guys. No email I know of does (although I am sure there are some).

I can see what email client the recipient is using....what operating system they are on....what device they are on...what time they opened it...how long they read...how many times they opened...how many times they clicked links...who they forwarded it to...etc.

And I see when Bob using an outdated Android OS opens up my email via Gmail on his phone at 3:52 am in Baltimore, Maryland."
39895,"Thats actually amazing for sending out resumes. I can check if the fuckers actually cliked on my portfolio site before declining me.



Does it leave any trace that you are using it?"
39896,"Sounds useful but also a tad odd, I wouldn't feel comfortable knowing someone else could see when I opened emails and how many times as well as which ones"
39897,"I have bad news for you: every marketing email you receive has this built into it, so all companies know when you open their emails and click their links"
39898,"Which is why your email client always asks you if you want to load images in the email. Unless you click on a link, load the pictures in the email or deliberately send a email read receipt there's no way they can see that you've opened it."
39900,"They're definitely looking out for you. When they include a picture in the email the only way your email client can load that picture is to request it from the server. 

Any request made from your computer to their server has information such as the browser you're using (will most likely be something like ""Chrome"", ""Firefox"", ""Thunderbird"" etc.) as well as your IP, your preferred language etc..

Imagine a picture URL was something like

https://customer-email.domain.org/getPicture?customerId=1234&picture=logo.jpg

The moment your email client tries to load that picture they (whoever owns `customer-email.domain.org`) will know that the customer with ID `1234` wants to load the picture `logo.png` and they'll serve the picture as if it was a normal picture. Obviously they also log all the information that is sent to them, so that they can use the statistics to see how many people opened, where they're from, what language they prefer and other kind of info of the user.

Since your email client doesn't know whether the URL is a real normal picture (without any tracking) or whether the external site tracks and _then_ returns your picture, they tend to not load it unless you've requested it.

From what I can see [gmail now loads all images through their own proxy](https://i.imgur.com/VlcXlI2.png) (`googleusercontent.com`) which at least protects you from sending all your info (such as IP, browser information etc.) since the request comes from Google and not you. Unfortunately the only way that `googleusercontent.com` can load the content of this image is to request it, meaning that from what I can see all gmail emails will automatically report their read information, assuming that the sender has set their email up to track those. The customer would still know that user `1234` requested this image.

It's also why you should be wary of clicking the links in any spam emails you might receive. While you don't type in any of information on the site, they still track that _your_ email clicks on spam links and will 100% send you even more spam in the future. From what I can see with the way gmail currently does it, the spammer with a small hidden picture (`pixel.png`) would be able to see that you at least received it and opened it, though Google might request the picture the moment the email is received (rather than when you actually open it) and hence all the spam sender will see is that all gmail users opened their email the moment they sent them (which is useless as it's false)."
39901,"Useful tip to avoid these: turn off “automatically load images and attachments” on your email client. Those trackers are normally a one pixel image that gets loaded from an external server. The second you load it, the server sees you accessed that one pixel resource and notifies the sender that the email has been opened."
39902,That's super interesting. Those sneaky bastards have been sending me one pixel at a time? Can't wait to see what the image is once I open 1920x1080 emails.
39904,"AdBlock and AdBlock Plus are no longer recommended, since they're slow and allow companies to pay them to let ads through. Use uBlock Origin instead (not uBlock)."
39905,"Sorry its long

* **Google Arts & Culture** – Cool artistic wallpapers for every tab you open
* **Chrome Currency Converter** – Automatically convert every currency present on the web page to your desired one
* **Turn Off the Lights** – Darkens the area of web page except the video
* **ColorZilla** – Select the color present anywhere on screen \[for designing purposes\]
* **DuckDuckGo Privacy Essentials** \- Privacy
* **Nimbus Screenshot & Screen Video Recorder** – What it says
* **Twitter Media Downloader** – What it says
* **uBlock Origin** – Blocks everything you don’t want
* **Extension Source Locator** – Locate the installed location of your chrome extensions \[For dev\]
* **Search by Image (by Google)** \- What it says
* **Black Menu for Google™** \- Contains every single google tool in just one pop up
* **Dark Reader** – Night Mode Every-fuckin-where
* **SimpleUndoClose** – Undo close last 10 tabs closed without opening history
* **Full Page Screen Capture** \- What it says
* **Chrome Remote Desktop** – Remote Desktop for use via phone
* **HTTPS Everywhere** – What it says \[Helpful in security\]
* **Ghostery** \- Privacy
* **LastPass: Free Password Manager** \- What it says
* **Power Thesaurus** \- What it says
* **Imagus** \- Enlarge almost every image present on web page
* **WhatFont** – Identify the font you see on web page \[For designing purposes\]
* **Video Blocker** – Block some specific YT channels to stop appearing in your feed \[No more Jake Paul\]
* **Grammarly for Chrome** – Corrects your grammar
* **The Great Suspender** – Suspend any tab on chrome so as to save that huge RAM
* **Google Dictionary (by Google)** \- What it says
* **RightToCopy** – Allows copying on sites where its blocked
* **Reddit Enhancement Suite** \- What it says
* **Hoxx VPN Proxy** \- What it says \[Free, Yes\]

EDIT1:- As a good Samaritan pointed out, pls avoid free VPNs, and use PrivacyBadger instead of Ghostery.

EDIT2:- [A bit useful info on HTTPS Everywhere](https://www.reddit.com/r/AskReddit/comments/96p1fv/what_are_the_best_most_useful_musthave_google/e43276g/?context=3), exposes the false sense of security."
39907,"Naw man, i just use The great suspender whenever high RAM usage. Works fine on my 8 GB. I just want as much productivity boost possible, so."
39908,"Pushbullet. 

Makes it super easy to share files between you phone and laptop."
39909,"And, if you have an Android phone, you can text from your computer!"
39910,"uBlock Origin is getting a lot of posts (and for good reason, that shit is great), but one I really love is [AdNauseam](https://adnauseam.io/), it not only blocks ads, but it ***reports a click signal to the ad itself*** so that your ad profile gets fucked up and the data received by advertisers is meaningless! In fact, it worked so well that google decided to block adnauseam from their store. You can still get it of course, but you need to enable developer mode. I wish it were more popular because this doesn't just block ads, but it actually fucks with advertisers business model in ways they really can't counter."
39911,"Tab for a Cause, you can donate to charity for just opening tabs."
39912,When I got more RAM I tested how many tabs I could open before my computer slowed down to being unusable and you're telling me I could have been donating to charity the entire time??
39913,Lastpass. Its a password manager that keeps all your stuff secure. You can put in info for gmail accounts to drivers licenses and credit/debit cards. Inputting any new login information on chrome triggers a popup asking if you’d like to add whatever you just entered into your password vault. Also there’s a master password for each account that has some pretty strict security measures so your stuff will be safe.
39914,How about KeePass? Idk which is better?
39915,"KeePass is an open source software program, not a Chrome extension (I assume LastPass is an extension). I use KeePass as well, and I 100% recommend it for keeping track of account usernames and passwords."
39917,"Late to the party, but Tabs for a Cause.

Every time you open a new tap it shows like 2 ads but you earn a  heart. 1 <3 = 1¢. You donate hearts to charities. Really cool.

Edit:

Also word replaces. Any will do. I used them to replace “Fortnite” with “cancer.”

It’s great having Epic Games telling me to “Get Cancer”"
39918,"It's not useful, but I always make sure to have [Clacks Overhead](https://chrome.google.com/webstore/detail/clacks-overhead-gnu-terry/lnndfmobdoobjfcalkmfojmanbeoegab?hl=en).  It's a tribute to Terry Pratchett who wrote, ""A man is not dead while his name is still spoken.""  So people came together to create GNU Terry Pratchett to keep his name alive.  It's based on the Clacks system in his Discworld novels which are basically semaphore towers they use to communicate.  GNU is a code sent by the Clacks telling the next tower to send the message along, don't log it, and turn it around at the end of the line.  That way the message is going forever.  The message in this case is Pratchett's name.  The addon lets you see which websites you visit have that hidden bit of code on the page somewhere, passing his name along and keeping him alive.  If you want to see it working, [my webpage](https://www.thelostfates.com/) has the code in the background.  But all it really does is light up the icon.  It's more fun to just run across them in the wild."
39919,"It's not useful at all, but you just made me happy knowing this exists and now I have it on my Chrome."
39920,Occupy The Bookstore. When you go to buy your textbooks on your schools bookstore website it will automatically find them at different online stores for rent or purchase usually at a much cheaper price. I saved hundreds on textbooks my final year of school.
39921,ITT: people not explaining what the extension does
39922,“I use Mechanic Aardvark! It’s great for my job!”
39923,"""Mechanic Aardvark is crap. Try Pelican Cogsnatch next time. It's even greater for your job, as well as your sex life."""
39924,"Recipe Filter - don't need to know the recipe blog author's entire life story to know how to make something? This extension pops out a window with just the recipe, saving you all that obnoxious scrolling trying to find the recipe among the bajillion irrelevant anecdotes."
39925,"I'll add a few i can't live without.

[Buster - automatically solve google captchas](https://chrome.google.com/webstore/detail/buster-captcha-solver-for/mpbjkejclgfgadiemmefgebjfooflfhl?hl=en)

[I dont care about cookies - no more annoying cookie warnings](https://chrome.google.com/webstore/detail/i-dont-care-about-cookies/fihnjjcciajhdojfnbdddfaoknhalnja?hl=en)

best in conjuncation with [cookiebro](https://chrome.google.com/webstore/detail/cookiebro/lpmockibcakojclnfmhchibmdpmollgn?hl=en) to whitelist cookies you want to keep and have chrome auto delete the rest.

Also [typio](https://chrome.google.com/webstore/detail/typio-form-recovery/djkbihbnjhkjahbhjaadbepppbpoedaa?hl=en) to stop losing everything you type when things crash/reload"
39926,"so what's worse than most cookie warnings?

California's CCPA law means that every other site pops up not just a cookie warning, but a whole fucking set of dialogs to allow me (annoy me) to set all my cookie preferences."
39927,It is a great list.
39928,"[Thredd](https://chrome.google.com/webstore/detail/thredd-useful-advice-from/nofhlafikocbioemioehbpadpgjlpeco) - http://thredd.io/ 

For finding if a link/webpage you are currently on has been submitted to Reddit or even in Comments on any Post on any sub. Really a must have for those use Reddit often."
39929,What's the main use case for it?
39930,"Sometimes you’re interested in something and want to ask Reddit about it. But if you had this and it was already said, you could just read it"
39931,That's an awesome list.
39932,Grammaery narks on you.
39934,!remindme 6 hours
39935,"I will be messaging you in 6 hours on [**2020-08-11 22:45:25 UTC**](http://www.wolframalpha.com/input/?i=2020-08-11%2022:45:25%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/chrome/comments/i7qom4/the_best_chrome_extensions_i_cant_live_without/g147z18/?context=3)

[**2 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fchrome%2Fcomments%2Fi7qom4%2Fthe_best_chrome_extensions_i_cant_live_without%2Fg147z18%2F%5D%0A%0ARemindMe%21%202020-08-11%2022%3A45%3A25%20UTC) to send a PM to also be reminded and to reduce spam.

^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20i7qom4)

*****

|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|
|-|-|-|-|"
39936,"Wow, I didn't knew a lot of them, thanks for this list, I absolutely love to discover and try new Chrome extensions."
39937,"The font one is cool, never heard of something like that before."
39938,Interested to know what idle RAM usage is?
39939,"Partizion - https://www.partizion.io/

Organize and save tabs, quickly search to find them later. Great for saving tabs (and groups of tabs) that you want to open/revisit later."
39940,"uMatrix, can usually replace every ad blocker and privacy extension because you have to click through until a page looks complete."
39941,"I did not know half of these existed 🤯 thank you! 

one I like a lot is [SharePass](https://chrome.google.com/webstore/detail/sharepass-share-accounts/ogobpofhpaediomejphdlbljncngeggl) - basically let’s you share an account without giving your password away


I find it pretty useful for Netflix Parties where not all of your mates have Netflix but you don’t want to give them unlimited access over your account etc."
39943,One more! Adguard addon is best one ever.
39944,"Hi thanks for sharing great extension just to add on this -  
[https://www.youtube.com/watch?v=CDGxyL2zE1I&t=47s](https://www.youtube.com/watch?v=CDGxyL2zE1I&t=47s)"
39945,Thank you! Great list! Does anyone know a way to test the blocking of sites that normally detect your ad blocker?
39946,"I have a few to add,

* [vGet Extension](https://chrome.google.com/webstore/detail/vget-extension-video-down/hniladkejehjfchadikcbjmgjaogciic?hl=en) to download embedded videos from some websites
* [HTTPS Everywhere](https://chrome.google.com/webstore/detail/https-everywhere/gcbommkclmclpchllfjekcdonpmejbdp?hl=en) \- Automatically use HTTPS security on many sites.
* [The Great Suspender](https://chrome.google.com/webstore/detail/the-great-suspender/klbibkeccnjlkjkiokjodocebajanakg?hl=en) \- Suspend the tabs you aren't using."
39947,!remindme 3 hours
39948,"There is a 20 hour delay fetching comments.

I will be messaging you on [**2020-09-14 16:29:44 UTC**](http://www.wolframalpha.com/input/?i=2020-09-14%2016:29:44%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/chrome/comments/i7qom4/the_best_chrome_extensions_i_cant_live_without/g587yfj/?context=3)

[**CLICK THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Fchrome%2Fcomments%2Fi7qom4%2Fthe_best_chrome_extensions_i_cant_live_without%2Fg587yfj%2F%5D%0A%0ARemindMe%21%202020-09-14%2016%3A29%3A44%20UTC) to send a PM to also be reminded and to reduce spam.

^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20i7qom4)

*****

|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|
|-|-|-|-|"
39949,Nano Defender contains Malware!
39950,Thank you for the heads-up. I've updated both posts.
39951,No problem. Let me know if you find a good alternative for that extension.
39952,"Only the chrome version contains the malware as it is done by other maintainers

while its firefox extension is malware free as it is maintained by the creator itself"
39953,Gotcha. Well this is r/chrome so I just wanted to warn OP.
39954,New edge browser extension is safe to use as original developers are developing this extension specifically for edge browser
39955,ty will save this : ) also any suggestion for pdf extension ?
39956,"As a salesperson, I can't live without [ShortURL](https://chrome.google.com/webstore/detail/short-url-breis/gmcofljannieocjefhglfanemdmkafgg) (it shortens long links), [Grammarly](https://chrome.google.com/webstore/detail/grammarly-for-chrome/kbfnbcaeplbcioakkpcpgfkobkghlhen) (it checks my typed words and indicates incorrect ones) and [SignalHire](https://www.signalhire.com/extension) (to get contact details of potential clients/biz partners, etc.)."
39957,I like to couple Minimal Twitter with [Twitter Background Restorer](https://chrome.google.com/webstore/detail/twitter-background-restor/gcjejnlljikllkloanankijokfbaelhi) to add some contrast color to my [twitter](https://i.imgur.com/jk8OCrY.png).
39958,looks sweet 🍭
39959,have you tried Dark Mode?
39960,No but [Dark Reader](https://chrome.google.com/webstore/detail/dark-reader/eimadpbcbfnmbkopoojfekhnkhdbieeh) is great!
39961,"Alright Reddit, what's missing?"
39963,"Only drawback: There is a noticable performance hit. It's not massive, but every page will take at least 1 second longer to load."
39966,"You should be able to just whitelist an entire site, literally a few clicks, one time."
39967,"True, but you need to remember to do that if it's opt-out by default. Too annoying for me personally when I first try to use it normally, something doesn't work, and then I have to try again because the extension might have interfered."
39968,I use no script for firefox(main browser) and normal chrome for when I need all scripts to work
39969,Is Privacy Badger a good alternative?
39970,[uBlock Origin's Medium Mode](https://github.com/gorhill/uBlock/wiki/Blocking-mode:-medium-mode) works very well for this too; it requires a bit of work as well.
39971,[Imagus](https://chrome.google.com/webstore/detail/imagus/immpkjjlgappgfkkfieppnmlhakdmaab?hl=en)...it opens and magnifies the pic/gif in a lil popup when you hover over it. Browsing reddit (on a deskstop) without it after having it is awful.
39972,Hoverzoom also does this
39973,Which extension had the malware? It had *zoom* in it's name or something.
39974,I definitely haven't heard that. Just looked into it and deleted the extension...thanks!
39975,"*;*  
&nbsp;&nbsp;*)*"
39976,"Great idea, thanks!"
39977,"Since this is reddit, Reddit Check is a must have extension. 

https://chrome.google.com/webstore/detail/reddit-check/mllceaiaedaingchlgolnfiibippgkmj

It checks whether a link has been submitted to reddit before or not. So we can know if there is a discussion already on going or if it's new content and not a repost. 

It's an extension which should ideally be made by Reddit itself or incorporated into RES but somehow it rarely gets a mention in these type of threads."
39978,"Honey.  Whatever website you’re shopping on, the extension will be searching the web for the best coupon codes.  I save like $5 for some items I buy off Amazon but the best I’ve gotten was $60 getting knocked of an order of contact lenses."
39979,I can't believe this got posted on Reddit without having a mention for Reddit Enhancement Suite (RES) or Reddit Masstagger!  Those two have gotta be my favorite extensions right now.
39980,I can't use Reddit on desktop without RES anymore. It's that useful.
39981,"Youtube Ratings Preview, it lets you see ratings on the thumbnail with a blue bar that doesn't get in the way. 

Youtube Magic Actions which gives you a whole load of other options while watching youtube you may find useful."
39982,"[Https Everywhere](https://www.eff.org/https-everywhere) from Electronic Frontier Foundation

 > HTTPS Everywhere is a Firefox, Chrome, and Opera extension that encrypts your communications with many major websites, making your browsing more secure. 

[Ghostery](https://www.ghostery.com/)

 > Ghostery helps you browse smarter by giving you control over ads and tracking technologies to speed up page loads, eliminate clutter, and protect your data."
39983,Better to use privacy badger (also by the EFF) rather than ghostery
39984,I'll check it out
39985,The OneNote Clipping one.
39986,I have heard this so much. I feel like I never really understand how to maximize that.
39987,[Tabs Outliner](https://chrome.google.com/webstore/detail/the-great-discarder/jlipbpadkjcklpeiajndiijbeieicbdh)
39988,My child ad blocker. May you forever be ignored.
39989,You’ll want to install a second browser for when all these extensions cause Chrome to slow to a crawl.
39990,"I heard something called The Great Suspender is also good since it's supposed to kinda freeze and out put tabs not in use to sleep or something. I haven't used it myself personally, but I've heard a lot of good things about it and that it can be value with how much RAM chrome can eat up... Especially with adding tons of other extensions as listed above"
39992,Good news. Use Great Suspender and Session Buddy so you'll completely forget about those tabs in a few weeks.
39993,"Can confirm. Been using it for more than a year now and its a life, and RAM, saver."
39995,"Wow, that's great, I didn't know about this, thanks!

Here's the pro and cons from the chrome extension page in case anyone interested. 

>	Advantages over The Great Suspender:
-	More memory savings
-	Compatible with chrome tab syncing
-	Super lightweight extension that uses no content scripts or persistent background scripts

>	Disadvantages over The Great Suspender:
-	No visibility on which tabs have been suspended
-	Unable to prevent a tab from reloading when it gains focus"
39996,"You have literally just solved a problem I've had for years. Without The Great Suspender, I'd have needed to buy more ram long ago. Yet, I've had a mysterious issue where Google websites give me errors and I'll need to delete my cookies cache to fix it weekly. I never connected that The Great Suspender could be causing it.

Thanks! I'll be switching over to The Great Discarder."
39997,"> The Great Suspender

is simply great. currently 45 tabs open, 90% in sleep modus (a couple are my regulars, many are for read later)  and RAM is not full."
39998,"This has built into Vivaldi for years now, along with a ton of other neat features."
