idx,text
58799,"Been my favourite ever since I was little, was given a bottle and it's not only a smell I love generally, but it's nostalgia and memory linked too!"
58801,My favorite for the past few years has been Play by Givenchy
58802,odeur 53. just has very fresh/clean notes to it
58803,"Abercrombie Fierce is the only one I've tried and I honestly bought it because the girl I liked said she loved it.

And who knew, they all do."
58804,Anything but Acqua Di Gio from Armani. You're supposed to wear cologne to stand out but wearing this makes you smell exactly the same as the ten other guys in the room.
58805,"It's true its popular but it smells amazing IMO. I like it more than all other colognes I've had: Aventus, Fierce, L'eau D'issey pour Homme, Polo Black, Gucci by Gucci. No lie I smell myself throughout the day when I wear AdG."
58806,"It's popular because it's nice. I didn't know you're *supposed* to wear cologne to stand out, I thought you're supposed to do it to smell nice, or at least thats why I use it"
58807,"Chrome Azzaro is my favorite scent.  I use it all seasons and all times of day.  It's not super strong, but it definitely does smell nice and attract people when you come in close contact."
58808,Can confirm. Got my first bottle for Christmas in eighth grade. Haven't looked back since.
58809,Light Blue. It's a panty dropper.
58810,Just got a whiff of this yesterday and can agree that it's a very nice scent
58811,Light Blue is my casual go-to scent when it's hot outside and I'm wearing just a tshirt. It's a little on the weak side so I have to use two sprays.
58812,"Dunhill - Pursuit. I'll use it till my last day. But like was said, everyone will be different and you'll need to experiment."
58813,Any thoughts on Miyake D'issey?
58814,Nuit d'issey is terrific. Sport is like the Budweiser of EDP's.
58815,"I have l'eau d'issey pour homme which I love, very subtle and smells lovely. It's a cologne you wear for yourself though, because there is basically no projection."
58816,I have this. Personally think its okay but my girl friends seem to love it.
58817,I agree it does not seem that the smell really projects. Doesn't last very long either.
58818,"I wear L'Eau D'Issey Intense pretty much every day – very balanced fragrance, works for day and night I think. And shockingly affordable too."
58819,Bleu de Chanel is a fantastic everyday cologne.
58820,USA Star by John Varvatos is subtle and good for any occasion
58821,"Like everyone else here said, it's more of a personal choice. However for everyday I wear a not as strong cologne. My every day cologne is Black by Kenneith Cole. It's not really strong but I only use like two or three sprays and have gotten many compliments over it. For dates I use something that'll last the whole date and a bit stronger. My personal choice is the 212 for Men. Only two sprays with that one but it's amazing. 

Here's a link to both colognes.

Carolina Herrera 212 By Carolina Herrera For Men. Eau De Toilette Spray 3.4-Ounces https://www.amazon.com/dp/B001CT079C/ref=cm_sw_r_awd_elRJvbFBVEF2K

Kenneth Cole Black By Kenneth Cole For Men. Eau De Toilette Spray 3.4 Ounces https://www.amazon.com/dp/B000E7WHLY/ref=cm_sw_r_awd_apRJvb1E13TPH"
58822,"**Kenneth Cole Black By Kenneth Cole For Men. Eau De Toilette Spray 3.4 ...** 

||||
--:|:--|:--
Current|$26.59|Amazon (3rd Party New)
High|$70.00|Amazon (3rd Party New)
Low|$21.55|Amazon (3rd Party New)
||$26.27|(30 Day Average)

[Price History Chart and Sales Rank](http://i.imgur.com/DTOieif.png) | [FAQ](http://www.reddit.com/r/PriceZombie/wiki/index)"
58823,"The only warning I have is to make sure you know what intensity you're getting. Aftershave will be the least intense, followed by eau de toilette. This is generally what most male fragrances is. The most intense is eau de parfum. I would only recommend it for people like me who have a skin effect that kills the scent quicker than it should."
58824,Polo Black
58825,"Scents are very personal. It's all about what you feel is right for you. Definitely should go to a large store like Macy's and test some out. I'm sure there's someone who could help you. 

Personally, I prefer chrome azzaro for spring and summer. It smells like the beach to me. Just really fresh and oceany. For fall and winter I usually choose a more earthy scent. That's just me though. Find something that you like."
58826,"One Million is *the* cologne for summer, but every second guy sprays that onto himself these days.

My personal favourite is joop homme, very sweet and unique smell

For dates I'd say Jean Paul Gaultier Le Male is a solid choice"
58827,"I'm actually not a huge fan of One Million. I don't mind it, it's just not great in my opinion."
58828,Creed all the way!
58829,"Sort of in line with what has already been said... You need to go to a store that allows samples, put a bit of one on your right wrist and a bit of another on your left wrist. Smell them initially and then again in 6-hrs or so, the latter smell (called ""base notes"" in fragrance wanker terminology) should be what determines which you go for. Fragrances react differently with each person's skin and their natural skin oils, so something that smells good on you might not suit me. You can also match them to the season / your outfit.

That said, you're gonna see heaps of suggestions, and this thread comes up basically once a month in MFA. Some of the ones commonly and consistently suggested are:

Burberry Brit

Bleu de Chanel

La Nuit De L'homme by YSL

Creed Aventus

Creed Green Irish Tweed

Acqua di Gio

Tom Ford - Tobacco Vanille

Armani Code

Ralph Lauren Polo Black

My personal cheat list for everyday wear colognes (if you can't be bothered with trying them out for yourself):

Polo Black

Burberry Brit

Bleu de Chanel

My date night cologne is Tom Ford Noir EDP. But lets be honest, the cologne you're wearing doesn't really mean much."
58830,Anyone here ever use John Varvatos by John Varvatos?
58831,John Varvatos classic? I do!
58832,Probably a stupid question but where should you spray Cologne? Skin or clothing?
58833,"Skin.  

I go for a spray on one of my wrists then rub them together, a spray on the bottom of my neck or the very top of my chest, and if I know I'll be getting real close to someone I'll spray a bit on my fingers and rub it on each of my earlobes so that it is very faint but noticeable when a girl is leaning in."
58834,What is a good cologne with a fresh oceany smell?
58836,"Lacoste Challenge. Super light, citrus scent. Becomes a sort of vanilla scent as I wear it."
58837,"So I've thought about the colognes I've used, and I think Acqua di Gio is currently my top choice. It's apparently overused, but I like it."
58838,I wear Burberry London in the cooler months. Still looking for a summer/spring sent but just bought Versace Man Eau Fraiche.
58839,"London has a incense-somewhat musky smell, right?"
58840,"Very earthy, tobacco/leather outdoors pine smell. Prefect for winter imo."
58841,i have been wearing [pi by givenchy](http://www.amazon.com/Givenchy-Men-Toilette-Spray-Ounces/dp/B000C1VX6M) for years
58842,"**Pi By Givenchy For Men. Eau De Toilette Spray 3.3 Ounces** 

||||
--:|:--|:--
Current|$43.19|Amazon (New)
High|$48.57|Amazon (New)
Low|$38.74|Amazon (New)
||$43.71|(30 Day Average)

[Price History Chart and Sales Rank](http://i.imgur.com/dAHYrh0.png) | [FAQ](http://www.reddit.com/r/PriceZombie/wiki/index)"
58843,"Try signing up for Birchbox. It'll get you lots of fashion based product to test out, including oddly well-chosen colognes. I've received two from them so far that are absolutely fucking bomb:

• Atelier Cologne ""Cedrat Enivrant Cologne Absolue""

• English Laundry ""Cambridge Knight""

As for my personal favorite, do yourself a favor and test out Mont Blanc ""Legend"" and Dolce & Gabbana ""Pour Homme."""
58844,I'm a big fan of Bleu de Chanel and Spice Bomb by Viktor and Rolf in the winter.
58845,I like Bottled Night by Hugo Boss and have gotten many compliments from female friends.
58846,"Bottled night is nice, but I LOVE Boss Bottled. It's marshmallow-y"
58847,"Montblanc legends. Its a good mix between musk, fresh, and fruity. Kind of smells like abercrombie fierce but it kills with girls."
58848,"I don't know why you're being downvoted. This cologne is killer.

Silly people..."
58849,"Depends where you live and the climate. If you are in a warm climate you should use lighter colognes and fragrances. The name of the sub-reddit about colognes slipped my mind, but it should be easy to find. You should head over there, the guys there know their colognes :)

Personally I wear Davidoff Cool Water durnig Spring and Summer and switch between Dior Homme, Issey Miyake and Calvin Klein Euphoria in the colder months."
58850,"I prefer warm tones. Right now I use Givenchy Play Intense, Armani Aqua Di Gio Profumo, Ysl La Nuit De L'Homme in edp. Looking for something new, preferably similar to play intense."
58851,What if your scent ends up being discontinued? This happened to me with a Sean Paul cologne I really liked (woody type one like you say) - is it just a case of starting again from scratch?
58852,I like the new Gio Profumo. it works in summer and very flexible for day or evening.
58853,"Oh, fun. I'm honestly not sure of the accuracy of this list as I'm very prone to changing my mind, but let's try:

* **Hermès Kelly Caleche EDP**; cool rose and (suede) leather; a long-standing signature 
* **Terre d'Hermès EDT**; sophisticated unisex-masculine vetiver; currently on my third bottle 
* **Guerlain L'heure Bleue**; a nostalgic, post-war masterpiece that truly tells a story; incredibly evocative
* **Chanel Le Lion**; bold and spicy, yet elegant and chivalrous; a lovely study in contrasts 
* **Byredo Bal d'Afrique**; velvety lemon and bright, grassy vetiver; just joyful 
* **Jo Malone Wood Sage & Sea Salt**; a likeable, versatile skin scent that evokes a cosy fisherman's sweater;
* **Prada Infusion d'Iris**; cool, dreamy iris; a signature for years until my skin chemistry changed 
* **Ormonde Jayne Champaca**; gentle magnolia and green tea; reminiscent of a lover's palm cupping your face
* **Nishane Sultan Vetiver**; an old-fashioned, moneyed fougere with some funk; the newest addition onto my list and one I can't stop smelling 
* **L'Artisan La Chasse aux Papillons**; truly the scent of childhood innocence, like running in the fields with white sunshine"
58854,Just gotta say this list is excellent.
58855,Thank you; it was fun to write! I hope you'll share some favourites as well.
58856,As are the descriptions!
58857,"I'm a swarthy dude and I love me some Champaca. Saw some reviews that complained about it not being what champaca smells like, but I've never smelled it and I try to not care what the marketing tries to make me think anyway. All I know is it's a lovely white floral that's just slightly different from the others and there's a creaminess in the base that gives it some extra depth and breadth. Lasts a long time too."
58858,"Ah, I love that! An expected pairing is always wonderful. Surprised people don't think this one actually smells like champaca, because I think it does, although it's not as prominent as perhaps Tom Ford Champaca Absolute.

I'm envious Champaca lasts on you, though - on me it's gone after 2-4 hours, which is tragic."
58859,"To be perfectly honest and maybe TMI, I'm a moderately hairy guy and I spray in my chest and arm hair and I almost never have longevity problems that way."
58860,"Ha ha, that's the way to do it then, perhaps! I'll try it in my hair sometime instead."
58861,"Beautiful descriptions! The last one sounds so dreamy, I’d never heard of it but I’m extremely tempted to try it based on those 2 lines alone"
58862,"Oh, it's amazing - please do get your nose on it if you can! I truly think that one's essential smelling. Also, thank you 🌸"
58863,">reminiscent of a lover's palm cupping your face

😯 

I will be smelling this on my next trip to the shop!"
58864,"Ah, I hope you get to try it soon! It opens with a rather unremarkable blend of bamboo and pink peppercorn but after ~15-20 minutes you get to the heart with champaca, basmati rice, and green tea, and it becomes so beautiful and tender; and then there's some myrhh, etc., in the base to add warmth to the concoction."
58865,"I will! There is a local store that carries them. Sounds gorgeous... I really love myrrh, and rice is an ""unusual"" note that can be lovely and aromatic."
58866,"Yes, yes, yes to Wood Sage & Sea Salt!"
58867,I get so much use out of mine - it's super versatile and always makes me smile.
58868,Fabulous descriptions
58869,☺💖
58870,"My long-winded top 10!

 1. Twilly d’Hermes - creamy ginger tuberose. It’s like putting on my favourite cashmere sweater. Both comforting and stylish. 

2. Terre d’Hermes EdT - originally bought it for my husband, but I wear it more than he does, especially when it’s hot and I crave the refreshing citrus woody punch

3. Tardes Carner Barcelona - a slight plasticy vibe at first spray, but dries down into an almond, heliotrope powdery dream

4. J’adore Dior - my first fragrance love and associated with so many great memories. It’s a bit too fruity for me to wear every day, but when I put this on for a date I feel very womanly and feminine. Also my husbands favourite. 

5. Eau des Merveilles Hermès - this one makes me feel like I’m eating oranges in a pine forest at the edge of the sea. Very laid back cool girl vibes. 

6. Champaca Ormonde Jayne - notes of rice and tea and flowers. When I wear this I can’t stop smelling myself. I can’t wait to wear this to a garden party or something. 

7. Chypre 21 Heeley - probably not a favourite for long as I am on a quest for the perfect Chypre. This one does a lot of things right - very mossy with a lovely floral edge. The longevity is really bad. 

8. Chloé EdP - another early love that I can’t quit. This one is so light and clean and feminine. I feel like it’s too young for me, but sometimes I crave it’s simplicity. 

9. Fragonard Eclat - bought this in Paris because I mistook it for another perfume I liked (Belle de Nuit - the knock off of J’adore) but ended up loving the sweet marshmallow anise dry down. The scent is discontinued, so I use it sparingly in the winter. Better than any other gourmand I’ve tried. 

10. Joe Malone wood sage and sea salt - this one makes me so frustrated. I adore the scent so much and I love wearing it. But the price! If they could make this in a version that lasted all day I’d be hooked for life."
58871,I wore both Terre and Merveilles... It's amazing what they both do with orange.
58872,You should check out Jenny Glow if you like Joe Malone wood sage and sea salt.
58873,I’d also recommend the wood sage and sea salt body Creme for longevity. I know this is purely a fragrance sub but if you can get a sample of it from a counter and use sparingly under the fragrance I find it lasts a lot longer and is really complementary used under other fragrances.
58874,Thanks for that tip! I will look into that.
58875,"Love the longer descriptions! We definitely have some overlap, ha ha, and some others that are very different. Nice to see a bit of Fragonard - didn't realise Eclat was discontinued but it was such a likeable scent; too bad. I used to love J'adore until someone stole it out of my locker in high school 🥺 

Really want to try Heeley Chypre someday; they're an interesting house!"
58876,I love Champaca Ormonde Jayne - just bought it in a beautiful green bottle at extra strength.
58877,"So you got a custom concentration? I’d love to hear how that works out for you! I don’t think I can get that in my country, but I’d consider it if I ever went to the UK."
58878,"I think you can! If you go to their website and choose 'Your Scent Your Strength Your Style' it's a new collection. It's only available in the Signature Collection, but Champaca is! You then can choose between Extract poured at 40% or Intense poured at 50%. I personally found 40% a brilliant option and not sure if I would go as far as 50% concentration.  Then you can choose the colour of the bottle. I think they also do engraving. https://ormondejayne.com/your-scent-your-strength-your-style/"
58879,Oh my God! Fragonard Eclat! I was torn to choose either this or Etoile because both were so good! I ended up with Etoile and it is in my Hall of Fame!
58880,I have both! Étoile has a special place in my heart in the summer time. I’m glad to see some Fragonard love on here.
58881,It is so hard to find Fragonard lover! LMAO. I live in a tropical country so Etoile works the best here!
58882,"I feel like since Covid, I’ve branched out a bit in my tastes bc I was so bored and ordered so many samples haha.  2 years ago, it’d be almost all aldehyde florals 

- Ormonde Jayne Woman
- Ormonde Jayne Tolu
- L’Artisan Couleur Vanille
- Guerlain Mitsouko
- Chanel No 19
- Chanel No 5
- Nicolai Cap Neroli
- Serge Lutens Un Bois Vanille
- Hermès 24 Faubourg
- Narciso Rodriguez (I have the black bottle + samples of the others, and I really can’t tell the difference between them...but I like their take on musk!)"
58883,"Love these picks! Ormonde Jayne Woman and Guerlain Mitsouko narrowly missed my list as well (ditto Un Bois Vanille, actually), and Narcisco Rodriguez is a good old friend too. I've also had my eye on Cap Neroli, but have yet to actually smell it."
58884,"We have great taste 😉

And highly encourage you to sample cap Neroli!  It’s so lovely and crisp...and not too horrible on the wallet"
58885,"I fully intend to! Love that they come in 30 mL bottles - it makes such a difference, honestly."
58886,"I’ve owned and disliked 24 Fabourg from a blind buy in Hermès for a year. I tried it again two nights ago after my shower and it was the cleanest, most elegant soap smell on me. I just adore it now!"
58887,"Isn't it strange how something can be so bleah but you try it another time and it's lovely?  I've got that going on with Chanel Gabrielle now.  I thought it was absolutely awful when I first smelled it.  I got a tiny sample at Nordy's and sprayed in the air just to remember not liking it.  Wait, what's that? Lovely ylang ylang? It's delighting me. Need a big bottle."
58888,Great choices. Mmm I love Tolu.
58889,I love Couleur Vanille! Best salt fragrance I’ve ever tried.
58890,"1. Replica - Under the Lemon Trees

2. YSL - Mon Paris

3. Viktor & Rolf - Flowerbomb Nectar 

4. Jo Malone - Wood Sage & Sea Salt

5. Stella McCartney - Stella Peony

6. Comptoir Sud Pacifique - Vanille Abricot 

7.  Replica - Jazz Club

8. Fruits & Passion - Orange-Cantaloup 

9. Tory Burch - Nuit Azur

10. Nest - Wild Poppy"
58891,"I love Stella Peony! Super bummed because as soon as I realized I liked it (I had a drawer full of samples I ""forgot"" about) it had been discontinued :( soft and spicy and so comforting for me."
58892,I have a 30 ml bottle that I’m using as slowly as possible :(
58893,Flower bomb nectar is also one of my faves
58894,"In no particular order:

1. Clinique Wrappings
2.  Amazing Grace
3.  Chanel Cristalle
4. Tiffany
5. Glow by JLo
6. Jessica McClintock
7. Diorissimo
8.  Halston
9.  Chloe (the original one from back in the 70s)
10.  Clinique Happy"
58895,"Omg Chloe original was the greatest, along with Chloe Narcisse. I'm gutted they discontinued them, I'm still trying to find a replacement for them."
58896,"I just watched Halston and I am now obsessed with smelling it. How would you describe it? also, do you get vintage or new bottles?"
58897,"I'm not good at describing all the notes, but it's a sophisticated scent that is just wonderful.  And lasts!  Started wearing it in the very early 80s.  It's the original Halston (I think there have been some later Halston scents that aren't the same).  The bottle is sort of shaped like the Jadore bottle and the fragrance itself is kind of an amber color.  You can buy it on Fragrance net.com"
58898,"I got a 2ml sample of vintage Halston from surrender to chance! It's green and floral, just a touch sweet. It reminded me of aromatics elixir. I got a lot of vetiver in the drydown, which I liked a lot."
58899,"I also dug out my old Halston bottle after having watched the movie. Mine is all glass seems pretty old. 

Smells great! I was really surprised!

I also went after Z14 and Halston Man Amber. So good!"
58900,"Ah, Chanel Cristalle.  Like a champagne rain."
58901,"1. Guerlain Mitsouko
2. Guerlain Jicky
3. TF Black Orchid
4. EL Youth Dew
5. Guerlain Shalimar

I can only give you a top 5 at this point. I am very indecisive and inconsistent!!! I love amber fragrances & chypres the most. I'm starting to get into fougeres, woody florals, and green fragrances as well."
58902,Jicky is so good.  It’s what my grandpa always wears so I can’t smell any barbershop/fougere fragrances without thinking of him.
58903,Jicky is def goated.
58904,"I so wish I (a woman) could wear Jicky because I love it, but it's just wrong on me."
58905,Caron Pour Une Homme is another classic fougere that may work. I have not tried it myself but I've heard great things from everyone who has!
58906,"This feels super hard for me because my favorites change and it totally depends on my mood, the season, what I'm doing etc. And my bottles aren't in front of me so lord knows I'm forgetting something. So I'm winging it. 30f.

1.) Tobacco Rose - Papillon Artisan Perfumes (probably the closest thing I have to a signature scent)  
2.) Cour des Senteurs Versailles - Guerlain  
3.) Chergui - Serge Lutens  
4.) Shalimar - Guerlain  
5.) Mitsouko - Guerlain  
6.) Jardins du Sud - Fouquet's (fell in love w/ this at my hotel in France and it doesn't ship to the US so I'm terrified to use that last drop)  
7.) Legare - Deconstructing Eden (indie)  
8.) Coco Mademoiselle - Chanel  
9.) Walk the Sea - Kerosene  
10.) Un jardin sur le nil - Hermes"
58907,I love Tobacco Rose!  Could you give me your impression of Legare?  I’ve had my eye on that one for a while
58908,"I can try! I'm pretty bad at describing scents though, sorry. For me there's something about it that takes me straight to summers in Hilton Head Island. The owner says it was inspired by a street in Charleston, SC (and you can find it on Google street view and it's gorgeous). It's definitely floral, which I think DE is best at, but it's a gorgeous summery floral. On the opening I smell mostly gardenia and magnolia, but you get more of a salty air smell and a slight tea smell as it settles on your skin. It lasts really long on me, and I get compliments on it a lot."
58909,"Straight 26M here. And I only have 16 fragrances so ill try regardless

1. D&G Light Blue Femme Intense (My signature scent that can be used anywhere!)
2. TF Jasmin Rouge (Sexiest Jasmine perfume ever)
3. Bleu de Chanel (Best casual perfume for me)
4. MFK BR540 (Long lasting sweet woody frag)
5. TF Tuscan Leather (Haven’t bought it yet but its the ultimate chad fragrance! I have a sample of it)
6. TF Soleil Blanc (Takes you away to a vacation in Palm Jumeirah its soo good! Haven’t bought it btw)
7. Aventus (Overrated but good for layering scents. I have many layer combos for aventus)
8. Byredo Bal d’Afrique (Fresh creamy scent that Im kinda addicted to but downside is it doesn’t last long)
9. D&G 3 L’Imperatrice (Fresh fruity melony scent)
10. Pegasus Parfums de Marly (It smells like luxury downtown, powdery and good for work)"
58910,I like that you included ur sexuality
58911,"Depending on where you’re from, the dominant culture may not be used to men wearing fragrance, so I feel like that has something to do with it"
58912,I think it's moreso that he has about 3 fragrance that is marketed towards women.
58913,"Difficult! Okay for just today, my favorites (in no order)

Michael Kors Michael 

Gres Cabotine

Serge Lutens Fleurs d’Oranger

Jean Patou Joy EDP & EDT

Dior Diorissimo

SL Sa Majeste La Rose

Chloe Roses de Chloe

Oscar de la Renta Rose

IM Pink Peony & Water Lotus 

L’eau d’Issey"
58914,"1. Lira by Xerjoff
2. Memoire by  Gucci
3. Unknown Pleasures by Kerosene
4. Karma by Lush 
5. Feminite Du Bois by Serge Lutens 
6. Lost Cherry by Tom Ford 
7. Lamar by Kajal 
8. Tobacco Vanille by Tom Ford 
9. Naxos by Xerjoff 
10. Black Perfecto by Guerlain"
58916,"LacyBardot, we are practically scent sisters and you have inspired me to create my own top 10 (a couple of mine are the same as yours; others of mine are very, very similar scents).  I need to sample the ones on your list that I've never smelled!  Thank you!!"
58917,Well let’s do a swap what scents do you have on your list that I don’t I am super curious maybe we could send each other samples?
58918,I'd love to swap samples!  Just have to figure out how I can get ahold of some vials.  I've not decanted/swapped before but I'm totally into it!
58919,Ok awesome message me when you are ready I need to buy some decant bottles too I’m thinking amazing 5ml
58920,I'll search Amazon for some 5ml as well and we can exchange!
58921,It’s so good !!!
58922,Do you think lira and unknown pleasures smell similar? Which one do you prefer?
58923,"They do smell similar however they are different animals. 
Lira is a sophisticated lady with a much deeper amber profile, her first blush is citrus and lemony with a hint of cinnamon and licorice , there is some lavender in there but it’s barely detectable and it just adds a minor clean floral note....her finish is caramel toffee on shortbread with a deep amber undertone. 

Unknown Pleasures has a sharp and bright citrus opening which quickly fades to buttered biscuits and caramel. The tonka bean in Unknown Pleasures gives that familiar well-rounded smooth Gourmand note the way it feels to eat a velvety bite of creme brûlée. There is just ever so slight hint of  Earl Grey tea but think of it as a tea served with warm milk and honey it almost is lactonic in a way. Overall unknown Pleasures is more of an obvious in your face scent where Lira is a bit more sophisticated and floral and of course amber. While they are very similar they are also incredibly different and as for someone who collects citrus gourmands I cannot live without both."
58924,How about [top 707](https://docs.google.com/spreadsheets/d/1hCucQqmEpbwk0cqRW6rJJsdDUWV22uXtLcKjHQaZXo8/edit)?
58925,This is going to take some time....
58926,Wow! Is this list in any particular order?
58927,Yes it is from top rating to lowest rating.
58928,"Oh wow, right, that makes it more interesting. I’ll have a scroll through it. Cheers"
58929,"Kouros at the very bottom? Sorry, opinion dismissed entirely! :-D"
58930,"I've limited my collection to 10 so all the ones I own I absolutely love

1. YSL LNDL
2. John Varvatos Artisan Pure
3. Dsquared2 Green wood
4. Mancera the Aoud
5. Banana Republic Vintage green
6. Mancera Aoud Lemon mint 
7. Swiss Arabian shaghaf Oud Abyad
8. Azzaro visit
9. L'Occitane eau des baux
10. Polo red extreme"
58931,Banana Republic 78 Vintage Green is so underrated
58932,For the price it's a steal. The quality is better than a lot of pricier fragrances
58933,How does it last/project?
58934,Around 5 hours with an hour and a half arms length projection. The price and quality make it absolutely worth it
58935,It has been on my wish list forever thanks!
58936,I buy them in Canada at the Banana Republic Factory Outlet. About $28 canadian dollars for the large bottle.
58937,How would you describe the swiss arabian abyad? I read so much different stuff about it? :)
58938,"It's fantastic but not the sort of thing you'd wear everyday. It's not oud at all. Blast of smoke up top like a fire after it's been put out. Also has a candy lemon sweetness that picks up over 30 mins until it's on level with the smoke. Works really well together and isn't cloying or too agressive, although you wouldn't wear it to work. You'd wear this on cold days outdoors. Performance is also very strong. It's lovely and another one which for the price has fantastic quality. Try to get a sample first since it's quite heavy if that's not your thing. Also I've heard it's a convincing clone of Amouage Interlude but since I've never tried that one I can't speak to it."
58939,"Not all of these I would wear, and in no particular order:

1. Chanel 28 La Pausa
2. Chanel Cuir de Russie
3. Chanel 22
4. Chanel 19
5. Chanel 18
6. Frederic Malle Portrait of a Lady
7. Dior Fahrenheit 
8. Naomi Goodsir Iris Cendre
9. État Libre d'Orange Experimentum Crucis 
10. Guerlain L'heure Bleue 

Though honestly, if I were to order these, I'd have to place La Pausa at the top. I just wish, wish wish it lasted longer than it does."
58940,"Ugh, so before the current iteration of La Pausa there was an earlier one that was even more beautiful and it *did* last forever. I'm still kicking myself for never picking up a bottle back then - the current iteration is also super nice but because I have a memory of the (superior) original, it feels like my heart was already stolen before."
58941,"Oh man, I never got to sample the original, that is tragic :( I wonder why they changed it"
58942,"My Designer Top 10

1. Dior Sauvage EdP
2. Valentino Uomo Intense 
3. Guerlain Jicky
4. Le Troisieme pour Homme de Caron
5. Pasha de Cartier Parfum
6. Narciso Rodriguez Bleu Noir
7. Prada Amber pour Homme
8. Mugler Angel
9. Davidoff Cool Water
10. Armaf Club de Nuit Sillage

*No clone house deserves to be on this list but Armaf.*"
58943,"Bleu noir edt, parfum or extreme. ?

Also armaf sillage that good ? Pretty much avoided Armaf as I thought they smell very cheap…"
58944,"I own Blue Noir EdT, but Narciso Rodriguez never misses. I'm sure they all smell good.

Yeah, Sillage is a 2013 batch which was fruiter and citrussy."
58945,"So far I have only had experience with designer fragrances. I really want to expand my knowledge into niche and indie - and even some old school classics that you can't necessarily find at your local Sephora today.

My list:

* Viktor & Rolf Flowerbomb Nectar
* Tory Burch Jolie Fleur Lavande
* Chanel Chance Eau Tendre EDT
* Tom Ford Ombre Leather 
* Ariana Grande Cloud
* Elizabeth Arden Green Tea
* Calvin Klein CK One
* Replica Lipstick On - sadly, don't own this one
* Byredo Rose of No Man's Land - sadly, don't own this one
* Byredo Bal D'Afrique - sadly, don't own this one"
58946,"Byredo is niche, so you've got yourself started at least. Obviously, I love BdA as well 💗

I really wish someone could make a little discovery sample set of fragrance classics like Jicky, L'Air du Temps, even Fracas ha ha. I've smelled most of them but it took me years! Definitely worth the journey, though."
58947,Surrender to Chance has some classic sampler packs that are at least in the vicinity of a discovery set for the greatest hits of fragrance.
58948,"Oh, that's fabulous to hear; I'm glad that exists. They seem like a cool company."
58949,"I’ve never even thought of that but that would be awesome, if anything just so you can say you’ve smelled them (something like Fracas for example which, most people nowadays probably wouldn’t wear, but if you’re into fragrances it’s like essential sniffing)"
58950,"Yes, 100%! It just makes it so much easier to talk about fragrances. Like, if you enjoy tuberose especially, Fracas is a touchstone - knowing it makes it easier to communicate what other tuberose fragrances are like."
58951,"1. Habit Rouge EDT

2. Heritage EDT

3. Dior Homme Original

4. Eau de Guerlain

5. Terre D'Hermes EDT

6. Endymion Original

7. Declaration EDT

8. Opus 1870

9. Aventus

10. Le Male"
58952,Kinda cool that I own (and love) half this list.
58953,"Oh nice, can I ask some of your faves because I might like them and am just interested anyway?"
58954,"My all time favorite is TF Beau de Jour. it just works on me. Need to include Chanel Platinum Egoiste and Prada Luna Rossa Black for that same reason. After that, I’d say Creed Himalaya (even though it’s so similar to CPE), TF Ombré Leather, and for something less serious and more fun, Eros."
58955,"Cool, thanks. Sometimes the fragrance chooses you."
58956,"Chanel 19 parfum

Guerlain Chamade

Serge Lutens Borneo 1834

Guerlain Nahema parfum

Chanel Bois des Iles

Tom Ford Fleur de Chine

YSL Nu

Amouage Homage

Satori Eau de parfum

Ostara"
58957,I grew a Nahema climbing rose on my front porch because of that Guerlain fragrance. It’s exquisite.
58958,"Yay, another Fleur de Chine lover! 💞"
58959,"In no order:

1.	**Original Vetiver**: clean and soapy vetiver, perfect spring and summer fragrance!
2.	**YSL LNDL**: ultimate date and summer night fragrance for me, loads of sweet-spicy cardamom and lavender.
3.	**Bleu de Chanel**: the most versatile fragrance and one of my first loves, EdP is my fav concentration.
4.	**Platinum Egoiste**: recently found this beauty, the best aromatic fougere I have smelled full of masculine barbershop goodness while still being modern!
5.	**Bois D’argent**: so simple yet complex, warm and soft but some of the best sillage I have ever experienced.
6.	**Memoirs of a Trespasser**: boozy and woodsy vanilla, I love this one. It sits almost like a second skin on me and lasts for days! 
7.	**Tuscan Leather**: this is what you wear to feel confident, smokey leather with a touch of raspberry to brighten it up, to die for!
8.	**Tobacco Vanille**: the best holiday fragrance ever, warm vanilla and spices all on top of dry tobacco, deliciously sexy.
9.	**Floris Santal**: this is a refined gentleman fragrance, it can be worn whenever, but definitely goes best with a suit. Nutmeg, lavender, and sandalwood are the main players on my skin!
10. **Happyland Signature**: half a spray is all you need to smell like a warm apple pie that is baked til golden brown. My favorite gourmand and reminds me of the holidays, perfect cold weather fragrance!"
58961,"Yardley lavender was my mom's scent as well. I had no idea it had been ruined, I think picking up the awful one at one point might have ruined my taste for lavender forever."
58962,"1. Chanel No 19 Poudre
2. Dan Tes Bras Frederic Malle 
3. L’eau D’Hiver Frederic Malle 
4. Iris Nobile Acqua de Parma 
5. Fico de Amalfi Acqua de Parma 
6. Contre Moi Louis Vuitton 
7. Black Jade Lubin 
8. Roses Vanille Móntale 
9. Quelque Fleurs Houbigant
10. Jardin Sur le Nil Hermès"
58963,"L'eau d'Hiver is such an underrated scent; ditto Dan Tes Bras. I really do feel that the lighter, airier Frédéric Malles do not get enough attention."
58964,"They are both great iris scents that get overshadowed by Lipstick Rose and Iris Poudre. I’m slightly allergic to the incense in Portrait of a Lady. I also forgot my number one from last year was Grand Soir MFK. I needed warmth in my quarantine, apparently."
58965,"I really need to revisit Grand Soir. I remember preferring the other MFKs to it, but I think it's one that may really need more time to grow. It has such a lovely name, too."
58966,"1. Alexandria II , Xerjoff
2. Bois du Portugal, Creed
3. Layton, PdM
4. Percival, PdM
5. Uden, Xerjoff
6. Straight to heaven, Kilian
7. Nouveau Monde, Louis Vuitton
8. Reflection Man, Amouage
9. Elysium, Roja
10. Les Sables roses, Louis Vuitton"
58967,"1- Tauer, L'air du Desert Marocain... so smoky, leathery (the good, birchy kind, not the overly synthetic kind), and densely spicy, and yet also sparkling, aromatic, and airy. I can't find anything wrong with this one.

2- Serge Lutens, Fille en Aiguilles... evocative nostalgic pine forest smell; it captures the sweetness of hot dry pine in summer (even though people say this is a Christmas/winter scent).

3- Serge Lutens, La Fille de Berlin... a smooth, herbal, honeyed, and slightly crisp rose. Classy and pretty, this is one of the more ""womanly"" scents I have (though a man could wear it, of course), and I love that it still has a slight edge to it, because Lutens.

4- L'artisan Parfumeur, Safran Troublant... FdB can be my spring/summer rose, and this can be my winter rose. A spicy floral-vanilla that's cozy, yummy, and a bit sexy at the same time.

5- L'artisan Parfumeur, Tea for Two... the best tea scent, like very aromatic earl grey with some extra smoke and spice. It reminds me of an austere intellectual woman who likes fine things.

6- Comme des Garcons, Incense: Avignon... I just really love frankincense and while am still exploring trying to find \*the one\*, I love that this feels easy to wear (casual, and soft somehow), while still standing out as arty and a bit edgy.

7- Comme des Garcons, Hinoki... a meditative spa in a wet forest... very true to its inspiration.

8- Frederic Malle, Portrait of a Lady... a lot is crammed in here: fruits, spices, incense, patchouli, ROSE, amber. I usually prefer minimalist-leaning fragrances, but this is just undeniably great. Maybe the fanciest thing I have (I am not fancy; I don't have a full bottle or anything, just a decant!).

9- Lush, Karma... a fave of younger me. I don't own it anymore but I want to get it again. I feel incredibly nostalgic when I smell it. And it still fits the profile of things I like... a little spicy, a little fresh, earthy, aromatic, coniferous. 

10- Guerlain, Mitsouko... I felt the need for a classic on here I guess; there aren't many I've tried yet but this is the one I've found most compelling. The peach note is so realistic compared to newer renditions of fruit, which mostly smell like candy. I'd love to smell an older formulation with real oakmoss.

Thanks for the prompt, it was fun! And I only own two of these as full bottles, so this clarified where I might want to focus my next purchase."
58968,"More artisans and small makers in my list than mainstream fragrances, but I hope that's okay, since maybe some could find a new perfumer whose work they enjoy.

* **Barrister and Mann Fougère Gothique** A dirty opening, and then the most lovely dark floral/forest/gravesite drydown ever.

* **Chatillon Lux Weinstrasse** A sun-suffused lazy autumn afternoon sitting in a vineyard, with a field of freshly mown hay across the way. Simultaneously sweet and dry.

* **Hermes Terre d'Hermes** Bright yet earthy; oranges, vetiver, and slate.

* **Southern Witchcrafts Samhain** Boozy pumpkin and tobacco. The aftershave actually smells better to me than the EdT, but whaddya gonna do?

* **Stirling Soaps Port au Prince** Vetiver and lemongrass. Can brighten up Encre Noir or add some depth to Terre d'Hermes, whether in aftershave or EdT formulation. Speaking of which:

* **Lalique Encre Noir** An abandoned church in an old forest. Dark inky vetiver.

* **St. Charles Shave Sandalwood From Wood** A defunct company, so no way to buy more, but damn if this isn't just straight wonderful *santalum album*. Distilled in-house and impossible to replicate 100%, but just lovely. You didn't ask ""what fragrances that I can buy,"" but what my favorite fragrances are. This is one.

* **Hexennacht Ceci N’est Pas Une Pipe** Tobacco leaf with honey and a bit of spiced vanilla.

* **Apothecary's Garden Babylonian Beard Wax** Not an EdP or Edt, but this post asked for favorite fragrances, and this is one. Frankincense and labdanum, with a tiny hint of tonka and the beeswax used in the mixture. Smells like a world-traveling trader may have smelled 2000 years ago, and that's a beautiful thing.

* **Barrister and Mann Hallows** Not-sweet-at-all raw cocoa with dank vetiver and oakmoss. Smelling a cocoa bean whilst walking through a swamp.

Edit: I totally forgot **MPeG Santal Noble**, which I really loved, but haven't smelled the reformulation."
58969,"Fougere Gothique is fantastic, but I think I couldn't wear the mushroom scent with confidence. Love the shaving soap tho :)"
58970,"I’m going to try my hand at this. I’m a woman in my early 20s. This list is also in no order, and it’s all over the place since I’m really indecisive! I also own mostly sample sizes and small decants. I’ve also only got 9 to put on the list so appologies! 

1) Tocca Stella by Tocca - this was my perfume throughout high school and there’s something wonderfully nostalgic in the oranges

2) Elie Saab Le perfume - started wearing this the last year and the faint honey note is my favourite 

3) Hermès Un Jardin en Méditerranée - makes me feel like I’m at a river at the edge of a forest on the hottest day of summer 

4) Afnan Souvenir Floral Bouquet - nothing else I buy smells like this. It’s underrated and unique. 

5) Amouage Epic - in the best way possible smells like homemade tea blends 

6) Tom Ford Black Orchid - I used to wear this to bars back when they were open, it’s so smooth and dark and I think sensational. 

7) Aqua Allegoria Nettare di Sole by Guerlain - it just smells like outside, or like warm and pleasant 

8) Sì by Giorgio Armani - it’s pleasant and simple, I wear this to work most days. 

9) Fleur de Portofino by Tom Ford - flowery, possibly my favourite scent. A gift from an ex boyfriend so I don’t wear as often, but it makes me think of being outside at a flower garden"
58971,Could you tell me more about the Afnan one? Are the notes listed on the website accurate?
58972,"Yes! I find the initial spray to be more of a warm fruit smell, which is I assume the rhubarb. Then the dry down gets more floral, but with a musky scent too. My description doesn’t really do it justice, it’s a really unique scent! I’d recommend!!!"
58973,"I don't really have a top 10 necessarily, but 10 I love... Kouros, Jicky, Leather Oud, Caron Pour un Homme, AdP Colonia, Eau d'Hermes, Chanel Pour Monsieur, Interlude Man, Dama Bianca, Declaration."
58974,"Apart from your loves of aromatic fragrances and fragrances from the 60s/70s, we're a similar age with similar-ish tastes. Swap aromatic for sweet and earthy for vanilla.

- Cartier La Panthere
- Narciso Rodriguez EDP
- Mugler Alien
- Cartier Baiser Vole
- Narciso Poudree
- Burberry London for Her
- My Burberry Black
- Mancera Velvet Vanilla
- Dolce and Gabanna The One
- La Nuit Tresor a la Folie

*Subject to change 😏"
58976,"It is a very light scent, I agree. I almost didn't buy it because of that but I love the smell. It's class in a bottle to me."
58977,"Oooh fantastic! This is difficult as my collection is now nearing the 100 bottle mark I think... But, in no particular order:

* I: **Amouage, Overture Man** This is simply one of my favourites full stop. Classy, boozy, seductive, basically confidence in a bottle. 

* II: **Tom Ford, Tobacco Oud Intense** My first proper foray into oud and tobacco and it was love at first sniff. Rough around the edges but exquisite in its overall composure. 

* III: **UNUM, Lavs** Must be pre-reformulation with the transparent side glass and lovely black and gold colouring. This, to me, is the pope smoking a cigar. It is incense, burning, and some layer of smoke too. This simply is the greatest scent (to me) I have ever smelled. 

* IV: **Xerjoff, Naxos** Again, love at first sniff. This is basically now my signature scent and I adore it. Sweet, sticky honey with a heavy dose of wet tobacco leaf. This is basically sex in a bottle. 

* V: **Initio, Oud for Greatness** I have samples of BR540, and a bottle of this, and as much as I might be shot for this opinion, to my nose OFG is basically a more masculine version of BR540. The best thing is my FWB enjoys wearing my BR540 samples, and I enjoy OFG, so we make a ridiculously good smelling pair. 

* VI: **Parfums de Marly, Carlisle** Now, I wanted to put Herod here instead but having a hard think, I would go Carlisle just for the difference. Carlisle, to me, is the bastard love child of Herod and Layton. The apple, woods, vanilla, tobacco(maybe?) scent is lovely, and it performs like a beast on me. So for the difference, PDM Carlisle it is. 

* VII and VIII: **Creed, Viking/Green Irish Tweed** Two for one here I guess... Viking and Green Irish Tweed are my two favourite Creeds and both match different day types to me. Green Irish is fresh, warm, sunny spring whereas Viking suits drizzly spring (needless to say my Viking bottle has been used a lot more here in the UK than GIT). But both are spectacular scents and feel upper class and gentlemanly. Suits my lecturer look and profession I guess. 

* IX: **Armani Privè, Bois D'Encens** This is a deep, dark, resinous incense and is probably my favourite out of my vast collection. The darkness in this is surpassed by Heeley's Eau Sacrèe, but I feel APBD'E is far more wearable and is much more akin to the type of incense I really enjoy. 

* X: **Amouage, Interlude Man** The Blue Beast which sent me down the rabbit hole of niche fragrances. Since Amouage is my favourite house I don't think I could ever be without this!"
58978,"Naxos is my signature (right now) too haha. But I love Carlisle —— imagine my heartbreak when my wife recently said “ewww what are you wearing, you smell like an old lady” 🥺😭"
58979,"Been hearing alot about Xerjoff lately but not that. That's a tough one 😆

(Dm'd you)"
58980,"In no particular order :

* Thierry Mugler Pure Malt

* V&R Spicebomb

* Creed Aventus

* Nasomatto Baraonda

* Abercrombie & Fitch Fierce (vintage)

* Amouage Interlude Man

* Chanel Egoiste Platinum

* MFK Baccarat Rouge 540(eau)

* YSL Kouros

* Mugler Cologne


My favorite note is **Ambergris/Ambroxan**!"
58981,"Funny!  I really like almost everything on your list, a lot, and yet I really don't like ambroxan (e.g., rules out BR540 for me)."
58982,"Interesting that almost every single list has a Guerlain.

They've been cranking out some amazing fragrances, I'm glad to see that other people love them too."
58983,"Ahhh these are always so fun! I'm a gourmand lover and I rarely like anything too citrusy or bright. Fall/Winter scents are my favorite. I can't say this list will look the same in a week, but that's kinda the fun of it, right? 

1. Alkemia Silken Tent - my signature, and some reviewers say it probably smells like Regina George
2. Hexennacht Black Mass - woody dark patch, incense, smoked vanilla, and marshmallows in a smoldering fireplace
3. Chanel Coromandel EDP - Incomparably elegant and beautiful and reminds me of my grandma in the best way - as she was when I was very small. 
4. Mugler Angel Muse EDT - one of my first fragrances! That nutella and passionfruit is perfect
5. Alkemia As Dark Things Are Meant To Be Loved - the most complex, sexy, dark smoky gourmand for date nights
6. Guerlain Gourmand Coquin - delicious dark chocolate and rum
7. Hexennacht Nightshade - a warm, aromatic green spicy floral
8. Lancome La Nuit Tresor - delicious fruity floriental 
9. Area of Effect Game Over - temple incense and glorious rising smoke
10. Possets Empress Cixi - A stunning dragon's blood and incense scent"
58984,I named my cat Cixi after that empress! I seriously need to check out that fragrance!
58985,"It is unfortunately part of the Orphans retour, and is only available for a couple months a year. Last year I believe it was available in August?"
58986,"Thank you, I’ll keep my eyes open!"
58987,"Hmmmm. 


1) Dior Homme Intense / Angels Share


2) Dior Homme Intense/ Angels Share


3) Dior Feve Delicieuse 


4) Dior Homme Cologne


5) Shay and Blue Salt Caramel


6) PDM Herod


7) BR540 EDP


8) Eau Sauvage


9) Chanel Coromandel


10) Gold Knight by Killian


Yes, Dior is probably my favourite house. I could quite honestly build a purely Dior collection and be very happy with it."
58988,"Not in order:

1. Rouge Bunny Rouge Lilt

2. BDK Gris Charnel

3. Diptyque Philosykos

4. Hermes Un Jardin Sur le Toit

5. Solstice Scents Midnight Marquee

6. L'Artisan Parfumeur Passage d'Enfer

7. Ormonde Jayne Ormonde Woman

8. Sylvaine Delacourte Virgile

9. By Killian Roses on Ice

10. Jo Malone English Oak and Hazelnut"
58989,"1. Maison Francis Grand Soir (full bottle. People say I smell like cookies). 
2. Byredo flowerhead (best tuberose scent and lasts and lasts)
3. Vilhelm parfumerie Dear Polly (lovely easy tea scent. Feel expensive but I’m not sure exactly why)
4. Bond no 9 Greenwich village (just sample sample because the bottle price is crazy. Wish they’d make a 50ml bottle) 
5. Ds and Durga debaser (a fig that lasts and always makes me happy. I dream about this scent)
6. Diptyque philosykos edp (doesn’t last but I enjoy it. Haven’t purchased a full bottle but I’m tempted now and again). 
7. Le labo another 13 (first scent to get me into fragrance. I can smell it intensely and it’s like wearing cashmere)
8. Le labo tonka 25 (balsamic and cozy) 
9. Mmm replica by the fireplace (just wear this one at home and have a travel size)

Some I’m liking but still sampling: Chanel Jersey, pdm delina, Chanel 1957 and mfk petit Matin."
58990,"Philosykos doesn’t last on me either, which is why I wear Fico de Amalfi by Acqua de Parma. It just wears all day on me and is a very similar green fig to Philosykos."
58991,I only smelled that one on a tester and I remember liking it. I should try it out again.  Thanks for the info.
58992,"1) Comme de Garçons Hinoki
2) Serge Lutens Fille en Aiguilles 
3) Diptyque Philosykos 
4) Dasein Winter
5) Le Labo Thé Noir
6) Le Labo Santal 33
7) D&G Light Blue
8) BDK Perfumes Gris Charnel
9) Stella Peony
10) Serge Lutens De Profundis 
11) Jo Loves Red Truffle 21
12) Serge Lutens Santal Majascule (unfortunately doesn’t last on me)
13) Dior Ambre Nuit
14) Frederic Malle Dans de Bras
15) Byredo Rose of No Man’s Land"
58993,"A very limited selection of diversity because Jo Malone is the only brand I have bought myself in my life and I've tried a fair few ones in the range, but I definitely have preferences, in no particular order 

\- Wood Sage and Sea Salt. Very nice, musk and unisex scent, non offending. Smells good on its own for the short period it lasts but also very good for pairing.

\- Myrrh and Tonka. Amazing. Sweet, heady, aromatic and very pronounced notes of lavender but not overdone, a very sexually appealing smell and definitely unisex. Very good paired with something floral or citrus but smells incredible on its own and high impact.

\- Mimosa and Cardamom. Same as above, while it can be paired with something, it can definitely be worn solo because of how unique the smell is. Creamy, unusual and enveloping. Also unisex.

\- Amber and Lavender. I LOVE LOVE it. Strong, clean, soothing, sexy and soapy, like a posh barbershop. Another unisex scent, I would argue that while it is still feminine it is more leaning towards masculinity. This is one I would wear on it's own, but still good for layering.

\- White Moss and Snowdrop. A limited edition but a very unique and sophisticated scent, clean, dry cut and powdery. Despite the name leaning towards Winter this one can definitely be worn all year round. Yet again, unisex.

\- Wild Bluebell. Wouldn't be my complete favorite but very pleasant nonetheless, not hugely impactful but a beautiful, simply floral scent. Very good for pairing with a more heavy scent to give a lovely floral twist. 

\- English Pear and Freesia. Beautiful fruity scent, easy to wear and enjoyable and comforting.

\- Basil and Neroli. Very strong and unique, feminine but leaning more towards masculine, smells delicious.

\- Vetiver and Golden Vanilla. This one reminds me of Myrrh and Tonka a lot but is like a copy and paste version, very smoky and sharper. While it is unisex I would also argue this one is more leaning towards the masculine side.

\- Wild Fig and Cassis. Warm and sexy and delicious, very comforting and the fig note is very pronounced. A firm favorite with a high place on the list. 

Lmao I need to be more adventurous and try different brands for a change."
58994,"Top 10 is tough but I know a past, present and future all time great and probably one of the GOAT, Dior Fahrenheit."
58995,"In no order. I’m 43F


Quelques Fleurs Royale-Houbigant


Chloe-Chloe


In Love Again- Guerlain (discontinued and hard to find the original)(the love of my life but with the longevity and sillage of rose water)


Dahlia Divin-Givenchy


Flowerbomb-V&R


j’adore-Dior (husband lives but I’m finding it sickly sweet as I get older)


Jour d’Hermes Absolu-Hermès 


Baiser Vole- Cartier


Paloma-Paloma Picasso (the 80’s in a bottle-I rarely wear it because it’s an ass kicker but has sentimental value to me and also my husband hates it, passionately)


Good Girl Gone Bad-Kilian


Also, what a great post. Off to find a sample of Ormonde Jayne Champaca!"
58996,Isn't In Love Again from YSL?  Or does Guerlain have one with that name too?
58997,Crap. You’re right. Don’t have a bottle anymore to look. So sad—I love that stuff.
58998,It's one of my treasures.
58999,"Super hard. Besides 1 and 2 the list changes daily
I'm rating based on my favorites right now, not of all time, as I simply couldn't do it

1. Chris Russak AEOOJ

2. Marc Antoine Barrois- Ganymede 

3- Tauer- Un rose de Kandahar PHI

4- Tirenzi- Orion/Nishane-Hacivat

5 Creed- GIT

6 ELDO- Herman

7 Serge lutens-Arabie

8 Ralph Lauren Purple label

9 TF- Ombre leather/tuscan leather

10 Frederic Malle- Musc rav."
59000,"In no particular order!

Florabotanica by Balenciaga  
Vie est Belle by Lancôme  
Black Opium by YSL  
Donna Born in Roma by Valentino  
Aqua di Gioia by Giorgio Armani  
Crystal Noir by Versace  
Libre by YSL  
Beauty by Calvin Klein   
Happy by Clinique  
Cloud by Ariana Grande

Yes I’m a basic B"
59001,"I like 3 from your list, so maybe I’m also basic! No shame though."
59002,"1. Indonesian Oud Zegna
2. Francesca Bianchi Sticky Fingers
3. Ultra Male JPG
4. Replica Jazz Club
5. Zaharoff Signature pour Homme
6. Montale Ristretto Intense Cafe
7. Serge Lutens Chergui
8. Mugler Pure Tonka 
9. V&R Spicebomb Extreme
10. French Lover Frederic Malle"
59003,"1. Eccentric molecules 01
2. Tova signature (QVC)
3. Original musk by cabot labs
4. Ralph Lauren Blue
5. Comptoir Sud pacifique vanille     abricot.
6. ""  ""  "" Vanille coco
7. Origins ginger essence spray
8. Nemat Himalayan musk oil (whole foods).
9. Kenzo Jungle
10. Joe Malone grapefruit"
59004,Ralph Lauren Blue.  Such a gorgeous scent.
59005,I've seen the Tova scents on QVC and I've always been curious about them.
59006,I highly recommend her signature scent...so delicious 😋
59007,"Here’s my top 5 in no particular order. 

1. TF Soleil Blanc
2. Olivine Atelier Amongst the Waves
3. Nest Sunkissed Hibiscus 
4. Clean Warm Cotton
5. TF Soleil Neige"
59008,"My top 10 and this can change like the seasons lol

1. Burberry touch- One of my fav scents gotten alot of love.

2. prada llhomme/llhomme intense- llhomme was the scent that started my love affair with prada i couldn't decide between the o.g and the intense.

3. PDM oajan- My fav from the house more that herod and layton tho i love both.

4. MM by the fireplace- It was hard to pick between jazz club and BTF for me so this is one that might change depending on the mood.

5. Prada luna rossa carbon- My 2nd favorite blue scent and one of my dumb reaches it works perfectly for me.
6. Y EDP- My favorite blue already went through one bottle.

7. Creed green irish tweed- My first creed fragrance green and clean.

8. MB individual- I've went through 3 bottles of this already and i'm hurting that it's discontinued.

9. Stronger with you- My dumb reach in the winter it kinda reminds me of eros i wanna try out the intensly.

10. commodity tonka- It was a love at first sniff.

HM: mont blanc explorer, one million lucky,aqua di parma colonia essenza, aqua di gio profumo."
59009,"Don’t have a top ten, but Tom Ford Noir Extreme and Prada Luna Sport are top 2. Hands down. I LOVE these scents so much."
59010,"* Aventus
* Layton
* Herod
* Carlisle
* Oajan
* Pegasus
* Percival
* Sedley 
* Galloway
* Godolphin"
59011,"1. D&G The One

2. Armani code

3. Burberry London

4. A&F Fierce

5. Acqua Di Gio Absolu 

6. Cool Water

7. Bleu de Chanel

8. Le Male

9. polo sport

10. Polo Double Black"
59012,"Okay, off the top of my head (and only in rough order:

- Van Cleef and Arpels Rose Rouge
- Kilian Love Don’t be Shy
- L’Artisan Mure et Musc
- Carner Tardes
- Narciso Rouge
- Narciso Poudree
- Bdk Rouge Smoking
- La Labo Santal 33
- Le Labo Another 13
- Elizabeth & James Nirvana Amethyst"
59013,"From both men/women's line

1. Guerlain L'Instant EdT/EdP
2. Neige de Lise Watier
3. Creed Green Irish Tweed
4. Amouage Portrayal Woman
5. Creed Erolfa
6. Creed Millésime Impérial
7. Hugo Boss Orange Sunset
8. Parfum de Marly Sedley
9. Parfum de Marly Godolphin
10. Bvlgari Aqva Pour Homme"
59014,I would add Terre d'Hermès too
59015,"I'm new to the scene, so this is all very tentative. Also, if anyone has suggestions based on my choices, I'd love to hear them!
1. Violet Ends by Boy Smells 
2. D.S. by D.S. and Durga
3. Windows Down by Henry Rose
4. Dark is Night by Henry Rose
5. Spring by Dedcool
6. Olmstead & Vaux by Phlur
7. Hepcat by Phlur
8. Moab by Phlur
9. Queens & Monsters by Henry Rose
10. Burning Barbershop by D.S. & Durga"
59016,"1. Royal Oud (heavenly, timeless, classy)

2. Aventus (120ml bottle days, not anymore)

3. Noir de Noir (this is what a deep & intense perfume should smell like)

4. Soleil Blanc (this is what light & easy to wear perfume should smell like)

5. Neroli Portofino Forte (sparkling, zesty, refreshing but obscenely priced)

6. Aventus for Her (Better than Aventus but so feminine thankfully, I am not tempted to wear it)

7. Royalle Muske (because Old Spice doesn’t smell the same as 20 years ago)

8. Davidoff Cool Water (most bang for buck scent)

9. LNDL or TdH(Both are a must-have for everyone starting a collection)

10. Kiehl’s Original Musk (most bang for buck musk)"
59017,"Mugler Angel EDT

Sarah Jessica Parker Lovely

Elie Saab Girl of Now Shine

Hanae Mori EDT

Jimmy Choo EDP

Jimmy Choo Illicit

Valentino Valentina

Roberto Cavalli EDP

Al Rehab Choco Musk

Symmetry Lab Naked Temptress"
59018,"So many to choose from! But currently:

1. Hermes Un Jardin en Mediterranee - my ultimate favorite

2. Le Labo Thé Noir 29

3. Le Labo Rose 31

4. MFK BR540

5. Byredo Pulp

6. Le Labo Santal 33

7. Tom Ford Oud Wood

8. Lanvin Eclat D'Arpege

9. ELDO Divin'Enfant

10. Avon Little Black Dress

Runners up:
Jovoy L'Arbre de la Connoissance
Tom Ford Champaca Absolut
Le Labo Another 13
Agua de Sevilla Agua de Naranjos
Moschino Toy Boy
Britney Spears Curious"
59019,"1. Frederic Malle - Portrait Of A Lady

2. Frederic Malle - Musc Ravageur

3. Frederic Malle - Monsieur

4. Frederic Malle - The Moon

5. Frederic Malle - Une Fleur De Cassie

6. Frederic Malle - Music For A While

7. Frederic Malle - Carnal Flower

8. Frederic Malle - Dries Van Noten

9. Frederic Malle - Geranium Pour Monsieur

10.Frederic Malle - Promise"
59020,Remindme! 2 days
59021,"There is a 74 hour delay fetching comments.

I will be messaging you on [**2021-05-26 19:25:04 UTC**](http://www.wolframalpha.com/input/?i=2021-05-26%2019:25:04%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/fragrance/comments/nk4v82/top_10_favorite_fragrances_of_all_time/gzb2hb6/?context=3)

[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2Ffragrance%2Fcomments%2Fnk4v82%2Ftop_10_favorite_fragrances_of_all_time%2Fgzb2hb6%2F%5D%0A%0ARemindMe%21%202021-05-26%2019%3A25%3A04%20UTC) to send a PM to also be reminded and to reduce spam.

^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20nk4v82)

*****

|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|
|-|-|-|-|"
59022,34m. my personal favorite is gucci guilty pour homme edp. such an interesting scent i can’t recommend enough
59023,"•adg profumo
•la nuit de l'homme
•versace eros edp
•cdn intense man edp
•cdn milestone
•cdn sillage
•1981x alexandria fragrances 
•bleu de chanel edp
•cedrat boise
•the one edp

Nothing spectacular, I know. I think I'm gonna get more into Alexandria Fragrances. I like a lot of their takes on popular fragrances with their own twists"
59024,Amazing list OP I have every single one of those fragrances on my shelf!  Glad to see I'm not the only one who loves  the classics from the 70s.
59025,"Azuree, Aliage and Aromatics Elixir.  I like your style! 

I want to try Jardins de Bagatelle and Chant d'Aromes very much."
59026,"Pretty new to the fragrance game, but here it goes (in no particular order):

Replica Jazz Club

Le Male

Dior Homme Cologne

La Nuit de L'homme

D&G the one EDP

Spicebomb Extreme

PDM Layton

MontBlanc Explorer

Well I guess I only have 8 that I consider ""top""."
59027,"1. Esprit, Life 

2. J. Lo, Still

3. Dennis Baso, Dennis Baso

4. Chloe, Love Story 

5. Rihanna, Crush 

6 Elie Saab, Elie Saab
 
7. Gucci, Guilty 

8. Carolina Herrera, Good Girl

9. Adam Levine, Adam Levine For Women

10. Marc Jacobs, Decadence Divine"
59028,"Acqua di Sale - Profumum Roma

Milk musk - Molton Brown

La vie est belle l’absolu

Lamar - Kajal 

Addict - Dior

Fils de Dieu du riz et des agrumes - Etat Libre d'Orange

Blossom love - Amouage

Sleeping with ghosts - Mark Buxton

Blu Mediterraneo mandorolo di Sicilia - Acqua di Parma 

Baccarat Rouge 540"
59029,"1. Xerjoff Dama Bianca
2. MFK gentle fluidity gold 
3. Van Cleef and Arpels Bois Dore
4. Replica whispers in the library 
5. Burberry Her
6. PDM Delina Exclusif
7. JPG classique essence de parfum 
8. Van cleef and arpels santal blanc
9. Atelier cologne Clementine California 
10. Penhaligons Equinox Bloom"
59030,"I have a designer nose so with that out of the way here goes:

Maison Margiela REPLICA Jazz Club

Tom Ford Ombre Leather

Chanel Bleu de Chanel EDP

Jean Paul Gaultier Le Beau

Tom Ford Tobacco Vanille

Lalique Encre Noir

Tom Ford Oud Wood

Givenchy Gentlemen Boisee

Tom Ford Neroli Portofino

Chanel Allure Homme Sport"
59031,"Not exactly the 10 I have in my collection right now, but since we’re saying “of all time”, I think about the ones below in no particular order. 

1. Aventus

2. Millesime Imperial 

3. Bleu de Chanel

4. Terre d’Hermes

5. JPG Le Male

6. Abercrombie Fierce

7. YSL La Nuit de L’Homme 

8. PdM Layton

9. Dior Homme (original)

10. Chanel AHSEE"
59032,Chypre huh? I love it and I have a aftershave of Chypre bit the company does not make it anymore so I’m really holding on to it.
59033,"Hmm, top 10? I’ve had a lot of cologne they the years. I’m merely making a list, not upon best or whatever:

1. Acqua di Gio
2. Jovan Musk
3: Alfred Desire of a man Res.
4: Dolce and Gabanna
5: Clinique Happy
6: Lolita Lempicka
7 The original Angel Men
8: Cremo Blue Cedar and Cypress
9: Vera Wang for men
10: DKNA Be Delicious Men

Whew! Lol"
59034,"1. Lolita Lempicka Au Masculine Vintage 
2. Dior Homme Intense (2011)
3. Rasasi La Yuqawam 
4. Carthusia Terra Mia
5. Zegna Florentine Iris
6. Maison Francis Kurkdjian Grand Soir
7. Jo Malone English Oak & Hazelnut
8. Dior Sauvage EDP 
9. Tom Ford Ombre Leather 
10. Yves Saint Laurent Opium"
59036,Hah Womanity did the same to me. Takes a bit doesn't it!
59037,"In no particular order:

❤️Guerlain Spirituese Double Vanille❤️
❤️Montale Sweet Oriental Dream❤️
❤️Serge Lutens Un Bois Vanille❤️
❤️Chanel No 5 Premiere❤️
❤️Chanel Gardenia❤️
❤️Bond No 9 Nuit de Noho❤️
❤️Stella McCartney Stella EDP❤️
❤️Frederic Malle Magnolia❤️
❤️Frederic Malle Iris Poudre❤️
❤️Tom Ford Noir de Noir❤️"
59038,"Only have 8 for all time faves

- Dior Poison Girl
- Mancera Velvet Vanilla
- Mancera Coco Vanille
- MMM Bubble Bath
- PDM Delina
- Byredo Blanche
- Dior Homme Intense
- Kayali Vanilla 28"
59039,"This is tough because I've been neglecting my winter frags as it's warm out so this may not be my most accurate list here goes:

1. Atelier Des Ores Rose Omeyade
2. Frederic Malle Portrait of a Lady
3. Dior Homme (2011-2019 formulation)
4. Tom Ford Lavender Extreme
5. Dior Fève Délicieuse 
6. MFK Oud Satin Mood
7. MFK Baccarat Rouge
8. Initio Musk Therapy
9. Xerjoff Renaissance
10. Byredo Rose of No Man's Land
11. Tauer Lair Des Alpes

HM (or add trade this out in my list and I wouldn't be upset):
Xerjoff Naxos, Dior Ambre Nuit (vintage), Creed Royal Water (vintage pre 2015), Le Labo Tonka 25, Aaron Terrance Hughes Homme"
59040,"1) mancera choco Violet
2) Donna Valentino born in Roma
3) issey miyake Leau issey
4) JPG scandal by night
5) Burberry HER
6) montale Ristrietto intense cafe
7) Versace Versense
8) Tom ford black orchid
9) mancera velvet vanilla
10) Chloe Nomade"
59041,"1. Guerlain Vetiver 
2. Eau de Guerlain 
3. Creed Bois du Portugal 
4. Azarro pour homme (would be R Gauche if not discontinued and obscene prices on ebay)
5. Guerlain Habit Rouge EDT 
6. Caron pour un homme 
7. Guerlain Heritage EDT 
8. Acqua di Parma Colonia 
9. Geo F Trumper Sandalwood 
10. Terre d'Hermes EDT"
59042,"1. Feminite Du Bois - Shiseido.  My hands down all time number one signature since I first purchased at Bloomingdales' Shiseido counter circa 1993.  Its different than the Lutens version.  Richer and more full.  The Lutens seems hollow and dry in comparison.  Though I've gone through many bottles of both over the years!

2.  Kelly Caleche EDT *not* EDP - Hermes.  I am in love with this cool leathery rose and it makes me feel like a classy bitch with a naughty side. 

3.  Coco - Chanel.  Just a powerhouse classic.  SO good.  I'd like to add Coromandel - Chanel here because I really adore both.

4.  Poison - Dior.  Of all my fragrances this is my boyfriends favorite on me.  Been wearing it since the 90s.  It's extra good if you are pale with black hair and kind of an ice queen.  That purple bottle.....

5. L de Lolita - Lolita Lempicka.  Such a yummy salty caramelish dessert.  Delicious.  Because its similar, I'll tack on Tendre Madeleine - Laurence Dumont.  They are both wonderful gourmand vanilla clouds.

6. Tam Dao - Diptique.  So zen.  So relaxing.  So meditative.  I reach for this when I mentally need it.

7.  Lord of Misrule - Lush.  This one is such a big, wild cacophony of notes I enjoy plucking them individually out of the air around me.  And waking up with that lingering stale vanilla patchouli on your pillow and clothing is amazing.  I bought the BIG bottle.

8.  By the Fireside - Replica.  Sometimes it smells like a sexy ashtray.  Sometimes it smells like a sexy marshmallow.  Because I wish it could be a cool October all year round, well, yes, I DO want to smell like a firepit.

9.  Lost Cherry - Tom Ford.  The liquor.  The cherry tobacco.  The gluttony. 

10.  Sol De Janeiro Bum Bum Cream - I am addicted to the smell of this lately and cannot stop slathering it all over myself.  Yummy creamy pistachio caramel goodness!"
59043,"Male 49:

Tom Ford Black Orchid 
Tom Ford Grey Vetiver 
Tom Ford Beau de Jour 
Tom Ford Tobacco Vanille 
Guerlain L’Homme Ideal edp 
JPG Le Male 
Burberry London 
Dior Eau Sauvage Parfum 
Old Spice
Vera Wang for men"
59044,"J'adore by Dior.

I've had people stop me to smell me. They say it's ""intoxicating"". There's a guy I used to hook up with that texted me a few weeks back about how he was in public and smelled me and he started missing me. 

I don't wear it often, but when I do, it's amazing. It's like an invisible cloak of sexiness."
59045,"This used to be my fragrance as well, until my mother in law asked me one day what I was wearing and then went and bought the perfume and moisturiser version for herself, so she was drenched in it every time she took a shower. I can't wear it now coz my husband would only smell his mother if I do."
59046,"I understand your heartbreak - I let my SO smell one of my favorite perfumes  (Victoria Secret's Tease) and his first reaction was: ""My mom wears that."""
59047,Okay I got this as a gift and it did not smell good on my skin at all! I had such high hopes haha
59048,"Oh no!!! You should try armani code, it's got more of a... peppery scent to it. Rather than floating along like j'adore it has this beautiful bite to it that I love."
59049,"I think I have a sample of this laying around actually! I'll try it, thanks:)"
59050,"Let me know what you think of it, I have a huge amount of perfume, through all of it I can find something fun for you to wear."
59051,This is months old now but I wanted to say I thoroughly like how you describe scents.
59052,Thank you so much I appreciate it!
59053,I'm visiting this sub and now I want to go out and buy J'adore
59054,"I second this. I was given a sample of this late last year and fell in love. Waiting for it to be on sale so I can buy a full size. It was long lasting but not overpowering, such a beautiful perfume."
59055,I second this! Recently started wearing J'adore and I get a lot of compliments from my boyfriend.
59056,YSL Black Opium!
59058,"I've been wanting to get this perfume for a while now, and I think this convinced me!"
59059,Love this one
59060,"This is such a good one! One of my aunts uses it, so I smell it every time I'm in her bathroom, haha. It doesn't sit well on my skin or I'd wear it too"
59061,"I wear Alien, and even the kids I work with love it. You just can't put your finger on it. Always an interesting smell."
59062,Yes! People constantly tell me how sexy I smell.
59063,Love this one too!
59064,I bought Lancôme La Vie Est Belle because I smelled it on a lovely looking woman on a flight. She passed me on the aisle and it smelled so amazing. I immediately asked her what it was and bought it asap. It has great staying power and I get lots of compliments!
59065,I tried a sample of this! It's beautiful
59066,I love the smell of LVEB but it gives me hellish headaches. Even tried a dupe and some flankers but it was the same for them all. :(
59067,Chloe by Chloe (the original one in the gold bottle) is my absolute all time favourite! My husband wouldn't notice if I smelled like cat litter but female friends comment on this.
59068,Marc Jacobs  Daisy Dream
59069,Yesss I love daisy dream
59070,My go-to scent; I fucking love it
59071,I just sampled this at a store an hour ago. IT SMELLS SO GOOD! I still smell good haha. If i wasn't such a broke ass id go get a bottle.
59072,Lust by Lush gets me random strangers complimenting me.
59073,I love jasmine but this just smells like mothballs and gasoline on me. My skin is weird.
59074,"Read mothballs as ""meatballs"" and can't stop laughing."
59075,This is my signature go to fragrance when I want to get noticed. Endless compliments.
59076,I get lots of compliments on this one too and it's affordable
59077,"It's really a guessing game of what is going to work well with your body chemistry. I am a perfume collector and have about 50 bottles ranging from $15 to $115. And you know what I get the most compliments over? The original Paris Hilton perfume. Not just occasionally. Every single time I wear it I get at least two compliments over how good I smell. My sister bought me a bottle like 10 years ago and I still buy it for that reason. One cool thing you can do is something like Scent Bird. It's like $15(?) a month and you get a decent size ""sampler"" every month. You can pick from 100s of perfumes and cologne. It's pretty convenient and let's you try a really wide range of stuff!"
59078,"> The original Paris Hilton perfume

Haha yes! My sister wears this too. It smells divine on her! She hates to tell people what it is though because... Paris Hilton."
59079,I second the scentbird subscription- I chose some awesome perfumes and some weird ones as well. I love choosing something that not many people wear. They carry some French brands that I have never seen in stores.
59080,"I used to wear Paris Hilton 10 years ago and you're right...so many compliments! I had totally forgotten about it, I'll have to pick up a bottle and give it another go."
59081,If you're anywhere near a Ross they always have it there!
59082,Are you still able to get the original Paris Hilton perfume? I use to wear it ages ago and I have since been unlucky in trying to find it recently
59083,Chance by Chanel (the light pink one)
59084,"Same, but I'm partial to the green one. I'm not sure if they still make it, but it is similar to the old Banna Republic fragrance called Classic."
59085,Green one here too! It's yummy and fresh!
59086,The only chanel i like it's amazing!
59088,">Sometimes it changes subtly, and sometimes it is a drastic change. For example Perry Ellis Woman smells quite good in the bottle, but it smells *amazing* on me. Intoxicatingly good. On the other hand, though Diesel Women smells fine in the bottle, once it warms up on me it smells like the fart of a dog that has medical issues. 

I second this. I remember buying perfume ages ago and getting home and having a migraine, full blown throwing up blinding pain. My grandmother who I was staying with washed my wrists and neck to help me feel better, and I started recovering. 2 days later I had the migraine again. It turns out that the perfume was acting as a trigger for it - I had no idea this was possible but the next time I saw my doctor I asked if scents could trigger migraines and they said yes. So that perfume went in the bin!"
59089,Yes definitely. My perfume fades on me. I try to mix with unscented lotion and put it on the specific points but it still doesn't stay as well. Mind you I live in South Florida so heat. I do have to say there was a girl in my previous department at work that smelled AMAZING no matter what perfume she had on. I had to go.up and.smell.her all the time lol. And she was fine with it bc she gets it a lot - so used to it! So I think it's also about your chemical makeup as well.
59090,"Don't forget, if you've got bare legs, put it in your knee pits and also your Achilles' tendon if you have shoes that expose it! It makes a big difference in smelling it longer especially on warmer days"
59091,"Friendly warning - be careful it isn't just a case of you having [olfactory fatigue](https://en.wikipedia.org/wiki/Olfactory_fatigue), aka ""nose blindness""   
Our senses tend to tune out constant stimuli so we don't miss any other potentially important stimuli.  It's the same reason we generally can't smell our own homes.  
  
This happens to a lot of people who regularly wear fragrances and they wind up unknowingly wearing way too much... don't be that person, nobody likes them  :("
59092,lol I can imagine but I don't wear as much perfume anymore. And when I do no one complains. My husband can smell it sometimes. I still don't think it's that powerful on me.
59093,"Do you have any recommendations for how to avoid the powdery smell from perfume? No matter what brand or scent I try, everything dries down to powder (unless it's perfume oil). Is there any way to avoid that??"
59096,I wear the same combination! Ha
59097,"Burberry Brit has a special place in my heart even though I haven't worn it in years. 

When I was in my first year of college it was one of a small handful of more ""adult"" fragrances I tried out in a vain effort to seem more mature and mysterious. That part hasn't worked out yet and I'm pushing thirty, but I got a glowing compliment from one of those ""angel of femininity"" types every young lady comes across once or twice that made my week.

I was meeting a counselor at an actual university campus over transfer agreements and was entirely too nervous because I was eighteen going to a meeting alone.

I also thought anyone on their campus could smell community college on me a mile away, which is pretty funny in hindsight. 

The counselor I met was absolutely beautiful, the kind of perfectly made up lady that just exudes confidence. Not cougar confidence, *classic* confidence. Putting on her face would have cost me another textbook, easy. 

We had the meeting, and when she walked me out she left her hand on my shoulder for a second and just said, ""The perfume you're wearing suits your skin very well.""

I went on about this for entirely too long but I think other people who love scent and flavor understand how important those types of memories are to keep vivid. Thanks for reading the ramble if you're the sentimental sort like me."
59098,I LOVE Burberry Brit!
59099,I wear Burberry Brit too :) I get a lot of compliments! When I feel extra chic I wear Coco Mademoiselle by Chanel.
59100,Vera Wang Princess
59101,Mine is Vera Wang Rock Princess! Smells so good!!
59102,"Same! I've been wearing it since for probably 10 years, I feel like I've outgrown it but I love it. I also have a few of the other ones, preppy princes, glam princess, and there's another one I can't remember the name of. The only one I don't have is rock princess I think."
59103,"Honest to god, Kim Kardashian Gold (fall scent), and Chanel Eau Fraiche (spring scent)"
59105,"Please do lol. It was a gift and I was like... thaaanks. So I gave it a test spray and didn't immediately hate it. Decided to wear it out one day and I actually got a handful of compliments on it and then had to tell them it was Kim Kardashian when they asked hahaha. I was once told I smelled ""so fuckable"" by a friend and she wanted to borrow it for a date. Regardless, I'm over the name on it now and wear it because I smell sexy af."
59106,"I don't like the kardashians. I've watched maybe 10 minutes total of their endless amounts of shows, but their makeup... their makeup is amazing. I love their honey sticks and their bronzers and highlighters are great. And it kills me to admit it. But let's be honest. They're amazing at branding, and they don't put out crap. Very smart."
59107,"> Chanel Eau Fraiche

Omg that is adorable! I once won this perfume and I kept buying it once the bottles were finished. It's soooo adorable!"
59108,Flowerbomb by viktor & wolf
59109,Bonbon is great too
