idx,text
23550,Not sure what’s up with your copy - Ive got essentially your same build and I’ve never had it drop below ~55 FPS except for a few select times. For the most part it runs fantastic. Worst part of the game is the EA social stuff and whatnot.
23551,On what resolution? I think I remember installing this game on a customer's PC that had a 3600 and 1660Super and it ran fine at 1080p with mostly high settings.
23552,But the races aren't fun in that game imo. No real story and rivalries like old games.
23553,"As someone who's been dying for another Underground, Heat was such a disappointment for me. I know NFS has always been the arcade-y racing series but Heat took it to a whole other level with the ""release the gas and press it again to enter drift mode"" thing. It felt *awful* to drive like that, and I couldn't find anyway to disable it so I had to just uninstall.

Edit: Seems there is an option to toggle it off now? Definitely wasn't a thing when it first came out 'cause I even searched online for an answer to this. Perhaps I'll give it another go now."
23554,Most Wanted holds up pretty damn well too
23555,"NFS Heat was pretty good too. First one I've played more than an hour or two of since MW 2012 (and I really didn't like that one either) after loving the Undergrounds / MW 2005 / Carbon, and after muting the music to play my own instead it was easily the most fun classic Black Box NFS feeling since IMO."
23556,"F1 2020! You can create your own team, which you will start with a slow car competing against the slowest teams, and it allows you to dive deep into upgrading your facilities and car upgrades. Slowly over time, you can see your race results improve, and my oh my does it feel good to finally get your first podium (top 3 finish). The physics is super well done, too. At first, I had no desire to play an F1 game because why would I only want to race with the same type of cars? But once you play it and see how fast these cars go around the most insane circuits in the world you understand how much fun it is to play this game. I have started 2 different teams, 3 different drivers, and played the heck out of online. I use a Logitech G920 racing wheel and it is so much fun. If you enjoy simulation racing and want a game that will start you off with crap equipment and slow cars, this is the game for you. Even the slowest Formula 1 car is still one of the fastest cars on the planet.

P.S. F1 2019 and earlier do NOT have MyTeam in the game. Just a heads up.

TLDR: F1 2020 is a 10/10 game for someone looking for a racing game that makes you grind to get a faster car. And not a bad type of hours upon hours grind either."
23557,"maybe FlatOut

edit: And Wreckfest! Same devs if I remember correctly."
23558,I'll add wreckfest to the list
23559,my dumbass forgot WF and I was just playing it the other day lmao
23560,"Definitely the FlatOut games.  
  
Burnout Paradise is pretty good as well."
23561,"Yup. It's not much, you get like 4 categories overall but damn is it fun."
23562,I had the same itch and Wreckfest surprised me. Great game.
23564,"Currently gonna emulate GT3, then Gt4 and NFS the remastered versions. Would be cool if new games would be more progression based instead of just handing you the crazy cars from the getgo."
23565,Need for speed ProStreet
23566,"Such an underrated game. Its so good. The only reason it didnt do well when it launched was everyone was still attached to most wanted and carbon and wanted a sequel to those, and they got a track racing game.

Pro Street is honestly one of my favorite Need for Speeds ever."
23567,"Pro Street honestly had some of the best feeling and most interesting racing in the NFS series.

From the track events to the speed challenges and even wheelie competitions. Plus the progression is super rewarding and unlike other NFS games you had to build multiple cars from the ground up to win every second of the ""crown."""
23568,"I have actually played though that game multiple times because I liked it so much! So well done. (At least, from what I remember)"
23569,"Thank you! Where has this gone from racing games?!

It was the whole driving force (lol) behind Turismo 1-4. I loved starting in the hot-hatch tourneys, tuning that car up so it can win, getting a better car, eventually getting into the rally scene then eventually ending up with super cars and LM race cars. So good.

That and proper points-based tournaments where you can't restart races but if you do well you can sit back and come last in the final race and still win overall."
23570,"Sadly the same place depth has gone in a lot of other genres, down the shitter to appeal to as many people as possible.

I would say my favourite games of all time are XCOM UFO defence and Rome total war, i still play these modded today. And while they had problems as all old games do just compare the complexity and strategical depth on offer in 1994 and 2004 with sequels from 2016 and 2020. The heart and soul has just been completely ripped out and replaced with fancy graphics and dumbed down gameplay its disgusting it really is.

I guarantee anybody who has played modern XCom has at least heard of either of the Long war mods too, where the direct goal of this mod is increasing the length, difficulty and complexity of the base campaign. I mean do these companies not know how to take a hint? Hardcore gamers are still a big audience and nobody is catering to them."
23571,"NFS Shift was also pretty good for this, you could not access the higher car classes before completed the previous ones"
23573,"NFS 5 Porsche unleashed. Build your way up through Porsche history. Occasional interspersed with some genuinely difficult story missions. The one where you have to get to the train station in 1:15, without a scratch, in random traffic, was particularly brutal. But man when Dieter said there’d be something extra in my cheque, all worth it somehow."
23574,"A guy released a patch for it in 2019 as well, so it'll work on modern systems with that."
23575,"I was never really a fan of Porsche as a brand, but I LOVED this game and it really gave me an appreciation for them. 

This was my immediate thought reading this post. The hard, long progression really made you appreciate minor differences between seemingly very similar cars and I formed real bonds with the cars I had, valuing each of them. A world away from the Forza experience described here."
23576,"Need For Speed, all of them.

But emulating Gran Turismo 4 is still the best there is, in my opinion.

Heck I think even some decent PCs can run Gran Turismo 5 without an issue now."
23577,"Fun fact: NTSC version of GT4 can run on PS2 at 1080i (yes, really) if you have a component cable, so it will look pretty good even on current TVs. That game was definitely build to last."
23578,The 1080i mode in GT4 looked worse than the 480p mode due to it being upscaled from 576i and have a lower colour count. Plus interlacing is yucky.
23579,"Well, the 1080i mode definitely looked better on my 720p TV, yes, there was some film grain, but it was way sharper."
23580,When you emulate in on a PC it’s best to just upscale the 480p mode in 16:9 format. Interlacing on a full hd screen looks gross when things move a lot.
23581,"I'm currently getting the 3-a spec rom and emulating it. Will be moving on to 4 when i've finished 3. Nothing mentioned so far seems to really fit it quite right, although i love how i'm clearly not the only one with this itch. 

\- i've been looking at the new NFS as well, the remaster of the old ones seem pretty cool, so they go on the list as well."
23582,Street rod 1 and 2.
23583,"Yes. They were good. I can still remember playing pink slips with keyboard. 

I just hope that some one would make a modern version."
23584,Need for speed Heat is really fun. Put in probably 80+ hrs into it trying to get all the upgrade parts and just racing with friends
23585,"Yep, just came in to say this. I have a group of buddies ( we are all older gamers) that just started playing this and it's been so fun. I logged 80+ hours, and still love playing it. most of them just started and really like it.
We all come from playing FPS and shooters during the summer lockdown so NFS Heat is a nice change. 
I like all the modding you can do, not just cosmetic but performance as well."
23586,"Yeah I actually enjoyed the progression curve quite a bit. It was the first time in a while that a racing game made me feel accomplished when I got a new car/part. This was coming from Forza Horizon 4 though, where the game gives you free cars basically every time you log in, so I guess it's a low bar to set."
23587,"Man, if you can find it, I can’t believe no one has said Tokyo Extreme Racer Zero."
23588,This and 3. Finishing all three regions in TXR3 took me a week to complete (not including the wanderers).
23589,I can't belive I had to scroll so far down for this.
23590,Incredible games.
23591,"If you can somehow find it, Blur.
And Re-Volt.

But those are maybe too much in the arcade category."
23592,"My Summer Car. You don't even start with a car, you have to build it yourself."
23593,Wreckfest
23594,"Test Drive Unlimited, idk if it's still out cause i played on PS3 but damn that game was the best racing game i've ever played. you start with volkswagens and chevys and progress to bugattis and ferraris"
23595,NFS: Porsche unleashed
23596,"Oh my God, I almost forgot about that game! I just remember the crappy graphics... or maybe it was all my computer could run at the time. Definitely that ""build up your car"" type game though!"
23597,"The graphics were good for the time, maybe you just had a crappy graphics card?"
23598,"NOTE:  
The Console and PC versions were made by two completely different dev teams.  

The console version offers an arcade-like and heavily watered down experience.   
The PC version was designed as a simulator where you progress through the era of Porsche automobiles, with real crash physics, a detailed progression system, money to earn and upgrade your cars, and it also contains a lot of historic information about each and every Porsche in the game in the form of videos.    

If you only ever played the console version or you were a fan of the ""simmy"" aspects from the very first Need for Speed(from Road&Track magazine), you owe it to yourself to find and play NFS: Porsche unleashed.  

It runs well on modern systems and can be modded to support 21:9 aspect ratios."
23599,[Death Rally](https://store.steampowered.com/app/358270/Death_Rally_Classic/)
23600,Midnight Club 3
23601,Forza Horizon 1
23602,"there is an indie game called Art of Rally. Highly recommend it

The career mode is a progression through the history of rally racing, you start off with crap cars from the 60s and work your way to modern cars. Group B is when shit gets real.

&#x200B;

edit: also NFS Heat is really, really good. My only complaint is that the game is too damn short. but the grind to level 50 is so fun. (also, there are amazing mods for this game too if you are into that)"
23603,Road Rash III
23604,"The first Grid was awesome, you run your own team and race all around the world with 3 categories (Europe, Asia and America). The feeling of improvement is amazing"
23605,"FlatOut and FlatOut 2 were great (don't ever look at 3).  
  
Burnout Paradise works more or less like that too.  
  
If you want something older and *slightly* on the simulation side, I was quite fond of Cross Racing Championship 2005.  
  
Even further back than that, a great oldie called 1NSANE.  
  
And... well it has racing too, so maybe Carmageddon? :P"
23606,test drive unlimited 2.
23607,"It's such a terrible driving game in every other way though, the physics were terrible."
23608,agreed... I adored TDU1 on hardcore mode so much. TDU2 as a huge let down and the reason why I never preorder games anymore.
23609,TDU1 was such a damn good game.
23610,"Man, cruising the east coast highway in a classic Lambo listening to Hired Goons by Evil 9. One of my absolute best gaming memories."
23611,"My favorite memory of TDU1 is when my friend and I were tandem drifting the twisties of the middle island section, only to be randomly joined by 4 Russian players, making it a drift chain of 6."
23612,"Didn't like TDU 2 as much as TDU 1, but for me TDU 1 still holds up as a decent game.

Had exactly the progression I wanted and it was pretty difficult back in the day when I had little experience with racing games."
23613,Last one I played was forza horizon 2.  Racing games now are indicative of society today; get the feeling of instant satisfaction and participation trophies.
23614,Hey op check out sega GT online. Was on og xbox if i recall. Progression was very similar to gt4. A little arcadie though.
23615,"Wreckfest, spiritual successor to Flat Out 1/2."
23617,"> NFS Most Wanted 2 (2006). 

Excuse me, what?"
23618,"The crew 2 does this with the car part of the game, I never used the plane or boats so that could work"
23619,"The newer NfS: Hot Pursuit does get progressively more difficult as you play, and based on how well you do nets you more cars and gets you new technology to take on/down racers and cops alike. Not exactly as you want it to be, but the progression is there."
23620,I'm pretty sure The Crew has a ton of car customization.
23621,Any of the recent F1 games
23622,"This is the answer if what you're looking for is car progression.  Yeah, it's all F1, but doing R&D on the car is a core component of the main single-player mode."
23623,"NFS Heat is actually pretty great. The game combines the risk & reward system of NFS Rivals and the customization of NFS 2015.

During day time, you do regular ""semi legal"" street races. The cops aren't after you, the races are mostly down to pure racing skill, even traffic is blocked during the racing. 

During night time, you do fully illegal street races. The traffic is active and cops can start chasing you mid race any time. And the chase continues even after finishing the race. The more you get chased the higher your earnings multiplier goes, so staying out long and doing a lot of races nets you massive rewards. However, if you get busted by the cops, you lose all your multiplier. 

The customization is really the best of any racing game today, especially in terms of visuals. Some cars can be customized more, others less (as expected you can't really rice a ferrari) and the game has a really nice selection of cars. 

I think the game is rather well balanced, cops are really tough at the start and you will be struggling to lose them, but as you progress, they get progressively easier to lose and by the endgame you will be out racing with max heat and not care all that much about the cops. If anything, I think the game gets too easy past the halfway point. But yeah, it's pretty tough at the start. 

NFS Heat keeps the classic ""from zero to hero"" progression. If you are looking for a different kind of progression, then Forza horizon 4 is pretty amazing. It's easily the best driving game since... Forza horizon 3. But as far as visual customization goes it's pretty basic compared to NFS, although keep in mind that Forza has like 5x more cars and also has a cockpit view and I'd say generally better physics. The progression in Horizon games isn't linear, after the initial 2-3 hour long intro you can practically choose what car class you want each race to be, and you get spoiled with rewards - Horizon games are primarily wanting to be your friend and let you play at your own pace. They can absolutely be challenging if you like, but also very easy going."
23624,"I love Forza but that game has absolutely 0 progression, with a few lucky wheel spins you can buy absolutely any car in the game unless it's one of those rare ones that cost 10mil credits because they come from events. It's a good game to drive around, race and free roam but it has 0 progression"
23625,The only forza horizon game with proper progression was Forza horizon 1
23626,"I agree with all of this and have about 70+ hours on it.  The game is fantastic but got stale pretty fast.  The online races kinda sucked and the game got to the point where your cars are OP as fuck and that got boring real fast.  

However I haven't played in over 3 months so I have no idea if it's any better.  Definitely the best need for speed compared to the old most wanted with all the epic destruction and shit. Probably going to play now lol"
23627,"I'll disagree with you on the easy cop part. I found them to be hard, annoying and whit infinity life, racing at night wasn't really fun for me. 

Later I discovered that jumps can really mess the AI of the cops but it felt more like a cheat/exploit than actually getting better on defeating them. Even got the 1,000,000 rep points trophy, but I would really prefer to race by day."
23628,"It could definitely be more linear, the jump from level 2 to level 3 feels like jumping straight to 5. But, when you have an endgame car it really doesn't matter."
23629,">I found them to be hard, annoying and whit infinity life,

Ok let's start with hard part, that is **easily** fixed by getting a faster car because your stock starter car is really not good

""Annoying"" uhh you played any NFS game that has cops in them? Cops are literally designed to be annoying 


>whit infinity life

You kill/disable them they don't have god mode"
23630,Thanks. I will sub a month of EA stuff to check it out
23631,It's also available through Xbox game pass on PC(since the EA play is a given with xbox game pass.)
23632,Wreckfest. You’re welcome.
23633,"This is probably the best answer. You actually do have to drive the same cars for a while and upgrade them. You can also build more towards sturdiness at the cost of speed, or the other way around."
23634,I was also surprised the the effects of tuning the cars. Changing the gear ratios for tracks with longer/shorter straights. And changing the differential to allow it to get loose around the corners if desired
23635,"Such a great game! Reinstalled it 3 weeks ago and finished the career just yesterday actually. 

Absolutely loved it. The best compliment I can give it is that it feels like multiplayer game even in career. The AI is good at racing and they behave realistically with oversteer corrections, random mistakes and crashes. Oh yes the crashes, there's a lot of them and they are god damn spectacular. From second best after beam Ng damage model to tons of car debris and random junk such as tires and bits of fences flying around (what's cool is that they remain on track for the entire race, by the end the road is littered with stuff). I played on realistic damage and sometimes all 24 cars would retire by lap 2 of 12. In each race you fight against the opponents while trying not to wreck your car. 

As far as career mode goes it's very stringy, money is constantly barely enough and you have to both unlock and save up for the upgrades, which is nice imo. Sometimes you have to remove 'armor' parts from your car and be more vulnerable just to keep up with the rest of the pack."
23636,I've never seen AI fuck up so similarly to human players in any other game. Wreckfest is really on another level
23637,"I’ve been keeping Wreckfest alive for myself and my community by doing a “Wreckfest Wednesday” event, such an underrated game, especially on a racing wheel!"
23638,"Honestly I can't really think of any since the mid to late 2000s NFS games...

Gran Turismo 5 kind of had that, but msot of the recent racing games are just social media clout stuff simulators or focusing on online sadly"
23639,Man i wish racing games with decent story and career modes
23640,"NFS Heat is awesome for a play through and totally worth it.  Other than the social medium crap they show in your face, the cars are fantastic and the game let's you have a lot of fun with them.

People are complaining the cops are tough and the game is missing cop breakers from Most Wanted, but there are specific roads you will learn you can drive a lot faster on against the cops for good escapes."
23641,Does anyone know if there are any games like the older gran turismo games on PC? Kind of like starting from a shitty car and slowly working up to a super car.
23642,"Forza Motorsport 7 and Project Cars might be what you’re looking for.  Project Cars 1 and 2 tried to be more proper sims, where I think Project Cars 3 is more of a simcade, and supposedly the best of the series for playing on a controller.

Haven’t played Forza 7, so I’m not sure if it still follows Horizon’s pattern of just throwing tons of money and cars at you from the get go."
23643,OK thanks
23644,Project Cars 3
23645,NFS heat and payback are like that but physics are nothing like gran turismo so you might dislike it
23646,Damn ok. What it's more arcade?
23647,It's very arcade you'll get used to it
23648,OK thanks one more question is the replayability good in the game and how is the multiplayer?
23649,">replayability

It's one of it's flaws actually, there isn't really any big replayability factor you can obviously pick different cars and upgrade them differently but there isn't much to it since it's very linear, it also has a weak endgame


>multiplayer

It's there for the people that like it, i really couldn't tell you much about it sorry because i never played NFS for the multiplayer."
23650,I gotchu exactly what I needed to know thanks
23651,NFS Heat has pretty great progression system and the best car customization in the AAA space
23652,"Sorry to piggyback on the thread, but I'd also like some suggestions that are more arcade than simulation. I loved Midnight Club on PS3 but I rarely use my consoles now."
23653,Need for speed underground 2 is still the best for progression.
23654,"Honestly dude, I do NOT get the Underground 2 love, coming from a person who has actually nolifed the hell out of it back in the day. Underground 1 runs circles around it by comparison, an open world means nothing if the tradeoff is making everything else shallow.   


Or maybe it's just the extra customization. Sure, can't knock that, even if I'd rather just play Heat at that point."
23655,"They are both good, I agree UG1 is ""tighter"" but UG2 has the graphics.  UG1's graphics haven't aged as well as UG2."
23656,What year is this?
23657,">What year is this?

[2004](https://www.metacritic.com/game/pc/need-for-speed-underground-2)

Many of the older NFS still hold up because NFS is fundamentally about racing.  So you can't really go wrong with an older version of NFS since the best NFS's were bade between 1997  and 2005 pinnacling with Most wanted in 2005.

Most NFS post 2005 has struggled to attain the quality of 2005 and previous."
23658,"Project Cars 3 seems like a good time with what you're describing, although people from the simulation community hate it, for an arcade fun type of experience I think its good."
23659,I saw metacritic score on 3 and it's way lower than 2. Do you know why?
23660,"1 & 2 are very simulation heavy racing games that are still popular in the simulation community, so there's a lot of vitriol from that still, because 3 tried going for a wider audience/tried streamlining a lot of things."
23661,"So for someone who has no interest in sim racing, and just want something more similar to NFS, is 3 better?"
23662,Definitely. Lot of people compare it to NFS Shift 1 & 2 and its done by some of the same developers.
23663,If you liked the NFS Shift games then you're probably gonna like this one
23664,Because it's shit. These developers are complete assholes. They tried to do two simulators before that but they weren't good enough so sim community didn't play them. Then they shifted to arcade and this time arcade community ignored them. They just don't have a clue on how to make racing games.
23665,">  Then they shifted to arcade and this time arcade community ignored them.

Even with how arcadey PC3 is compared to even PC2/1, it's not exactly an arcade.

I agree SMS are a bunch of assholes though."
23666,"Looks 100% arcade, just like FH4. PC1 was a simcade, PC2 improved a bit and was almost a sim."
23667,"Forza Horizon 4

&#x200B;

&#x200B;

Soon: Forza Horizon 5"
23668,Not at all. There is no sense of progression in that game. It’s just random unlocks
23669,"You're telling me you don't like unlocking 3 super cars in the first 30 minutes of the game? How can this be!!

/s"
23670,"some of the NFS, probably Heat but I don't know how deep the customization is because I stopped playing NFS because it's shitty driving physics"
23671,"NFS Heat has really good customization, especially if you download Heat+ you can do  some crazy (unrealistic) engine swaps."
23672,"Forza Horizon had a lot of customization but IDK if it's really what you're after since things are so easy to get in that game. Blink three times and you've got 6 super cars. That kind of thing. 

Some people saying NFS Heat but IMO the newer NFS games are abysmal. Even if they have some decent customization you have to sit through the cringe dollar store Fast and Furious cutscenes and it's just not worth it to me. The old games were great though. 

The Crew is just... no. At that point you might as well just go with Forza since they do the arcade thing way better and have better open worlds. 

I guess you could go with F1 if you're into that kinda thing? 

Come to think of it there really is a lack of new, great, immersive racing games with meaningful progression where you feel like you have earned everything you've got. 

We could do with Test Drive Unlimited 3 right about now."
23673,"came here to talk about forza horizon 4 too, I think that the car upgrades are more limited in what you can get, but the car tune is very good, also having more than 750 cars in a single game gives you a lot of stuff to tune..."
23674,"First game I thought of was Test Drive Unlimited. THe progression was awesome. Getting new racing licenses, buying better and better cars, buying new houses etc!

They're making Test Drive Unlimited Solar Crown but I have no idea what it's going to be like... fingers crossed though."
23675,"For my money, Underground 1 and 2 are the last truly great racing games with a sense of progression. The newer shit is really just ""here's a bunch of cars and some generic upgrades you can buy immediately and tweak from day one."" I want that RPG feeling of starting off broke with junker stock cars then move up to higher and higher tiers of upgrades and cash, and even higher end base models."
23676,What NFS games have you played so i can recommend you the good ones?
23677,"nfs heat, forza horizon series."
23678,"Don't pay much attention to PCars 3 comments. It's a fantastic game to teach and for beginners at SimRacing. Starting with games like AC or iRacing it's like starting at gymnastics doing a triple mortal jump. The game teaches very well the basics of weight transfer, the effects of high torque on your car'so behaviour, and how to brake. And you learn a ton of real tracks that will help you out when you transition to higher end sims."
23679,Shift 2 Unleashed with the ptmu physics mod. This is the closest you'll get to Gran Turismo experience on PC without emulating the PS2 era GTs.
23680,"Nfs Heat received a lot of bad reviews, people say that the police at night is very hard.
Nfs payback was quite bad.
Project Cars 1 is good."
23681,I was playing it last night and a cop spawned right in front of me when i was just about to escape and i lost all my points. Shit made me so mad i almost uninstalled the game
23682,"> a cop spawned right in front of me when i was just about to escape and i lost all my points.

That always happens to me at least once when i replay NFS MW and Carbon

It's tradition"
23683,"It's strange they gave you a hp bar. I used to love just messing with the cops, seeing how long I can last. Not have them smash me into a wall and I'm fucked."
23684,"NFS Underground 1. No doubt about it.

The arcade car handling is perfect. The graphics are all shiny, neony and still look gorgeous today. Soundtrack kicks ass. Lots of customization options and you can actually make your car look good.

It's just a gorgeous and enjoyable arcade racer. Too bad that the entire genre died out. Not just the ""rice car"" theme, but the arcade racing games entirely. Everything has to be a simulator or a simcade nowadays."
23685,NFS UG2 too! Loved my full maxed Golf GTI
23687,"Underground 1 is the better racing game. Really good sense of speed and I prefer the car handling. Tracks are more suited to racing. Great, motivating soundtrack.

Underground 2 is the better PimpMyRide game. Much bigger choice of parts, more indepth performance tuning, and cars are more visually detailed as a whole. And the best open world city in a racing game. Full stop.

I personally prefer Underground 1 but Underground 2 has its place as well. Both games are some of the best car games ever."
23688,To the windooooow!
23689,Recently it's been Dirt Rally.
23690,I'm dying for it to finally go on sale since it was released for Linux. I'll play the shit out of that.
23691,The Oculus support thorugh Revive really lifts this game to exceptional. It runs like hot garbage in VR but the sense of presence is amazing.
23692,Dirt Rally has been the only simulator I have enjoyed. That along with Trackmania are my favorite racers.
23693,"Dirt Rally.  Picked it up about 30 seconds after it appeared on Early Access and has been my go to for the last 2 years for racing.  The career mode is just about perfect in terms of progression and style.  Probably the hardest racing game I've played.  I've ""beaten"" the game I guess, as in finished a few seasons at the master difficulty level, usually coming in 2 to 4th in points, and I've yet actually win an event.  I'd happily continue playing for years with more cars and stages.

For those in the PNW, Both the Oregon Trail Rally and Olympus Rally are coming up in the next 2 months.  I highly recommend spectating at least.  Oregon Trail's Friday night stages at Portland International Raceway might be the easiest rally spectating in North America."
23694,I wish i'd picked this up when it was in EA and ~£10. Now it doesn't seem to go below £30. I know i'd probably enjoy it so I might just bite the bullet and pick it up.
23695,Check Amazon. I got a steam code on there for £15 whereas on steam it's £40.
23696,"NFS Most Wanted Black Edition 2005. Man that game was brutal with its police chases. 

Burnout Paradise for awesome open world arcade fun.

Assetto Corsa for hot lapping sim action."
23697,Nfsmw black edition is the whole reason I built my PC with a cd drive. Game is still insanely fun and looks great with a couple of mods.
23698,"Loved MW's story for some reason too, especially the big reveal at the end"
23699,"iRacing.  Yeah it's expensive... but it's the best organized multiplayer community for sim racing.  There's really nothing that matches the quality of competition found in iRacing.

EDIT: To note for OP... 100% NASCAR licensed, with the only official NASCAR sanctioned eSport league (if you're good enough to qualify)."
23700,"Same here, other Sims have their good points but for me iRacing is all i need. The new Porsche 911 GT3 cup is fantastic and an absolute blast to race, and no other racing game comes close to iRacings online setup imo."
23701,Trackmania. I love the arcade full speed tracks and the sense adrenaline you get taking extremely high speed corners.
23702,"Coming from someone who only has played Nations and the original which one do you prefer?. I ve heard good things about 2 and horrible things about Turbo, and how healthy is the MP population."
23703,you heard right I enjoy TM2 quite a bit. I cant speak to the population as it's been about a year or two since I played.
23704,The reason turbo is not looked upon favorably is because it was basically tm2 but they removed the parts that the openess of PC would allow for. The reason is that they needed to consolify the experience for well... The consoles as no other trackmania game had been released on consoles before and they wanted to enter that market. So ya TM2 is where it's at with the community and leverages PC as a more open platform. Tho you will be missing out on lagoon environment.
23705,"Please dont hurt me, but wouldnt the consoles be capable enough to do even the largest maps of TM2 acceptably(heck my HD4000 doesnt fare terribly on them)?,  that on the technical side so i wondered what (apart from the 100 players cap) was dumbed down, dummied out  or cut."
23706,"TM2 allowed one to turn off the visibility and sound of opponents, while TM Turbo does not. There are also only 2 camera view options. TM2 had 3 views but the most universally/popularly used one is omitted in this version. The settings are missing a lot of options that TM2 had (you can not even toggle motion blur...). The soundtracks start from the beginning of the track every-time you reset, which if you know anything about track-mania you know that would get annoying really fast. No dedicated servers or dedimania plugins, customization is much more limited (no horn, custom car models, liveries, etc), mods in general, the track-building is apparently worse. These things are a big deal as they fueled trackmania's dedicated community. That along with the 100 players cap, which it does not reach because of the shooting the multiplayer in the foot.

A lot of stuff has to come together to make seamless and enjoyable experience. When one of those are missing the experience can be greatly hindered. A lot of these omissions are due to consoles, as this was the first trackmania for consoles. IIRC a trackmania dev claimed that they making it for consoles but released it on PC so the trackmania community(which has exclusively been on PC) would not be left out. The two games provide a clear comparison of  console focused design choices and PC focused design choices. The console design choices simply was to omit a lot of features. I hope for the sake of the gaming community, developers, the industry, that consoles simply die off. They have been holding back the industry for too long now, but I digress."
23707,"Thanks for the lenghty post good sir!; Is it still worth getting on a deep sale, are the tracks still extremely challenging and varied?.

Oh and so far i have only played the original and nations, what are the differences between the versions of TM2? And which one would you recommend for an amateur player?."
23708,Re-Volt.
23709,"Assetto Corsa  
It's currently the best driving sim for drifting with it's physics and good amount of mods available (tracks, cars, etc). Also it's run really well and works good with multiple monitors."
23710,Oh yeah this also a favorite of mine. It just sucks that I can't play the game properly because I don't have a racing wheel or a controller. Maybe some day...
23711,If you got a steam controller you can still be a contender with the gyro. I own a wheel and a sc.
23712,"Absolutely has to be Top Gear for the SNES. No fancy car cusomisation, no painting or decorating; you get four cars to choose from. You use the directional pad to steer and hold a button to speed up, and use another one to hit the brakes. Just pure racing: choose a place in the world to race, go around the lap a few times, if you win, you move on.

It's just... it's so clean and minimalistic, and it doesn't have all the extra junk I hate about racing games, like missions for the driver that are not racing."
23713,"Such a good game. Used to love the purple car, think it was called the Razor or something to that effect. Top Gear Rally/Overdrive were great too, although the original SNES one was still the best."
23714,"I always chose the white car, simply because of fuel efficiency. While everyone was off running into things and having to hit the pit-stop every lap, I could sometimes go two without having to stop. It seriously helped me win quite a few races."
23715,"Oh yeah, the white car was probably the best, and the one I had the most success with. But the purple car had style."
23716,"Hahah, very true~ I thought the orange one was snazzy as hell, but its efficiency was in the toilet."
23717,"Yeah after like 2 races it just didn't have enough fuel. Fast as balls though. I don't remember ever using the other one, was like a teal colour iirc."
23718,"Something like that--teal, probably.

Yeah, that car looked nice, but it just didn't laassst."
23719,"Grid Autosport. Good graphics, nice tracks, nice cars and cool AI.
Driving the cars is fun and sound realistic in this game."
23720,"While they physics aren't realistic, they sure are fun... always feel like you're holding on to the wheel for life at the edge of grip.  Also has one of the most realistic single player career progressions out there... and I love how you can choose your path (eg, stick with open wheel from bottom to top) and not be forced in to unwanted events."
23721,"You know, I bought that game when it came out and only have 26 minutes of playtime and for the love of me, I can't remember why I shelved that game."
23722,"Dirt Rally, since it's out on Linux now. Great game. Honorable mention to GRID: Autosport as well."
23723,Any experience with wheel support on Linux?
23724,"No, not yet anyway. There are some people on /r/linux_gaming who can tell you which wheels work though, I'm pretty sure most do."
23725,"Trackmania for the Multiplayer, Burnout Paradies for the open world, Flatout 2 for the demolition derbys, and NfS: Most Wanted (2005) for the police chases.

Yes, I'm not a huge fan of realistic driving games."
23726,deleted  ^^^^^^^^^^^^^^^^0.2904  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/70130)
23727,"I have a couple depending on how I want to race that day. 

All out thrill and adrenaline:  Dirt Rally.

Simulation Feel/good FFB: Assetto Corsa

Fun with friends drifting/setting lap times: Forza 6.

All these games offer something different. I probably play dirt rally the most, it's just so much fun and the game is hard as fuck, so it's very rewarding when you start killing it.

Assetto Corsa has an excellent handling model and is very challenging. Another bonus about this game is there is nearly unlimited cars/tracks through mods, oh and drifting is phenomenal, however there's no way to ""keep a score"" As there is in Forza.

Forza is a game I've been playing since forza 3, and I still think it's the best casual racing series ever, shit load of cars, fun handling model, seamless multiplayer with friends. Obvious downside is it's on Xbox one, but Horizon 3 is pretty good (not as good is the ""motorsport"" games in my opinion) and can be had on pc."
23728,"Since F-Zero GX doesn't really count, my second favorite racing game is Burnout Paradise."
23729,Dirt Rally. I hate that game. It's so good.
23730,Need for Speed: Hot Pursuit 2
23731,"Nascar 2003

Richard Burn Rally

Race  07

not true to form racing but loads of fun Burnout 3"
23732,"For hot-lapping, probably Assetto Corsa; laser-scanned tracks, good tyre physics, great car replication (devs work closely with the manufacturers), good graphics, good VR support, constant updates and improvements, good mod-support. 

Downsides are lack of a compelling career mode, no iRacing style point system for multiplayer (can be had through mods though), and very Euro-centric in regards to track availability."
23733,"Rock n' Roll Racing. It had it all; customization, coop, multiple characters/cars, and a fantastic soundtrack. Screw Warcraft, THIS was Blizzards finest work."
23734,"> Rock n' Roll Racing

I had it in my DVD player with an SNES simulater in it. We played a lot of Rock n' Roll Racing, Streets of Rage and Road Rash with my brother"
23735,Flatout to Flatout Ultimate Carnage. Still play them from time to time.
23736,FlatOut.
23737,Back in the day it was Burnout
23738,Forza Motorsport 4. The newer games just arent the same
23739,"Rally: Dirt Rally

Hotlaping/Multiplayer: rFactor 2 
(if you want good multiplayer you have to be in a league) 

Drift: Assetto Corsa"
23740,Dirt Rally
23741,Arcade/kart racer where the vehicles feel different from one another. *cough*wtf nfs*cough*
23742,"I actually like the Asphalt series. Its arcade-style racing, short but varied tracks, and selection of cars makes me very fond of it.

Second place is Forza. It's still relatively fun and I love the huge selection of cars to choose from. Forza 4 will always have a place in my heart for allowing me to race a Prius against the various supercars. I'm guessing I would have adored Gran Turismo 6 which has nearly double the amount of cars, but, unfortunately, I never owned a PS3."
23743,Toca Race Driver 3
23744,Gran Turismo 4. I haven't really played another racing game since that one that I actually enjoyed. I haven't owned a console in almost a decade so I haven't been able to try the more recent games.
23745,"Dirt 3, Sonic Racing Transformed, and Test Drive Unlimited 2 (years ago... I'd probably like Horizon 3 more now from the same angles I enjoyed TDU2 from, but it's Win 10 + Windows Store exclusive so I've yet to play it)."
23746,Forza Motorsport 2
23747,"~~Gran Turismo 2.~~

~~Because it's really the only racing sim I ever played for more than 20 minutes. Unlocking everything in that game was hard as fuck. Especially as a non-racing gamer.~~

EDIT: Wait... I forgot about BeamNG. Does that count? I love the soft body physics and the more realistic controls (like actually shifting gears to go forward/reverse and shit)."
23748,"F-zero GX if you just mean racing games, but with cars, I would say Motorstorm Pacific Rift or Grid 1 unless you mean realistic but I am torn between Assetto corsa, Dirt rally and F1 2016"
23749,Re-volt.
23750,"Raceroom for the physics, sound and car selection and Wreckfest for fun banger races"
23751,"Definitely the first Test Drive Unlimited. I still find myself going back to it. 


A big open world with great variety in races and roads, not to mention the amount of cars that are modeled with accurate interior and details like changing acoustics depending on speed and weather. At least for a racer at the time. Granted, the handling at launch wasn't the best and controller support was/is lacking, but the Gold Edition with, i think it was called ""Hard Mode"" or Simulation, was fantastic in terms of driving feel, especially with a wheel.


 It also had an online component that I'm absolutely missing today and that was the racing Clubs you could create and join. Of course other games did similar things, but here you practically had Clans that organised specialised Tournaments and competitive leagues for all the different car classes and tastes. That combined with an actual auction house and economy, estates, club houses and garages really immersed you in the game. 


Now with Forza Horizon 3 on PC, the graphical fidelity has been surpassed, but I feel the community aspect just hasn't been successfully recreated in any arcade/semi-sim racing game since. Similar to SWG as an MMO. Forza also misses a lot of small QoL features that TDU had. Partly animated dashboards, windows you could open, fully customizable radio etc. 
The Progression in TDU was also a lot of fun. 


If you want to try it for yourself, there is a Mod that reenables FreeRide and online cruising and the launcher has several tweaks that make the game more playable on modern systems. You can get it through the [Turboduck Forums](http://forum.turboduck.net/threads/29561-test-drive-unlimited-project-paradise-v003a-public-beta-available)
If you have a PSP, pick up the disk somewhere, since it's one of the most enjoyable hand held racers out there. Apart from the low resolution of course."
23752,"> Test Drive Unlimited

This is an underrated game for sure."
23753,"Arcade TDU and burnout paradise.
Rally dirt rally.
Sim assetto corsa and project cars."
23754,"Gotta be 60hz and arcadey for me. Ever since Ridge Racer and Daytona in the arcades, less than 60fps has been unacceptable for this genre. Racing is one genre that I tend to prefer on console to PC though - with a gamepad and big TV. (And the 'arcade racing' genre was never very big on PC anyway)

Loved OutRun 2. Thoroughly enjoyed Burnout 2+3+Paradise. And Mario Kart games are always great for local multiplayer.

Also loved the first Trackmania game on PC, IMHO they went downhill when they came out with the stadium stuff (less precise control, too much speed, seen-it-all-before?), but they're still good fun in short bursts.

Not a whole lot of recent stuff there though... have I missed anything good?... I wish the Burnout series was still going, really. My only recent racing purchase has been FAST RMX for the Switch, which is pretty cool, but not cars."
23755,"The game that got me most into racing was gran turismo 5, it had this series of racing tests on nurburgring that had accompanying videos that explained the history, challenge, and legends of each quarter of the the track. 

The time you had to beat was brutal and so you were forced to learn a number of advanced techniques just to get bronze."
23756,"Recent ones that have been really good for me have been Dirt Rally which is just an incredible unapologetic Rally game, or if you want something a lot more arcadey, then Redout was fantastic fun it is Fzero/wipeout really fast and some amazing track designs.

I also enjoyed Forza Horizon 3 if you like a nice open world variety racing game."
23757,"DiRT 2. To me it strikes the perfect balance between having handling that is complex enough to be interesting and arcadey enough to be fun. Specifically because of flashbacks, which mean that if you having issues at a particular spot on the track, you can retry it many times without having to waste several minutes on every try."
23758,Mario Kart 8. Most PC sims are way too serious for me to get into.
23759,Gran Turismo 3
23760,"Anything from the Tokyo Xtreme Racing series or NFS games from the early-mid 2000s (Underground, Most Wanted, Carbon)"
23761,"Ought to be Shift 2. The only game on PC which has a decent cockpit view for ALL cars (looking at you, Gran Turismo!) and you can put mods for pretty much any car you'd like.

In all honestly I dislike track racing (much prefer street/drag), but Shift 2 allows you to play with your favorite car and test it on the Nurburgring for example. Oddly enough, my fastest time on the 'ring was with a '70s Challenger R/T. Boy, it sure took a lot of time to master that beast, bone stock, 425 horsepowers of pure, unadultered fury!"
23762,"Nfs 4 and 5. 

4 is the perfect Nfs arcade game, loads of tracks (all of nfs3 and the new from 4), cool music and game modes, could use some more cars, though.

5 is less arcadey, less round courses, more rallye-like start-finish tracks, most of them great, dozens of Porsches, awesome content."
23763,"road rash 2 and kicking bitches, stealing chains and then just whipping my way into a win ( ͡° ͜ʖ ͡°)

driver san fran had an interesting gimmick, also this really old game on pc, 4x4 something had full deformity for all the cars to an extreme level, felt really nice just trying to drive off cliffs and mangle the shit out of your vehicle"
23764,First is Need for Speed Underground 2. Then it's the Forza Horizon series
23765,"iRacing is my pick, without doubt. Yesterday I raced in the [12 Hours of  Sebring](http://imgur.com/gallery/lvUpN) and was one of the best experiences of my life.
Is not cheap, but if you love real racing go ahead and get into it. Is worth!"
23766,Assetto Corsa.
23767,"Interstate 76, great story great physics old graphics."
23768,"Gran Turismo 3 until 5. Those games were my entire childhood. I remember buying a PS3 Slim the day 5 came out, when I was 11 years old. Grinded up for weeks, and started online racing. Fuck I loved that game so much, I just wish RPCS3 would support it already."
23769,"Flatout.  Backwoods down 'n dirty hillbilly racing is best racing and this hits closest to the mark for me.

TOCA Race Driver was also really awesome.

I haven't really played a racing game for over a decade."
23770,"Colin McRae Rally 2.0 still holds the crown after all these years, but Forza Horizon 3 comes pretty close, abysmal port aside. Burnout 3 is amazing as well, but no PC version :[[[[[[

Test Drive 5 also holds a special place in my heart, but only because it was my first racing game and the  soundtrack was *dark as fuck*."
23771,Sega Rally on Model 2.
23772,"Shift 2. For me, it's the perfect blend of arcade and simulation handling. Loads of content and customisation options as well. Only major drawback is the way the drifting works is so utterly overfucked it made me quit right away."
23773,All the comments that aren't Burnout 3 are outright wrong.
23774,"I’ve only played driveclub, but I’ve played the older forzas, just not this generation. Same with gran turismo. Only last gen. Anyways driveclub is a really good racing game. Some of it is a bit tougher honestly than what I was used to, I had trouble being consistent with most vehicles but I felt like I was getting better. The picture mode in driveclub is amazing. The weather makes the game very difficult. The glare you can get from the sun, the rain makes it slick af, coming out of tunnels is very hard to do with the sun in our eyes.... It really adds a lot to the game."
23775,Driveclub by far
35134,yikes
23777,"In general, IMO the Forza Horizon series and Forza itself are the best racing games this generation, but that's Xbox. 

On PS4, GT Sport is gorgeous and fun to play racer, it has a good selection of cars as well. This is one is definitely one of the best racers out right now. 

Project Cars 1 & 2  is geared more towards simulation and it also features a ton of cars and realistic locations. 

The Crew 1 & 2 is more like Forza Horizon, an open world racer with a lot of variety and you can race against other players. The first game is story driven, while the second one focuses solely on racing.  

Driveclub is an older title, but it's still a beautiful game and one of my all-time favorites. It has the best dynamic weather system around and it's cheap. 

I could go on, I love racing games as well and own most, if not all of them between the two consoles."
23778,Are the cars in GT Sport had to handle?
23779,Never go full Boston
23781,"You misspelled ""hard"" as ""had"" which sounds like someone from Boston saying Hard"
23782,Oh haha
23783,"Not at all. If you’re familiar with GT in general, you’ll feel right at home."
23784,it’s more of a sim right?
23785,No .. is soft sim or a simcade. A hybrid of arcade and simulator. Project Cars and Assetto Corsa would be more of a sim than GT Sport.
23786,"Oh ok, I’ll check it out."
23787,Forza Horizon series.
23788,"Gonna be controversial and say the only good one is that Burnout remaster, the rest on PS are too obsessed with being realistic 

&#x200B;"
23789,Driveclub with season pass for single player. For online I have no clue.
23790,"Gran Turismo Sport, without a doubt.

The graphics are insanely good and the cars actually feel like they’ve got weight added to them unlike Project Cars 2, which makes me feel like I’m playing with Hotwheels orsomething.

I adore the car sounds in PC2 though, they’re much better than GT Sport right now but they -are- improving.

Updates are free, you get a car everyday for doing the daily challenge (although chances are they’re shit).

GT Sport also has support from the FIA and you can ‘sign’ contracts with certain constructors to drive for them. Fictional, of course. Still a sweet feature."
23791,"Project Cars 2. On PS4 it's basically the best for what you're looking for, but lacks a large selection of classics. Gran Turismo Sport exists, and has a better selection of older cars, but PC2 is the best all around game. Honestly, Forza on XB1 is, I think, the best racer this generation, but you were looking for PS4 games"
23792,"I have to say that Project Cars 1 was most frustrating racing game i have ever played with controller. It clearly wasnt meant to be played with controller, even after tweaking settings it never really felt right. Driving Formula/ higher than GT3 class car while its raining was just unplayable(either you go too slow or you spin if your throttle control wasnt perfect, every single corner), and i consider myself as above average driver. I have played racing games since Toca Race Drivers, so i have played many different racing games. GT Sport just feels right even with controller. It lacks customization and all that fancy stuff, unnecessary or not depending what you want, but driving is satisfying and unmatched on PS4.

Edit: Forgot to tell that they have most likely made it better on PC2, but i have heard its still made mainly for wheels. I think someone here share my complains about PC1 and can confirm if PC2 still feels the same. For the record i havent played PC2 so this is straight up speculation based on reviews/comments i have seen and my experience with the first one."
23793,"The customization in PC2 is good? I like to play with 'prettier' cars, like Ferraris, Lamborghinis and etc, not really looking for F1/racing cars. I quite like the dynamic weather and realistic simulation of PC2, but on the other hand, GT Sport apparently is receiving free updates with new cars and tracks, while PC2 charges for the packs.  


So... PC2 or GT Sport? Hahaha"
23794,"GT sport has no weather, yet. They've been promising for ages. Customization is almost non existent in PC2, set livery selection for every car. GT Sport has fully customizable livery on almost every car. PC2 has a Collector's Edition that has all but one of the DLCs, the extra one is $5, and GT Sport is still popping out more cars almost monthly. PC2 you can do single player races with every car from the get go, no collecting and buying cars. GT Sport has the classic grind for money to buy cars thing from every GT game past"
23795,Gt sport has way better online competition. PC2 is dead in comparison
23796,Horizon 2 or Forza 6. Although I will say if they ever brought back a true Gran Turismo experience then that would have a very good shot at dethroning Forza. I still think GT3 is the best racer ever made and there is no reason why we shouldn't have had a racing game at that level by now.
23797,"Anything in VR.

If you aren’t racing in VR this gen, you’re doing it wrong.

Turn your head and drive like it’s real."
23798,Dirt rally
23799,i like firetrucks and monster trucks.
23800,what a cool trick I dont even think about it
23801,"There’s a good amount of subgenres for racing, but I can’t nail a definitive racing game available so here goes:

**Arcade**: Driveclub

**Sim**: Forza Horizon 4 (PC), Gran Turismo Sport (for PS4 Games)

**Futuristic**: Redout or WipEout: Omega Collection

**Sandbox**: Burnout Paradise Remastered

**Rally**: Dirt Rally 2.0 (I admittedly haven’t played this, but from what I’ve read it’s amazing)

**Kart**: Nickelodeon Kart Racers (until Crash Team Racing comes out, probably)

**Combat**: OnRush

**Soccer**: Rocket League

There’s also Assetto Corsa, Project Cars 1 & 2, The Crew 1 & 2, Need for Speed, Trials series, WRC series, F1 series that are worth mentioning. 

I know that WipEout, Redout, and Rocket League are playable in co-op and are pretty damn fun (Rocket League in particular). Rest are great for playing single player and nearly all feature online play"
23802,It's still Burnout Paradise.
23803,"NFS Underground 1-2, Most Wanted

Grid,Grid autosport"
23804,"Depends what you're looking for, but there are loads of great games out there.  Some of the ones I have:


**iRacing/Assetto Corsa/rFactor 1/2**


These are the main games for realism - they go for as close to life as possible.  As such, they pretty much *need* a wheel; controllers just don't work well enough (though DiRT can get away with it).  Loads of setup options, real life cars/tracks etc... Don't look here for career modes though.  All but rFactor 1 have at least some laser-scanned tracks too.  


iRacing is the one for serious online play - join leagues and compete against other serious people .  Assetto and rFactor are the best for mods - literally thousands out there.  rFactor 2 is highly regarded as perhaps the most *realistic* (v. subjective tho) but afaik isn't being supported as much as it was.  Still incredible though.


If you want a specific car, rFactor 1 is still the way to go.  So many mods, and still great fun.  Nothing beats the DRM revival mod - still the benchmark for 70's/80's absurd cars.



Graphics (for me) Assetto > iracing > rFactor 2 > rFactor (but this is rarely important)

**Project Cars/F1 2015**


Both games go for realistic, but don't quite hit the mark.  F1 2015 is leagues ahead of the older f1 games in my opinion.  Loads of cars - decent career modes.  Good fun, but not so serious.  Pcars has absolutely loads of cars and tracks from various eras/competitions/parts of the world.  Graphics are gorgeous, and the career mode is comprehensive.  F1 2015 has the 2014 & 2015 seasons.


**DiRT 3/Next Car Game**


Both great arcade games.  DiRT 3 is the arcadey version of DiRT Rally - good fun but a bit annoying.  Next Car Game is still Early Access, but is the next thing in car destruction and is amazing entertainment.  Both good on controller also.


**Euro Truck 2/OMSI**


Both are Simulators instead of racing games, but are great fun if you like that kind of thing.  Euro Truck is literally running a haulage company and driving trucks around (not as easy as it sounds!).  Surprising amount of game there.  OMSI is a simulation of Buses being driven in Berlin in 1989 (iirc) and is strangely addictive...



**Grand Prix Legends/GT Legends/GTR 1+2**


Classic games that are still great.  If your pc isn't running newer stuff well, then these are fantastic.  Grand Prix Legends is ancient but still fun, all about F1 from the 1960's.  Gt Legends is cars from the 60's up to the 80's(?) - GTR 1+2 are made by the same company and were groundbreaking in their day - 00's touring cars.



With regards to a wheel, I personally would lean towards the Logitech G27 instead of the newer one - you get a gearstick included with the G27 out of the box, plus it's cheaper too.  It's not the quietest though - the helical gears can be very noisy compared to belt-driven wheels, but the G920 has the same so I doubt it's make too much difference here.  If you want something more expensive then I'd recommend either Fanatec or Thrustmaster."
23805,Dirt Rally and any of the Grid games are really good. Besides that I have no idea.
23806,Grid 1 With a wheel is absolute crap. Be warned. I've heard Grid AS much improved this though.
23807,"newest and best in my opinion is project cars.
For absolute simulation racing project cars is good but assetto corsa is just a tad better.
The grid series is a bit more arcade'y but also much fun.
Don't know much about steering wheels because i cant afford one :/"
23808,"For sim racing on PC:

**Assetto Corsa** is the best hotlapping simulation out there and with really good, true-to-life graphics, however it isn't a finished product and if you want to play online lots, you'll most likely need the Dreampack DLCs. Since most the active servers require them, bumping up the total price to around $35-$50 which is still solid value, considering you get around 10 fictional tracks and 5-7 laser scanned tracks, plus around 50 well detailed cars to choose from(mostly european). It's also a highly moddable sim, from tracks to cars to in-game apps, expect this game to blow up even more with time. There is a career mode but it's nothing amazing yet.

**Rfactor 2** is also another alternative with good graphics, said to have physics on par with AC, but more features to the sim itself. I have not played it yet, did play Rf1 with mods, which was a blast actually, though graphics are bit dated now.

**iRacing** is widely accepted as the best, most realistic online racing sim. Though it's really quite expensive, with monthly and content subscriptions. Expect to pay upwards of $200 a year. There are also a few weird, minor kinks in the physics engine, and graphics aren't exactly new but it shouldn't be a problem for majority of racers. It more than makes up for it with it's robust online network & its various parameters that separate good drivers from the bad nicely. Not to mention every single track you pay for, is laser scanned to what can only be described as perfection. There is also quite a gigantic userbase here, so you shouldn't ever have problems with inactivity online.

**Project cars** sets you back $60, full-retail price. Haven't played this too much. Racing is good fun, lots of options to tweak & and full-day/night cycle with dramatic weather changes. Some tracks are laser scanned, some aren't, but there are 30 tracks total. Graphics are great and there's a good dose of racecars, but modding is not supported and the game still has some physics bugs from Shift 2 present.

**Richard Burns Rally** If you're a die-hard rally fanatic. Simulation is top-notch, even for a 10 year old game, naturally graphics are dated. There are around 10 cars to choose from, but the real draw is the tracks. They are real, long and very challenging with the game's difficulty level quite steep and such a realistic physics engine. There are also several mods for this game.

And check out the new **Forza Apex** if you don't want to spend a dime on PC sim racing, though it is yet to receive wheel support and requires windows 10. We also don't know much about it as it's a fairly new game.

For more info on sims and comparisons, I recommend you check out Sim-oriented sites like [Racedepartment] (http://www.racedepartment.com/threads/driving-realism-of-ac-vs-iracing.97542/)

Other titles that I've heard good things about, but yet to delve into:

Game Stock Car Extreme

Dirt Rally

GTR2

Grid Autosport

---Honorable mentions:---

BeamNG Drive: While it's not a Sim racer, it certainly is a car Simulation, and a very realistic one at that. The best crash physics on the market. No doubt. This game, isn't a game, it's an on-going development of a physics engine and continues right off it's first game, Rigs of Rods, only with almost complete re-write of the physics engine. So this ""game"" you could say has been in development for 11 years. Since 2005. Modding community is also very creative and the game comes with a built-in map editor for making scenarios(missions) and maps. Very cool game if you have a top-notch PC and just like crashing cars, planes, helicopters and anything else that is churned out by the modding community. It's only $20-$30.


--Arcade racers, just for fun:--

Wreckfest (previously Next Car Game)

Flatout Ultimate Carnage

Dirt 2/3"
23809,"if you like old games, need for speed underground 2 and most wanted bring back many memories to me."
23810,"The most realistic racing game is iracing which is good pratice, but i like playing grid for fun."
23811,I really enjoyed dirt 2. It's not on steam though sadly. It's one of the few racing games that has my actual car in it.
23812,"Just out of curiosity, what car would that be?"
23813,I'm one of the few out there with a solstice. It's a fun little car and kind of eerie to see the detail they put in the game to match the interior.
23814,"Ah, a solstice. I don't think I'll be seeing my car in any racing games anytime soon..........

unless somebody decides to put a '99 Jeep in a racing game, that is"
23816,"The only game I know of that would have it is some crappy Jeep racing game on the Wii that probably shouldn't have existed, and was basically just a terrible advertisement for Jeep. Even that didn't have mine in it though."
23817,"According to internet game car database, there's 400+ games with an actual make by Jeep in them. Not all of them are racing titles though."
23818,"There's a site somewhere that you can pick a model of car and it tells you what games it appears in, let me see if I can find it lol.

EDIT: Found it

http://igcd.net/makes.php"
23819,"Some game called Ocean City Racing that I've never heard of, a few NFS games (odd because I've NEVER seen it in one of those), and The Last Of Us. Didn't expect that one."
23820,"iRacing is by far the best true racing sim and it has a great community. Dirt Rally is fantastic. Others to look at would be Assetto Corsa and Project Cars. 

The G920 is good, but personally, I'd save some money and just get a G27."
23821,"I'll vouch for DiRT Rally. It's a fantastic game, especially considering it's still in Early Access (you wouldn't know it by looking at it though)."
23822,Definitely DiRT Rally
23823,"Project Cards, Assetto Corsa or I-Racing(this is one can get expensive).  

 You can also go the ps2 emulation route for Gran Turismo 3/4 if you want as well."
23824,"All of these games look amazing... I found the humble bundle quite a few of the titles mentioned here and went ahead and picked it up. I'm also looking at picking up either Dirt Rally or Project Cars... Probably project cars, I've spent a many of hours on laguna seca on Forza and would love to do it again."
23825,"There is a huge spectrum of racing ""games"". The question is, do you want something designed primarily to be fun and with lots of game-elements (we'll call this the Mario Kart side of the spectrum) or do you want a serious business tire traction simulator that is as difficult to learn as actual racing realistically is, involving possibly years of not-always-fun practice and developing your skills to master.

Something like the classic console franchises of Gran Turismo or Forza falls somewhere in the middle of the spectrum, and unfortunately there aren't a lot of choices on PC for that middle-ground. Most of the PC options lean quite heavily towards one end of the fun-vs-serious spectrum or the other. There are lots of games attempting to be fun crazy racing games with no basis in reality, and there are lots of games attempting to be a complete replacement for reality with no room for anything that a casual player would consider ""fun"".

Which is too bad, because the middle of the spectrum is my favorite part. It is sadly underrepresented on PC."
23826,"I wouldn't mind getting involved in a game that is a true simulator, but honestly I'm just looking for a game to fix that Forza itch I've been having."
23827,"Assetto Corsa, Project Cars, DIRT Rally, iRacing, Trackmania...

Gran Turismo 3+4 if you're willing to use a Playstation 2 emulator."
23828,"GT6 is much better than GT3 or 4, in terms of physics and graphics. Gameplay/career is slightly worse imo."
23829,"It's expensive, but iracing is the absolute best out there in my opinion"
23830,"Project Cars, DiRT 3, NFS:MW!"
23831,"If you are up for some simulation, I recommend you Dirt Rally and even better, Live for Speed. They are easily the games with most realist physics I ever played and they both run really well on various hardware. ;)"
23832,Forza :>
23833,That is an Xbox exclusive title. As much as I wish it where not.
23834,i was joking hence the :> face :>
23835,"Honestly? Nothing on Switch really matches what you're looking for. 

If you're not limited to your Switch, the PC Xbox game pass is 1 buck for the first month these days (you can unsub anytime) and has Forza Horizon 4/Forza 7."
23836,"This.  Forza Horizon 4 is splendid and the 5th one comes out in November, this franchise is the greatest car racing series as far as customization and driving fun are concerned.  You can make any vehicle do any type of race, create your own races from scratch, take any vehicle off road and just drive around free roam, keep your cars stock or supe them up to the max and still be able to do any race with them with the other drivers scaling to that car's class.  It's a truly great racing game, from someone who has been playing them since Cruisin' the USA and Beetle Adventure Racing on N64.  Switch doesn't have anything nearly as good, unfortunately."
23837,Waitttttttt a minute. Forza Horizon and Forza are 2 different series?!
23838,"yup!

Forza (Motorsport) is the original and afaik from what little i’ve played it’s very much focused on track racing, similar to Gran Turismo. your main focus is to win. it’s realistic compared to horizon.

horizon is the little brother and it’s a little more casual and opening. rather than being locked-in track racing, horizon focuses on open world racing, driving around, discovering landscapes, owning businesses, owning houses, and some mini games too (there’s a battle royale kinda mode, tag, team death match sorta mode)

i’ve only played motorsport 7 a little, but it seems pretty fun. i’ve dumped hundreds of hours into horizon 4 and it’s easily one of my favourite games of all time."
23839,"It's also got F1 2020, Dirt 4, Dirt 5, Dirt Rally 2, MotoGP 20; you'll definitely get your fix of racing sims on Xbox for that $1 entry fee.

On Switch, the closest I've found in terms of the actual racing is Grid, but that lacks all the other aspects of GT/Forza; collecting cars, tuning, etc."
23840,"A few people have suggested grid, but I’ve put about 40 hours into that career mode and there really isn’t much in the way of a garage of cars that you own afaik. It puts you kore in the role of a driver-for-hire; you get “offers” in different racing disciplines from fictional teams. Then you use the car they provide you for that season

There’s a good variety of cars you’ll end up racing, but you don’t really upgrade and customize them. Not in career mode at least, maybe I’m missing these options for online multiplayer

Having said all that, if you’re looking for some sim-ish racing, it really is as good as it gets on switch. It’s got a lot of notable tracks and some fun fake-street circuits

If you want to have a car collection a la GT/Forza, I don’t think it’ll scratch that itch, but the racing is quite good imo"
23841,"GRID online does have a limited amount of cosmetic and performace upgrades, but its mostly locked behind a level cap for each car. I have been playing since launch and even now with millions in cash, I cant upgrade my cars engine or drivetrain because the car needs to be a lvl50 for those mods, and im still at lvl20 on my most used car. I guess it would work better if there was a bigger online community for the game."
23842,Have you tried playing with analog triggers for acceleration?
23843,"I use the right stick for analog acceleration in handheld, and while it's sort of weird it's not too hard to get used to. But I have used a gamecube controller playing docked and the analog triggers work really well. It's definitely the best way to play IMO"
23844,Hot Pursuit has no modding but is ridiculously fun with the cop levels.
23845,"Grid is probably the most realistic racing game on Switch but no modification in it. Great car list and tons of tracks but the career is not really fun. 

CarX Drift Racing Online has extensive car customisation but the whole game is focused on drifting and the handling is very arcade (turn left to drift left, no counter steering). 

Gear Club 2 has car customisation and the handling is okay. Track design is not the best either."
23846,"Damn that's unfortunate to hear about CXDR. I love countersteering in drifting games, was hoping CXDR would be just as playable as on mobile. I'm hoping FR Legends will be switch ported one day."
23847,"It is as playable as CarX Drift Racing 2 on mobile, there are a lot more assist on mobile to make it play well on touchscreen. If you get a gamepad connected to your phone and play the game, it is very similar to what you get on the console build but self centering is weaker than mobile."
23848,"Considering there aren't any analog buttons or triggers, the Switch isn't great for realistic driving games. I doubt there will ever be many options."
23849,"Rush Rally 3 you can adjust different parts of your car to adjust how it drives, and can also customise the paint work of the cars (not just colour, but you can add and make patterns and logos). It also has brilliant gameplay, and requires winning races and tournaments to save up for the better cars."
23850,GRID ?
23851,"Grid will be your best bet, but the controls take a lot of getting used to."
23852,CarX Drift Racing Online
23853,I believe Asphalt 9 is on switch. I haven’t played an Asphalt in a while but they used to be so addicting
23854,Need for speed hot pursuit
23855,"Gear Club has customization but I found the load times too ridiculously long to get past to feel like playing the game.  I haven't tried GRID.

Overall there's better arcade races than realistic ones in the Switch.  Horizon Chase Turbo, Need For Speed: Hot Pursuit, Burnout: Paradise, Asphalt 9, Rise: Race The Future, Fast RMX.  Those are the best arcade racers on the Switch in my opinion (not in any particular order)."
