idx,text
16030,Sunglasses are actually my favourite accessory now- they step up any outfit and I can look decent without bothering to do eye makeup! I have a chubby face and wide cheekbones so I have a giaaaaant pair of black ones that look classy and polished ($3 on Wish!) and also some silver mirrored ones in a slightly cat eyed shape. Between the two I honestly can't think of any others I need- those two cover the bases for all outfits.
16031,"I have black ray ban wayfarer and I love them, they're super flattering and I know I'm protected from the sun. Unfortunately they're super heavy and always leave red marks on my nose that last for hours :\ am I alone in this?"
16032,"I'd like to add on OP's question by asking the ones of you that wear prescription (so not transition) glasses exactly how they wear them. I mean, do you switch between sun and normal glasses during the day? do you only go out with your sunglasses or do you always bring the normal ones along?

as you can imagine I've been meaning to get prescription sunglasses but the transitions​ are too high maintenance and I know I'm too lazy to switch between two pair of glasses all the time"
16033,"I keep my prescription sunglasses in my car because if I'm leaving the house, 99% of the time I'm driving. Once I get where I'm going, I'll switch before I leave the car (unless I forget like I do about 75% of the time) so I don't have to carry both pairs around since I carry a small purse if I carry one at all. If I'm just running in a store quick, I won't switch.

Prescription sunglasses were one of the best things I ever bought, seriously. Even if you use them for nothing else but driving, they are so worth it."
16034,"I carry my prescription sunglasses in my purse, always. Switch on even the barely sunny days. Partly for comfort, partly to ward off cataracts, partly to ward off crows' feet and other eye wrinkles.

My brother gets glasses that have those clip-on sunglass pieces, as does a dear friend."
16035,"I wear these:

[Celine Shadow](https://s-media-cache-ak0.pinimg.com/originals/ce/9b/46/ce9b46d54877e0349ea9aabb1c7e9fa5.jpg) with black and tortoise frames 

[Maui Jim Mavericks](https://www.mauijim.com/en/shop/sunglasses/aviators/mavericks) with silver frame and blue mirror polarized lenses

And my [Dita Supa Dupas](https://s-media-cache-ak0.pinimg.com/236x/1f/81/b7/1f81b7f0a4a4cf76d7be063ae77568f0.jpg) in black will always have a place in my heart 

In terms of shape, I prefer oversized (can you tell?) and not too boxy but not too round. Otherwise it just depends on my mood but I'm usually not an aviators person and my Maui Jims are the exception. Traditional wayfarers don't really suit my face so I avoid them. I really don't care at all about sunglasses trends and wear whatever makes me feel awesome."
16036,"I only buy cheap sunglasses since I am the queen of leaving them on the top of my head to fall on the ground when I look up and/or stuffing them caseless into my bag.

For the past couple years I've stuck exclusively to the Wayfarer shape since I think they add some angularity to my round face and aren't comically oversized on my small face/head.

Sometimes I wear my husband's aviators and they are GOOFY on my cheekbone-less face."
16037,I just stopped wearing contact lenses so I have prescription sunglasses that are the same frames as my regular ones right now. I'm looking for a new pair but haven't found any frames that I really like yet.
16038,Ray Ban New Wayfarer.
16039,"I used to be a cheap sunglasses person, but I bought myself two nice pairs and I looove them - unfortunately, I left my [burgundy ones](https://www.therealreal.com/products/women/accessories/sunglasses/balmain-oversize-embellished-sunglasses?sid=m9gvbv&utm_source=polyvore&utm_medium=shopping&cvosrc=cse.polyvore.polyvore&sid=o6rufs) on a plane and never got them back, so I just have my [navy ones](https://bossmanshades.com/wp-content/uploads/2015/10/Balmain-2024-Sunglasses-Frame-NAVY-Lens-Color-Gradient-Grey-BL202402-0.jpg)


I also have a pair (somewhere ...) of prescription aviators, but I always wear contacts so they aren't very useful.


It feels like everyone has been snapped up by Luxxotica, so I'll be creeping this thread to find a proper sunglass source."
16040,"[These](https://www.smartbuyglasses.com/designer-sunglasses/Marc-By-Marc-Jacobs/Marc-By-Marc-Jacobs-MMJ-477/S-D28/E5-296781.html#).  

I wear prescription glasses daily (I'm short sighted) and it sucks I can't have lenses put in these because I adore them but I totally can't see when I wear them.  But I always get comments on the shape and style.  They're classic but with a twist."
16041,"I wear prescription sunglasses (since I wear prescription glasses all the time). Mine are Ray Bans (I only own one pair), simply because I liked how they looked on my face & I can't afford to buy new prescription sunglasses every month. Brand name doesn't bother me, so long a they look sensible on my face. Interestingly, the arms of my RayBans do not have a metal arm, they're only plastic, and the size/shape of my head meant they kept falling off until my awesome optician added some [glasses grips](http://www.ebay.co.uk/bhp/glasses-grips) onto the arms so they're fully adjustable and dont fall off anymore. Yay!"
16042,"I have an Asian person nose and I wear false eyelashes everyday so I can't wear most sunglasses. The only sunglasses I can wear are the ones with nose pads on adjustable wires and I'm terrified of breaking more expensive ones trying to extend them as far as they will go. I usually just buy them from discount stores or Forever 21. 

(I'm aware of Oakley sunglasses, I'm not a fan of their styles.)"
16043,"I thought I was going to be the type of person who bought a bunch of cheapo sunglasses and just went through them, but with my dear MIL's influence I now somehow have two pairs of Chanel sunglasses. These are also the only Chanel items I own.

I have a black pair. [I can't find a better photo online unfortunately.](https://www.google.ca/search?q=CHANEL+5303H+Simply+Pearl+Collection&source=lnms&tbm=isch&sa=X&ved=0ahUKEwjX8v_wr5zTAhVl4YMKHT3sAr4Q_AUICCgB&biw=1366&bih=604#imgrc=GFJG0bMJ4oUODM:)

And I have a brown pair. [Again, I can't find a better photo, also I'm 99% sure these are it, but I'm not sure.](https://www.google.ca/search?q=chanel+pearl+sunglasses&source=lnms&tbm=isch&sa=X&sqi=2&ved=0ahUKEwi2-dq5r5zTAhWBzIMKHWMdD2UQ_AUIBigB&biw=1366&bih=604#tbm=isch&q=chanel+bijoux+sunglasses+brown&imgrc=FNRAXwXXNslmlM:)

I haven't really felt like I needed to buy anymore."
16044,"I bought [these](https://s-media-cache-ak0.pinimg.com/736x/23/6c/60/236c60030015d9e669df405128ed6c63.jpg) from Modcloth two years ago and I constantly get compliments on them! They're cheap but have held up very well, and they go with everything in every season."
16045,"I switch between a couple pairs. I have three pairs of Ray Ban aviators that I wear all the time. The classic, all black, and a frameless blue lens. On very special occasions or when I feel my outfit warrants it I'll wear my Tom Ford [Fanny](http://www.tomford.com/fany-sunglasses/FT0368.html) sunglasses. They are so precious so I don't like to wear them too often."
16046,"I have 3 pairs:
1) plain black Ray Ban Wayfarers (I wear these the most) 
2) a pair of blue grey ones from Banana Republic (50% off)
3) all black Celine's that I need my eye doctor to adjust because they're a tad big on me"
16047,I buy cheap ones. At the moment I really like square-ish cat-eye sunglasses. I found a pair that worked for me at Urban Outfitters for $16. I have a lot of trouble finding sunglasses that aren't too big for my face. They usually end up looking very odd on me.
16048,"My husband and I share the following Ray Bans we've acquired over the past 10 or so years:

- Clubmasters: these are my favorite in terms of shape and the fact that they don't hit my cheeks when I smile but they are so heavy and they leave marks on my nose

- Erikas: I like how these are lightweight and comfortable

- Old Wayfarers: I like the shape of these too but they are loose on me (they might have stretched out over the years) and slide off my face

- New Wayfarers: We got these in the rubber matte and it does not age very well. They look gross and peel-y now :(

I also just got the Madewell Indio sunglasses and I really like them! They look like these Oliver Peoples sunglasses I liked at a fraction of the price."
16049,"I don't mind spending on designer shades, but I have really bad vision so it's too much trouble to make them prescription. But I have a pair of prescription Gentle Monsters that I got for overseas for $100 usd. Fits so comfy on my face."
16050,These black rubber Ray Bans https://specsandmore.com/rb4222-rayban-round-622 have been my every day sunglasses for a couple of years now. So comfy. Less slippery than plastic and I love that their nose support is attached so it doesnt collect foundation or get stuck in my hair.
16051,this morning this thread inspired me so I wore contacts and sunglasses for the first time in years. I have a beautiful pair of grey saint laurent glasses with faded lenses and I had forgotten how much I like them. by the way SLP is one of the few designer brands that uses their own designers for their sunglasses
16052,"I lose/break/sit on/scratch sunglasses a ton, so I only buy cheap ones, pretty much. I have a pair of [Quays](https://www.quayaustralia.com/collections/women/products/kosha?variant=36390222542) that I got as a gift (silver/clear) and I love the way they look but I feel like the lenses are kind of pale and don't actually protect me from squinting in full sun.
 

I have a few from Sunglass Spot, almost all of theirs are $5 and they have really trendy styles. I think it's kind of a toss-up quality wise, but for the most part they feel about as nice as Forever 21 or other fast fashion options. [This](https://sunglassspot.com/collections/round/products/steampunk-inspired-full-metal-retro-round-colorful-lens-sunglasses) is my favorite of the pairs I got from there, they have sort of a fun goggles vibe. [Here](https://www.instagram.com/p/BPikKM6D0Ge/?taken-by=breathcue) is me at the local women's march in another pair from Sunglass Spot.


Otherwise I'll hit up H&M or Forever 21 since I know they'll always have a selection of trendy styles."
16053,"I've got a couple of pairs that I've collected over the last six years or so... I have a very very small head and most adult sunglasses are too big for me (they look too big but also don't stay on my face). 
I used to prefer cat eye shapes and wore a $100 dupe of the Ellery x Graz sunnies for a few years because I could never bite the bullet on the $330 price tag.
Then I moved to round frames, I bought the Porto style from Bespecd for about $80 that were my go-to the last two summers.
More recently I wanted to take my sunglasses game to the next level, I found the [M6 model of Kuboraum x Julius](https://dt66ikht21gkc.cloudfront.net/img/imgocchiali/358/img_art_JULIUS_MASK_M6_MATTE_BLACK_BURNT_BM_BT_A.jpg)  and fell in love with how quirky they were (and they fit my face!). At $550-ish depending on the retailer I just couldn't do it even though I was prepared to invest more this time around. However my gorgeous boyfriend remembered them when I mentioned them about 6 months ago and got them for me for my birthday. I absolutely love them so much. They're so unusual that they circumvent style trends, so I'd say these are my sunnies for the long term now. If I ever got another pair it'd be to add to the collection rather than replace."
16054,[Ray-Ban Erika Metal](http://www.sunglasshut.com/us/8053672587692) in gold. They go with everything yet add interest and the shape is great for my oval face.
16055,"I've been wearing Ray-ban aviators for years now. They're the only ones I wear these days. I've considered getting another pair of sunglasses in a different style, but I've never been in a rush to. The aviators kinda became my go-to.


Edit: I wear contacts most of the time so I haven't needed to get rx sunglasses. At one point my sister - who also wears contacts - had an eye issue and couldn't wear hers for a while. She got a pair of prescription sunglasses and basically wore those when outside and her regular glasses when inside/when it wasn't sunny. They can make rx lenses for almost any frames provided the lenses are relatively flat."
16056,"I ruin sunglasses very quickly (I stuff them in my purse and they always get scratched), so I usually buy several at a time for less than $10 a pair. I'm really in love with a pair of yellow heart-shaped frames I got for like $6."
16057,Rayban Clubmasters I got on ebay 8 years ago!
16058,"I have a prescription pair of [ over-sized Coach sunglasses](http://imgur.com/6IUFvSO) that are tortoiseshell that I love. Unfortunately though, I've lost weight in my face and it is hard to keep them on now. But I love them."
16059,I just got these [Onyx](https://eastora.com/collections/all-accessories/products/devi-onyx) today. I prefer cat shape and no prescription as sunglasses make me dizzy :(
16060,"I'm really picky about shapes because I feel like most of them look super odd next to my chubby cheeks. I generally prefer a vaguely cat eye-ish shape.

My daily go to: [Ray Ban Erikas (Tortoise)](https://mosaic02.ztat.net/vgs/media/pdp-gallery/RA/25/1F/00/17/03/RA251F001-703@2.1.jpg)
My fun pair: [Quay w/ clear frames](http://www.lastylerush.com/assets/images/QUAY%20Australia%20LikeWow%20Rave%20Glasses%20CBLU-m.jpg)"
16061,I have those Erikas in matte black.  They're so lightweight and I get compliments all the time.  10/10
16062,"I have a pair as well, comfortable and generally a nice pair of sunglasses."
16063,"Go to Nordstrom rack and raid the red stickered clearance glasses. I've gotten like Linda Farrow for the gf and a few ray bans and other designers for myself all anywhere between $30-50.

This is if you enjoy shopping for deals like I do. Otherwise just buy glasses from where ever"
16064,"That's what I did, I got my pair of ray bans for like $60 I believe"
16065,"Good call, I do the same. You’re at the mercy of what they have available but they usually have a solid selection."
16066,"Oh they usually have scraps, I agree. But hey, you gotta enjoy shopping haha"
16067,"I've gotten ray bans, shwood twice, saint laurent twice, dior, zegna, Oliver peoples, and celine sunglasses using this method. Probably spent around $300 for $5000 worth of sunglasses."
16069,Damnnn they pricy
16070,"Check out American Optical, almost identical but much cheaper"
16071,Yup. Both companies are using the same design for aviators contracted by the US military in the late '50s.
16072,"American Optical's Original Pilot sunglasses are fantastic. They still make glass lenses, but I'd opt for the polarized polycarbon​ate. And while I know it's not authentic, I didn't get the bayonet temples - I find them uncomfortable.

The other brand I like is Electric - I have a pair of Electric Swingarms that I like a lot.

https://aoeyewear.com/shop/#!/Original-Pilot-Sunglass%C2%AE/p/109208906/category=29540456


If you shop around you can usually find a pretty good deal on them."
16073,Sweet thanks
16074,They got marked up because they were worn on Mad Men. American Optical originally held the US contact for aviators and later lost them to Randolph. Buy the AO ones for cheaper.
16075,"Go to Costco: Their Kirkland brand sunglasses sell for around $25 not a large selection, but they're fashionable-ish and seem of good quality. They had wayfarer style, aviator style, etc all for around the same price.

Also in the opitcal section they have a larger selection (More name brand stuff like Police, Oakley, Persol, REVO, Serengeti, etc, etc...).  - again very reasonably priced. I bought some Hobies for around $40 and i'm very happy with them. Polarized, etc."
16076,"Unfortunately, Costco optical and all the brands you named (except Kirkland) are Luxottica owned as well. All of those brands made quality products prior to their acquisition and now they are noticeably cheaper but selling for the same price."
16077,"Serengeti is owned by Bushnell. Advanced optics (polarization, photochromic lenses) are standard, and they can be found at the same price point as non-polarized Luxottica shades. I've had the same pair of Serengeti Napolis as driving glasses for probably 10 years and 3 cars, and I have no plans to replace them. I left my Wayfarers at a bar in NYC, found a pair of Serengeti Carlo for $45 on EyeDictive to replace them, and now couldn't care less I don't have my Wayfarers. 

I'm with you on the Luxottica front. I have a pair of Wayfarers from the 60s when they were made by Bausch and Lomb, and those things are tanks. The pair I lost weren't even comparable."
16078,"Glad to see Serengeti hasn't given in. I worked for Sunglass Hut in college (about 12 years ago) and was disappointed to see them destroying so many high profile brands, I will buy from them from now on."
16079,"> I have a pair of Wayfarers from the 60s when they were made by Bausch and Lomb, and those things are tanks. The pair I lost weren't even comparable.

You have no idea how bad it's gotten. I broke a pair of 2013 WFs at a party in 2017, bought another pair, and had the screws fall out within weeks due to no mistreatment. They replaced those, then those got stolen. Insurance covered that, tried a Clubmaster series. Liked how they looked but felt cheap. Broke in two weeks. Asked for a refund and was told no. Would've gone elsewhere but couldn't *see*, so I asked the clerk for a recommendation and he gave me some POLOS that have held up nicely (despite also being Luxottica).

Moral of the story, do not buy Luxottica brands anymore, ever. They're basically roadside vendor quality now at high-fashion markups. I have more faith in quality control from *drug dealers*, FFS."
16080,I grabbed my wife's Wayfarers to remind myself what they're like now and you nailed it with the roadside vendor comparison. They just feel cheap.
16081,"From what I can tell, the quality hasn't seemed to suffer. The build of my newer pair feels solid and the optics seem the same. That said, their poly lens optics are very good, but their glass lenses are incredible. Overall, I can't see myself buying any other brand at this point.

My wife on the other hand, she likes wearing Ray Bans because they're Ray Bans. So we have several pairs of Ray Bans around the house. And she'll continue buying Ray Bans, much to my chagrin.."
16082,"I went to a Sunglass Hut last fall to get replacements for my 15 yr old Ray-Bans. All the Luxotica Ray-Bans were complete shit. They were all non optical quality poly lenses. They looked cheap as hell but still cost $200+. I didn't see any glass lenses in the styles I like, if there were any at all."
16083,"If you had 15 year old Ray Bans, these were also made by Luxottica. 

Luxottica bought RB in 1999 and started making them In 2001. So, anything post 2001 is made by Luxottica. I do agree that the Chinese made Luxottica stuff is cheaper looking and feeling than the Italian stuff. I normally stick to the Italian stuff and I can tell a vast difference."
16084,If you are paying 200+ then might as well go for Maui Jims
16085,"Agreed! Luxottica has systematically bought up all the once respectable brands and produced what are essentially cheap knockoffs using the actual brand name, but still keeping the same price tag. It’s really sad. A pair of Ray-Bans from 15 years ago were obviously superior just by holding them in one hand and a cheap pair in the other. They fit comfortably, had higher quality lenses, and were also durable and didn’t break as easily. Now, remove the logos and it’s hard to even tell the difference."
16087,"Nope, look every time I go in there"
16088,I bought a pair over the summer. They have them around still.
16089,Pretty sure Luxottica does Police and Oakley too
16090,[Goodr](https://goodr.com/?gclid=Cj0KCQiA68bhBRCKARIsABYUGieqD2Pj6cl-KUpRrF3hSh5jY9BbXqwtTMnzz-nFRG_Pc-JBtdjA-1caAiIoEALw_wcB) are great for $25
16091,"Got them for running, ended up wearing them for all other occasions as well."
16092,Surprised these aren't higher.  Y brother just got a pair for Christmas and they are dope!   Been starting to see them around alot
16093,"Thanks, friend. I just bought me a pair."
16094,"They're still expensive, but my Costa del Mar's are amazing."
16095,"2nd the expensive part, but worth it.  Paid $200 for a pair of 580G Blackfins 10 years ago.  Rubber on the frames wore out once, they sent me a brand new pair.  Still rock them everyday.  Not a part of Luxotica to my knowledge."
16096,"++ On the repair - I sent mine in with a cracked lens - and got a new pair.

They're either on croakies or they're on my bag (still on croakies). I'm fucking terrible with losing things, so unless they're literally strapped to me, I'll lose it.

You can take the boy out of the frat, but you can't the the frat out of the boy."
16097,"Sunglasses are incredibly marked up items. If you want to get a pair of ray bans that are pretty much identical to retail and dont want to directly support the company, go to /r/fashionreps and look up ""Aooko"" in the searchbar. I have a pair of his clubmasters for 45 bucks and they look and feel identical to the retail my girlfriend has."
16098,$45 is still a lot for fake ray bans.
16100,"Unfortunately, the very first result for the search in that sub is ""DONT BUY AOOKO SUNGLASSES!""

They seem like a controversial brand but its the first time I've heard about them, so thanks"
16101,"If you read the comments, it seems that what he claims isnt an honest finding. I had mine tested to see if there is any way they could cause damage to my eyes and I was told that these were perfectly fine."
16102,"It's such a weird complaint for people to make about Chinese sunglasses. Like, *oh, they won't protect your eyes from UV and you will go blind* but fancy sunglasses aren't $200 because the lenses are expensive -- it's the frames. Cheap polycarbonate plastic lenses block it all just fine, which is why safety glasses are like $3-$5.

It happens a lot with sport sunglasses too. Don't buy those Foakley sunglasses for $20 because you'll die, you should definitely spend the $250. Don't get me wrong, Oakley has done a lot of r&d and they've made real changes in the industry, but I'm simply not able to spend that know and of money on sunglasses I may lose/break. And I don't think my shades should cost half what my bike costs."
16103,You just a need a more expensive bike to justify more expensive glasses. easy math
16104,"'Tis a slippery slope, bike ownership."
16105,The hardest thing to build is a brand. Every single time you buy something name brand the majority of the cost is royalties for the brand. Using the world royalties in an unorthodox business fashion here.
16106,"I agree, but that's not usually the point people make with these discussions. With glasses it can be especially finicky and contentious because Ray Bans are super expensive now under Luxotica, but back in the day we're gas station sunglasses."
16107,"Well that’s because Bausch and Lomb was going under and the brand went to shit. Prior to the late 90s Ray Ban (called that because they ban rays) was a very reputable brand in the US and their sunglasses were premium. Shit happens, things change. And Luxottica, might be putting a huge mark up on their shades, but they sell and are well made. Luxottica also makes just about every eyewear our there.  So you can’t scape them. I don’t care about brand, but I will say that the optics in Luxottica’s Ray Bans are far better than those of your 20 dollar gas station shades. I buy my Ray Bans at a descent price point. I have two pairs of lite force (very light plastic) frames, one of them being folding Wayfarers, which I love. If you can find Ray Bans for a discount, they are worth it."
16108,I’ve heard that cheap/fake sunglasses that don’t block UV rays are more damaging as your irises open up due to the shade of the glasses and therefore take in more harmful UV rays which do not get blocked by the fake lenses. How true is that?
16109,that applies to all non-polarized sunglasses
16110,"i've got two aooko pairs and have received nothing but compliments and they've held up great over the past couple years. Not polarized, unfortunately but he doesnt advertise them as being polarized anyways"
16111,"I've got a pair from aooko and one of the hinge screws fell out within six weeks. When I asked for a replacement they told me to buy a new one and offered $5 off. Service isn't great. I can't recommend them. I would, however, suggest another seller called Vincent. Look him up."
16112,huh. im surprised he said that. Were you able to screw the hinge screw back in? not saying it's your responsibility to do that but some eye places will do it for a couple bucks
16113,I could manually screw it back in but it was extremely loose even using a screwdriver. I screwed it back in only to have it fall out and get lost again after a few weeks.
16114,I've bought two pairs of Ray Bans from Aooko; couldn't be happier with them. I compared them with a real pair my buddy owns and they are damn near identical. Definitely worth it.
16115,DHgate is probably the easiest. These products come from China so shipping will take forever. Alternatively you can use a shopping agent or order directly from the seller to get it sooner but shipping will be a bit costly.
16116,Shipping on DHgate is free in most cases. Shipping can just be slow.
16117,"Aren’t those knockoff sunglasses even worse for your eyes than not wearing sunglasses at all? Read an article about that recently.. your pupils dilate because it’s “darker”, but they aren’t polarized so they’re taking in direct sun. 

If your goal is to look cool and like you own Raybans, I’m sure they’re fine. But if protecting your eyes is of any priority wearing sunglasses, you shouldn’t wear these. 

Edit: as others have pointed out, it’s that they aren’t 100% UV protection, not that they aren’t polarized. I didn’t remember the article correctly."
16118,"I don't see what polarization has to do with it, all that does is reduce glare and is mostly pointless if you're not fishing. Perhaps you're thinking of the lenses not having proper UV blocking? That would definitely hurt your eyes."
16119,"After looking it up, I misspoke and you are correct. The knockoff sunglasses often don’t have 100% UV protection."
16120,"Polycarbonate is already highly UV resistant. Glass is a different story. If you are worried about a pair, have them tested at your optometrist. They have a machine that will tell you if they are safe to wear or not."
16121,There have been several reports on Aooko’s terrible QC and lack of UV protection including threads with optometrists analyzing it.
16122,American optical is what you're looking for. also look at Amazon
16123,You can buy Aooko from DHGate too
16124,"I have two pairs of Aooko: Ray Ban Justin, and Ray Ban Clubmasters. They feel identical to what I’ve seen at eyewear stores and look great. I paid less than $40 a pair. Couldn’t recommend it more.  

You can buy them from DHGate directly, or buy them from the Chinese store, Taobao, by using an agent such as Superbuy. The DHGate route is much easier but costs a few bucks more."
16125,I searched his name and I still can't find any place to actually buy his glasses.. Any additional help?
16126,https://www.reddit.com/r/FashionReps/comments/710qq7/aooko_rundown_ultimate_guide/
16127,"I got some Knockarounds around Black Friday, I'm loving them."
16128,"Second Knockarounds, have had about 10 pairs and love them. Cheap enough to “knock around” but don’t look cheap."
16129,"I have 3 pairs and they’re fine for those times times when there’s a high likelihood for drops, etc. But they feel cheap."
16130,"Another vote here for knockaround. They have a bunch of styles all cheap, but well made, and to my knowledge not owned by luxotica."
16131,"Only brand I wear anymore, although I always go up to the second ""tier"" or whatever. The basic ones look very cheap with the huge logo on the side."
16132,"I whole heartedly second this. The basic ones are not worth it at all but the ""premium"" or whatever the better ones are called are about $5 bucks more expensive and look much much better"
16133,"I own like 5 pairs of these in various colorways and lens options, and I can’t recommend them enough! They happen to fit me really well and if I accidentally break a pair it’s fine because they’re only $20 or so. The polarized lenses seen great for the price."
16134,I love my Knockarounds and they sell Polarized ones too!!
16135,"I've amassed over half a dozen Knockarounds. They look great, they hold up just fine and if they get broken or lost, it doesn't hurt my wallet to get a new pair!"
16136,Shwood and Raen are pretty good brands. You get the higher end stuff without supporting Luxottica also
16137,"Came here to say Raen. They aren't cheap, but you can usually get at least 20% off by signing up for their email. Also take a look at Steep and Cheap,"
16138,I've also been able to find Raens on discount or on eBay for really good prices. They are my go to!
16139,"[Warby Parker](https://www.warbyparker.com/sunglasses/men/barkley/oak-barrel) I personally got these, quality is very well and they range from 90-150 i believe."
16140,I was in one of their retail shops the other day and was surprised how pricey they are. The ones I liked were all over $200. I thought they were supposed to be disrupting the luxottica monopoly.
16141,Are you 100% certain of that? I’ve never seen WP more than ~$100.
16142,"WP has a bunch of new styles in the last year or two that are pricier. They're usually metal or mixed material or a limited run. Getting sunglass lens with a prescription also adds to the cost, as does high index lens if you've got a high power."
16143,I guess that’s what they were. But not prescription. Maybe they’re more expensive in store than online?
16144,"Pro tip: you can get a free lens replacement on any pair purchased in the last year. 

Totally learned while I was looking to buy another pair to replace ones I had scratched up. Overall been a big fan of their sunglasses."
16145,I forgot I totally did this! Highly recommend WP for eyeglasses. Prescription lenses is included as well
16146,"big +1 for prescription sunglasses if you don't use contact lenses, but price does reach $175+"
16147,"The quality of Warby Parker is just ok. The fact that not one of their glasses (at least that I’ve seen in brick and mortar stores) has a spring hinge kinda sucks. Yeah, they’re definitely cheap, but the quality isn’t great either."
16148,Fantastic normal prescription glasses but their sunglasses are garbage because they don't apply anti reflective coating to them. So all you see are reflections when driving. Not sure why they do this because they do apply it to their normal glasses....
16149,"Sunski has great sunglasses, their style is a little neutral tho"
16150,Great sunglasses and better customer service. I snapped a pair last summer and emailed them and they gave me a free new pair of my choice w/free shipping
16151,"I had a pair but they got really badly scratched in like a week - I was taking care of them fine, they just got a few years worth of wear and tear extremely quickly, which sucks."
16152,Also they sell replacement lenses. Maybe $12-14.
16153,I recently got a pair of American Optical Original Pilot on Amazon for about $100 and they feel/look amazing. I love that they come in three sizes since a lot of sunglasses only come in one or two and they're usually too big for my tiny head. The fact that they are genuine American made and not part of the Ray Ban / Luxottica monopoly is just a plus.
16154,"AO can be had for less than 40 bucks. They are nice, for the price."
16155,"I'll second American Optical. Probably the best value in sunglasses. Solid frames, great styles, and their glass lenses can't be beaten for clarity. The bayonet temples are great for wearing under a motorcycle helmet, too. Opticsplanet has them on sale pretty often."
16156,2nd for American Optical. Love mine. Bought a second pair because Poseidon took my first pair when I wore them in the ocean.
16157,"Eyebuydirect and Zenni.

Really happy with eyebuydirect. I got this $35 pair as an alternative to the Ray Ban round classics. https://www.eyebuydirect.com/sunglasses/frames/disclosure-brown-l-18773

I believe you can also make any glasses frame into sunglasses."
16158,I've ordered multiple pairs from Eyebuydirect and have been very satisfied with the quality.
16159,"EyeBuyDirect is owned by Essilor, which is owned by Luxottica. 

EDIT: Try [Bailey Nelson](https://baileynelson.com/), [Ollie Quinn](https://www.olliequinn.com/), [BonLook](https://www.bonlook.com), [MarsQuest](https://www.marsquest.com/)"
16160,Thats spoiled too. Maybe not knowing is better :)
16162,What was the cost of prescription sunglasses for you from Zenni? I am looking into it as well.
16164,"Second Eyebuydirect. While they couldn't support my prescription, the pair I got for them feels pretty sturdy for the $30 I paid. That included a gradient tint, too."
16165,I bought two pairs of Shady Rays this year and they have been solid.  They will also replace them twice for free if you lose or break them.
16166,"Same. They have buy one, get the next 50% off sales pretty often, which is where I picked up mine. I hope they keep expanding their styles, they are good quality for the cost."
16167,Nectar makes some sweet sunnies. I've been really happy with all the pairs from them I've tried. They're like 40 bucks and usually on sale.
16168,"BIG one up for nectar... great options, very VERY durable, and great staff support. I’ve bought 5 pairs, only need replacements because I’ve lost (2 of) them. Also most, if not all, are polarized which is very important for retinal health"
16169,Blenders.
16171,"I’ve had 3 pairs of these, they’re great quality especially for the price."
16172,"Love my pair (love that they carry smaller sizes that fit my face better). Also, great customer service. They sent me a pair with a loose screw (tried to get it to stay in, was screwing it back in every other day near the end) that fell apart about 6 months after I got them and even though there's no warranty they sent me a replacement no questions asked."
16173,random question do they ever make you dizzy?  for some reason I feel like I get seasick when wearing them.
16174,I love Izipizi sunglasses! Great value
16175,"I'm a big fan of Oakley Holbrooks in matte black.  By no means are they ""dressy"" but I feel they are definitely a solid casual to semi-dress pair of shades.   Can be had for as low as $90 non-polarized."
16176,Try to get cheap Serengetis. I got a sweet pair on amazon For 60 bucks. Tortoise shell Acetate frame. Photochromic glass lens. Imho best glasses on the market. Sometimes costco carries them but usually ugly styles
16177,Vintage Serengetis are some of the best sunglasses out there. They'll cost a lot more than $60 though.
16178,I agree they are the best. I got brand new ones on amazon.com. Giacomo large about year ago. Sometimes you can find them.
16180,"If you can find American Optical on amazon warehouse, they are US made, non Luxottica very high quality glasses. 

Also, I have a few pair of safety glass sunglasses. Very high quality, impact resistant, and come in polarized flavors, such as these: Edge Eyewear TSKAP218 Kazbek Polarized Safety Glasses, Black with Aqua Precision Blue Mirror Lens https://www.amazon.com/dp/B001KIGKVE/ref=cm_sw_r_cp_api_i_4KRmCbSREEW01"
16181,Toms on sale for ~$50 or less. They typically make great quality sunglasses. Check Nordstrom Rack. They had a decent selection a couple of days ago when I checked.
16182,"I've owned a number of Peppers brand sunglasses that I really like. You can find them online for $30-50 depending on the style. I've found that the lens quality is on par with much more expensive sunglasses, and the build quality is good for the price point as well. I'm pretty rough on my sunglasses and a pair of Peppers typically lasts me 2 years of daily wear."
16183,They aren’t necessarily cheap but I love my Revo’s.
16184,I think Knockarounds are great. You can get polarized ones for \~25$
16185,"[Triwa.](https://www.triwa.com/us/sunglasses/mens-sunglasses/) They are expensive but frequently go on sale 50% off and currently have a 15% off promo code: SAGE15 that stacks. 

They make a few models that are reminiscent of ray ban wayfarers and club masters but once you hold a pair in your hands you'll know just how shit and flimsy all Luxotica sunglasses are. They are hand made, hardware is top notch stainless steel, and come with extra screws with loctite already applied that I have never had to use. Mine have survived many drops onto rock and asphalt, so far none of the screws have come loose.  

Their sunglasses are great, but their watches are way over priced. All in all, their products are extremely worth it when on sale."
16186,I own a Triwa watch.  It’s over 2 years old and it still looks to be in mint condition.
16187,"They're nice watches but use 5 dollar quartz movements. Aside from that they are all stainless steel/gold tone and acetate (plastic). They look good, but parts and materials considered, overpriced."
16188,I agree.  I’ll always take my Seiko SNN079P2 over the Triwa.  But the Triwa is just stunning (from a fashion standpoint) and never fails to get me compliments.
16189,"I bought a pair of Woodies off amazon and they are great. Half the frame (part goes behind the ear) is made of wood and the rest is plastic. I got one made out of ebony wood for $20 and they're the best pair of sunglasses I've ever owned. They also have a really cool pair of sunglasses made out of bamboo, but they really don't fit my style and are $60."
16190,Jomashop has great deals on RayBans
16191,"https://www.suncloudoptics.com
I love these. Don’t know if they’ve been mentioned yet."
16192,"I’ve used sunclouds for beaters (river, hiking, climbing), but they feel *really* cheap (lightweight and flimsy frames) compared to good sunglasses. And the lenses scratch super easily. They certainly have a place, but not what I’d want for a “nice” pair of glasses."
16194,"This.  Bought some off eyedictive for $30 last week.  Past season model.  I fly fish and having good quality, polarized lenses is a must.  Smith's have great lenses."
16195,My problem is that Smith chromapop plastic lenses scratch so so easily. Haven’t tried glass chromapop. Though these are the best lenses I’ve ever looked through and I own three pairs.
16196,try [eyedictive.com](https://eyedictive.com) new offer every day.
16198,"Your submission has been automatically removed because affiliate and referral links are not allowed in /r/frugalmalefashion. If you believe this removal has been made in error, please message the moderators using the button on the right sidebar.

*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/frugalmalefashion) if you have any questions or concerns.*"
16199,Check out Chimi or Sun Buddies.
16200,"I don't know much about sunglasses, what makes a pair worth the money? Just how durable they feel?"
16201,American Optical. though they're a bit heavy for my nose.
16202,"I was in the same place you were a few months ago.  [Nordstrom Rack](https://www.nordstromrack.com/shop/Men/Accessories/Sunglasses%20&%20Eyewear)  proved to be the solution.  Went on their website and got $200 sunglasses from Electric California for $35.  They are worlds better than any other sunglasses I’ve had, even my (now-broken) Ray-Bans.  Most of the stuff you find on the Rack is extremely high quality because it’s liquidated/out-of-season products that are originally from Nordstrom.  In other words, you can get these $200 designer, fully-polarized shades for <$40 shipped.  I recently suggested some from [Timberland](https://www.nordstromrack.com/shop/search?query=Timberland+sunglasses), who are known for quality products."
16203,"I got a pair of ATTCL on Amazon for $26 that are the same style as clubmasters. They don't feel cheap at all. They have metal frames as well as polarized lenses.

[Here they are on Amazon.](https://www.amazon.com/dp/B07CGL7197/ref=twister_B07CGGNRCV?_encoding=UTF8&th=1) They have other styles too if you aren't looking for Clubmasters."
16204,"If your head is XL then try bisonheadsunglasses.com

New season shipping in Feb, and only 50 dollars including case"
16205,"I love my William Painter “The Hook”.

Titanium frame. Guaranteed for life. And they have a beer opener built into the design. I stepped on my pair and broke them, they sent a new one within a week.

Cost under $150."
16206,So you might say that the hook brings you back?
16207,I can vouch for sunglasses from Han Kjøbenhavn!
16208,How is glassesusa?
16209,There's a brand called Panda that make sunglasses out of bamboo which I really like. They're very lightweight but high quality. They used to run about $80 bucks not sure anymore.
16210,Check out American Optics. They’re pilot glasses. Don Draper wore them on Mad Men
16211,Costa del mars off Amazon
16212,"Have you hear of 100% they are relatively cheap under a hundo for some sunnies [100%] (https://www.ride100percent.com/cycling/sunglasses/campo.html)  not sure who owns them but I don’t think it’s a conglomerate.

They also have polarized for about 150 I believe"
16213,Rudy project makes great sunglasses. During sales they can be had for ~50-60% off. I think they also have lifetime replacements on the lenses.
16214,polaroid
16215,"Check out Shady Rays. Not too expensive and they look good. And you get two fuck ups, where they will send you a new pair for free"
16216,"Someone else mentioned Sunski, but I wanted to write a separate comment recommending them (instead of a reply to their comment)! They’re about $55/pair. They come polarized! They have a number of designs to select from. They come with a lifetime warranty! So if they snap on you, send it back and they’ll give you credit for a new pair! If you scratch the lenses, they sell separate lens kits so you can easily swap them out! And they’re lightweight!

I’ve replaced 1 pair so far and I’ve gotten a few lens kits (for different colors)."
16217,"Try Columbia, I got a pair about a year ago primarily for the UV protection which is amazing. Overall quality was quite sturdy. The aviators I got cost around  $45."
16218,"On AliExpress you can find a brand called ""Elitas"" that have aluminum framed sunglasses with polarized lenses for like $8 in a variety of styles. I have 3 pairs of them that I ordered 2 years ago and they've held up fine. The downside is it takes around a month to get them delivered. I think Amazon might carry them but they're $15-20 each"
16219,"On that note, sunglasses brands for guys with big heads? Your average pair of sunglasses will dig into my temples like crazy because they're not wide enough."
16220,"Shady Rays. I got a nice set of Wayfarer style glasses for $50, better part is that they offer 2 replacements if yours are lost, stolen, or broken. They have great polarization, very similar to a set of Costas I had previously."
16221,Sunski is an online only brand that does homages to classic designs. I have had a pair which I use for travel (scuba trips and visits to generally rough parts of the world) and they've held up fairly well.
16222,"Check out [eyedictive.com](https://eyedictive.com) \-- very limited selection, but every now and again they have some majorly discounted steals on solid sunglasses."
16223,DHGate ray bans
16224,I really like Sunskis
16225,"Knockarounds. Polarized, comfortable, customizable for $15."
16226,Knock around premium. $25 and the hinges are SO STRONG. A+. Good hinges turn me on.
16227,"I was watching steepandcheap.com for a long time, waiting for Smith Wolcott Chromapop+ to go on sale.  They are normally $229, a price I was unwilling to pay.  Then last summer they dropped them to $75.    I stopped buying Oakleys since learning of the Luxottica monopoly.  Smiths are much higher quality."
16228,If you’re in Canada The Bay has some Alfred Sung polarized glasses for as little as $20. I’ve had a few pairs of the club masters and they are very good for the price.
16229,"I like this brand called Woodies. I get them on Amazon for like $25. Most of them float, they have a ton of different colors of wood available for the frames, and I’ve beat mine to hell but still have the two original pairs I bought two years ago."
16230,"Goodr.  I cannot say enough good things about them. I bought a pair, they're $25. They have funny names, weird colors, and work and look great. 

They do fit on the snugger side as they are geared towards runners, so the tighter fit helps prevent them from slipping around on the face. 

https://goodr.com"
16231,I got a pair of Polarized Dot Dash sunglasses for like 30ish bucks and the build quality is very nice. They aren't name brand but they are solid quality sunglasses for cheap. [https://www.dot-shades.com/](https://www.dot-shades.com/)
16232,"I actually buy off of e-bay, usually used. Bought both Julbo and Tico Sol, with the leather side shields, didn't pay more than 25 bucks CDN for either, with shipping and tax usually less than 50 bucks. 

Here's a link to a new set of Julbo's of the same style. 

[https://www.smartbuyglasses.ca/designer-sunglasses/Julbo/Julbo-VERMONT-CLASSIC-J010-1121-339629.html](https://www.smartbuyglasses.ca/designer-sunglasses/Julbo/Julbo-VERMONT-CLASSIC-J010-1121-339629.html)

Heres one of the same style on E-bay- [https://www.ebay.ca/itm/Sunglasses-Sportswear-Skiing-Julbo-Colorado-PE-Polarized-Spectron-X-6/264122015686?hash=item3d7ee61fc6:g:6E8AAOSwnINbnV-5:rk:8:pf:0](https://www.ebay.ca/itm/Sunglasses-Sportswear-Skiing-Julbo-Colorado-PE-Polarized-Spectron-X-6/264122015686?hash=item3d7ee61fc6:g:6E8AAOSwnINbnV-5:rk:8:pf:0) 

Just have to shop around."
16233,"I get Serengeti off eBay or Amazon. Retail on them is ridiculous but they are 50-150 at those places depending on the frames. I super love them and have my 3rd pair over 10 years. One i dropped and broke, one is my backup, and one i wear daily"
16234,"I've found Blenders eyewear (https://www.blenderseyewear.com/) to be pretty good quality and great price! I have their snow goggles too and I love them. 

Here's a $20 off link (http://fbuy.me/lkr0-) for frugality!"
16235,[Shady Rays](https://shadyrays.com/) which come with 2 replaced pairs when you break/lose your old pair for $7 shipped so it ends up being $42 for 3 pairs of polarized sunglasses that look as good as Ray Bans. Much better than Knockarounds.
16236,I like my Raen glasses.
16237,"Check out our models at www.painabrand.com
You can get an extra 15% off using Code: DENISE19"
16238,"Knockaround makes some really nice and stylish shades for anywhere from $15-$35. You can pretty much find any lens and frame combo with them and if not, you can customize your own for under $50 I think. I just got a pair of Joopin Ray-Ban-style clubmasters off Amazon for $13 and they've held up surprisingly well!"
16239,"My wife picked up three pair of sunglasses from “SEE” last summer, and she loves them. About a third of the price of the Luxotica stuff and seem excellent so far.

I’m still sporting a pair of Spy Optic glasses I picked up on a whim a few years ago.  Best aviators I’ve ever owned, at half the price of my other pairs."
16241,"Blue Island shades cost about $35-$50. Made in USA, polarized. I bought a club master style pair a few years back and still really like them"
16242,"When I was in Barcelona with the wife, we both got us a pair of Etnia Q sunglasses and they were amazing, the Lenses were so gentle on our eyes ...I know u don’t want too spend over $150 bit damn these sunglasses are worth the pricey tag imo"
16243,"Folks, just be careful with “cheap” sunglasses that do not legitimately protect your eyes. 

Our eyes squint to protect them from harmful UV rays. When you wear glasses that do not protect your eyes, the shades will prevent you from squinting...and your eyes will be more exposed to those harmful rays.

For the past 15 years, I’ve liked [Smith](https://www.smithoptics.com/us/) aviators. Not part of the monopoly, legitimate polarized protection, and good quality if you take care of them $99-$125.

In terms of great price point to quality, you can check out [Goodr](https://goodr.com) $25-$35."
16244,"Fed Thrill wayfarers are about 40 bucks, fully polarized, and have lasted for well into their second year with reasonable handling."
16245,"If you're in USA just go to Macy's or Dillard's during a sale and open a credit card for additional savings. I went to Dillard's New year's day and got a nice pair of raybans and Oakley's for 50$ each, and a whole bed set for 30. New year's day next year see you at any  Dillard's next year."
16246,"Suncloud optics, I believe they're made by polaroid (the camera company) they're awesome"
16247,"An Australian brand called Local Supply make really good sunnies. They last ages, can take a beating and are good for your eyes. Look after the lenses and they should be fine for ages (1-2 years of solid use). IMO they look pretty good too. They'd ship to America but not sure about the cost

[https://www.localsupply.com/](https://www.localsupply.com/)"
16248,"I've had like a dozen pairs of Oakleys, and 2 pairs of Ray Bans. I'm done with designer brands. I buy groupons to sunglasswarehouse.com and they always have coupon codes. I'll grab like 5 pairs for about $30 after the groupn deal. They're cheap but I love them."
16249,"I love my Kent Wang sunglasses. I’ve had probably half a dozen pairs by now. I think they’re around 50 bucks, constructed with high quality acetate frames, great polarized lenses, and durable spring-relief hinges. I’m consistently impressed by the great quality, considering that I know what people are paying for (IMO inferior quality) raybans, etc"
16250,"Sierra Trading Post always has a variety of (sunglasses)[https://www.sierratradingpost.com/mens-sunglasses~d~9811/].  

They have a bunch of good-quality non-Luxotica stuff.

I scored a pair of sweet French made Julbos here last year.   

Their inventory is always changing, so if you don't see something just check back in a couple of months."
16251,"Is there a reason why you don’t want to support Ray Ban? I’m a firm believer that I can’t wear “cheap” sunglasses as I’m in a country that’s 90% summer all year round. Whenever I wear fake sunglasses I get such bad headaches when I step out into the scorching sunlight. That being said, i have worn ray bans quite a lot because of their price to quality ratio that I like. However if there is a reason I should stop supporting them (poor ethical choices, bad business practices, etc) I would like to know! Thanks!!"
16252,"Check out Sunski glasses. They feel great, look great, are incredibly durable, and only cost $50. I would highly recommend them."
16253,I buy knock-off rayban wayfarers off Amazon by the dozen for $25.  I would never buy real ones and don’t support the concept of licensing out styles to Lux.
16254,"Raen sunglasses. with sunglasses the time to buy is before summer. Thats when I purchased 3 of my Raen Remmy sunglasses for $40, and the other two were $50. their cases for the sunglasses are shit but the build quality and look of the actual sunglasses are great."
16256,How much can you find those for? They look so good.
16257,I found a pair for like 15 pounds in my local fast fashion shops last year. Not persols but practically the same design.
16258,"[Persols for me, too.](http://m.persol.com/usa/sunglasses/PO3113S/1025-56) Was hard to leave Revo~~, but since the Ray-Ban acquisition, they've kinda turned shit.~~ 

Edit: Not saying Ray-Ban is shit; just that Revo has coincidentally turned me off since."
16259,You do know they got acquired by the company that makes persol? Lol
16260,I know now 😂
16261,[Persols](http://m.persol.com/usa/sunglasses/PO2803S/24-31) for me three. Classic Italian style that goes from t-shirt to tuxedo and insane quality.  They're heavy though.
16262,Loving these [Typewriter editon] (http://m.persol.com/usa/sunglasses/PO3108S/95-31)
16263,"I got a pair of the [Reflex Edition](http://m.persol.com/usa/sunglasses/PO3046S/24-57) a while back and they're my favorite sunglasses I've ever owned. Big fan of Persol, especially if you can find them second hand since the price point up front is a little overpriced."
16264,[Persols] (http://www.persol.com/canada/sunglasses/PO0649/108-58) for me four
16265,"Well now Persol got acquired so be careful, might only be a matter of time"
16266,"Actually Persol and Ray-ban are both owned by Luxottica. Revo was owned by Oakley (another Luxottica brand) but was sold off in 2013.

Persols are awesome though."
16267,"After losing my beloved Ray Bans to the ocean while drunk, I upgraded to Persol and love them even more!  You feel the quality and I got a good deal at sunglass hut for buying 2 pairs of polarized sunglasses.

I love the 2 tone of this pair, it gives you a unique experience from the frame illuminating from the sunlight.

http://www.persol.com/usa/sunglasses/PO3007S/1022-31"
16268,"Ogod, those are nice."
16269,How hard is it to get sunglasses in my prescription? I can't wear these over my actual glasses obviously
16270,"Very easy, I have [those](http://www.persol.com/usa/sunglasses/PO3132S/24-33) with prescription. What you do is you tell your shop to order those but in the optical (usually the models that are optical end in V, sun in S). If you order the sun it's fine, but you'll be paying extra. So you order the optical, and then you pay to get your prescription lenses tinted. It's around 50-100$ over regular lenses from experience.

Up here in Canada, not everyone carries Persol. The prices will change. Shop around. Get two-sided anti-reflection, it's worth it. I also have [those](http://www.persol.com/usa/sunglasses/PO3148S/9014-31) in one-sided anti-reflection, and hate to see my own eyelashes all the time."
16271,"Ray Ban Clubmaster

They are pretty pretty pretty good"
16272,"I think club masters are the coolest, but they do not fit my face shape at ALL and it makes me sad."
16274,I love them.
16275,"Clubmasters are cool and all, but have you seen [Maui Jim Kawikas](https://www.mauijim.com/shop/sunglasses/classic/kawika)? They combine that classic frame-less bottom look with a sexy squareness and the quality is insane. I was lucky enough to happen across a pair right as I was about to pick up some Clubmasters, and I am so happy I randomly found them! If anyone is in the market I highly recommend checking out a pair."
16276,"I like the Clubmaster because it's thin frame and classic look (I've got a black pair with gold, so the standard one) and I'm not a fan of the square look, can't stand it"
16277,"To each their own I guess! I too like the general look of the Clubmasters, but I think that the lenses are far too round and tend to [dominate the face rather than accenting it](https://i.ytimg.com/vi/cj_Dk730nBs/maxresdefault.jpg)."
16278,"There's two different lens sizes, that guy is wearing the bigger one and has a smallish face"
16279,They make 2 different sizes.  I get mine in the 57mm...fits my face better with the oversized Clubsmasters.
16280,"They actually make them in three sizes. 49, 51 and 57. And the folders have a slightly different fit to them as well"
16281,Op wants 200 and under.
16282,"Oh my bad, I totally missed that part for some reason."
16283,Tbh they remind me of the protective glasses the blind wear
16284,Honestly these strike me as a more feminine look not that there is anything wrong with that but its not my cup of tea. Maybe its just the classic value of the Clubmaster's but I think they look better. 100% opinion though.
16285,Please let this be a curb reference
16286,"It is, but I really do love my Clubmaster"
16287,I upvoted because of this very reason
67054,Seconded
16290,"Well, I like them, they are smooth as hell when you wear them right, no need to be a dick because you dislike something"
16291,...or maybe you just have shit taste?
16292,Ray Ban is shit? Part of the sunglasses monopoly lol
16293,Okay then
16294,"Ok ffs what he means is that you'll pay ~$200 for $20 quality sunglasses, honestly if you want the rayband brand go look at fakes or get another company for actual better quality than what OP has now"
16295,Enclave eyeware. https://enclavemfg.com/collections/model-20/products/model-20-frost-grey-blue
16296,"Those *sound like* really good quality, polarized and stainless steel. 

How is the lens hardness and clarity? These are half the price of wayfarers and look just as good, I'm impressed"
16297,"I've got a pair of their original models and they were decent, the lenses got a little damaged when I took them into salt water at the beach and it seeped in between the layers of the lenses. When it dried there was some bubbles at the edge of the lenses, otherwise they are still in great shape. My wife got a pair of the newer ones and they are significantly better quality, the SS is a nice touch and the lenses seem better. 

I will personally never spend $100+ on sunglasses again. For $50 these satisfy my need. I live in Colorado where it is sunny 300+ days a year. I have had Raybans, Persols (are better quality but still do not justify their price imo), and a few other designer brands."
16298,I have two pairs of these sunglasses and they are awesome. I've bought them for people as well and universally they are loved. I can't speak to the lens hardness and clarity (other than I wear them and often forget to take them off). Take good care of them and they will last forever. Highly recommended
16299,I have a pair of Oakley Frogskins that have similar lenses. They're my go-to casual glasses. I think I paid ~$160 for them a few years ago but the fact that they have polarized lenses bumped up the price a bit
16300,Real Wayfarers?
16301,"I've never understood the point of fake Wayfarers. The shape is always completely different in terms of how they sit on the face, with Wayfarers having quite a sharp angle towards the cheekbones. Real Wayfarers are legitimately the only sunglasses I've ever tried that suit my face."
16302,">with Wayfarers having quite a sharp angle towards the cheekbones.


and this is why I can't wear them. with the shape of my face it actually seems to make glare*worse* when you are under anything close to direct overhead sun, the lenses slope so much that they let in a ton of light at the top and it reflects off the inside of the lenses right into my eyes.  

I have a pretty dope vintage pair in very nice condition that my brother gave me and I never wear them because of it. They are stashed in the glove box of my car as emergency sunglasses in case I forget one of my good pairs. 

I've tried on many Ray-ban styles over the years and I've never found a frame that fit my face properly"
16303,"There are some really good fakes out there if you look hard enough, most people just don't want to spend stupid amounts of money for a $20-quality pair of sunglasses"
16304,"I've had fakes in the past, and I'll say my real Wayfarers have fared (lulz) really well over the last 6 years.  I'm a putz, and rarely use the case, and I have a kid and bend down and rough-house with her all the time, and they fall on the ground, a LOT.  I'm at 6 years, and the lenses are finally completely shot, and the frame is too banged up to warrant just replacing the lenses (like $22/ea, I think). 

I'm likely going to buy replacement Wayfarers, and some Persol whatevers, to be a bit fancier.  I have some Ray Ban Aviator, oversized (which are still small on my giant head/face), and I don't like them.  I need to be able to prop the glasses on top of my head, since my life consists of running errands and having my hands full, at all times :S"
16305,"I agree. My first pair of Wayfarers lasted over six years including traveling the world with me, getting stuffed in bags, pockets, going swimming, getting dropped and generally abused on a day to day basis. They finally broke after I stood on them, no surprises there. 

People say they could buy 7 pairs of knockoffs for what I spent on my real pair. You know what, over 6 years you probably will buy 7 pairs and mine don't look or feel shitty. 

I just bought a new pair of Wayfarers to replace the old pair and couldn't be happier. They also came with a warranty so that if I break them in the first two years I get 50% off a new pair."
16306,[I've got these Ray-ban Justin's on me or in my car at all times](http://www.ray-ban.com/netherlands/mobile/customize/rb-4165-justin-sunglasses?pid=SA01_NL_Brand_Type_Model_Justin_Exact_NL_Brand_Type_Model_Justin_Core_raybanjustin&gclid=CjwKEAiAoaXFBRCNhautiPvnqzoSJABzHd6h3igo0PzkXI6xTHzQM2Wy80vQtD0wAM4fu5w2yKlBURoCgwXw_wcB)
16307,"+1 for you. I was going to recommend these, but I couldn't remember the name. I love these so much. Classic wayfarer shape without looking like you're trying too hard to be hip."
16308,Rayban Wayfarers.
16310,At last somebody who knows about quality
16311,Or American Optical. Also very good.
16312,"Can't believe no one's mentioned American Optical. Used to make Aviator style glasses for the USAF, now you can find a quality pair of theirs for about $50. Definitely the best bang for the buck pair I've ever bought."
16313,[I mess with Warby Parker](https://www.warbyparker.com/sunglasses/men)
16314,Their pick 5 keep 1 thing is a cool feature
16315,you don't even gotta keep one
16316,Same. I rock the [Downing](https://www.warbyparker.com/sunglasses/men/downing/walnut-tortoise).
16317,I just bought [Topper](https://www.warbyparker.com/sunglasses/men/topper/river-stone-blue-fade) in the blue fade a week or two ago. I've been wearing their eyeglasses for a few years and have been pretty impressed with the quality!
16318,"man, I love some of those styles but idk if I could eat the cost. Are they really solid?"
16319,I have a pair of the Lowrys and I like them a lot. They also use no-scratch lenses and they'll replace them if they do get scratched.
16320,"That seems awfully nice. I got a pair of zero uv glasses ($10) that are all scratched up, but I've had em for almost a year now. Is there a max time frame you can replace them if they get scratched?"
16321,"It's hard to recommend sunnies without knowing what your face looks like as different sunnies look good for different people. 

But if the wayfarer looked good on you, you could always try the clubmaster which became pretty popular a while ago.  

Aviators suit most faces imo and can make you look 4x more masculine. 

Or change it completely and try a [round style](https://ae01.alicdn.com/kf/HTB1X1NhHVXXXXcyXVXXq6xXFXXXk/sun-glasses-sunglasses-men-vintage-round-circle-lens-frame-mens-goggles-brand-designer-aviator-sun-oculos.jpg)

Also it's not just the style itself. Mix up the colour of the frames and lenses. I like the tortoise shell frames personally but I've seen a lot of guys pull off wooden frames as well."
16323,This is the correct answer. Nothing compares to Maui Jim clarity
16324,Only one mention of Maui Jim?!
16325,"Any and all costas.

I like to fish."
16326,"I don't fish, but love my Costas."
16328,"People like to shit on high end glasses for being overpriced, but brands like Oliver Peoples, ic!berlin, Maui Jim, Blackfin, Barton Perreira and Dita all show a noticeable jump in style and quality that is definitely worth considering if you're not a broke hipster like most of this sub."
16329,"yep haha. Everyone and their mother is posting ""Ray Ban!"" ""Maui Jim!"" but Tom Ford, Moscot, Garrett Leight, et cetera are my preferred options."
16330,"Nobody mentioned American Optical (AO) original aviators? I  have a pair of those amazing sunglasses which was 50 dollars and they are as timeless, and unique as can be."
16331,"Metal Frame - 
American Optical: http://aoeyewear.com/ (or Randolph Engineering)

Black acetate - 
Electric Swingarm: http://www.electriccalifornia.com/sunglasses/swingarm.html"
16332,"- Ray Ban New Wayfarers

- Ray Ban Aviators

- Ray Ban Clubmasters

- Ray Ban Original Wayfarers

- Persol 649 / 714

- Moscot Lemtosh

- Moscot Miltzen

- American Optical Pilot Aviators"
16333,"I came across [these](http://imgur.com/a/3q36k) in an airport in Norway, from what I can see on the website, the style is called Round Metal, but they have this sexy dark blue rim around the lenses. Also they fold.

I think they look good on me, but I don't get an excuse to wear them a lot in this climate."
16334,"This pair from this guy. It's handpainted, and I have gotten an ton of compliments!

https://uglybell.com/product/another-whoopsie-wave-2/"
16335,It looks like they don't ship and they're only available in Greece.
16336,"I've ordered via a PM through their Facebook page, here:
https://www.facebook.com/uglybells/

Paid via PayPal as well, and paid for a pair to be shipped abroad too. You should ask them!"
16338,"Something a bit under €150, but I know some of his models are more expensive, especially the hand-carved ones."
16339,Persol 649 are my weapons of choice
16340,"Love my Maui Jims. I don't know know how, but they make everything appear so much sharper than my Ray-bans."
16341,[American Optical - Original Pilot](https://www.amazon.com/American-Optical-Original-Eyewear-Bayonet/dp/B00HQXP9V4)
16342,I like the ray ban signet
16343,Persol
16344,I love my Knockarounds. Amazing value for the price. I've always got a few pairs in different places.
16345,"I got a pair of RAEN Wiley's on eBay for $55, love the look and the quality feel on them. I think they retail for around $110."
16346,[These are the ones](http://www.persol.com/usa/sunglasses/PO3019S/24-31) I've been wearing for around a year now and I've had loads of complements on them
