idx,text
55558,"*Mistborn*, Brandon Sanderson

*Codex Alera*, Jim Butcher

*Memory, Sorrow and Thorn*, Tad Williams

I really, *really* enjoyed all of these. (Which is not the same as saying they're good, as I'm very much aware.) They all feature their own big fantasy world to explore and lose yourself in, suitably epic stories and stakes and an enjoyable (and sizeable!) cast of characters to follow along and come to care about. I'd rank them as firmly high fantasy, like Lord of the Rings."
55559,My suggestion is the Blade Itself trilogy by Joe Abercrombie. AMAZINGLY AWESOME CHARACTERS! And it is not your typical fantasy novel. There will be blood...
55560,Upvote for the best set of characters I've ever read in Fantasy.
55561,"The Gentleman Bastard Sequence by Scott Lynch. Caveat though, there are 7 books planned and only the first 2 are out (the 3rd is due out in October) so it won't be finished for a while."
55562,"They've been spaced out quite a bit, unfortunately. It seems forever ago that the 2nd came out."
55563,"Well, I don't think anyone has mentioned Harry Potter yet, probably because everyone is assuming you've read it. 

If you have not. 


Read it. It's difficult not to love."
55564,"Haha funny you should mention this. I grew up reading Harry Potter, like many others. It was what made me love reading in the first place.

My husband has never read any of the books - and has only seen two of the movies, and never really paid attention to either of them.

At the time of your comment, I am literally taking a couple minutes  break from reading The Sorcerer 's Stone to him. We're just now getting to the part where Harry and Ron first meet on the train. I am so excited to relive this awesome journey with him experiencing it for the first time."
55565,I actually felt a pang of jealousy reading that. I need a friend that's an hp noob.
55566,"Along the same lines is a lesser known teen fantasy series *Pendragon* by D.J. MacHale.  I like it even more than Harry Potter, and it's geared more toward a general audience than just kids.  All 10 books are out now.  I also want to second the Shannara trilogy mentioned above."
55567,"If you're reading it for the first time as an adult, I'd have to disagree. Most people read it as a kid, and as children's lit it's just fine, but I don't see how it has much appeal to adults aside from nostalgia. (I'm reading them for the first time as an adult, myself. Although I'm only in book 4, so that recommendation really only applies to the first three.)"
55568,"Don't underestimate an adult's occasional escapist desire to go on a fantasy adventure. I started reading Harry Potter as a kid, but my mother started reading Harry Potter at some point and has been this family's resident HP nut ever since. As in, reading each book dozens of times, watching and re-watching all of the movies several times over and so on. HP wouldn't have sold so ridiculously well if it had only had true appeal to children. (For that matter, all *good* so-called children's literature will be enjoyable to adults as well. Not everything has to be *The Blade Itself*.)"
55569,"> Don't underestimate an adult's occasional escapist desire to go on a fantasy adventure.

I don't! I'm an adult, and fantasy/sci-fi is and has always been my go-to genre. I love fantasy! But there is tons of fantastic adult fantasy out there, and I don't personally understand how HP has adult appeal. I'm not saying it's terrible - but I'd take Roald Dahl or Brian Jaques any day of the week over JK Rowling. Now keep in mind, that's my OWN nostalgia kicking in. There's better stuff than HP in the children's lit world, and there's WAY better stuff out there in the YA/Adult world. That's all I'm saying. HP got popular not because it was that good - but because it was popular. It got popular for the same reason the Kardashians became popular. I realize most people will disagree with me - because I'm going against popular (there's that word again) opinion. That's fine."
55570,"> I don't personally understand how HP has adult appeal.

“Critics who treat 'adult' as a term of approval, instead of as a merely descriptive term, cannot be adult themselves. To be concerned about being grown up, to admire the grown up because it is grown up, to blush at the suspicion of being childish; these things are the marks of childhood and adolescence. And in childhood and adolescence they are, in moderation, healthy symptoms. Young things ought to want to grow. But to carry on into middle life or even into early manhood this concern about being adult is a mark of really arrested development. When I was ten, I read fairy tales in secret and would have been ashamed if I had been found doing so. Now that I am fifty I read them openly. When I became a man I put away childish things, including the fear of childishness and the desire to be very grown up.” - C.S. Lewis

(Harry Potter is read by far too many adults for someone to validly suggest it doesn't have adult appeal, whatever that is. ""Having spent eighteen years upwards alive"" as a trait is too broadly distributed to be useful as a distinguishing factor.)

Your argument is resistant to outside interference for the most part - HP cannot be good because you do not think it's good - though the bit where HP got popular *because* it was popular is pretty ludicrous circular logic. Harry Potter was Rowling's debut work; she was a single mother living on state welfare while she wrote it, and it was rejected by several publishers before someone took a chance on it. It started out *not* popular, but became so on its own merits.

Popularity is not a yardstick to measure quality by, but there are certain qualities a work must possess to become wildly popular in the first place. If one could easily replicate those qualities, tons of talented authors, I'm sure, would write at least one wildly popular book to become financially set for life and then move on to writing ""good"" books."
55571,"I think you're reading too much into what I wrote. First of all, lets clear one thing up right off the bat. I'm not making an argument. I'm sharing my opinion.

Second, I'm NOT suggesting that HP isn't good because it's children's lit. There is plenty of really great children's lit out there, which I readily acknowledge. 

>  though the bit where HP got popular because it was popular is pretty ludicrous circular logic.

It isn't logic, it's an observation. As far as I can tell, the Kardashian's got their popularity in the same way. ""Famous for being famous"" is an expression you must be familiar with, no? IMO, the phrase describes HP as well.

And look - I never even said it was bad. I found them to be entertaining at times - but *personally* there are too many flaws (what I consider to be flaws) with the writing to consider them really good. 

You want specifics? Here's three of the top of my head:
1) Extremely flat characters. Characters are either good or evil. The bad characters are cartoonishly evil.  
2) Very poor character development in most cases. Example - Who are Malfoy's henchmen? Crabbe and who? How do you tell them apart? They're just names. There's no character there at all.  
3) Deus ex machina everywhere. This is the worst aspect of the books to me.   

Final word: it seems like you're trying very hard to defend HP from attacks I haven't even made. I never said it was terrible. I never said you shouldn't read it. I DID say (I'm paraphrasing myself here) ""It's fairly mediocre, I'm not sure why it's so popular.""  That's not an argument. It's just my opinion.

And lastly - just a reminder that I'm only in the 4th book. I've told they get better towards the end, and I'm plugging away hoping that's true. I may revise my opinions once I finish the series. We'll see. My opinions therefore should only be considered to apply to the first three books."
55572,"The Kardashian comparison doesn't make sense as ""an observation"" either."
55573,"Maybe this will help. I'm suggesting that this applies to HP to at least some extent.

http://en.wikipedia.org/wiki/Famous_for_being_famous"
55574,"JK Rowling was *nobody* before her first book took off, and the only reason it took off is because *people (of all ages) loved reading it*. That's about as far away from the concept of ""famous for being famous"" as you can get.

Of course, everything that's popular will attract additional attention because of its popularity. That's what popularity *is*."
55575,"> JK Rowling was nobody before her first book took off, and the only reason it took off is because people (of all ages) loved reading it.

I don't deny that. Avatar was massively popular too, despite being absolute crap. (I'm not saying HP is crap.)

And I said the ""famous for being famous"" concept only applies to a certain extent. There are better books/series out there that never became massively famous to the extent that HP is."
55576,The Dark Tower Series by Steven King.
55577,The rated R version of Lord of The Rings.
55578,Stephen*
55579,"Darkness That Comes Before, House Of Leaves"
55580,"The Darkness That Comes Before was extremely dark, if I recall correctly. I remember it being an amazing series though."
55581,"If you like British humor, read Robert Rankin. One of his books, Waiting for Godalming, is about a detective who tries to solve a particular case: God was found murdered. In a dark alley behind a pub. Were he probably tried to get laid again. At least underage Jewish virgins frequent this bar..."
55582,"ahaha, i just googled him, and by the profile picture he has on goodreads, i can tell i'd like his style."
55583,The Necromancer trilogy by Gail Martin is pretty good
55584,All the books are so so good and the characters are super likable as well.
55585,I'm about to restart it while I ponder my next series. Its been a few years since I finished it.
55586,"Yea, I havent read it a long time either. There were 4 books, right?"
55587,"I'm suprised, no one mentioned *Malazan book of the dead*, by Steven Erickson. it's 10 book in total, plus side novels, so lots and lots of reading. The story has multiple threads, all connecting at most surprising points. Magic is there, and in not seen anywhere else form. Characters are vivid, and even if they live short and die ugly, there's a meaning to that. I think this has the most potential to call it epic.

Edit: First book is called *Gardens of Moon*."
55588,Garth Nix Abhorsen trilogy. It's fantasy that avoids some of the pitfalls you get with serious high fantasy. It has some funny moments and is a generally good adventure story.
55589,Sabriel will always be my favorite fantasy book! :)
55590,"Seconding ""Memory, Sorrow, and Thorn"" by Tad Williams, and the Joe Abercromby trilogy.

Would also recommend Raymond Feist's Riftwar Saga (the first trilogy). And Terry Brooks Shannara trilogy (the first trilogy). Feist's characters from the Riftwar Saga (Pug and Tomas mostly) have stayed with me for decades."
55591,The Way of Shadows
55592,"Oh man.  The best story of any genre I have ever read is The Malazan Book of the Fallen by Steven Erikson.  He was an archaeologist/anthropologist for a long time before becoming a writer and it really shows.  His story is extremely complex, realistic (as far as fantasy can be realistic) and surprising.  He pretty much drops you in to the middle of a story with many different arcs and leaves you standing there confused for a while.  Clarification comes, but he never wraps everything up in a neat little package for you.  I've never been so emotionally invested in fiction.  I not only cried, but actually wept at points.  I'm not exactly the picture of stoicism...but still.  The first book is really good, but honestly kind of hard to follow for the first half, but once the three or so story lines start coming together, you will be hooked.  The second book is fucking brilliant and they just get better from there.  

That said, it's not for everybody.  If you have a need to skim or think about other things while you read, it's probably not for you. He will definitely leave you wondering what the hell is going on a LOT.  The reveals will come pages, chapters and books later...sometimes not at all.  

Also, I don't know how old you are now, and he writes on somewhat academic level.  If you aren't comfortable with a sometimes obscure and usually high-level vocabulary, you may not enjoy it.

Edit:  Forgot to mention that tor.com is doing a chapter by chapter re-read of the entire series with someone who has read the whole thing and someone who hasn't read it at all.  They are giving really fun commentary on every scene and they even have a Q&A with the author after each book is finished. it's sweet!!  http://www.tor.com/features/series/malazan-reread-of-the-fallen"
55593,Not Terry Goodkind.
55594,"i have asked about him already in this thread, as someone mentioned him. i found Wizard's First Rule in a second hand shop and picked it up, but have been apprehensive about starting it, since it seems to have conflicted reviews. Why wouldn't you recommend him? What didn't you like about him?"
55595,"I'll jump in here, because I read most of that series as it was coming out.

The first few books captivated me.  The overall story is pretty derivative, but it was done in a good, character-driven way and with a few novel ideas.  I was really rooting for Richard and Kahlan (the main protagonists/romance factor), and I loved Zed (the main side character).  At some points in the plot I just rolled my eyes, but overall I was looking forward to each book.

Then the preaching begins.

You don't notice it at first.  But by the middle of the series (book 5, I'd say), Goodkind is *really* beating you over the head with his objectivist philosophy, cramming whole sermons into the story and leaving absolutely zero room for ambiguity or realistic argument.  Basically the author's ideology takes over the story.  It's a similar problem that Ayn Rand's work suffers from - you enjoy it at first, until you get tired of the obvious (and incidentally, flawed) agenda.

In addition to this, Goodkind himself has said some pretty strange things on the record.  He thinks a great deal about himself, and he doesn't think much of the genre he writes in, as seen in this widely circulated quote:

> ""First of all, I don’t write fantasy. I write stories that have important human themes. They have elements of romance, history, adventure, mystery and philosophy. Most fantasy is one-dimensional. It’s either about magic or a world-building. I don’t do either.""

It seems that he only uses fantasy as a vehicle to push his philosophy, and for me, that's a turn off.

It's really against my nature to dissuade someone from reading something.  And if it wasn't for the fact that the series is like a dozen books long, I'd say give it a try anyway.  But I just wanted to let you know about these issues, because nothing sucks more than investing weeks and weeks in a story and then giving up on it."
55596,"All this, yes. But also Richard, the protagonist, is one of the most infuriatingly uninteresting characters you'll find in any book in any genre. 

I liked Wizard's First Rule. That, I think, was a bit of honest storytelling from Goodkind. But it's all downhill from there, and the hill is slick with Goodkind's sanctimonious bullshit."
55597,"Read anything by Brandon Sanderson.. it's all top notch stuff. I started with the [**Mistborn trilogy**] (http://www.goodreads.com/book/show/68428.Mistborn) and kept going.. he's a fantastic writer and creates some truly great high fantasy. Excellently thought out magic systems, vivid worlds and characters, and twists that keep you on your toes. Another benefit to reading Sanderson is that he turns out material quicker than most, and his books aren't short on word count. Another sort of neat thing to consider is that almost all of his novels are subtly connected and he seems to be weaving a greater story behind the scenes.. 

He has also begun, what should prove to be, his longest and greater work yet.. The Stormlight Archive .. a series of 10 planned books. The first, The Way of Kings, is phenomenal (and clocks in at 1000 pages).. the 2nd is due out January 2014 ..  the waiting for this series is going to drive me mad."
55598,Sword of truth series by terry goodkind.
55599,"i found Wizard's First Rule in a second hand shop, and picked it up a while ago. I've been meaning to give it a go, but have been apprehensive about it, since i had never heard of it before, and the reviews seem to be conflicted. What did you like about it, and what did you think of the writing?"
55600,Don't let the size of the book sway you.  I know it is big.  But Think of it as a gift that keeps giving.  Goodkind is a master storyteller.  He weaves everything together so well.  Things happen in first book that play out in third.  Etc.     he takes you on a emotional journey. Helping you form a bond with the characters.  This is by far the best book/series I have ever read. It revolves around a epic love story.    I had a friend who only reads crime dramas.  Tell me they would read first rule if i read a book they liked.   They finished it and continued to read the whole series.  This is someone that never reads fantasy at all.   Read the first book only if your prepared to be sucked into the whole series.    Let me know what you think of it.   Also most library's  carry this book/ series at least near me.
55601,"it wasn't the size of the book, it was the premise. i knew it was a long series, and i just wanted to know a little more about it until i started it. i had not heard of it before i found the book. but anyway, i started it yesterday, because even in the event that i don't like the story SO much as to continue the series, i really wanted to give it a try, i love fantasy.

and i have to say that so far, i'm enjoying it very much. i just got to the part where Richard gets chosen. I like the characters; i don't know a lot about the worlds yet to say anything about that, but i like the premise so far. thank you for your reply, i wanted to hear some opinions, but i knew i was going to try it anyway, and i'm glad i did :)"
55602,Lol 23 days ago you replied.   I am new to reddit and did not see I had the reply heh.  Just checking in to see how you like/liked the book.  Hope you have a great weekend.
55603,The Book of Lost Things is a great blow me away book. It's highly underrated and has a great message.
55604,"If you fancy Science-Fiction-Fantasy, read Dan Simmon's Hyperion books (4 of them)."
55605,The riftwar saga by raymond e feist is pretty good if a little predictable.
55606,"*Magician* (split into *Magician: Apprentice* and *Magician: Master* in most editions) was one of my favourite books when I was young, and still one I enjoy coming back to from time to time. The later books he wrote don't do as well, but this trilogy and a bit of the other earlier stuff is quite enjoyable, even if it isn't literary brilliance."
55607,"I need to read the latest one, but I've read all the others. I thought the original was fantastic and I completely immersed myself in the whole series. In the later novels he recycles and rehashes to many characters from previous arcs, and the need for bigger and badder villains can be a little tedious but then he can also pull some fantastic characters and plots out of the bag so I would recommend sticking with him and giving them all a read. They aren't particularly difficult to get through anyway."
55608,"Here are some authors yu should check out: Kelley Armstrong, Derek Landy, Philip Reeve, Cassandra Clare , Eoin Colfer , Darren Shan, P.B Kerr, Paul Stewart and Chris Riddel, Melvin Burgess, Kevin Brooks, Rachel Vincent, Kriston Cashore and John Green. Just pm if you want some more recommendations"
55609,"The Wind on Fire trilogy, a very underrated series IMO. It's not your Lotr or HP fantasy though. It's really something unique and special, read and see!"
55610,"If you can find it, *Stalking the Unicorn* is a pretty good read. Detective style book in an alternate New York with cat people, elves, ect.

And *The Homecoming Saga* is way better than the *Ender* series. It kept me entertained, but it might turn off a more attentive reader who notices (sooner than I did) that it's the Book of Mormon or something."
55611,since you were a serious reader i reccommend silverlock by john myers myers.  serious readers will especially enjoy it!
55612,A Wizard of Earthsea
55613,Wheel of Time by Robert Jordan.  THere is 13 books though so be prepared for a long adventure.
55614,*The Black Company* by Glen Cook. It's one of the original dark and gritty fantasies.
55615,"If you're looking for something that doesn't have an intimidating number of sequels after it, try The Lies of Locke Lamora by Scott Lynch."
55616,"If you want something like Tolkien, stick to high fantasy. If you are just getting into reading again I would start with one of the smaller series, something in the 1-5 book range, or a series that just started. There is a lot of excitement in waiting for a new book. Some great authors to check out are: Brandon Sanderson, L.E. Modesitt Jr., Peter Brett, Patrick Rothfuss, Jim Burchers Codex Alera, Terry Goodkind, Trudi Canavan, Brent Weeks, and Robert Jordan(long series). Personaly I""m most excited about Brandon Sanderson's The Way Of Kings. One of the most unique and beautifuly written books I've ever read, I can't wait for the rest of the series."
55617,Good suggestions all round!
55618,"Check out the Emaneska Series by Ben Galley. 

The first two are :
[The Written](http://www.amazon.com/The-Written-Emaneska-Series-ebook/dp/B005ELJOY8/ref=sr_sp-atf_title_1_1?s=books&ie=UTF8&qid=1374471147&sr=1-1)
and [Pale Kings](http://www.amazon.com/Pale-Kings-Emaneska-Series-ebook/dp/B007EW03P4/ref=sr_sp-atf_title_1_2?s=books&ie=UTF8&qid=1374471147&sr=1-2)

If you have a kindle or the kindle app for phone, you can get the first book for free. The other 3 in the series are $3.99-$4.99 each."
55619,"Eona and Eon are big books, but they are AMAZING. They might seem slightly childish but the imagery throughout the whole book kept me enraptured. I loved them. Sadly there's only two."
55620,"Some have already been mentioned but I would recommend
The Dresden Files - Jim Butcher.
The Riftwar trilogy - Raymond E Feist.
The Blade Itself - Joe Abercrombie

Also if you have never read them, I would say essential fantasy/sci fi reading includes Dune and The Silmarillion."
55621,"I'd highly recommend The Chronicles of Thomas Covenant, the Unbeliever.
Features an INCREDIBLY conflicted anti-hero, memorable characters, and fantastical creatures and places. A great read if you want a darker, more adult fantasy."
55622,"Anything by Brandon Sanderson....if you're not sure, you can check out Warbreaker for free on his website.

Robin Hobb's Farseer Series (I'm actually getting ready to re-read that)

Wheel of Time (Robert Jordan) is great but probably not the best to start with since it is so long.

Kingkiller Chronicles (Patrick Rothfuss) is awesome but unfinished

Night Angel trilogy by Brent Weeks...I enjoyed it but have read mixed reviews about it.

And you can always check out /r/fantasy for more suggestions!"
55623,"Try the evermore books
It's a great series!
There is about 7 or 8 books"
55624,"*The Dream Quest of Unknown Kadath* By Lovecraft.  It's short, epic, and I read it often."
55625,*Eragon* by Christopher Paolini is one of the best fantasy novels I've ever read.
55627,"*Son, that ain't no fantasy novel.* It's literary fiction/magic realism."
55629,"Damn, so edgy."
55631,"I was thinking of writing a well thought out response to your comment, but I decided not to. Nothing I, or anyone for that matter, say will sway your thoughts towards people who read the Bible."
55633,The Bible
55634,"Wool: Omnibus, followed by Shift:Omnibus, by Hugh Howey.  It's more dystopian than fantasy, but wonderful all the same.  Unfortunately it is short.   

I'll second The Kingkiller Chronicles, by Rothfuss, Patrick.

The Lodestone Trilogy, by Whiteway, Mark.  It is long, detailed, and a satisfying read."
55635,"Richard K. Morgan's [Altered Carbon](http://www.goodreads.com/book/show/40445.Altered_Carbon) seemed pretty action-packed to me. It literally starts with a bang, and doesn't let up a whole lot most of the way through."
55636,"this book SO good.

picked it up because of this cover like 7 years ago http://bookcoverarchive.com/images/books/altered_carbon.large.jpg
and it started by book devouring craze of ""hey, theres others genres except boring british fiction that was required school reading"""
55637,Seconded. The only time 'orrible murder *isn't* happening is during the obligatory SF terrible sex scene(s).
55638,"When I first came to the book in middle school, I LOVED the sex scenes (though reading them in the middle of study hall was a bit uncomfortable). I remember distinctly thinking, ""Hey, this is a lot sexier than that scene in Neuromancer.""

I suspect I'd still enjoy them today, though I've come to see just how preposterous they are."
55639,"The sex scenes were decent smut but by the second one it was kind of  annoying how formulaic the conquests were. 

Scene 1: Mindless, animal sex with character who is, or may be, antagonist or character has no emotional relationship with

Scene 2: More emotional sex before final battle that character has been slowly growing closer to and has emotional connection with"
55640,"I know that many disagree, but the other two in the Takeshi Kovacks series were similarly action packed, if not quite as all-around great as Altered Carbon."
55641,Agreed. :) The violence was a bit unjustified here and there for me but otherwise very exciting.
55642,This is the first book the came to mind as well.  If anyone knows a book that's more action packed I would be curious to know.
55643,Yeah. go Tak!
55644,"Came into this thread thinking of this. I leave satisfied.

I also think *The Stars My Destination* (or *Tiger, Tiger* for the purists), by Alfred Bester is very action packed. But maybe I just read it in a very action packed moment of my life."
55645,I guess Consider Phlebas was all about a bunch of freaks sliding from one crazy situation into the next...
55646,"As Space Opera its O.K. 

As a Culture novel, its comparatively substandard.

The Hydrogen Sonata was much better and more action packed. Some of the fights, characters and settings in that book will blow you away."
55647,"I didn't think Consider Phlebas was a space opera at all. I thought it was more like Indiana Jones in space. But I'm not even sure what a space opera actually is, so whatever.

I have read Hydrogen Sonata as well. In the beginning I found it so boring that I almost put it down but you are right, when they start shooting, the action is really awesome."
55648,"Deathworld 1 2 and 3

Planet of the Damned

Planet of No Return

All five books are by Harry Harrison. Super action packed. But are a product of their time. Be forwarned. Also, pretty much all of the stuff by H. Beam Piper. Also, The Gap Saga by Stephen R. Donaldson. That's pretty crazy. And if you want horror sci fi, go with Veniss Underground by Vandermeer. I can't recommend that book enough."
55649,The Quantum Thief / Jean Le Flambeur Saga!
55650,"Heinlein's *The Puppet Masters* is possibly the fastest paces sf book I have read, it's very much underrated among his books I think.    
 (Also ripped off by the *Falling Skies* tv show)"
55651,"Wow, I thought for sure I'd be the first one to suggest this. You're spot on."
55653,"Are the books actually good though? Like, clearly and entertainingly written? I read the short story ""Watchcrab"" by him online, and it was absolute dreck. It made me really hesitant to pick up anything else he's done."
55654,"They aren't great literature full of clever characterisation or subtle themes, but you're *never* going to get that when your primary requirement is ""action packed"".

As action novels go they're not bad - the world-building isn't as good as Peter F. Hamilton or Iain Banks, but they're enjoyable enough, and (*unlike* later Banks) his books at least have a coherent plot and narrative which proceeds from a beginning through a middle to an end."
55655,"The only time he is really incoherent to the rest of the story is gridlinked.  I don't think he had fully planned out his universe at that point.

In later books he takes much of the poor/misfitting things and says ""This was actually inaccurate... this is the real thing"" which are poorly disguised attempts to fix the inconsistencies that don't fit with the way the series ended up.

That said I rather prefer that method rather than spending far too much time trying to justify poor plot decisions (think star wars kessel run/ parsecs).  IMO star wars would have been far better off just putting a one liner in some future movie or book saying ""Why is it called parsecs?"" ""Well the guy who made it up was dyslexic and called lightyears parsecs and it became a tradition to call them that in the particular context."" or something along those lines rather than some of the convolution I have seen to try to explain it."
55656,"I read his book *The Skinner* and all I thought was ""meh""."
55657,"His style definitely is an acquired taste. Even after you've acquired it, his novels still only go from middling to meh.

And yet, somehow, they are the only place where you can scratch that sentient-space-crabs-of-doom itch that you didn't know you had until you read one of his novels."
55658,"I've only read *The Skinner*, but it is excellent, without question.  Fairly action-packed too."
55659,"Came here to say this.  Richard Morgan does it better, imho, but if you want a rip-roaring evil aliens vs. military imperialists then he's your man.  No brains required, though."
55660,"Yeah Asher is the Tarantino of sci-fi. Not only are his scenes violent, they're horrifically painful. Over the *Agent Cormac* series it is eventually revealed that the main character has probably died multiple times before in combat engagements but has been rebuilt into a new body with the memories from the previous one transferred."
55661,I thought the Expanse Series had a lot of action.
55662,I'd say there was more suspense than combat. Corey does very well at keeping the reader engaged at all times.
55663,"Just finished this series and have to agree. Best I have read in a few years, look forward to more from him."
55664,">look forward to more from him.

Them. James SA Corey is a pen name for a [duo](http://en.wikipedia.org/wiki/James_S._A._Corey)

I didn't realize it until I finished Leviathan Wakes. One of them is also George Martin's protege"
55665,[Young Miles](http://www.goodreads.com/book/show/61916.Young_Miles) (Vorkosigan Saga) by Lois McMaster Bujold.
55666,"The vor game is just one huge, glorious, xanatos pileup."
55667,"What about that one where he's locked in a prison camp?  ""Borders of Infinity"" I think.

I swear if you ever got Miles and Tyrion in the same universe there'd be no stopping them."
55668,can you see my hat?
55669,"Yeah, they really would see eye to eye."
55670,Snowcrash
55671,"Snow crash is action, interspersed with pages and pages of bad linguistics exposition and info-dumps."
55672,"Making it very much the prequel to *Cryptonomicon* and *Anathem*.

The linguistics exposition and info-dumps get a *lot* better."
55673,"Yea, I can't get through it. I thin I left off on a rant about the Phoenicians or something, it was just...bwahhhhhhhhhh."
55674,"Yeah, that's my problem with all the Stephenson I've read. Good to decent SF, but I can't stand it because he fails to introduce information about his admittedly interesting worlds and ideas without massive info-dumps."
55675,":D  I like the infodumps.

Well, some of them.  But I do have to say, I'm not quite sure why *Snow Crash* is considered to be one of the best sf books ever.  Don't get me wrong; I like it, but I don't think it's quite all that."
55676,The Lensman series.
55677,*Wasp* by Eric Frank Russell is pretty action packed. Although it is more of the espionage spy/assassin/saboteur. It is still a very fun and quick read.
55678,"I believe Peter F. Hamilton's [The Reality Dysfunction](https://www.goodreads.com/book/show/45245.The_Reality_Dysfunction) is, for all its faults, a prime example of the kind of thing you're looking for. Lots of crazy set-pieces involving space battles, chases, asteroid attacks, onslaughts by legions of the -- ah, you get the idea."
55679,"He writes really GOOD action, too. The robotic assault on the construction facility in Pandora's Star (trying to keep it vague to avoid spoilers) is on the scale of what you'd find at the end of most blockbusters, and it's just one chapter, partway through the book. It's awesome."
55680,"I'm re-reading *Pandora's Star* just now, and while I agree it has several great action scenes, I don't know that I'd describe it as ""action packed."" It's a very long book, and there's a lot of chapters which are just dialogue and exploration. Whole chunks of it are basically police-procedural, a lot of it is devoted to politics and worldbuilding. And sex, too, quite a lot of sex."
55681,"You're right - The Night's Dawn trilogy is more action-packed than his Commonwealth saga. I just meant that in general he's a great action writer, and that was one of his better scenes."
55682,"I've read a couple of his books, starting with Great North Road. Is this any different? He seems to be a competent enough writer but holy hell GNR was a boring drudge-grind. Most of the novel was filler and too slowly drawn out."
55683,"I liked GNR, but I liked his other stuff more. But all his books are pretty long."
55684,"I'll second that.  A bit of a slow start, and the NONSTOP."
55685,"Yeah, most of the first book is build-up, but after that shit really kicks off."
55686,Don't forget zombies in space!
55687,"Jeff Somers's [Avery Cates](http://www.avery-cates.com/) series is pretty much nothing but bubble-gum, summer-time styled dystopian sci-fi action with tons of explosions, blood, and a smart-ass anti-hero who always manages to get up one more time to finish the fight and somehow live.  Seriously, there is no real depth of story or character here, just action and plot.  If books are food for the brain then this is straight up junk food."
55688,Definitely this series. The Samuil Petrovich Series by Simon Morden is similar Action.
55689,"Germline by T.C. McCarthy. 'All quiet on the western Front' meets Hunter S. Thompson in a resource war 50 odd years hence.

It's two sequels are worth checking out too."
55690,Liege-Killer?
55691,I have fond memories of that trilogy by Christopher Hinz
55692,"I'd recommend a lot of Games Workshop's _Warhammer 40,000_ books. Maybe check the _[Space Marine Battles](http://www.blacklibrary.com/warhammer-40000/Space-Marine-Battles)_ series."
55693,"Golden Globe (John Varley): [Abbreviated Spoiler](/s ""Hell bent mafia hitmen, a race throughout the solar system, child abuse, megalomania, boardroom power plays, pocket chainsaws, attempted  genocide and the Rude Theatre's take on King Lear..."")."
55694,"Very little known series of three books called Death's Head by David Gunn.

The lead is 98% human and 2% something else. The books are extremely violent, have amazing action scenes, and they just dial everything up to 11. 

I think the author would be writing the fourth book, but no one is really sure because the author is very publicity shy and David Gunn is definitely a pseudonym."
55695,"If you're into Warhammer 40k, Dan Abnett has some of the most well written action books. Eisenhorn and Ravenor trilogies come to mind."
55696,"Walter Jon Williams: Hardwired and Voice of the Whirlwind - intelligent cyberpunk and action. 

David Drake's Hammer's Slammers books - future mercenary warfare with lots of tanks and shooting. 

Timothy Zahn's Cobra and Blackcollar books. 

For quantity of action, the already mentioned Asher and Hamilton are hard to beat."
55697,Old Man's War.
55698,*Armor* by John Steakley is probably near the top of the list.
55699,Disagree. Most of that book is pointless scenes with Captain Jack Crow that add very little to the story in the end.
55700,"Shit, you're pretty much right. But the action parts are so intense they make the rest worth it. But, I disagree those scenes are pointless."
55701,"What do they add to the story? The only planetside Jack Crow scenes that matter are those in which they actually interface with the combat suit at all, and those are few and far between. The rest has so much filler that by the end of the novel I'd forgotten why Crow had gone to the research facility in the first place."
55702,The Jack Crow scenes serve to ultimately build up to provide a basis for the redemption of Felix as a person and not just The Engine.
55703,"[Bolo Strike](http://www.baenebooks.com/p-40-bolo-strike.aspx) is mostly tank battles, with a little bit of space combat.  There are some people and plot in there too."
55704,The Legion of the Damned series by William Dietz is pretty damn good.  As is anything by Dan Abnett in the WH40K universe.
55705,"Robopocalypse is basically a novel length action scene. Different from the sci fi I usually read but it definitely fulfills your criteria. Enjoyed it while it lasted, and its sequel Robogenesis just came out."
55706,Anything by Dan Abnett in the Black Library.
55707,Besides Alan Dean Foster's novelization of *Star Trek 2009*? Maybe *Infected* by Scott Sigler. It's an alien invasion thriller with body horror.
55708,Infected is literally the worst book I have ever read.
55709,Christopher Rowley - *Starhammer*
55710,"John Ringo's 'A hyme before battle', iirc it's a series called 'the posleen wars.'  Earth being invaded by centaur-like aliens and the military gets fantastic tech (read: mechsuits) from other alien civilizations to stave off the invasion. The books reads like reports from military-campaigns with some interstellar politicking thrown in for good measure."
55711,"*The Legacy of Heorot* by Niven and Pournelle starts a little slow, but ends all action.  

*Snowcrash* is all crazy action.  

*Jurassic Park* is great, the action is without peer.  

OH my oh my, *Kiln People* by Brin has incredible action, and is fucking hilarious to boot."
55712,"So many series out there with decent amounts of action, but I always see the same dozen books mentioned. 

Instead, check out these book series and see how you like them. (Apologies for lack of links, vague titles, this is from my phone and my memory, neither one being top of the line).

Helfort's War series

Starfist series

Sten series

Star Risk Ltd 

Frontlines

B. V. Larson's series

Nightstalkers/Area 51 series

Crossover: Cassandra Kreshnov series

Into the Black (Evan Currie)

Ian Douglas's Warstalkers

Jean Johnson's series

Simon Green's Deathstalker series

H. Paul Honsinger's series

Michael Hick's Empire books

Nick S. Thomas - Battle Earth

That's all I can think of at the moment."
55713,Black Company though it is a band of mercenaries that go around the continent doing stuff to stay alive.. Terrific books.
55714,"Came here to recommend this, whole-heartedly agree."
55715,Great books. I got the vibe the OP was looking for something a little more lighthearted though.
55716,Cool are these more war and big battles or small quest adventures? Good monster stuff?
55717,War. Imagine *Band of Brothers* with swords and wizards.
55718,Ah gotcha. Never been much for fantasy war stuff. I prefer the one or small group of adventurers in a quest.
55719,"I'm currently reading the Draconis Memoria series by Anthony Ryan (starting with the Waking Fire), and I think that could potentially be a great fit. It's set in a pseudo Victorian-era timeframe (think East India Trading Company) and includes well-written dragons, magic, corporate espianage, pirates, ancient relics, and tons of adventures in a huge number of locations (from deserts to forests to polar ice caps and even a prison city).

The final book in the trilogy is coming out this summer (I mistakenly thought it was complete when I started reading it), but I'm really enjoying it so far."
55720,Sounds interesting. Are there other monster encounters besides dragons? And how is the pacing?
55721,"So far it's just dragons, but there are a variety of different breeds that are all very different, from wingless ones that live in forests to giant sea monster-esque ones. I'd say the pacing is moderate - not super fast, but not slow either."
55722,"You can try some classic sword and sorcery (like Conan). I recommend Elric, Corum, Hawkmoon and Erekose by Michael Moorcock, Fafhrd and the Gray Mouser by Fritz Leiber, Kane by Karl Edward Wagner. I have not yet read some of those, but I intend to and most people seem to like them.
I haven't read any, but propably Dragonlance and Forgotten Realms books also match what you want."
55723,"r/Fantasy's [Author Appreciation series](https://www.reddit.com/r/Fantasy/wiki/authorappreciation) has posts for an author you mentioned  

* [Author Appreciation Thread: **Fritz Leiber**](https://www.reddit.com/r/Fantasy/comments/5wv3ke/author_appreciation_thread_fritz_leiber/?st=j01pyqup&sh=de79b94c) from user u/Unconundrum 


---

 ^(I am a bot bleep! bloop! Contact my ~~master~~ creator /u/LittlePlasticCastle with any questions or comments.)"
55724,Riyria Revelations by Michael Sullivan
55725,Actually started reading this but heard there is only one monster? I do like the writing so far.
55726,"There isn't much in terms of monsters, you're right, but the books have a lot of adventures, close calls, clever plots, etc. Plus, the characters are awesome!"
55727,"SPOILER???????

So is it that the monsters are all illusions created by magic? This is something that I heard. Hope not."
55728,Wheel of Time seems a little obvious but it really fits
55729,"Gotta do Wheel of Time if you haven't!  Adventuring all over a rich world, tons of different characters, epic battles, magic, and it will keep you busy for months!  I'm doing a reread right now and I can't get over how good it really is."
55730,Tried and didn’t get too far into book one. But that was also my first fantasy book so it just seemed weird and it seemed like the writing was too drawn out. I don’t mind a little slow burn if it’s interesting. But there was just a too much stuff I found hard to care about. Didn’t give a big chance though I admit. Does it eventually check all of my boxes?
55731,"It does. It can also get a little trying at times, but it has some of the highest highs in fantasy so I think it's worth the ride."
55732,"I think it matches everything you listed above for sure.  The first book is great, but I feel that 3-4 is where it takes off.  8-10 are a notorious slog, but the pay off is amazing.  The series essentially spends so long building up to the final battle, that the last book is pretty much just that battle.  Again, I'd recommend it highly!"
55734,"Sounds perfect. So more quest adventure and not too much military battles/politics, etc?"
55735,"Yes, I would definitely say it is more of a quest adventure and is minimal on the politics and military battles."
55736,"The Green Rider series by Kristen Britain.

I review the first three books [here](https://www.reddit.com/r/Fantasy/comments/6e0vgc/review_the_green_rider_series_books_13_by_kristen/)."
55737,"This series is great up until the 5th(?, i think its the 5th). Then it falls off a cliff."
55738,"I'm reading the 5th right now and I'm still enjoying it, so YMMV"
55739,Check out Malazan and The First Law series by Erikson and Abercrombie respectively.
55740,"Malazan scares the hell out of me. Sounds like a LOT of complexity to get to the adventuring, but I never read it so I could be wrong??? I also don't have a lot of patience when it comes to reading and I suck at keeping track of a ton of characters, plots. 

I've heard mixed things about First Law. Some say there is no strong story, just more character stuff. Also heard there aren't really any monsters (besides the human kind). But again, I could be wrong. 

I'm looking for something more old fashioned quest-like, but with good characters and story and a real sense of peril. And of course fun fantastical beasts!"
55741,"Yeah sounds like Malazan isn't for you.  And what you say about First Law is also true.  No fantastic beasts.  

Sounds to me like you are a ripe candidate for the old TSR stuff.  Hit up DragonLance and The Crystal Shard.  That will keep you busy for a while. :)"
55742,Unless the no monsters thing is a deal breaker (although there are orc analogs) you could give the First Law a try. I think that it ticks most of your boxes
55743,Yeah I like my monsters unfortunately. Thanks for the info though.
55744,You could check out The Tales of Bauchelain and Korbal Broach. They are novellas set in the Malazan universe but are much less complex and have a much smaller character list and are also a side stories so you don't need to read the main series. It's about the adventures of two necromancers and their long-suffering manservant.
55745,"The Red Wolf Conspiracy by Robert Reddick is an awesome series that just doesn't get enough love IMO.  The author just did an AMA on this subreddit about his new series if you want to get a feel for him.  This series has it all and is really unique and well written.   The main plot follows a group on a large ship which travels to new locations, and so much goes on.  And yes there is a magical object at the heart of the story."
55746,"Wow, I totally forgot about this series. It's definitely a hidden gem."
55747,What can you tell me about it? A lot of adventure? Monsters?
55748,"How about The Deed of Paksenarrion, by Elizabeth Moon? Protagonist runs away from a shepherd's life and arranged marriage to join a mercenary troupe, is involved with a variety of battles and adventures travelling around the country (forests, rivers, mountains), learns life and combat skills on the way."
55749,"r/Fantasy's [Author Appreciation series](https://www.reddit.com/r/Fantasy/wiki/authorappreciation) has posts for an author you mentioned  

* [Author Appreciation thread: **Elizabeth Moon**, veteran author of Fantasy and Sci-Fi](https://www.reddit.com/r/Fantasy/comments/6x54cu/author_appreciation_thread_elizabeth_moon_veteran/?utm_content=comments&utm_medium=hot&utm_source=reddit&utm_name=Fantasy) from user u/Tigrari 


---

 ^(I am a bot bleep! bloop! Contact my ~~master~~ creator /u/LittlePlasticCastle with any questions or comments.)"
55750,"And it’s followed up by the Paladin’s Legacy series. Not with much Paks, but it has plenty of the supporting cast."
55752,"*The Dark Tower* by Stephen King might suit your needs, if it do ya fine."
55753,"Rachel Aaron's **Eli Monpress** books might be up your alley.  Eli's out to be the best thief in the world, so he's always traveling around looking for stuff to steal.  He's trailed by a sort of magical FBI agent, who has jurisdiction to track him down basically anywhere he goes.  Eli's traveling companions include the best swordsman in the world (and his magic sword) and a tween-age girl who could possibly flip out and destroy the whole world.  Despite that, it's a pretty breezy, funny fantasy series that doesn't really dwell on the heavier side of what's going on.  Lots of adventure, lots of travel, and lots of fun.  I need to get to the rest of the series (I've read the first three) but I like it so far."
55754,Sounds interesting. Are there encounters with monsters/beasts? Lots of quest adventure?
55755,"I don't think there are too many beasts/monsters in the book, although the magical FBI agent does ride a ""ghost hound"", which is twice the size of a horse and can talk."
55756,I've heard good things about this fellow named Tolkien
55757,"Ha right. Should've mentioned I meant besides Tolkien. So some other quest adventure with diverse locales, fantastical monsters, high adventure."
55758,"Are you willing to look at some light science fiction? There are some really fun planet-hopping adventures that would fit what you're looking for. I'm thinking Simon Green's Deathstalker Series and Karl Schroeder's Virga books.

Fantasy, Wheel of Time is the obvious recommendation. 

If you like enchanted objects, please check out Lawrence Watt-Evans Ethshar books."
55759,Appreciate the info. I never got into space/planet stuff unfortunately.
55760,"If you like YA I would recommend The Immortal Life of Nicolas Flammel series by Michael Scott. 

Or any of the series by Rick Riordan. 

My husband recommends David Eddings, the Belgariad series."
55761,I’ll check the first two. Heard of Belgariad but are there monsters in it? I thought I heard there weren’t.
55762,He says “very few” I’ve never read it but it may not have as many as you would like. Mostly a human war. Apparently.
55763,Crap and it’s a war story? I will definitely check out more info on the other two you sent me though. Appreciate it.
55764,"It isn't a war story the way you are thinking of it.  It's a band of adventurers wandering around the world trying to recover something that was stolen.  They are being opposed by an evil empire, yes, but they aren't in an army themselves.  There are a few monsters, but most of the adversaries are human.  It's pretty good overall, though there isn't too much complexity and it plays everything extremely straight."
55765,"All of Eddings' books have magical enchanted objects and lots of time with a core group of people on the road travelling to do something or another. His books are all quest-related. No real monsters (some weird dogs and bears sometimes), but it's light-hearted and fun."
55766,Sounds good. Would y'all recommend this over the Codex Alera series based on what I'm looking for?
55767,"Difficult. Codex Alera is a bit more mature, and serious. It's a good series. It has definitely got a few monsters, but maybe a bit less questing/travelling. The Belgariad - poor Garion barely stops. 

The Belgariad is about half the length (maybe 1/3 of the length) of Codex Alera, I'd say. It's a quicker read, it makes me smile, it's not too challenging, it's a classic. The Codex Alera is a bit more intellectual, has more monsters, maybe slightly more interesting magic, is more mature. You'd probably prefer the Codex, but sometimes it's nice to just escape almost mindlessly ..."
55768,"I've heard great things about [Master Assassins](https://www.goodreads.com/book/show/35437058-master-assassins?from_search=true), I've only just started it but I'm really enjoying it so far."
55769,Sounds interesting. Appreciate it. What can you tell me about it? Whe are the characters? And does it check all of my (picky) boxes?
55770,Richard K. Morgan's A Land Fit for Heroes is under-appreciated in my opinion. It's as weird as but not quite as complex as Malazan. R. Scott Bakker's Prince of Nothing might have some of what you're looking for.
55771,Forgot to mention I’d really like some fun enchanted objects used in magical ways.
55772,Indiana Jones and the Temple of Doom easily
55773,"* Guardians of the Galaxy
* The Indiana Jones Franchise
* The Lord of the Rings Trilogy
* The Mad Max Franchise
* The Star Wars Original Trilogy"
55774,Indiana Jones and the Last Crusade
55775,"The Man Who Would Be King

A Far Off Place

The Adventures of Baron Munchausen

The Journey of Natty Gann"
55776,Goonies never say die.
55777,"The Mummy, I know it's fairly derivative and heavily influenced by Indiana Jones but it sucks me in every time I stumble upon it."
55778,Up
55779,Romancing the Stone
55780,I don't understand why this is being downvoted. Exactly the movie that came to mind.
55781,"It's a romcom, with elements of action and adventure. It's not a proper adventure flick like the Indiana Jones series, and not even half as good as those flicks."
55782,"Stop being a genre nazi. Of course it qualifies based on ops criteria. Hell, Temple of Doom has just about as much romance.

Also, downvoting any rec that isn't an Indiana Jones movie, the one series that has a 99% chance ops already seen them? This sub is dumb right now."
55783,"It's an action-adventure film with a romance in it. The primary elements are the kidnapping and related action, the romance is secondary. Also, OP specifically mentions not just typical action adventure films. Agreed it's not as good as Raiders, but who the hell hasn't heard of Indiana Jones and really needs it recommended?"
55784,"Yeah, its odd that people have an issue with this one. The presence of a buddimg romance doesnt negate the adventure. I mean, its about a treasure hunt. It has all the hallmarks of an adventure. I suppose the title is the problem?"
55785,"Dragonslayer, Secret Life of Walter Mitty, Grand Budapest Hotel, The Princess Bride, The Postman"
55786,"Into the wild, Cast away, life of Pi or Master and commander: far side of the earth"
55787,Commando
55788,*best action comedy
55789,Remember when I promised to kill you last? I lied.
55790,Uh La LAAAAAAHH!!!!
55791,Came here to post this
55792,"I love how Bennet, who has no muscle on him whatsoever, is taunting Matrix at the end by saying ""Youre getting old, John."" Thats prime 37 year old Arnold right there, jacked as hell!"
55793,"Indiana Jones movies

Mummy movies

National treasure movies

Pirates of the Carribean movies

Sahara

Journey movies

13th warrior

Jumanji movies

Tomb raider movies

Prince of Persia

Clash/wrath of the titans

Gods of Egypt 

Inkheart

Stardust 

Narnia movies

Romancing the stone / jewel of nile

LOTR movies

King Kong 

Jurassic park movies 

Willow"
55794,I love every one of these! Was there any more you recommend?
55795,Great list. Sahara’s a favourite of mine. Films don’t have to have good critic ratings to have loads of imagination and escapist charm.
55796,"Definitely.  There are cerebral movies I adore, but I would never pass up watching any on this list—I have watched many of these over and over."
55797,Operation Condor 1&2
55798,True Lies.
55799,I will never stop recommending Butch Cassidy and the Sundance Kid.
55800,Every indiana jones
55801,Even the Cystal Skull?
55802,Yes. It may be a mediocre indian jones movie. But its a pretty good action/adventure movie.
55803,its really only bad when you compare it with the rest of indiana jones movies.
55804,The Mummy 1999 and The Mummy Returns
55805,"Unpopular opinion, but I prefer the mummy movies over Indiana Jones movies. Maybe because I grew up watching the mummy series."
55806,"I have no idea how this hasn't already been mentioned, but Pirates of the Caribbean: The Curse of the Black Pearl is a genuinely perfect action adventure movie and a true classic. Such a whimsical, grand, epic adventure that is pure, unadulterated fun from start to finish. From the sets to the fight choreography to the score to Johnny Depp's performance as Captain Jack Sparrow, they really don't make movies like it anymore."
55807,"Why not the entire franchise—in your opinion, I mean."
55808,"If you like animated stuff, *Castle in the Sky* is a really fun adventure movie. Calling it simplistic feels like a criticism when I don't mean it that way at all, but the plot doesn't get in the way of the action on the screen. I feel like it's one of the more overlooked Miyazaki movies. *Porco Rosso* also falls into that sort of light hearted adventure niche and has probably my favorite English dub.

*Nausicaa of the Valley of the Wind* is another good one to watch if you're looking for something more plot heavy. There's a lot going on in that one."
55809,"Off-topic, but have you seen ""Only Yesterday""?"
55810,"Depends on how you define action-adventure. On the more ""swashbuckling"" side, its probably  *Raiders of the Lost Ark* and *The Last Crusade*.

But if we're counting more sombre films, too, than it probably goes to *The Lord of the Rings*."
55811,"Wow nobody rembers the classics ?
The great escape. Steve McQueen
 Where eagles dare Clint Eastwood
 The guns of Navaron. Gregory Peck
I know that they are all war movies
 But they grab your attention from the start
And don't let go"
55812,My husband had never seen TGE and I died a little when I found out.  SO good.
55813,I know right?😎
55814,"I really dont know but i watch the boss level yesterday, with frank grillo, i enjoyed the hell out of it"
55815,Most of the classics have been mentioned so I'm going to recommend Romancing the Stone which is a fun action adventure comedy.
55816,The Adventures of Tintin
55817,"My favorite movies that fall into both the action and adventure categories (and are thus action-adventure) are:

1. the Indiana Jones series (1981-2008 \[with a new one currently being made\]) - An archaeologist battles to prevent artifacts from falling into villainous hands. The original three (1981-1989) are all masterpieces, but the fourth, as has already been said in this thread, only really works if you divorce it from the rest of the franchise.
2. the Star Wars series (1977-2019) - The Skywalker family finds itself involved in a series of galactic wars. The original trilogy (1977-1983) is clearly the best of all of them, but, if you want, watch them all in release order to make up your own mind.
3. *Metropolis* (1927) - Being a silent science-fiction epic about tensions between the upper and working classes reaching their breaking point, this may seem like a weird choice. However, it does become an action-adventure movie in the last third, and, despite being silent, it's loud-as-Hell, thanks to its bombastic visuals and incredible Gottfried Huppertz musical score.
4. *The Wind and the Lion* (1975) - Very, very, very, very, very loosely based on a true story, a hostage crisis in 1904 Morocco brings the United States to the brink of war with desert rebels.
5. *The Magnificent Seven* (1960) - This classic western is about a team of seven gunslingers traveling to Mexico to protect a defenseless village there from a gang of bandits.
6. *The Guns of Navarone* (1961) - During World War II, a team of Allied commandos is dispatched to the Greek island of Navarone to sabotage two massive Nazi cannons there.
7. *Khartoum* (1966) - It's probably not really an action movie, but it's still an adventure flick with a reasonable amount of top-notch action. During the Mahdist War, a British officer is dispatched to the Sudanese capital of Khartoum to evacuate it in the face of a jihadist insurrection led by the Mahdi. Will he follow orders or dig in?
8. *The Great Escape* (1963) - Like *Khartoum* above, it may not be a true action film, but it's still an adventure picture with some great action. During World War II, Allied prisoners-of-war plot their breakout from the Nazi prison-camp they're being held in.
9. *Duck, You Sucker* (1971) - A Mexican bandit and an Irish revolutionary team up to rob the Mesa Verde bank, but end up involved neck-deep in the Mexican Revolution.
10. *The Good, the Bad and the Ugly* (1966) - Three gunslingers - including the Man with No Name - race against each other across the American Civil War-torn Wild West in search of a lost treasure of gold. It's actually the third film in a loose trilogy - the first two being *A Fistful of Dollars* (1964) and *For a Few Dollars More* (1965) - but those ones aren't really adventure flicks (though they're still excellent).
11. *Army of Darkness* (1992) - A chainsaw-handed smart-ass is transported back in time to the Middle Ages, where he must fight an army of the undead to return home. It's part of the Evil Dead franchise.
12. *Zulu* (1964) - During the Anglo-Zulu War, a small British outpost is besieged by thousands of Zulu warriors.
13. *Farewell to the King* (1989) - During World War II, an American soldier in the Pacific theater goes A.W.O.L. to become the leader of a tribe of natives in the jungles of Borneo.
14. *Pirates of the Caribbean: The Curse of the Black Pearl* (2003) - A blacksmith joins forces with a former pirate captain to rescue a woman who's been kidnapped by pirates. It's the start of a franchise.
15. *The Adventures of Tintin* (2011) - A reporter and his dog try to uncover the mystery of a model ship they purchased (animated, but still amazing).
16. *Jurassic Park* (1993) - A remote amusement park brings dinosaurs back to life with cloning technology.
17. *Wonder Woman* (2017) - Superhero Wonder Woman intervenes in World War I to put an end to it.
18. *The Real Glory* (1939) - A squad of American soldiers defend a remote Filipino village from Moro marauders during the Moro Rebellion.
19. *The Wild Geese* (1978) - A team of mercenaries raid Africa to rescue a recently-deposed president there.
20. *Walker* (1987) - It may not have enough action to be an action film, but it still has some action and is an adventure movie. This surreal, satirical biopic is about William Walker, the American mercenary who seized control of the Nicaraguan government in the 1850s.
21. *The Lego Batman Movie* (2017) -  This animated action-adventure-comedy is about the Lego version of Batman (in case the title didn't fill you in).
22. the Mission: Impossible series (1996-2018 \[with more being made right now\]) - Secret agent Ethan Hunt fights to save mankind from terrorists. My favorites are *Ghost Protocol* (2011) and *Rogue Nation* (2015).
23. *King Kong* (1933) - A film crew discovers a giant ape on an uncharted island.
24. *The League of Extraordinary Gentlemen* (2003) - Heroes of Victorian-era literature join forces to prevent a world war.
25. *Mighty Joe Young* (1949) - An ape raised in Africa by a human since childhood is brought to the United States to serve as a nightclub attraction.

These are just my favorites. I excluded action movies that I loved that didn't have a strong adventure component (like the masterpiece *Commando* \[1985\]), so there's plenty more exciting movies out there to enjoy."
55818,"Die Hard 1 2 3

Crank

The Expendables

Last Action Hero

The Mummy 1999

Face Off

Total Recall

Hunt for red October

The mask of Zorro

The last boy scout

Cliff hanger"
55819,"Not trying to be a pedantic a-hole and I didn't downvote you, but these strike me as almost strictly ""action"" without the ""adventure"" aspect. When I think of adventure I think of a bigger quest like Indy, LOTR, The Mummy, etc."
55820,"LOTR I would not really class as an action adventure, more fantasy adventure. 

I agree most are action, solely but some do have a great sense of travel and excitement"
55821,"Mad Max: Fury Road, Dredd, John Wick 1-3, The Night Comes For Us, The Raid, Kill Zone 2, Kick-Ass, Kingsman, Blade of the Immortal, Robocop, The Villainess"
55822,Fast and furious 9
55823,The lord of the rings trilogy. More adventure but plenty of action. I find those movies very immersive
55824,The Transporter. Mission Impossible. All the James Bond movies.
55825,"While I wouldn't say it's the best action-adventure movie (""Raiders of the Lost Ark"" was a million times better), ""Romancing the Stone"" (1984) is an above-average movie in this genre.

Additional films that would fit here are ""The Princess Bride"" (1987); ""Spartacus"" (1960); and ""The Adventures of Robin Hood"" (1938). All three of these have plenty of action and adventure."
55826,Congo (1995)
55827,"I really liked King Arthur Legend of the Sword, though everyone like to poop on it.  It's fun.  As are the 2 Sherlock Holmes with Downey."
55828,"Die Hard series, Indiana Jones series, Star Wars series, LOTR, Pirates of the Caribbean series."
55829,"ghost busters, super 8, 5th Element, LOTR (obviously, and get the extended version if possible),  2001 space odyssey, blade runner, blues brothers, The Avengers, Sherlock (BBC and Robert Downey Jr. versions), Bill and Ted's excellent adventure, the never-ending story, Aladdin, the Lion King, Mulan, the Wizard of Oz, Faris Bueller's day off, Wayne's world, Kick ass, Pan's Labyrinth, Serenity (and firefly series obviously) and finally not a movie but Game of Thrones 

those are just off the top of my head. All movies that I've seen more then once and enjoyed. 

Try to think of movies that if you turned on the tv and they were playing, you would be happy as a clam."
55830,"Dang man, thanks for the list. Got a lot of movies i didnt think of on there!"
55831,"I just [threw them out there,  I'm glad you liked them](http://i.imgur.com/4RrLDcp.gif)"
55832,"The Protector, Ong Bak 2, The Raid: Redemption, The Matrix Trilogy, 300, The Bourne Trilogy, the most recent Bond movies, and one of my personal favorites: Behind Enemy Lines. Very underrated movie."
55833,"Bad boys 1&2, terminator 1&2, aliens, dredd, commando, predator 1&2, matrix 1, die hard 1-3, rise of the planet of the apes, Conan the barbarian, the rock, public enemies, collateral, heat, x-files fight the future, district 9, batman 1-3, American gangster, point break, lethal weapon 1&2, hunt for red October, sum of all fears, battle Los Angeles, scarface, departed, Bourne trilogy, 12 monkeys, v for vendetta, mission impossible 1-3"
55834,Another great list of movies! Im gonna be broke...
55835,Money has nothing to do with it.
55836,It's really easy to stream these movies free on the interwebs
55837,"Here's all of the movies I have:

http://i.imgur.com/ITWAUJ3.png

I think most are action/adventure. Just look through and see if there's any you haven't seen in a while and forgot about that you want to watch again."
55838,Nice collection there! Thanks for the list of movies.
55839,The Fifth Element.
55840,Raid: Redemption.
55841,Mad max 2
55842,"Lord of the Rings Trilogy, Star Trek II - IV, Seven Samurai, Children of Men, Chinatown, Prometheus (I know, I know...it's just a bizarre obsession of mine), anything by M. Night Shyamalan (another bizarre obsession of mine).  Those are all rewarding upon many viewings."
55843,"Raiders of the Lost Ark
Romancing the Stone"
55844,"The Bourne trilogy has some of the best shot action I've ever seen (also, if you like well shot action The Kingsman has well shot action as well - and its pretty funny)."
55845,Goonies
55846,"*Mad Max* and *The Road Warrior* (A.K.A. *Mad Max II*)

Sky Riders (1976 made for TV movie)

*Aliens*

*Aguirre, the Wrath of God*"
55847,John Wick is a good one.
55848,National Treasure.
55849,"I loved Sahara.  I wish it did better, so there could be more Dirk Pitt films."
55850,There needs to be a sequel called Panama.
55851,But have it set in Nicaragua.
55852,Then why's it called Panama?
55853,BECAUSE WE THOUGHT WE WERE IN PANAMA!
55854,I really enjoyed that one. McConaughey did a couple of those type films during the early 2000's that never really blew up. I liked Fool's Gold too.
55855,"Came here to comment specifically on Sahara and Fools Gold - definitely true that we don't seem to see many films like that these days. 

Where did the fun movies go?

Sahara

Brendan Fraser Mummy

Fools Gold

Without a Paddle was a good one


those are the only recent ones I can think of off the top of my head."
55856,"Same, I know the author hated it but come on, they always change shit from book to screen and it was just a fun adventure movie."
55857,"I'm not going to argue whether or not the movie was fun, but as a fan of the Dirk Pitt novels...it was a steaming pile of shit. It was drastically changed and horribly cast."
55858,But to those of us who never even heard of the novels it was awesome!
55859,"Never heard of Pitt before this post. Didn't even know it was based on a book.

But that movie was fun as fuck and exemplifies action/adventure."
55860,"Same, that movie is one of my favorites to rewatch. It's such a shame we only ever got 1 Matthew McConaughey as Dirk Pitt movie."
55861,Couldn't agree more. Atlantis found is my favorite... It needs to happen
55862,Read this as “Dark Pit” aaaand I’ve been playing too much Smash Bros
55863,The pile of shit that was Raise the Titanic(oh hell ya there was another Cussler movie)made Cussler swear he'd never do it again. He eventually let them do Sahara because of some script control and we all know how that turned out. It was a decent flick but it sure as hell wasn't a Dirk Pitt adventure. I believe it's safe to say no more Pitt until Cussler is dead and even then probably not.
55864,"I hope they set it up with a major streaming service and do it like BOSCH does with Amazon. Each season is one book, starting with the origin story in Hawaii (Pacific Vortex if memory serves correct?)."
