idx,text
24971,Andrew > Tom >>> Tobey
24972,"I Like all of them as spider-man honestly, that's the rest of the movies that are more complicated to judge.
I really, really didn't like homecoming but Tom Holland is amazing as peter
Tobey Maguire is basically what defines my childhood and I really enjoy Andrew Garfield as Peter (i think i am the only person who love Tasm2)"
24973,"Garfield was the best, he just was given bad writing to work with. He captured current Spider-Man comics the best. Tom is a good young Spider-Man, similar to Ultimate but less bitter and pissed off. Tobey had a cool costume and was the first so he'll always be special to us all, and I think that's something people need to recognize about him. Too many people have their nostalgia goggles on with him and start to remember the comics character differently whenever they suggest he was the most accurate."
24974,"***Pizza time.***

That is my reason. Also, Emo Peter is the fucking ***best***."
24975,Keanu Reeves
24976,"I liked Tobey Maguire as Peter Parker but not Spiderman.

I liked Andrew Garfield as Spiderman but not Peter Parker.

I love Tom Holland as Peter Parker *and* Spiderman so he wins."
24977,"Tom Holland because he portrays both Peter Parker and Spider-Man perfectly.

Tobey is a great Peter Parker but, not so much as Spider-Man.

Andrew is fantastic with the quips as Spider-Man but, his portrayal of Peter Parker made him look like douche."
24978,"No man, not my board."
24979,tom. he portrays peter as a teenager perfectly
24980,Tom Holland. Because.
24981,Tom Holland because he’s probably the most comic book accurate casting choice yet.
24982,Tom because he thicc af
24983,"The last one that had Electro in it, not that new kid."
24984,"Tobey Maguire easily

&#x200B;

&#x200B;

p i z z a t i m e"
24985,toby maquire
24986,"From my undertstanding:

1.  Toby was not an accurate portrayal of Spider-Man, but was a good actor in strong movies, at least 1 and 2.

2.  Andrew was a pretty accurate portrayal of Spider-Man, but not in particularly strong movies.

3.  The new guy is spot on in a well executed series."
24987,"My opinion:

1. Toby did a good job doing the nerdy Peter Parker, but a bit too passive as Spider-Man. Also Sam Reimi.

2. Andrew did a good portrayal of Spider-Man, but his Peter was too douchey, and unfortunately in mediocre movies.

3. Tom's is a good balance of both."
24988,"But I feel like the opening scenes of the original Spiderman solidify Toby as the best. Playing the unassuming kid and being, at the end of the day, just a normal young adult. You're telling me you think the new movies can beat the Toby McGuire ""GO WEB GO"" scene or the bedroom scene where he learns about his powers? Passive can be beneficial. Give me that extra-detailed exposition. Give me The Macho Man Randy Savage. Give me a HUMAN feeling movie that I believe only Toby could capture."
24989,"Absolutely. Tobey is the best actor in the best Spider-Man movie with the best Peter Parker characterization.

Andrew Garfield is probably a good actor, but was in two absolute garbage movies and played a douchebag Peter Parker.

I like this new kid."
24990,Andrew Garfield was pretty good in hacksaw ridge
24991,Definitely. Kid has awesome acting chops but he wasn’t right for Spider-Man
24992,"This is where I'm at.  The first Spider-Man with Tobey was nearly flawless.  The weakest parts were probably, I dunno, Macy Grey's cameo and Green Goblin having to act with a big plastic trash can on his head.  It was a serious landmark in superhero movies, too - before that, we had X-Men 1, which was the OTHER kind of superhero movie.  Tobeyman 1 was big, loud, fun.  

Maybe I can't see the full value of the newest one because I've been through three reboots, 5 movies and quality is all over the place."
24993,"I think a lot of people forget how huge the first one was at the box office. $400 million box office, over $100 million opening weekend. 16 years ago, when super hero movies were 99% guaranteed trash."
24994,"This. If it weren't for Spider-Tobey and the X-Men, we wouldn't have most of the comic book movies now outside of Batman. It was also the later Joe Schumacher Batman films that almost killed the comic book movies."
24995,"Ah ah ah.

Blade was the first Marvel movie to be made.

Comic book fans the world over collectively owe Wesley Snipes blowjobs on command."
24996,Uhhh bro you forgot 1986 Howard the duck
24997,And Howard the Duck is the reason LucasFilms sold what became Pixar.
24998,I too go on this website a lot
24999,You also forgot Dolph Lundgren as the Punisher.
25000,You can have spiderman and not replay him getting his powers for the third time. At this point everybody already knows the story so i appreciated the new one kind of jumping right into the action
25001,Macy grey? That had her singing for like 5 seconds and it was at an event. Lol whyd you find that part to be weak?
25002,The scene has aged really badly. Effects wise the CG looks pretty bad but that is a product of it's time. Practical effects look good though.
25003,BONE SAW'S REAAAADYYYYYYY
25004,AND GIVE US BRUCE CAMPBELL
25005,The HUMAN-SPIDER
25006,"But let's be honest, I'm not sure I could sit through another half movie self discovery Spiderman... I like that they threw him in boots on the ground picking up where civil war left off. And it give the MCU even more fluidity as a moving universe."
25007,"This is a really good point, but I think this falls under the Peter Parker aspect of the movie, which is why I think Tobey is the best Peter. That being said, “FLYYY” ... “UP UP AND AWAY WEB!”"
25008,"Yes, I mean the whole point of Spiderman is he's a guy with powers that is trying to balance leading a semi-normal life while being a superhero too. Toby is the most human out of these, while the others while they are good actors seems like they are missing something."
25009,"The main problem with the Toby movies was that Spider-Man never actually produced webbing from his body (along with other jumps in the lore). At least now the story is accurate with the webbing coming from the wrist attachments that Peter Park made himself, etc."
25010,"I never understood why this was such a sticking point for folks. It's different but hardly changes the big picture, in my opinion"
25011,"The main reason people have a problem with it is it changes the dynamic of Peter Parker in a negative way. In the comics and the newest movies he has his powers, but is also a genuinely brilliant person who is able to develop and formulate the compounds for his webbing on his own. It shows that the powers aren’t the only thing he has going for him, and really hammers home the genius nerd aspect of his regular life. With organic web-shooters you lose that, instead it’s just the spider bite that gives him everything he needs to be Spider-Man and that’s all there is to it. I don’t get bothered by it as much as some, but I do prefer the mechanical web shooters for this reason. This is all also part of why I think Tom Holland’s introduction as Spider-Man was so damn good in Civil War, since over the span of a relatively short conversation with Iron Man they’re able to cover his interest in tech, demonstrate his physical strength, the ingenuity of his webbing, and his motivations for being Spider-Man, all without ever having to actually retread his origin story we’ve seen so many times already or even say the words “with great power comes great responsibility.” It was really well done and sold me on the character."
25012,Because it was an unnecessary change from the original story
25013,"I dunno. I guess they already had me buying into superpowers, what's one more? Believing a teenager made web shooters in his bedroom though, is a bridge too far"
25014,"That's a pretty big part of his character though, Peter is one of the Marvel geniuses. Right next to Reed Richards and Tony Stark. Tobeyman had the personality down to a tee, but you never really got a sense of genius from him (Andrewman too on that account). That's something I appreciate from the new guy"
25015,how does that make it worse?
25016,"I didn't even say it made the story itself worse, just that it was unnecessary. And it also wasn't the story."
25017,"The organic webbing was actually an idea from when James Cameron was going to direct. It was intended as a puberty metaphor. He also wanted Arnold Schwarzenegger as Doctor Octopus and his catchphrase would have been ""Okey Dokey!"" It would have been a weird movie. It was canned when Cannon films went bankrupt. You can find some of the early scripts online."
25018,"Preach bro. People sleep on Tobey like he wasn't a great Peter Parker portrayal. Your boy was a pioneer for the modern super hero movie, along with Hugh Jackman; put some respect on his name!"
25019,I don't think people realize that superhero movies weren't a Thing in 2002 when that first Spider-Man came out. It really was groundbreaking in a lot of ways.
25020,"I definitely wouldn't say superhero movies weren't a thing, just not to the level of today. The Michael Keaton Batman films and the Christopher Reeves superman films were both really popular."
25021,"That's why I capitalized Thing. Since 2010 we've kind of expected at least one superhero movie every year and we take them fairly seriously. They're a big deal. Before Spider-Man, superhero movies were really just silly Batman movies and we judged them as such. Raimi's Spider-Man was the beginning of a Thing in the sense that everyone could take it seriously.

Does that sound about right?"
25022,"I can definitely see your point then. The X-Men movies and the Spider-Man movies put superhero movies into serious category, and the dark knight trilogy showed they could be amazing in their own right."
25024,I thought the MCU connection brought that movie up rather than holding it down. It's my favourite Spider-Man film.
25025,Yeah I would say the baggage was the fact that it would be the 2nd reboot of the character.
25026,"100% I know a lot of Spider-Man purists were upset that they changed a few things from the comics, but it was honestly for the better. This was a fresh Spidey movie."
25027,"[I mean, really](https://imgur.com/a/HHTtj)  Watching it for the connection to the MCU is almost the selling point. I'm not a huge Spiderman fan, overall."
25028,Tom Holland is the most accurate portrayal of comic book Peter/Spidey.
25029,"Exactly. Tobey was way too earnest and wholesome as Spidey/Peter Parker. Garfield was good but those movies were pointless. Also, Holland is the only actual teen playing a teenager, so even better. 

Edit: was* the only teen."
25030,Tom Holland is 21 tho
25031,"Yeah, now, but he wasn’t in his first appearance. We gotta take what we can get!"
25032,"Being earnest and wholesome was perfect for Peter, just not for Spider-Man. Maguire was a very good Peter, Garfield was a very good Spider-Man, and Holland is very good at both."
25033,Spiderman 3 was a great movie.
25034,Emo peter dancing down the street lmao
25035,"That's a fuckin cinematic perfection of a sequence

Now the song and dance with gwen stacey was shitty"
25036,https://youtu.be/6Ron-Ikenfc
25037,this hurts me
25038,The dance was such a weird choice.  I know Sam likes his comedy but that was a bit much.
25039,It is so perfect. A life long weird nerd suddenly gets a unhealthy over the top confident boost and he acts exactly how that would work out.
25040,"Hmm, interesting perspective.  I could see that.  I loved his shit-eating grin too."
25041,Holy shit imagine filming that lmaoooo
25042,"As someone will surely bring up: the black suit gave Peter a new sense of confidence that led to unwarranted self-importance. This self-importance manifested itself in his cringey, emo interactions in that scene. The movie intentionally made him look like an idiot because he was being one.

Whether or not that's good or not is debatable. But some people didn't think the directors knew how awkward that scene came across. Of course they did. That was the intention."
25043,"Yeah, the symbiote makes you the best it can, including being the coolest. It's not its fault that Peter's idea of cool is so lame"
25044,That scene alone helped me get over my insecurities and caring what people think of me. Straight up confidence.
25045,What is this insanity?
25046,Now dig on this
25047,"> The new guy is spot on in a well executed series.

That sounds like Disney's signature."
25048,Bingo.
25049,Tobey was the first man I saw who got bitches by being sensitive. I’m not stopping until I get his technique down.
25050,Nigga you still gonna need spider powers for that to work
25051,And be attractive..
25052,And wear a skin-tight suit
25053,“And that tight little-“
25054,"Eh, it works for me sometimes. Spider powers would probably help though."
25055,Real shit Spider-Man 2 gotta be one of the best superhero movies of all time. That struggle of peter was too real in that movie and he played it so well.
25056,The train scene goat don't @ me
25057,You right I cried.
25058,They even tried to do the weak ass rip off in the new one.
25059,Iss ok Spida man we ain’t gonna tell nobody
25060,"Watch the cinematography, listen to the dialogue, and dissect the character development, themes, and plot. It's a pretty serious movie with some lighthearted elements. 

Now compare it to a modern Marvel film. It's unreal how different they seem."
25061,"A lot of people get on my case for not liking MCU movies.  I get it; people are highly appealed to them.  I find them too same-y same-y, if you catch my meaning."
25062,"The hero rises, the hero Falls, the hero overcomes and rises stronger. That's how I feel after every Marvel movie at least"
25063,Tbf that's the basis for most stories. The template is ancient. I can't think of the name for it.
25064,The hero's journey?
25065,Yes! Thank you for that.
25066,The Hero's Journey
25067,The Monomyth!
25068,That is the heroes journey though to be fair
25069,Doesn't that largely apply to the Raimi films too?
25070,Cos Marvel is hindered by having the overarching story to deal with. You can't have a clear or well developed trilogy of films that tells a consistent story cos you gotta keep enough the same for when Infinity War comes round. It's why Raimi Spiderman and Nolan Batman are gonna be best superhero films for awhile cos they insular (yeah Spiderman 3 and TDKR aren't great but still).
25071,"too much of the comic book, not enough of the movie"
25072,"It’s my favorite film of all time, best action, writing and possibly best villain (only competition would be Willem Dafoe). Also Aunt May in this one had purpose, she was Peter’s yoda, she provided him with wisdom and encouragement and she was a very human character. That “I believe there’s a hero in all of us” speech she gave is one of the dopest movie speeches ever. In Homecoming she just made shitty larb jokes and everyone wanted to hang her. You never see them sad about uncle Ben, and she’s just kinda... there..."
25073,"Only Toby was able to keep people from killing themselves from that scene in Spider-Man 3, you know exactly which scene I'm talking about."
25074,👉👉
25092,👉😎👉Zoop
72716,Good bot
25077,How's the pie??
25078,SO good
25079,That scene was so swaggeh
25080,"Spiderman 1&2 should get more credit for re-starting the superhero craze after shitshow that was Batman Forever. I remember how excited I got to catch the first show, 16 years ago."
25081,To be honest XMen did that.
25082,"That's fair, but honestly, I always felt that Spiderman movie had broader mass appeal than X1."
25083,I'll always remember that the Famous Players Colossus near me had a giant inflatable Spider-Man crawling on the saucer.  That movie was a fucking movement.
25084,OG Scarborough mans out here
25085,Nope.  Grew up in Jane and Finch.  I was talking about the Colossus in Vaughan.
25086,"Dang. Close enough tho, still GTA. STC had the same thing"
25087,X-Men were fucking huge though.
25089,Tobey McGuire was the best Spider-Man. Change my mind.
25090,[👉😎👉 ^^^^^*](https://am23.akamaized.net/tms/cnt/uploads/2016/04/spiderman-gif-1.gif)
25093,"That scene was perfect, I don't understand why nobody liked it. He was a nerd that now became ""cool"", that's what he thought being cool was. It was clearly a joke, look how all the women he boops look back at him."
25094,"no banter. if there was banter it was boring and unfunny.

also bc of the organic webs he didn’t have any good scenes showcasing his intelligence which is a big part of peter’s identity. didn’t develop any web shooters so we just gotta take the movie’s word for it “he’s in college and other scientists like him”.

plus his suit looked super dumb."
25095,"> plus his suit looked super dumb.

You take that back right now"
25096,[is this your king?](https://i.pinimg.com/736x/62/80/a1/6280a17ffc4f770e18bfdb9177d4897d--marvel-art-marvel-movies.jpg)
25098,"""hey my homie over there thinks you're cute"""
25099,No u.
25100,*The entirety of Tom Holland's performance as both Peter Parker and Spider-Man.* Toby was the OG but Tom is the realest we've ever seent.
25101,"Garfield was the most accurate portrayal of Spider-Man.

S-man has bantz man.  The way he shittalked whenever he put the suit on was clutch."
25102,"As someone who grew up on Tobey McGuire Spider, I feel like Tom Holland is the best one. Simply because they took what I like about Tobeys Spidey and what I like about Garfields Spidey and threw it into one character."
25103,i really like that we finally have a spider-man who looks like a high school child instead of being played by 30-somethings. when i first saw/heard him in the civil war trailer i thought “oh my god he’s a baby”. instead of like the scene in spider-man 2 when everyone sees him on the train and one guy is like “he’s a kid. he’s my son’s age” like yeah dude if you’re 55 and your son has a mortgage.
25104,Pizza time.
25105,"Fam...I respectfully disagree.

But Tom Hardy in this new Venom tho!"
25106,It's not tied to the current Spiderman franchise though. Not sure how far a new venom franchise will go without Spiderman being involved.
25107,"Actually, there is a rumor that Tom Holland will make a brief cameo.

> According to Jon Schnepp in an episode of Collider Heroes, “Tom Holland was on set filming scenes on Venom for at least two days as Peter Parker.” He went on to clarify that “I’m not saying Spider-Man is in the film. When I say Tom Holland’s Spider-Man is in the film, I’m saying Peter Parker is in the film.”"
25108,"Well, I'd say about as far as the Spiderman franchises lol."
25109,That movie is going to be so awful.
25110,I want so badly for you to be wrong because Venom was my favorite vilian when I was a kid. But you're most likely correct. I'm keeping a VERY cautious optimism about that movie.
25111,Carnage is a better symbiote. Change my mind.
25112,*carnage is the best symbiote*
25113,I mean we know Tom hardy will be great in it. Because Tom Hardy is always great.
25114,Sir...please. Don't squash my hope.
25115,I'm so pumped for it though... my fave villain of all time plus my favorite actor? I lost my shit when I found out Hardy was playing Venom... if it ends up awful it will definitely be from either shitty directing or writing (like Assassins Creed)
25116,Uh Tom Holland is the best and it's not even close.
25117,"Nothing is beating Toby, Tom Holland basically joined the Warriors of the Movie industry. I mean a lot of other people could of played him, No hate on the kid, great actor great the role, just saying"
25118,The people behind Tom Holland understand the character far better than the folks that worked with Toby. I'm not saying Tom Holland earns 100% of the credit or even that he's a better actor than Toby. With all factors at play he is by far the best Spider Man.
25119,JK Simmons as J. Jonah Jameson was the best
25120,"I used to love the hell out of the Tobey spiderman movies when i was younger. But i gotta admit, they were some trash in reality but did open me up to Spiderman. This new one is the most accurate ver of Spiderman ever"
25121,"lol what Spiderman 2 is considered one of the greatest super hero movies ever, it's easily better then anything in the current mcu"
25122,Wait did u say its better than any of the current mcu movies? Even with Civil War being current?
25123,Civil War isn’t even the best MCU movie
25124,"Now what do you consider ""current MCU""?"
25125,every marvel movie since iron man
25126,"Sheesh, but I respect ypur opinion."
25127,Exactly. Great for their time but dont age well. Look like pure cheese now. This new one is awesome.
25128,"For all kids who grew up watching spiderman, it made them feel like even they too can be a hero like the nerdy teenager Peter parker. And Tobey perfectly played that part. Havent felt the same kind of impact until black panther came out"
25129,"The thing I like about Toby is that even though he was Spiderman, his personality made him automatically into an underdog for me. I couldn't help but root for him while Garfield just felt too ""cool"" at times."
25130,Tom is the best foh with this
25131,r/raimimemes
25132,No the fuck he was not.
25133,You're banned from /r/raimimemes
25134,I’m sorry sir. It’s time for you to leave.
25135,Yeah..... this is gonna be a no for me dog
25136,"Toby's 2nd Spider-Man movie is the best Spider-Man movie. It still holds up. I like Homecoming, but in the end Toby's sequel is still better."
25137,HEEEEELLLL No.  Chum bucket for me then.
25138,I'll take Weenie Hut Jr.'s
25140,I hate tobey as spiderman horribly overrated.
25141,"Hands down had the best Spider-Man movies by a long shot, and yes he was the best Spider-Man also but Andrew Garfield and Tom Holland are both good too, they’re all very different versions of the hero as they’re all pretty good. But yeah Team Tobey."
25142,Tobey was the best. Garfield and Hollanr are good but they definitely don't look nerdy. They both look like they could win prom king and I never picture Peter Parker as looking good enough to have women fawn over him the way they do Garfield and Holland
25143,"This is [comic's Peter Parker](https://www.bleedingcool.com/wp-content/uploads/2017/06/AmazingSpider-Man20151-p1-350x350.jpg) since some years ago, its been many, many years since he was the nerdy high school kid. In looks Holland and McGuire are ok, Garfield failed at the personality that Peter usually has though."
25144,Toby was a 30 year old playing a teenager. Andrew looked too good to be Peter Parker. Ain't shit wrong with Tom though. He's the perfect fit for Peter Parker and Spiderman.
25145,"~~I'm OOTL, can someone explain the differences in this SpongeBob meme, what is each building supposed to represent~~ got it, thanks!"
25146,"The Krusty Krab is where spongebob works it’s suppose to be good, the Chum bucket is run by plankton and he is trying to steal their Krabby patty secret formula they’re bad. And weenie hut jr is where you get weenie and sundaes they’re for kids and stuff"
25148,"Krusty Krab is obviously the GOAT, the good one, chum bucket nobody likes (in this I like Andrew Garfield but his movies were 💩) and weenie hut juniors is for little children (Spider-Man Homecoming which I 100% agree with)"
25149,"I like Tobey as Spider-Man the most because as I grew up he was Spider-Man. I’m not adding emphasis so let me do that real quick. I had a Spider-Man blanket, bike, costume, pillow, toys, damn near everything. I played the games on PS2 and GameCube."
25150,"/r/RaimiMemes shoutout, we forever grieve the cancelation of Spider-Man 4."
25151,Nah to me Tom is the perfect mix of Toby and Andrew (Toby’s Peter Parker was really good but his Spider-Man wasn’t and Andrew’s Peter Parker wasn’t really good but his Spider-Man was).
25152,"Spider-Man is my favorite super hero of all time. I grew up watching the Raimi films. At that time I loved the films, they were my favorite things to watch as a kid. That being said Tom is my favorite portrayal of Peter and Spider-Man from the live action films."
25153,"Toby was best Peter. The other dude was the best Spider-Man. The young kid, I have no idea cause I haven’t seen him in anything."
25155,Upside-down Tobey
25156,Pizza time
25157,"All three spider mans are very good in different ways, Toby is the best on balance but let's not act like Holland isn't very, very good. Garfield was great but let down by bad films."
25158,"Eric Foreman Venom will always make that original Spider-Man series lesser in my eyes. My boy Holland is perfect for the role, while Garfield was too cocky as Peter."
25159,That disrespect to Tom Holland though. Homecoming is the 2nd best Spidey movie. Behind 2 and ahead of the original.
25160,"You guys need to hop off the member berries. As a film, not just a superhero movie, homecoming is better."
25161,"I hated Toby as Spiderman. But also I hate his acting in general. It feels fake and rubbery. I can never buy into it, I feel like he his a step away from taking a coffee break."
25162,Weenie Hut Jrs. for me son.
25163,"Holland>>>>>Tobey 

Fite me"
25164,Toby was the worst Spider-Man.
25177,r/Raimimemes
25166,Preach.
25167,P I Z Z A T I M E
25168,New Spider-Man is hot ¯\\_(ツ)_/¯
25170,Toby was great. Just that 3rd movie killed all the progress...
25171,Recently rewatched all three of the McGwire Spiderman movies and the first two are actually really good and everything a Spider-Man movie should be. I think they get a bad rap for how good awful the third one was and how badly they fucked up Venom
25172,I miss the old Spider-Man.
25173,"When I was a younger  Spider-Man was my favorite. Spider-Man 2 the game is still the best spidey game because of the swinging mechanics, open world, etc. 

As I’ve grown I’ve moved on from him. When you’re young he’s an awesome guy to follow. When you mature he’s still exciting but the connection passes and now I find other characters interesting because I can relate better.

He’ll always be my nostalgic #1 though. And thank god for just cause 3 because those grappling hooks remind me of spidey back in the day."
25174,Spider-Man 2 game ruled.  Agree on best swinging mechanics.
25175,[Never forget](https://www.youtube.com/watch?v=qtx18tPNda4)
25176,Tobey was the reigning king of the Pussy Posse.
25178,"Tobey Maguire was a good Peter parker but a bad spiderman, Andrew Garfield was a good spiderman but a bad Peter parker, they got it right with Tom Holland hes great at both."
25179,Exactly what I was going to say
25180,I came here to say this but saw that you already said it exactly the way I would've... So... take your upvote instead...
25181,You just got that from Kevin Smith in that YouTube video about Spiderman
25182,Haven't seen it but it's pretty obvious
25183,Tom Holland. He fits the part so well and I really enjoy seeing him as Spider-man.
25184,I 100% agree
25185,Peter Parker
25186,Pizza Time
25187,"Spiderman from Infinity wars, is so far the best Spiderman."
25188,Tobey McGuire
25189,Shinji Todo
25191,Nicholas Hammond.
25193,A 30 year old kid.
25194,yuri lowenthal
25195,"This is my answer too. Tom Holland is very close behind, in my opinion, and he wins if we're only talking about live action.  Yuri Lowenthal killed it though."
25196,"John Mulaney was the best. I could watch Peter Porker in every movie. You name it, Peter Porker cameo."
25197,"The best Spider-Man actors

1. Tom Holland 

2. Tobey Maguire 

3. Yuri Lowenthal

4. Jake Johnson 

5. Andrew Garfield"
25198,Charles Aznavour.
25199,Danny Devito
25200,i like tobey
25201,Tobey!
25202,"Grew up with Tobey, gave Andrew a chance, didn't connect.

Third time's a charm, Tom Holland *is* Peter Parker/Spider-Man."
25203,"Tom Holland and it isn't even close. He embodies everything about Peter Parker that I love, and I can't think of a comic book character brought to life in better fashion than Tom has done with Peter."
25204,"The way we think of Christopher Reeve as Superman and RDJ as Iron Man, we'll forever think of Tom Holland as Spider-Man. Calling it now."
25205,"I think Affleck very well could be that for Batman, under Matt Reeves that is."
25206,I think it strongly depends on his performance in Justice League and his standalone title but judging from BvS he's a strong contender for the spot for sure.
25207,"That's the case with every other MCU protagonist, so... yeah."
25208,"I really liked Tobey's version, but I think Tom, his age, and the writing came together to make the current version the best one. The writing in Homecoming is being seriously underrated IMO, it takes really great writing to make Peter's character and Spidey's character come together so well, especially in little moments. After that, Holland sold the hell out of it."
25209,"Tom Holland. Question finished. Go home, drink milk, go to sleep."
25210,Take my upvote. TAKE IT!!!!
25211,"Tom Holland now, of course

Previously, I always felt that Tobey Maguire was the better Peter Parker, while Andrew Garfield was the better Spider-Man, if that makes sense.

Tobeys jokes as Spider-Man just didn't land for me, and Andrews Peter Parker was too quirky/""cool"" to properly be Parker

Tom Holland is best at both though, so..."
25212,I think I agree with this. Garfield was fantastic as spidey for sure but his peter scenes were a little off. Except with Gwen. I thought there was some amazing chemistry there but Holland nailed Peter. Good thoughts.
25213,"Oh yeah, there was definite chemistry between him and Emma stone, no doubt. But still didn't seem like peter Parker"
25214,Where I stand on it when I compare Tobey Maguire and Andrew Garfield. Tobey Macguire did a better job handling the balancing his double life as Peter Parker. Andrew Garfield did a better job with wisecracking Spider-Man.
63562,Exactly
25216,Tom by miles
25217,Ha miles
25218,Morales?
25219,"Tom is the best, most accurate Peter Parker. Now, Tobey shows heart, and Garfield is fine. But Tom nails the look, personality, and everything"
25220,"Not to mention, they did a really good job of making it feel like he was both characters and not just one or the other.  I felt like there was a lot of disconnection between Spider-Man and Peter in the older movies."
25221,Holland by far
25222,"Tom and no one else. I liked Toby once upon a time but since Civil War Tom is Peter and Tom is Spider-man and no one else. I disliked Andrew the most and like to pretend that two movies don't exist. No hate, just my opinion."
25223,Tom Holland. He's playing the literal teenage Spider-Man...not a 30 year old playing a high schooler.
25224,"I haven't even seen Homecoming, but I know the only answer is Tom Holland."
25225,"Go see it, you won't regret it. It's incredible."
25226,"It depends really what you mean, because I think Tobey McGuire was the perfect Ditko inspired Peter Parker. Whenever I rewatch that first Raimi film it just has so much old school cheese to it than I can't imagine it any other way really. His Spider-Man also had some appropriately fitting cheesy lines but I really don't think Tobey is a good voice actor. Presumably the Spider-Man lines are dubbed over and his delivery always sounds strange, as they do whenever he did the video game stuff. 

When TASM came out I really liked Andrew's Peter, but after I met some wannabe edgy hipsters who clearly took inspiration from his design I just couldn't take him seriously. Shit like him riding the skateboard in school feels so painfully dated. Plus things like him ruining a kid's internship at Oscorp doesn't sit well with me on rewatches. That said his Spider-Man was perfect, I wish he still had the chance to be the character.

Tom Holland though is a perfect modern Spider-Man. He embodies the best of both worlds. I think his Peter Parker feels so real because he isn't some ""of the times"" character like the hipster from TASM, he's just such an everyman, which is exactly what Peter needs to be. He has a few friends, he's a bit of a loser to many (his interests for example being building a Death Star) and he's just excited to have something like Spider-Man in his life. 

The way I see it, Tobey is a perfect classic Spider-Man both as Peter and the webhead, Andrew's Peter Parker feels like what a studio of middle aged men think is the new and hip fellow kid whilst his Spider-Man feels like Tom Holland's Spider-Man but all grown up. Holland's Peter Parker feels perfectly like an average guy and his Spider-Man is so young and inexperienced it feels hard to compare him with the others but you can just see him growing up like Garfield's Spider-Man who feels tonally pretty similar however he has a bit more experience to him."
25227,"Tom, definitely. But I liked Garfield's a lot as well."
25228,"Tobey will always have a special in my heart since spiderman 2002 is my favorite movie of all time.
However after seeing homecoming i have to say, Tom Holland is the perfect spiderman/peter parker."
25229,"Tom Holland 100%. Maguire and Garfield were good, but they weren't fully realized. Maguire had the nerdy Peter Parker side down, Garfield had the cocky Spiderman side down, Tom Holland gets both."
25230,"Tom Holland, 100%."
25231,"1.) Tom Holland - Best without a doubt

2.) Toby Maguire - Great in Spider-Man 1 and 2, but not what I think of Peter Parker

3.) Andrew Garfield - Great Spider-Man and older Peter Parker, but not a good young High School age Peter Parker."
25232,"Holland and Maguire are both great, and Garfield is the Yamcha of Spider-men."
25234,"Tom. Wanted to give it a fair shake though so rewatched Spider-Man 2 last night. Yep, still Tom."
25235,"Tom Holland is far beyond the previous actors. Tom Holland convinced me twice in the last two nights that he is indeed Spider-Man and Peter Parker

#TomHollandIsMySpiderMan"
25236,Tom Holland by far
25237,Tom > Andrew > Tobey
25238,"I loved the Tobey Maguire movies, for the most part, growing up with them they will always have a place in my heart and I think he did a great job capturing the character.

But Tom Holland just brings such a freshness, youthful, and true quality to the character...yeah, he's my favorite."
25239,"Tom > Andrew > Tobey for both Peter Park and Spider-Man, in my opinion. While the Tobey movies were better, I thought Andrew did a better job of portraying the character."
25240,"I think this is the best answer. First movies were better than ASM, but Garfield had it down."
25241,"For me, Toby was a great Peter Parker but not very believable as Spider-Man. Whereas Andrew Garfield was pretty believable as Spider-Man, especially in the way he was built all lanky and spindly. But the skater/photographer/sometimes genius aspect of his Peter Parker didn't sell me. Not that most of that was his fault at all. 

But Tom Holland absolutely crushed it as both Peter Parker and as Spider-Man. He sold them both so well."
25242,"You know, I don't really know! I'mma say Holland, mostly because [his line delivery when Peter asks Liz to the dance](#spoiler). It is literally the cutest thing in the world."
25243,"Andrew Garfield for me but I REALLY do like Tom Holland as well. But they are playing him at different ages and in different circumstances so I think each did well with what they were given.

I hated Toby with a passion. Google tobyface on youtube."
25244,They all played him as a highschooler
25245,Garfield played him at 18 or so. Thats a bit different than 15.
25246,"Yeah, a bit"
25247,"I mean maturity, who you are. How you interact with people. Not saying your an adult but starting high school and finishing it are different for sure."
25248,"Yeah, I see what you're saying man. I didn't really take that into account before."
25249,I can see someone being way more confident at 18. Especially if they are dating someone as hot as Gwen ect and had their powers for awhile and such. I think both did a great job honestly but the stories they had were totally different as well.
25250,"Yeah, they had vastly different circumstances"
25251,tobey forever
25252,"I honestly enjoy all three. I used to have distaste for Tobey but being older has changed that. I also think Andrew would make a fantastic older/college graduate age Spider-man, not high school. Tom is just perfect for right now though, especially if they pull a Harry Potter and have him grow up"
25253,"Josh Keaton.... Oh cartoons don't count? Uhhh it has to be Tom hands down, he's endearing, he's funny, he has the quips down without being too much of a jerk, he makes Peter seem like a legitimately good person with rock solid morals where as the other two both occasionally had questionable morals, he plays the whole dealing with his Parker Luck really well without being a moopy idiot, he isn't meek but he isn't an asshole either. He truly feels like a kid."
25254,It will be a long time before someone mentions a Spiderman movie and my first thought isn't Tobey Maguire. I am happy with Tom Holland though.
25255,"Tom Holland is most definitely the best Peter/Spider-Man we've ever had and i hope Sony doesn't do something stupid like not extending the deal they have with marvel. I feel like Tom is perfect for the role but the fact that he's in the MCU now really helps too.

Having said that, Tobey and Andrew both did a good job in their movies despite not every movie being as good."
25256,"Tom Holland and no this isn't recency bias, I swear. I saw Tobey recently and he is just awkward and barely likeable, Andrew was not bad, but still not likeable. Holland is a LITTLE over the top, but then again so is Peter, and he was so excited the entire time, but when stuff happened he hit the right emotions perfectly, and his struggle under the rubble was great. The cheesy voiceover wasn't but holland still managed to nail that scene."
25257,"I think every Peter Parker and Spider-Man actor so far has been perfect for their respective versions of the character.

Overall, so far, I think Tobey is the best Parker, Garfield the best Spidey, but Tom Holland is the best at bein' both and has the most potential to be the truly definitive version of the character as a whole.

So TobePete ≥ TomPete > GarPete, GarSpide ≥ TomSpide > TobeSpide."
25259,"Holland is a perfect Spidey, i just connected more to Tobey's Spidey... I guess that makes me a moron..."
25260,"Trick question, it's Jake Johnson"
25261,"True, he immediately showed all the best aspects of spiderman"
25262,I dunno I liked Chris pine alot
25263,Also another good option
25264,"I'm so torn on this... On one hand Tobey Maguire was my youth. On the other hand, Tom Holland is truly killing it."
25265,"Tom Holland is an amazing actor and gives the role a lot of energy, but i still don't know how to feel about the MCU turning Spider-Man into Iron Man's apprentice/sidekick, making him very dependent on Stark tech.

From a legal perspective it's a smart move because it ties Spider-Man closer into the MCU by strongly associating him with Iron Man, when they know that Spider-Man still belongs to Sony but still making him an integral part of the MCU so that the backlash/cultural impact would be huge if he were to leave it."
25266,“Nothing without the suit”
25267,"Imo that'll be dampened by time. In Far From Home you already see Peter messing around creating his own suit, granted with Stark tech, maybe in the next one he'll start going more his own way, since Far From Home's theme was just that."
25268,"Damn, thats in-depth! kudos on the dilemma"
25269,"Ironically, I had a dream last night where I was spider-man. Ngl it was a really nice dream. 10/10 would have again.

So yeah I went with me dreaming"
25270,you go gurll!!
25271,"For me it will always be like this: Tobey was a great Peter but he didn't catch all the personality of Spiderman, for me he was too serious as a Spiderman. 

Andrew was a great Spiderman more ""funny"" and sarcastic with his enemies but at the same time he was responsible about it.

Tom for me is the worst in any aspect but not because of the actor, he's performances are great, the problem is that the way they're developing his Spiderman is so childish and sometimes his actions doesn't even make sense. 

Personally my all time favorite movies of our friendly neighborhood are Spiderman Into the spider verse, Spiderman 2, The amazing Spiderman and Spiderman."
65041,Completely agree.
25273,"Nice analysis there, agree with most of it"
25274,"If you pick the wrong answer, I'll put some dirt in your eye..."
25275,"ahhh...nicely done, tobey"
25276,Tom Holland’s Spider-Man is incredibly bland
25277,"I literally had a dream that i was spiderman last night, it was a brilliant dream"
25278,"The reason I pick Tom Holland is because Tobey Maguire was a great Peter Parker he wasn’t very good as Spider-Man, Andrew Garfield was a good spider man ( given the script he was given ) but a poor Peter Parker, but Tom Holland is decent at being both giving him the win"
25279,Josh Keaton isn't on this list.
25280,Neither is Robbie Daymond.
25281,Or Shinji Tôdô
25282,"Come on, people, it’s Spider-Man! Respect the hyphen. 

I picked Holland, but I think Garfield is an underrated Peter Parker. Maybe a little emo, but he really nailed the smart alec/quippy vibe that makes Spidey, great. 

I’ll also side with whoever said Jake Johnson because that rendition of Pete is flawless."
25283,Tobey was a great Peter.  Andrew was a great Spider-Man. Tom is the best of both worlds.
25284,Jake Johnson
