idx,text
69937,"I'm not confident regarding the curriculum of most schools, but I know some have engineering majors take almost identical classes during the first year or two of college, allowing students to commit to a specific engineering field after taking some electives.

Edit: I completely understand that most curriculum is different in some way, and that most introduce major-specific classes early on (that's why I mentioned it above).  I'm speaking mostly to the schools that intentionally parallel the curriculum for the first year or two for all (or most) engineering majors to allow for a choice to be made after some engineering electives have been taken, and the decision is more informed."
69939,The Pay Raise thing is so true.  It is also infuriating knowing that someone who knows nothing about you other than your resume is wiling to pay you more than someone you have proven yourself to time and time again.  Loyalty is not a virtue in Engineering.
69940,"Civil Engineer here. I highly recommend it if it interests you. There are so many branches your career can take after college, depending on what fascinated you in classes.

I love construction, so I don't even have a P.E. (Professional Engineering) license but rather a G.C. (General Contracting) license. Day-to-day I don't do all that much I learned in school save for a few construction management-oriented classes, and utilizing the organizational and problem solving skills I developed in college and thereafter.

The degree will get your foot in the door for many different types of companies."
69941,"Good engineering programs will have a gen-ed type intro to engineering class you should take in your first two semesters.  It should give you a chance to try out different types of engineering.  


I would recommend talking to professors that teach the higher level classes.  Let them know you are interested and see what they think about things that interest you.  i.e. job prospects, job security, grad school requirements for positions you want, pre-requisites for upper level classes, possible minors that wouldn't require a large extra load of classes, co-op positions, etc.  


Then if you still have the time, try to network with some actual practicing engineers in the fields you are interested in.  Go to some job fairs your first semester, even if you aren't graduating anytime soon and just go check out the prospective companies and talk to them.  Get a connection that could give you an in for a co-op in your second or third year.  Those damn things are worth their weight in gold when you get out.

Good luck!  It's a fun ride, but do your homework."
69942,"Economics


EDIT:these replies are a goldmine of insight"
69943,"Pros:

Very interesting and diverse classes. I took everything from history of economic thought to economics of terrorism. Along with the more analytical classes of course.

You have a wide array of careers to go into afterwards.

A lot of what you learn is applicable to real life.

Cons:

You better be good at math AND english. Its both writing and math intensive. You can't just be a creative or analytical type of person. You must be well rounded. 

Good luck. I have done everything from finance, to accounting, to owning my own business with my degree."
69944,"College student here to address the high schoolers. When in college, don't have a tunnel vision, only taking classes directly relevant to your major: use your required elective credits to take interesting classes which have nothing to do with it. You may find a new hobby or even a new career aspiration. Make the most of your time."
69945,"Also, get an internship. Does it suck spending one of your last free summers working and not getting paid? Yup. But you know what sucks more? Not being able to find a job and pay bills because just about everything requires internship experience to even be considered."
69946,"Ctrl+f agriculture

No results. 

Aww come on high schoolers 


Edit: Holy shit guys, this really blew up and turned into my highest rated comment! I've read through a lot of the threads already and it seems that a lot of people have been answering questions under this, I posted and then just went back to work and couldn't get on reddit due to lack of service. 

I encourage anyone who is interested in going into agriculture to read through some of the responses in this thread. If anyone would like to either pm me or comment again on here and ask a specific question, I've worked in chemical, grain, and livestock and done peri much everything in between. 

Edit 2: Also, for anyone with more than a year left in high school, I encourage you greatly to look into FFA. Its, in my opinion, one of the most important student organizations in America, and is great at building skills used in all industries."
69947,"Same for biology.

Ain't nobody want to become a broke-ass average biologist."
69948,Back when I was in high school everyone and their cousin wanted to be a marine biologist.
69949,Filmmaking
69950,"> Film

Don't go to film school. Go to films and make movies. You'll save a shit ton of money that you won't be able to payback and you'll actually have made something. I'm fully aware a shit ton of film majors are about to pop up now and shit all over this opinion. If you value your credit, time and effort just make films and save thousands of dollars.

Source: I went to film school"
69951,">I'm fully aware a shit ton of film majors are about to pop up now and shit all over this opinion 

I won't fully disagree with you because in many cases film school is a huge waste. I'm currently a film major so I'm a bit biased but I **will** say that what film school does is give you the opportunity to hone your skills in a competitive but somewhat risk free environment. Basically it allows you some time to really fuck up and make your mistakes before entering the much more competitive real world. It costs a shit-ton of money and the jury's out on whether the investment is worth it but that's a debate that will pop up with many majors in jobs where degrees aren't necessary to succeed. 

What also matters is *which* film school it is. If you're applying to the North Dakota Film Academy in bumblefuck, I would say that it's not worth it. But a well-connected school in or near a major city has a huge upside in that you have so many networking opportunities and a chance to get your foot in the door that you may not have gotten so easily otherwise.

Film school is **not** for everybody and most schools don't have the sort of program that will actually be beneficial. but I think it comes down to financial status, location of the school and what the type of program the school offers."
69952,How dare you speak ill of Bumblefuck.
69953,"Biology and Computer Science as a double major. I want to go to med school and I have always wanted to learn how to program. I figure these majors combine to things I like, and also give me a shot to get a decent-ish job right out of college if I don't go to med school. 

Edit: Thanks to everyone who replied, you guys/girls have really helped me make sense of everything. I have some research to do!"
69954,"Any bio degree + computer science opens you up for bioinformatics as well, which is a lesser known but super interesting field. There is so much data being generated by research now that it's difficult for humans to analyze it all, so computers are being used more and more to parse and analyze all this data. There still aren't a ton of people that know enough about both biology and CS to do bioinformatics, though, so it's a good field to get into."
69955,History. There's just something about the subject.
69956,"Pros: History is phenomenal if you're planning on pursuing a masters degree. It is a very solid base for any future studies, especially for research. The skills you get in critically analyzing information and writing are invaluable. It's also incredibly fun to study if you are the kind of person who is fascinated by it.

Cons: Engineering and business majors will constantly talk shit about you and your degree, and there are almost no relevant jobs with just a bachelors. Basically you'll probably need to use it as either the starting point to a graduate degree or use it as a generic college degree that allows you to check the ""college graduate"" box on application forms."
69957,"History majors aren't quite as hard to find a job, IF you know how to package your skill set. A good school will teach you about specific subjects, sure, but the skills of how to do research are going to be valuable in a number of fields. I know that the FBI and CIA have recruited among History majors, for instance. Highly recommend getting other languages under you belt as well. History dovetails nicely with a lot of other fields, so consider double majoring, if you have the fortitude for that much work. Also, for heavens sake, try to get an internship in somewhere while you are in school."
69958,History is good for everything and great for nothing. It's a versatile all around degree that shows you can interpret information and think critically. Some people will say you'll have trouble getting a job but I haven't found that to be the case. I live in a fairly poor Southern state and have had no issues getting/staying employed with my BA in history.
69959,"Pros: Super interesting, very broad range of subject material.
Cons: It will be VERY difficult to land a job. Even if you're planning on going into teaching, history is NOT an in-demand area for teachers. And if you do manage to land one, the pay will be crap.
Edit: Lots of people replying to me have said it's not hard to find a job as a history major, but nearly every single one of them has said that they are working in a field other than history. Food for thought..."
69960,"I'm surprised nobody has said it yet, but what about IT?  
Edit: So the general consensus is just to focus more on certs, and not all that much on the college side of things? If I was looking to go into tech support what would be a good job to have in high school to prepare? I would think something like retail so I have experience dealing with customers/people, but are there better options? Thanks again all of you, It's really helpful!"
69961,"A lot of times these days IT isn't so much a college program as a trade. Get certified, in order:

- CompTIA A+ Certification

- CompTIA Network+ Certification

- Either Microsoft Certified Technician, or Cisco Certified Network Specialist. Or both.

These certifications with prove to anyone you want to work for that you know your shit. I've seen people get jobs with this and no college while their college educated peers remain unemployed."
69962,"Physics, I think it would be amazing to someday work at a place like the LHC"
69963,"I have a physics BSc/MSc, now doing an Astronomy PhD.  Physics is hard.  Really, really hard.  And being smart isn't the most important thing, honestly, compared to having the discipline of working all through the weekend multiple times in a row to just get all your homework done.

That said, physics is just about the coolest thing for someone curious about how the universe works, and labs are super fun IMO.  I also happen to think physicists are a bunch of wonderful, interesting people."
69964,"> labs are super fun IMO

This attitude is probably the #1 reason why someone does or doesn't make it in the field. I graduated with a bachelors in Physics, loved my study, but would never make it as a physicist because I am not particularly happy in the lab setting (though my experience was limited). For anyone thinking of studying physics, I encourage you to start labwork as soon as possible to find out how you like it, and try projects in different disciplines if it's feasible at your school.

> physicists are a bunch of wonderful, interesting people.

I would second this. My major was small (class of 10-15 at a school of 5500 students) and I am still close friends with many of my physics classmates 4 years after graduating."
69965,"Physics MPhys, one of my project supervisors put it best.

""You'll come out knowing more maths than anyone but a mathematician, more about experimental procedure than anyone but a biologist/chemist, more about computer programming than anyone but a computer scientist (even more than some), more about material science than anyone but a material scientist and more about engineering than anyone but an engineer""

EDIT: You do end up knowing some physics too (hopefully), I should add.

It's difficult but honestly I like that, it makes me feel like it's been worth doing it. Very marketable jobs-wise too. About half of my final year has been to do with particle physics too, my project involved CERN, so I agree on that."
69966,"> You do end up knowing some physics too

But not as much as a physicist."
69967,"There are more people pursing physics than there are jobs for physicists, so the field is very competitive, especially in particle physics. But if you go into it with an open mind, and pick up some other marketable skills (statistics, engineering, programming, technical writing) you can still be fairly competitive in other quantitative careers. There are a few more arrogant people who think that they will be the next Feynman than in other sciences, but that usually gets beaten out of them in grad school. Also, the LHC is only one of the awesome places to work at. Granted it is the hot one right now, but there is so much more to physics than just particle physics, and a lot of very great places scattered all over the world. I'm not telling to avoid particle physics, but keep in mind that there are other exciting subfields like AMO, condensed matter, biophysics, cosmology, and so on.

Overall, 9/10 would do again. 5/10 with rice."
69968,"B.S. in Physics here with a couple points. 

* There are no jobs for Physics B.S.  Be prepared to work in a different field or be in school for a long time.
* Great general B.S. that prepares you more than anything to think.  You will be able to perform well in any quantitative field.   Getting your foot in the door is another story.  Most hiring managers know that physics majors are legit, but no more legit than someone with a degree in the actual field they are hiring for so you'll be competing with those folks.  
* As its so general, you don't really get too into the ""cool"" stuff except maybe through an elective or two.  In other words, your core courses will mostly just be foundational stuff that has been known for 100+ years (newtonian mechanics, electromagnetism, thermal dynamics, etc.)  Don't think you'll graduate as a ""scientist.""  You're just building a foundation and the real stuff comes via grad school.  Note that you'll probably have the opportunity to take graduate level electives and get a taste of that stuff.
* Classes are hard.  This has been stated plenty and it's probably the case with lots of degrees, but physics forced me to become a real student, not just a smart guy.  Through highschool I was fortunate enough to be able to do well in school without all that much effort.  By my Jr year in college, I was about to not be on track to graduate because I had too many D's in my core physics courses.  I had to reevaluate my approach to learning (actually learning, not just doing) and retake some courses, but that experience taught me more than anything else.
* By the end of my B.S. I knew I wanted a job, not more school, so I applied for anything quantitative that I coild.  I got two phone interviews and one call-back.  It was 2008 so I understand the economy was a factor but I definitely felt at a disadvantage due to my lack of specialized knowledge.  I was lucky enough to land a job in insurance (I found out later that they offered all 6 people they interviewed and only I and one other guy accepted).  Once I got my foot in the door, I did very well and I have since been able to build a good reputation, but I feel like I was lucky to get that foot in the door.  I work in finance now, but still feel disadvantaged vs. those with finance degrees.

Just thought I'd throw in a few comments about my experience. 7/10.  I don't regret anything but if I could do it over with the benefit of hindsight, I might choose a  less general degree."
70349,Psychology
69970,"super interesting subject, but you'll need graduate school if you want to make it your career."
69971,"Can confirm. All my psych major friends are either working in a completely unrelated field or went on to grad school. 

Edit: I am not a psych major. I have several friends who were. They were told by their department to get a master's degree if they wanted to work within the traditional field of psychology. If you do not agree with what their professors told them, I'm sorry. Just sharing what I know. Jfc Reddit. 

Edit 2: also, needing a master's degree in a certain field doesn't at all mean it's not worth studying."
69972,"PhD in clinical psychology here. Depends what you want to do with it. There are many fields of psychology and many things you can choose to do (clinical work, assessment, research, teaching, or some combination) but in almost all cases you will need some graduate training. The pros if you go through to the end AND you get a job are that you'll be doing something you love and hopefully working to improve the lives of others. The cons are that jobs are scarce, competition is immense, and for that reason pay is not great. I make 100,000 and that's towards the mid-upper end of the scale for a clinical psychologist. 

Edit. I'll put in a plug for my sub that I decided to create 5 minutes ago, /r/behavioralmedicine. There's nothing there yet, but for those interested in behavioral medicine/health psychology my plan is to grow this thing."
69973,"Animation.

EDIT: Thanks to all that replied! I can't keep up with all of them. But I'm going to read every last one! Thanks a ton :)"
69974,ITT: My hopes and dreams being crushed.
69975,Biomedical Engineering in to med school
69976,"Finally my time to shine! I would say doing an undergrad in pure engineering, then master's in BME definitely benefited me since it is such a vast field and you certainly need the technical background as well as a solid specialization.

Pros:

* A fascinating time to be in this field if it's something you're interested in
* Fast growing industry, therefore many well paying job opportunities
* You get to have an education in engineering AND health sciences which is awesome
* Sometimes you get to wear a lab coat

Cons:

* You can't be squeamish since you'll be cutting up dead people alongside other med students
* You'd potentially need to study longer than other fields"
69977,"I did this and I'm currently a 4th yr med student applying to residency in head and neck surgery. This is definitely not the smartest route if you are set on medical school. I thought it was great for me but it is challenging to maintain the 3.7+ gpa you need in undergrad in engineering courses to get into med school.  There are much 'easier' routes to med school but if you're interested in research (md/phd) or device development or want to have a more solid understanding of science than a straight bio major then it is a good choice. PM me if you have specific q's

EDIT: Getting a lot of PMs about my statement regarding 'easier routes'. To clarify, I meant other majors that involve much less work than engineering to achieve the same GPA output. Eg, in engineering I would often spend 15-20+ hours on a single problem set or engineering report for a class that requires 10 or so during a quarter, combined with taking 3-4 other classes. To get an A you have to do well on all of these assignments as well as doing well on the midterm/final, but you find that you get less time to just straight up study when you're spending all your time getting your damn MATLAB code working/completing hours of assignments etc. Spending all your time to do well in engineering means you have less time to do other activities that med school admissions committees value including volunteering, research (I still did a lot of this - but then you sleep less), going abroad etc. 
To me, some of these easier majors may be Biology, Molecular Biology, Biochemistry, and other non-science majors as long as you fill out the med school pre-reqs.
Overall though I think it is best to pursue your 'passion' - something that you can study for hours and not get bored, which for me was was BME/engineering. When you study something like that, you can do really well with less effort and you end up enjoying it more. The hard part is finding this area. That is something no one can tell you and requires some soul-searching. Hope this helps ... I agree with what MDfootball2014 wrote below"
69978,"So far nobody's said game development, but I'll just say don't go for it if you enjoy having free time."
69979,"I came to this thread to warn people about it too. Guys, it's not for everyone. It's A BUTTLOAD of work. You think you know how much is too much work? You don't know shit. In other jobs, work ends when you finish your work. In game dev, there is no finish lines. If you are good at your job and you complete your work fast, your reward is more work. There is always more work. The industry burns young minds like no other, so be very, VERY sure before going in. 

Edit: jeez ok people, I know there are other jobs with high hour demand, no need to keep pointing it out and getting all pissy about it. But a guy who goes into game dev isn't going in with the same mentality as someone who goes into science or medicine. Also most people already know science and medicine are a lot of work, and this is a warning thread, we're supposed to be telling them what they don't know."
69980,"It also doesn't pay nearly as well as other development gigs. 

Also do not for the life of you get into game testing. Holy shit.

Edit (in addition to adding the word pay which I forgot):


I don't do game testing but I know a bunch about it from some people I know. Testing of any kind is pretty horrible because you're at the bottom of the tech barrel other than maybe IT. You don't get paid very well (it isn't particularly hard, just very repetitive), you're kind of looked down upon, and the hours aren't great and there is a decent amount of stress. Basically, the perfect person for QA is someone who is smart enough to be competent and motivated to do a good job, but isn't ambitious enough to get out and do something they actually like. I've sat in on hiring for QA, and a lot of candidates we turned down because we just didn't believe we were going to be able to retain them for a long enough time. Anyways, in QA, you're kind of like the company goalkeeper, every time you miss something, you get blamed, but when you do a great job and find all the bugs, you get no recognition.

Game testing is the worst though. You're basically just repeating parts of games all day. Like you have to run into walls, do all sorts of really crappy tasks for hours on end. And that's if you're lucky enough to do real games. I've known a few people who had to QA shit like the Kardashian mobile game. Think of all those horrible mobile games out there. There are people whose jobs it is to test that. 

Anyways, I would really avoid QA as much as possible. You can make a career out of it, but it's kind of a shitty gig that isn't very stimulating that becomes increasingly hard to escape from the longer you're there. You can escape to something like development, but a lot of places don't like letting their QA people move to other groups. And then, if you stay there long enough, unless you've been simultaneously cultivating other skills, the only thing you're going to be qualified and have experience is QA which means at your next job, you get a bit more money and even more stress."
69981,"Do you ever tire of hearing people want to do this because they ""like games?"" I feel like that's gotta be a really common theme among people who *can't* cut it in that industry."
69982,"Music education. You'll know very fast if its something you'll want to stick with or not. Also it's just as much about experience as it is having the degree.


I've seen so many students drop out fast in this field. Even one of my classes this semester only had 3 people left in it by the end. Some people don't think Theory and all that will be difficult till they get into it."
69984,"Political Science

EDIT: I am planning to go to Law School afterwards"
69985,"**PROS:** Most people don't realize how versatile a political science major can be depending on where you specialize. A B.A. in political science can be a good basis for Law School, government jobs, academia, and more. 

* Law School: Political Science can make you knowledgeable in American or International laws. Very good background to have. **UPDATE:** Its been pointed out that political science is becoming all too common in law school application pools. I  take these points with a grain of salt since there are less law school applicants these days and I do not believe the major is out for the count, but then again, i'm not a current law student or lawyer so I am not the expert on this. Take that as you will. But, as others have said, diversifying your undergraduate education is a major plus when applying and double majoring in something else will improve your chances.

* Government: Almost any Federal Department (Or State or Local) will have jobs for Political Science majors. Depending on the department you may want to double major or have a minor. State Department for instance has the Foreign Service (check out /r/foreignservice) if you want to be a diplomat and that will require foreign language skills. Likewise, an economics double major or minor will be useful for almost any department.

* Political Campaigning: A political science major with strong people skills, creative thinking and a sense of strategy could make a career out of this. Keep in mind, it's not an easy world to break into. You'll most likely start small working for the campaigns of State officials. If you can land an internship in DC and get your name out there, you'll open a lot of doors into high level positions. **UPDATE:** As others have pointed out, you do not necessarily NEED to have BA in Poli-Sci to land a campaign job. You can start off as a volunteer or campaign staffer during your education and later on, experience becomes the most important element. In addition, you don't have to go to DC to be ultimately successful if you prefer to work elsewhere. It is your call.

* Academia: This will require a PHD and a strong sense of discipline to get to (4 years of undergrad, 4-6 years of grad school). Academia is a tough job market since there's only so many renowned universities looking for professors of certain subjects, but if you get into a Top 20 program, your odds are fine. 
Beyond universities, you could land a career at a DC Think-Tank and formulate policy. The Federal government also hires PHDs into different departments to do consulting or research although these positions are also few. Once again, you're going to want to get into a Top 20 program to break into most of these careers but if academia turns out to be something your really interested in and really want to do, then go for it.

* Private Sector & Lobbying: Companies hire political advisors/consultants to assist the company with the legal and political side of regulations and to try to influence legislation to be favorable to the company's interest. 

* Non-Government Organizations/Non-Profits: Doctors without Borders, Red Cross, and so forth hire political science majors. 


**CONS:** Most well-paying political science careers will require some form of graduate school and experience in other areas. Just straight political science won't get you far unless you're going straight academia or non-profit. Thus, I recommend the following.


* You Need to Get to Know Your Professors: Your Political Science Department will be the key to getting your foot in the door in various places. Whether that is DC internships, graduate school or elsewhere, you will need your Department's help.


* **YOU NEED TO DOUBLE MAJOR**: Like I said earlier, straight political science won't help you outside of academia and NGOs. Pairing political science with a business or economics major can open up doors. Statistics is also a favorable double major, as many graduate schools and public policy jobs want you to have experience with different research methods. Language and Regional Studies (Asia, Europe, Middle East, etc) can be useful if you want to pursue a career in international affairs but these are riskier to pursue. If you take anything away from this post, keep this in mind: MAKE YOURSELF MARKETABLE. More skills, more talents, and more experience will make you stand out compared to other political science majors.


* You're Going to Have to Bust Your Balls: These ideal job positions for Political Science are reserved for the best and brightest. C's may get degrees but policy-makers and graduate schools are going to throw your resume in the trash. You're going to need to shoot for the best possible grades. In addition, you're going to need to stand out as best as possible. Join Honor Societies, win scholarships, hell if you can pull it off, try to get published. While I listed a lot of different job opportunities you can pursue, its not like engineering or accounting. They aren't just handing out jobs to anyone. You have to stand out.


* Everyone and Their Mother is Going to Give You Their Opinion: I try to not mention I study political science as everyone assumes I study American politics and then the torrent of political opinions sprays out. Its really annoying.


* Finally, You're Not Going to Be Insta-Rich: While there are very well paying jobs for political scientists out there, they are few. If you're dedicated to going into political science, you need to accept that the hot-shot finance major or the mechanical engineer working at Lockheed-Martin is going to make more then you. You'll need to define success by your own standards on this career path. Landing a decent political science job can allow you to live comfortably but don't expect to be earning enough money to be able to afford whatever /r/malefashionadvice is gushing about that isn't Uniqlo.


**EDIT:** Updated some points on Law School and on Political Campaigning after some comments pointed out things I missed or misinterpreted. I apologize for the inaccuracies and invite everyone to continue commenting with their experiences.

**UPDATE:** Hi guys, I appreciate that a lot of you are messaging me or commenting here asking for career advice, but I cant give you answers on every possible degree combo or whether your internship at [X] will give you a leg up for pursuing [Y]. I don't want to give you information that may be false so please I encourage you all to ask others in the thread who are in that career field or ask your professors at university. Thank you."
69986,"Golf Management. 

EDIT: I'm serious it's a real thing. Some colleges offer profession golf management programs where you can get a job in some aspect of golf. Be a teacher/coach/professional/grounds keeper/official/ECT. There are several jobs for the golf industry. I've been playing golf since I was 5. I'm a senior in high school and I'm planning on going to college for the PGM program. From there I can get internships at some really nice golf courses and basically find what I want to do in the golf business. 

*there are a lot of comments I'm getting and I'm trying my best to get to all of them. Thank you all for the feed back/info I really appreciate it!*"
69987,My friend did this at Mississippi state and is actually doing very well. It's just risky
69988,"My roommate in college got a 2 year turfgrass management degree specifically for golf courses. He got out and was immediately making $70,000 a year in Pinehurst."
69989,"If I could go back, I would have majored in Turfgrass management at my community college. I thought it was a useless degree. All those fuckers got 50-75K jobs starting."
69990,What were his connections like? Seems like it would be tough to break in unless you already knew some people.
69991,His resumÃ© was on par
69992,"Computer Engineering, not Computer science like some people bring up.

Edit: what i mean is i don't want to major in CS, i understand that i will  be learning a lot of it with Comp E"
69993,"Electrical Engineering ðŸ˜ƒ
Edit: Wow! Thanks for all these awesome responses! Also, thanks for the gold! This all is just super cool beans. ðŸ˜„"
69994,"I had to scroll to far to find this.

Pros: Excellent job market, plenty of money in the field for research, internships, etc, and your profs will be enthusiastic.

Cons: Don't expect to be able to ""do"" a whole lot until later in your studies. Most programs cover the most basic possible concepts your first 2 years. You'll start with very simple circuit analysis, very little in design, and basic building blocks for larger circuits. It wasn't until about my junior year that I got to interesting circuits and applications of the digital logic courses I'd taken.

I can answer any specific questions you might have."
69995,"Lol there you are, way at the bottom. 

I'm an Electrical Engineer that started in design and now does quality work for electronics manufacturing. 

Pros: Just like any engineering degree, you don't have many ""slow"" days, there's always a new challenge.  Pay is very good, even at entry level, it's extremely competitive.

Most importantly (for me), flexibility, you can do so much with degree. Because of the critical thinking skills required, it's often a prefered degree for law enforcement, FBI, etc.  If you live in an engineering/manufacturing dense area,  there's always new opportunities if you get bored or if your pay plateaus. Also, you learn to self educate. There's just way too much to shove in a 4-5 year degree. You have to be self driven to continue learning, because it'll require so much during school, it'll come second nature at work. 

Cons:  School work sucked a big bag of dicks, but worth it in the end. I don't have too many. I've very much enjoyed my work. Design was fun while it lasted. I've really enjoyed the Quality path. My hours are pretty average 9-10/day.  It can be frustrating dealing with people not on the same technical level as you (i'm speaking about mostly manufacturing environment now). All in all, very happy with this career path. 

Best if luck brother."
69996,"Secondary Education (6-12 grade in the US). Will be either teaching English or social studies.

EDIT: Oh wow I did not expect this many replies. I should mention that I am actually a college Freshman who just got done with my first year. Not exactly a high Schooler but since I'm not in my major yet I just wanted to get some insight on those of you who are Education Majors or have an Education degree to some sort. EDIT 2: TIL I need to talk to my advisor again."
69997,"If you're going at the secondary level, don't major in education. Major in the subject matter you want to teach, and then apply to teaching school. Or better yet, apply to a school that combines these two. For example, my undergrad has a 5-year program where you get your bachelor's degree in your chosen subject area (such as English), as well as a teaching certificate, and spend a year student-teaching in an actual classroom. Also, I'd look to other subject areas - it will be very difficult to find a teaching job in those two subjects you mentioned, they are in very low demand."
69998,"Ctrl + F for chemistry. 

0 results. Good. Don't do it. 

Please see [this reply for an in depth explanation](http://www.reddit.com/r/AskReddit/comments/37c2p3/high_schoolers_what_do_you_want_to_major_in/crlgbqj)"
69999,"For anyone interested in chemistry nonetheless: 

**Pro**: If you understand the concept, you don't have to memorise as many details as other majors. 

**Con**: Many of my courses had labs. *(I personally loved most of them especially inorganic chemistry since it was all pretty much playing with colours)*. However if you don't know what you're doing, you'll hate labs. You're basically standing for a couple hours following instructions and then you have to spend more hours in the week to write up the lab report. Plus all those chemicals in the room get to you pretty quick and you feel lightheaded soon into the lab time. 

In upper years though, you get to design your own experiments and research and that can be either fun or not depending on whether you're there just to get marks or are actually testing something fun. (A friend of mine is growing fruit fly embryo with cancer and then using one of our other professor's anti-cancer drug to treat it. Cool, no?) 

**Pro**: There are a variety of fields you can choose to specialise in in chemistry - inorganic, organic, biological, analytical, medicinal, thermodynamics, etc so you're likely to find something you both like and are good at. 

**Con**: Most of the opportunities to get experience are boring. On campus, I can help out in labs and as an undergrad that basically means I'm washing your pipettes and stuff and helping to set up materials for other people's labs. If you're smart and cool with a prof you can ask to help out in their research lab. Even then most of the time you'll be doing the stuff that the grad students don't want to do (running titrations, chromatography, preparing the instruments etc) 

**Pro**: Whenever you tell people you're studying chemistry you instantly gain their respect. You also gain superiority over biologists (even though I personally feel biology is a much harder field because of all the memorising). 

**Con**: If you can't understand concepts easily, you won't do well no matter how well you memorise everything. This really gets some people because they grow up with the mentality ""if you don't get it, memorise it"" to ace tests. Here you'll fail even if you memorise the textbook inside out. Side note: uni tip - if you're going to memorise anything, memorise the past tests. Most profs repeat questions

**Pro**: You can pretty much do anything (science related) with chemistry. With chem you can go into environmental, industrial, food, pharmaceutical, med school, nuclear chem, forensics, etc  *Physics is even more general! Biology is the one that's the most restricted imo. But that's just me building a hierarchy of the sciences.*

**Con**: Your uni schedule will be a mess. At least here at my uni this is the case because most of the chemistry courses have labs. You'll have to fit them in on top of  all your other lectures and tutorials 

Source: I'm specialising in chemistry, it's the funnest subject out there tbh. I'm going in my fourth year of a chemistry specialist and environmental science major at the university of Toronto. So this is mainly concerning uni life in that field not as much as life after uni. 
 
Edits: If you're wondering what the edits were, I just fixed the format and grammar. 

Edit: If you want a more unbiased opinion, do read what all the other folks here have to say! Here are some that replied to this comment: [1](http://www.reddit.com/r/AskReddit/comments/37c2p3/high_schoolers_what_do_you_want_to_major_in/crlihap), [2](http://www.reddit.com/r/AskReddit/comments/37c2p3/high_schoolers_what_do_you_want_to_major_in/crljypi), [3](http://www.reddit.com/r/AskReddit/comments/37c2p3/high_schoolers_what_do_you_want_to_major_in/crlit9g), [4](http://www.reddit.com/r/AskReddit/comments/37c2p3/high_schoolers_what_do_you_want_to_major_in/crljlkh), [5](http://www.reddit.com/r/AskReddit/comments/37c2p3/high_schoolers_what_do_you_want_to_major_in/crlotf0), [6](http://www.reddit.com/r/AskReddit/comments/37c2p3/high_schoolers_what_do_you_want_to_major_in/crlr0yo), [7](http://www.reddit.com/r/AskReddit/comments/37c2p3/high_schoolers_what_do_you_want_to_major_in/crluodm)\*, [8](http://www.reddit.com/r/AskReddit/comments/37c2p3/high_schoolers_what_do_you_want_to_major_in/crly2e8),\* [9](http://www.reddit.com/r/AskReddit/comments/37c2p3/high_schoolers_what_do_you_want_to_major_in/crlwox1) (forensic chem), [10](http://www.reddit.com/r/AskReddit/comments/37c2p3/high_schoolers_what_do_you_want_to_major_in/crlwoxh) (nuclear chem), [11](http://www.reddit.com/r/AskReddit/comments/37c2p3/high_schoolers_what_do_you_want_to_major_in/crm9902)

\*I really recommend reading these!"
70000,"> You're basically standing for a couple hours following instructions...

So, potions class?"
70001,"Chemistry Technician here. I do a lot of the hands on and less of the formulations and stuff. Sometimes it's cool seeing the chemistry, but depending on the schedule, you get to enjoy the science less and just do more work. Seeing what the actual chemists do, they sit in an office and crunch numbers and call people all day, very little hands on for them. If you want to do fun chemistry, QC is probably your best bet, but they often have to work late hours"
70002,Chemist. Did QC. Don't do QC.
70003,But Jesse I need to cook.
70005,Fuck you! And your eyebrows!
70006,"""It's called a cook. See, everything comes down to following a recipe. Simple, complicated, it doesn't matter. The steps never change, and I know every step."""
70007,*box cutting intensifies*
70008,"Bah, don't hate on us chemists! I love what I do haha. You definitely gotta be dedicated to it. Especially if you're in research."
70009,"I'm a chemist. I hate my job. Probably just the company though. I love science, just not what I'm doing."
70011,">  FINISH QUANTUM

[Finish Quantum?](http://graysharbordeals.com/wp-content/uploads/2012/01/finishquantum.jpg)"
70012,Business management
70013,"I graduated with my BBA back in December. I think the biggest obstacle in my job hunt now is geography. Here are a few tips from me, if I had to do it all over:

* **Go to school in an area that has plenty of jobs and businesses around.** There's nothing around here but an outlet mall and insurance offices, so all of my experience is retail, with a year as a teller at a bank. Trying to get a job closer to the city is pretty hard, because I hadn't cultivated another skill that would make me stand out or make me useful. Thankfully, I've always been good with computers, and I've done a lot of repair on the side with them. I'll be taking my A+ exam here in the next week or so, so I'll get rolling on my way into the tech industry. So, if you do go for your BBA, you need to be in an area where you can get a solid internship. The coursework wasn't very hard, in my opinion. This is an opportunity for you to take a look at the current job market and see what companies are looking for. 

* **MINOR IN SOMETHING.** I was going to double major in Marketing, but I ended up dropping it because I wanted to graduate sooner, among other things. All the work I put into getting to those marketing classes I could have put towards a minor, which I didn't have. If your school has a good music program, do music. You can minor in a specific instrument and get some great training if you'd like. Accounting or CompSci would be a great minor as well, from what I've seen.

Now, a short list of pros and cons:

Pros:

*  **You will become an extrovert.** While many other classes do this as well, Business classes especially focus on class participation and working with groups. A lot. You will find yourself in a group in just about every class. You will have to meet up outside of class to do homework. Groups are life to you now. You'll fake it until you find yourself enjoying it. Or you'll contemplate suicide. Whatever.

* **You will learn how to lead and motivate a group.** There are no set group leaders. If you want to get good grades, someone has to step up and assign people. Sometimes, the whole group will do this, and everything will go great and there will be few problems. Other times, no one will. This is where you have to step up, dish out roles, and stay on top of people until the project is done and delivered.

* **You will have professors from wildly varying backgrounds.** In my experience, professors who teach Business classes don't need to be as strictly credentialed as say, more disciplined sciences. I had a professor who was working as the Operations Managers of the school. Ex-military, lawyers, businesspeople, entrepreneurs. Thousands of different stories and hundreds of years of cumulative knowledge, all right in front of you. If you take the time to talk to them outside of class, they are an indispensable source of wisdom that you absolutely NEED to take advantage of, for your own sake. 

* **You will learn a wide range of different skills.** Business Management isn't a set skill in itself, it's an amalgam of different disciplines. Yes, you will learn management techniques and the like, but you'll also pick up a lot from leadership, accounting, business law, HR management, psychology, marketing, manufacturing, operations, advertising, and statistics. That's not even a full list, but what I'm saying is, you're going to have a huge base of information to draw from.

* **You will learn to compromise and prioritize like a pro.** There will be weeks where you have three huge projects due, and you know you can't get them all done. You'll have to know which ones will hurt you more if you skimp on them, and make sure those get ample attention. Some you will just have to ignore and not complete. This is the nature of Business school. It sucks sometimes, but compromising and prioritizing are skills that will go a long way in the real world.

Cons:

* **You will have to deal with shitty classmates and team members.** This part sucks, and it sucks a lot. You will have to deal with getting the heavy part of a project while everyone else gets light loads. You'll deal with a more extreme example where you do all the work and they do none. There have been many times where I went to the professor and said ""Look, this is my work, this is their work. I've tried to get them in on this, but they aren't having any of it."" Yeah, this makes you feel shitty, but sometimes it's what you have to do to make it out the door with a decent grade.

* **You will feel like you aren't learning anything.** I say this because, up until the last semester or two, I was wandering around campus between classes questioning if I had even learned anything worthwhile. Business Management is fragmented into many different areas, and up until you have a few cornerstone classes that help pull all of your knowledge together and focus it into a single objective, it can sometimes be hard to look back and see how far you've progressed.

* **You won't be able to rely on your degree to get you a job.** You will have to have a solid resume and some work experience. An internship would be really helpful, but I never did one. Be sure to talk more with your professors about job options, and use your colleges career services office to help line up interviews and touch up your resume a good while before you graduate. Don't be like me and just try to wing it after graduation. 


**EDIT:** As some people replying to you have said, if you don't make yourself valuable through job experience or some sort of internship/certifications, you'll pretty much end up in sales. This isn't always a bad thing, but I personally cannot stand the cold-calling and going up to people who put up a hundred barriers once they see that you're trying to sell them something. If you don't want to end up slinging someone else's crappy product, you need to plan to have skills companies are looking for, and once you get your foot in the door, have that BBA in your back pocket to make you a shoe-in for a higher role.


Something I'd HIGHLY suggest is working for a bank. This does wonders for your resume, no matter what industry you decide to go into. I've been to interviews for Helpdesk positions where they pointed it out with surprise and related some mundane job function that I did to the task I was being interviewed for. It shows that you're professional, responsible, and can be trusted handling large amounts of money. You get a glimpse into the financial world, you get to work with accounting documents, you get to help people  get the paperwork together to start their own businesses.. Seriously, working at a bank is a HUGE opportunity for a Business Management major, and you should do everything in your power to snag a job as a teller or something at a local branch.

But hey man, good luck in whatever you intend to do. I hope I've helped a little bit."
70014,"I haven't seen anyone mention any degrees with a plan to be pre-med, but I just wanted to share my two cents. Medical schools in the US are inundated with applications from biology majors and chemistry majors, from kids with 3.5+ GPAs.  It's difficult to stand out. They are often looking for people who don't purely have a science background. So don't feel you have to do bio or chem as a major. 

If you can fulfill your prerequisites while doing another major, go for it. You certainly don't have to major in a science field, and it may actually benefit you *not* to."
70015,"I just wanna bring to the attention here that blue collar jobs have thriving markets and some very good pay and compensation.
I myself am a pipe fitter/welder for the union and I enjoy what I do. Every day seems to be different and every job presents new challenges, yea you may get dirty, beat, bruised and banged up if you use your ass to think instead of your head (I do quite often, dont you judge me). My pay is well above most of my buddies who have completed college degrees and im almost willing to bet anything that my job satisfaction is higher. 
Just saying, give it some thought too. I know the go to route is college for most but for those of us who enjoy looking back and knowing we built some intricate shit that helps run even more intricate shit it's a rewarding feeling. Plus... The money. Jesus, the money. 

Edit: I just wanna say thank you to everyone for the overwhelming responses. I recieved multiple people asking the same questions so I did try to answer to some on my general pay (not all, so many asked lol), how to get into this trade, my personal experiences, etc. 

I do really appreciate the gold too! Granted I have no idea what it does lol

Also I did receive a number of negative comments and I encourage people to please take a look at them as well, they did bring up valid points and I tried my best to refute some of the examples given. This isn't a life for everyone but damnit it's a good life to a lot of people.  Thanks guys."
70016,"I always hear younger blue collar workers say how they enjoy their jobs and are fulfilled by the work and pay. Then every 50-60 year old welder or plumber is the first to grab you by both your shoulders and give you an intense, grizzled look and say ""Son, don't do this for a living. Go to school and get paid to use your brain."""
70018,"> probably lifts AC or Furnace units incorrectly

Safe lifting has been around just long enough for some of us to to see it really does work firsthand. Back when I was younger, it was just starting to hit workplaces, and I can see in my age group that it really works among those of us who actually practice it."
70019,"I logged in just to reply to this. I went to an automotive trade school/business college, and got an A.A.S. in Automotive Technology, and learned how to diagnose, rebuild and repair cars and light trucks. But I ended up getting into welding after college. 

Every older welder or mechanic I know always says, ""don't do this for a living - it's hard, unsatisfying, shitty work that will break your body over time."" 

Not very encouraging, is it?"
70020,Geography
70021,"Macroeconomics

Edit: Thanks for all the incredible feedback!
To clarify, I live in Austria, where the university system works a little bit differently. As soon as I enter university I will have to pick a specific focus, e.g. Macro/Microeconomics
Sorry for the confusion"
70022,"Well, I am finishing my master's degree in Economics. I hope you like math.

Edit : PM me if you have questions!

Edit 2 : I'll detail my post a bit more. 

""Economics"" is a very very broad field : it can mix up sociology, history, geography and of course statistics and math. 

Don't worry about your specification yet, the first years of college will be very general and are just here to confirm you actually like economics (in my uni, about 70% of the students drop in the first year).

The basics are (at least for me) really not that interesting. IS-LM (since you are talking about Macroeconomics) will likely be the first model you will learn, and it is entirely false. It doesn't matter, models often are.

If you are interested in this field, you should be at ease with math (it's getting completely crazy on the third or fourth year) and be curious. 

The jobs opportunities are endless, but specialized. Be sure not to major in a dead-end specialization (I took microeconomics and econometrics, I'll probably work in a statistics-related field).

No pressure though, I'm finishing my fourth year and I am not yet sure of what I'll do next (probably going for the Ph.D)"
70023,"If anyone that comes along wants to be a Music Major of any kind, think extremely carefully about that choice. Taking on a Music Major is one of the roughest decisions you can make, and over half of my class dropped after the first semester, leaving them with 15+ hours of useless music credits. It is hard, the content is hard, you will have many days where you will be so buried beneath work, practice, and stress that you will not be able to breathe. You will spend MANY long nights stuck at school because of rehearsals and concerts you don't want to go to and you will have to do things that you're going to think are unorthodox and stupid. I stuck it out but I have a lot of friends that couldn't. Make that choice carefully, it's a four year+ commitment that you have to be sure you want.

EDIT: Just for clarification, I'm a sophomore now at the University of West Georgia and I'm a Music Education Major with a principle in percussion.

EDIT 2: A lot of people commenting on this make great points. All of the stress and such can be daunting, without a doubt. But that doesn't mean it isn't rewarding. Lots of people go into this program thinking it will be easy and that their love of music will pull them the whole way through. That is both true and untrue. If you love what you're doing, it's going to help you, and the more fun you make your major the more rewarding it will be and the less frustrating it will be. Enjoy the concerts you perform, enjoy the friends you're around, enjoy the things you study, and you're going to be okay. But at the same time, love alone will not get you through. You have to work hard, you have to study, you will have to do things that you legitimately do not want to do. But that isn't to say it isn't worth it. If you really feel like you can and want to do this, let nothing stop you. Strive to be the best you can be and play, sing, teach, or write your heart out. But if you think this is going to be an easy ride, you'll find out pretty soon that's not the case. Naturally I wish you all the best and I hope you enjoy it like myself and many others on this thread!"
70024,"Architecture.

Edit: In case anyone sees this and has experience with both pointing devices, what's best for 3D drawing applications, a mouse or a trackball? I've committed to learning AutoCAD in the summer after school ends next week and I'be been trying to decide what to get, upgrading from a wireless trackpad. Thanks"
70025,"Somewhat successful NYC architect here

College will be very difficult if you don't like what you do. If you enjoy the work, it's just a blast. You will see people cry because they couldn't cope, and you get a really thick skin from presenting and getting torn apart on a regular basis. I loved it, and would love to go back. 

My experience working has been they value previous experience much more than a college degree. That being said, if you can't find a paid internship offer to volunteer at one of your teacher's firms or any you come across. Spend time putting together a portfolio, practice your interviews with people, and you'll do fine. 

Getting a license needs to be done under someone that already has theirs and is willing to do the extra work for you, because it puts a burden on them. If you don't graduate from a certified college you're required to work 5200 hours under a licensed architect, if you do I believe it's 3200. I'm not sure that a license is required in this field because I work on my own without one and have a firm rubberstamp my work. 

Jobs are very competitive. There are a lot of jobs but even more people fighting for them. The people offering the job will try to offer you less money than the job is worth since there's so much competition. Don't let this discourage you, as long as you keep looking and be flexible (I've worked in PA and NJ while living in NY) you'll find something you like. 

I really love my work so all the hardships have been worth it to me. I'll keep this account for a while to answer any questions if you have any. 

Quick edit

I graduated three years ago and have been working constantly since. I don't want to sell an architect's license short because I don't know the full value of one yet."
70026,"In highschool I wanted to major in Computer Science, and now that I'm in college, I'm working with pre-law.

EDIT: Looks like I need to reevaluate my classes that I signed up to be in for the Fall Semester. For the record, I am terrible at math, and that was a large variable in ditching CS.

EDIT 2: Mislabeled myself. Not majoring in a dedicated ""Pre-Law"" course branch, I'm really just double majoring in Criminal Justice and Philosophy.


Thanks for the input, everyone. I've only just begun college, going into my second year soon. I think I still need to see where I can go."
70027,"As someone that is about to start articling in one week I have a few things to say (keep in mind Canadian experience here). 

1. There is no such thing as pre-law. You are doing an undergrad, there are not specific classes needed to get into law. 

2. My first Torts class the Prof said this to the entire class. ""All of you think you are smart and you probably are smart, relative to the rest of the population, but here half of you are idiots. You are used to getting A's and A+'s, you will now get C's and C+'s. No longer are you the smartest person in a room, you are lucky if you are the 20th smartest person in this room, that's how smart everyone is around you and multiply that by 100 once you get into the actual legal field.""

3. Jobs are super hard to come by, they involve long hours and it's mostly bitch work that real lawyers don't want to do because it bores them."
70028,"Becoming a lawyer is a crap-shoot. The top of the class in the top law schools can land jobs with incredible starting pay and insane hours. Unless that is you, (remember, your competing against other people who did great in college, so its going to be much harder than excelling in undergrad) or you have family connections that will get you a job as a lawyer after graduation, going into the law is a very risky proposition. There are huge numbers of law grads that have either left the legal field, or are barely getting by on contract work that pays less than jobs you can get without law school, or are barely scratching a living out of solo practice. Oh yeah, and you will probably graduate with $100k+ in debt, many are over $200k."
70029,Thinking finance as a major--any advice?
70031,"Isn't this a little subjective? This article would be more accurate if it was titled ""The top 10 best and worst college majors for making money"""
70032,"It's just a bad synopsis. The person who wrote that article is not the one who put together the list. If you click the link to the full list, the title is actually ""10 Best College Majors for a Lucrative Career""."
70033,The editor always gives a sensational title...
70034,"The OP did that too, to be fair. I think that's what was the real problem."
70035,Yes as it is all about money.
70036,"""Don't let my degree be on this list. Don't let my degree be on this list. Don't let...dammit!"""
70037,"If it makes you feel better, I'm a triple major, and all three are on that list. 

When explaining this to people, I insist that I'm trying to build a tiny house with all of my diplomas so that I can shield my head from the elements while I'm sleeping on the street."
70038,"Chemical engineer here - been working for a little over a year. The pay is good, but in the majority of ChemE jobs, they work you like a dog for it. I have friends that went into oil and gas and work 12+ hour days for weeks on end at drilling sites and hate their lives. I went into manufacturing and work probably 60 hours a week, but it is very taxing on the mind and body. Due to the massive amount of time I spend working, my weeknights and weekends are spent catching up on sleep or trying to squeeze in a few minutes to pursue a hobby. That is not living. 


tl;dr - money isn't everything.  
  
Edit: this may sound like I hate my life/job. I don't. I really enjoy my work. I've never been much for going out and partying, etc. so I do fine without it."
70039,"Regardless of degree or job, you have to put in your dues. In 10-15 years  you will be on easy street with plenty of free time and the money to enjoy it."
70040,I'm majoring in ChemE. I love it but it makes me miserable... lack of time is a thing that i'm accustomed to.
70041,This is all based on money...what about job satisfaction and happiness?
70042,"I wanted to be a park ranger or something similar. But no, I became a lawyer and sit in a small office with no window. I am sure I make a lot more money at this job, but I think I would have been happier overall working outside in the middle of nowhere."
70043,"You can always save, save, save and then have enough to live out the next 20 years of your life as a park ranger, depending on how you spend your money and what amenities you choose to live with/without."
70044,"grass is always greener on the other side. i bet you would have been barely surviving off of the measly city salary, that is unless you're into that. (i'm thinking of NYC parks department, maybe another state pays more, but mainly the people that work for the parks department here are usually a bunch of high school dropouts)"
70045,">  but I think I would have been happier overall working outside in the middle of nowhere.

Yeah for some reason I think he might not be talking about working for the NYC parks department here."
70046,"heh, fair enough."
70047,"Not quite what I meant. I live in Virginia near the Blue Ridge mountains and there are tons of national forests. There are a lot of jobs involving trail maintenance, plant/animal conservation, etc. that are more than simple trash pickup in a NYC park.

Pay isn't high, but cost of living tends to be pretty low in those areas."
70048,I figured that's what you meant after I posted that.
70049,That's a fucking beautiful area of the country.
70050,"Plus if you're outside all day doing that kind of work, you save on not needing a gym membership :P"
70051,There are very few park ranger jobs mind you.
70052,Bear lawyer.
70053,Sitcom time!
70054,"LOL I gave up on the idea of practicing law about 6 months into law school. I realized, ""Yeah I'll make a bit more money but I have so much more fun doing my tutoring business and I get to set my own hours. I'll be damned if I'll spend all day in a little room answering rog's from insurance companies just for a small increase in salary."""
70055,"I remember looking into law. Almost every thing I read was burnout, burnout, burnout."
70056,Whats funny to me is that that make 40k a year sound bad. I would love to make that much money.
70057,It all depends on where you live.
70058,"What are you, a communist?"
70059,Engineer here. Couldn't be more satisfied with my job. Well I guess I could if they replaced my computer chair with a bean bag chair... Yeah that would make it even better.
70060,Money=Happiness.
70061,"""If a little is not enough for you, nothing is."" -Epicurus"
70062,"""Money doesn't buy you happiness, but i would much rather cry in a Ferrari , than on a bicycle.""- someone."
70063,"in an ama some multi millionaire stated it quite good imo

money can't buy you happiness, but it removes a lot of stuff that hinders you to be happy

I can imagine that to be very true!"
70064,"No money = sad, insecure"
70065,Always.
70066,"I can't wait until something happens which makes money worthless, so that I can watch people like you guys die off like flies."
70067,"I went to college, studied what I am interested in, and am now being punished for it. I accept that."
70068,"You're only being 'punished' if you have the mindset that college degrees exist solely for the purpose of getting you a job. If that's your stance, then yeah, it was probably a mistake to get a degree in fine arts.

If you just wanted to *learn things*, then nobody is punishing you."
70069,Student debt is pretty punishing.
70070,"If that's a serious issue, learn shit on your own. I graduated in Political Science, and learn still almost as much about politics now as I do in school. Classes just teach you how to learn - all the information is (relatively) freely available now."
70071,"I also did poli sci, and while the raw information is out there for free, the context provided by interacting with professors who are experts in the field, is not. 

Upvote for political science!"
70072,"you get out what you put in, truth. students who interact with professors and use (free!) school resources are getting more out of college than people who are only hoping for further delay of the ""real world,"" so to speak"
70074,"People say this because college is quickly becoming a glorified trade school. As much as you don't like it, universities were intended originally for people to learn for the sake of learning; while it sounds snotty, it doesn't mean that it's not reconcilable with doing something practical either.  

That being said, I'm all for separating academia from trades. I hate the fact how work experience has been replaced by online MBAs or masters in things like ""administration."" as if tacking on masters makes it as legit academically as someone who decided to study something less lucrative like anthropology.  Not crapping on admins, as I have been one for awhile, but I'd be ashamed to admit to anyone I had to pay for and waste time over what should amount to job experience."
70075,"The only issue is debt. I studied English, graduated with $0 in debt and $5000 in savings (my tuition was $120/year).

The only thing wrong with Liberal Arts is debt. If they can make college cheaper, we'd have a surge in the humanities again."
70076,How is that possible? Scholarship Grants?
70077,"Yeah but if you say that to a Baby Boomer, ""Hey I just want to pay the same tuition in inflation-adjusted dollars that you paid in 1971"" you get called an entitled government-dependent brat who's part of the 47% that can't take any personal responsibility."
70078,Who's punishing you?
70079,THE SYSTEM
70080,"I'M NOT APART OF YA SYSTEM  
  
EDIT: I'M AN ADUULLLLTTTTTT"
70081,I TOOK IT . . .
70082,[I THREW IT ON THE GROUND](http://www.youtube.com/watch?v=gAYL5H46QnQ)
70084,What did you major in?
70086,">skills, work experiences, internships, connections,

This right here is key. I got a degree in Sociology but because of my work experience and skills was still able to find a pretty damn good job. I can't say the degree was a complete mistake, it is an interesting subject to me and did help get my job. But without experience and a well developed skill set I'd be shit-outta-luck,"
70087,"This is the boat I'm in right now. Finishing up my Liberal Arts/Fine Arts majors, but I already work in music promotion and am getting experience doing things that I would like to do professionally."
70088,"So if I double major in chemical engineering and graphic design, how will that affect my job prospects?"
70089,[Well...](http://media.tumblr.com/tumblr_m71mr1z8c01r8b9rj.gif)
70090,That is probably the most relevant gif I have seen this whole week.
70091,"Right, if you want to go to college for something that leads directly to employment, which I am by no means looking down on, then this is the list to look at. However, as someone who love learning and doesn't mind doing all kinds of strange jobs (From managing a coffee shop to cutting trails in southern ID) then perhaps this isn't the list for you."
70092,"Not to take anything away from you for choosing that path, but I know a few people who said the same thing, and are regretting it now. Try to find a balance between doing what you enjoy and being at least a little bit hireable, and future-you will be thankful."
70093,"Hireability has less to do with the major and more to do with the person. I'm a creative writing major with a minor in cinematic arts and I'm currently heading my own department at a marketing firm. I've taken my love of learning and critical thinking and made it into something that works for me. 

Hell, college majors don't matter with the exception of incredibly specialized skill sets. Having a degree just shows employers that you can accomplish something you set out to."
70094,"Thank you! A lot of people have a hard time realizing this. After you get some experience under your belt, employers will look at that rather than your degree. 

I know a few people that have non-computer related degrees, but work in large data centers or are network admins, because they have tons of experience and know-how. The Computer field is definitely one of the biggest fields in which experience will trump a degree nine times out of ten."
70096,You can still go to college at 37.
70097,"Hell, I went back at 40 so I could teach public high school (and some of my classmates were in their sixties). It is never too late for anything until you're dead.

EDIT: Thanks, ddecay!"
70098,i upvoted this even though you spelled too incorrectly just because i agree with the sentiment so wholeheartedly.
70099,"exactly, think about where you could be at 47"
70100,"I am genuinely interested in Math.

Do I win?"
70101,"Yes. Doing something incredibly valuable, and being genuinely interested in it means you won."
70102,"Regarding graphic design... this was my major and my conclusion is that you really need to be **really** talented to expect to go far with a graphic design degree, and when I served as TA for any class, I realized that maybe 20% tops of any given class of designers were ever any good. Those who do succeed though can find a lot of demand for their talents. And of course as always, likelihood of finding a job is highly dependent on where you're located/looking for work.

Edit: To add to this, if you factor job satisfaction into the mix... arguably I'd say graphic designers (and other creatives who get to actually do creative things for a career) are some of the most passionate about their job and their work. My colleagues and I would likely agree that we all absolutely love what we do for a living and it's our hobby. So even if we were able to earn a substantial salary increase for working a more administrative or managerial job, we'd probably still rather stick to being designers."
70103,"I have worked as a graphic designer, electrical engineer, programmer, lawyer, etc. The graphic designers were probably the most fun people."
70104,"I agree, it is completely based on talent and location. I've been out of school for about a year and a half, and I have had no problem finding freelance jobs and found a full time job within a month of looking for one. 

I was in a pretty solid design program, and half of my graduating class (the talented ones I would say) got jobs almost immediately. The other half were the slackers/not very good had a lot more trouble find jobs. It truly is an industry based on talent and many people don't seem to appreciate that."
70105,"Yes! The other thing is that I feel that design is one of those fields where working harder won't really equate to doing better.

A lot of students I've encountered just didn't have a good eye for design, and that translated to their work. No matter how many pointers you give them, they just wouldn't ""get it"". It's like trying to design while being severely colorblind (not trying to say all colorblind people can't design, just making a rough point). They can learn all the technical points, you can't really teach someone how to have creative talent.

On the other hand, the talented students will often barely need to iterate on a design at all--they'll hit it on the dot their first or second draft.

There are also those students who are design savants but don't ever show up to class, turn in work, or finish projects. Those are the most frustrating, because they clearly are extremely talented but will fail classes because they have poor work ethic."
70106,"Going to get long winded (even professorial?) here. Hope it doesn't get buried. 

We used to see non-elites having access to a liberal arts education as a natural extension of the democratizing power of public education. EVERYONE could, ideally, become cultured, self-aware, and generally Enlightened enough to be the equal of a non-democratic aristocracy and thereby participate in the democratic public. Moreover, your life would be richer for it, regardless of occupation. You might be an assembly line worker, but you'd know enough about labor economics or the cultural signifier of your product or enough about Shakespeare to go home and read him for fun when you got home to have a deeply enriching life both on and off the job. All this goes back to Kant, who attempted to define Enlightenment, on both the individual and cultural level, as the cultivation of a Public Self that could write and communicate about  difficult and scholarly topics for the betterment of himself, his government, and, ultimate, society at large.  

This list isn't just hard science vs. everything else. Note that the classical psychical sciences, Chemistry, Biology, and Physics, weren't on that list either. Computer Science and Math don't make the cut either. That's because these are all academic subjects, concerned primarily with producing knowledge about the world as both an end in itself and a larger project of Enlightenment. 

Instead, every single major on the list, including Engineering ones, are job-training programs. Why? What happened? Well at some point private employers decided that they would take advantage of mass higher education. Why waste time training Enlightened citizens when colleges could be training Employees? This trend of thinking began with local industries, say a steel mill, demanding that the local community college churn out steel mill technicians, but has obviously expanded to more and more colleges and universities offering majors like the ones on this list. What this amounts to is, in effect, a massive coup of the original Enlightening and democratizing aim of mass higher education. By pushing the cost of job training on to universities, who push it onto students in the form of tuition, companies are gaming the system to their benefit.

But what is truly distressing is that this logic heralds a return of the Liberal Arts education, and the Enlightenment consciousness it offers, as being the sole purview of the elite. After all, the poorest among us will be most logical to hedge their bets and get the degree in ""business administration"" over English (or even Economics!)

 And with the rise of online courses (which offer ultimate breadth of access with low-cost efficiency), I believe that we will see a bifurcation between physical universities where the elite can mingle and indulge (in both knowledge and consequence free fun), while the rest take on debt burdens to get online and participate in the route memorization of job related tasks. The elites will be poorer in perspective for having spent 4 years in a bubble, with top schools re-acquiring their status as ""boys club"" networking centers, regardless of major, and the poor will be poorer for having to compete viciously for jobs in order to pay off that debt. 

**TL;DR: The turn in higher education from Enlightening to job training screws over both the rich and poor in the long term.**"
70107,"Very nice little essay. I think there is another flaw in this article. It doesn't take into account long-term job-advancement prospects. I notice that a lot of these majors have jobs with high starting salaries but do not have good long-term prospects (e.g. Pharmacist).

I am also surprised that Finance, Accounting, and Computer Science didn't make the list (although both Accounting and Finance usually require at least one more year of follow-up to get a Masters to get a CPA or CFA). Overall, I just think this is a very poorly conceived/researched/written article.

Your article was much better."
70108,I would definitely pick Accounting over MIS. There's more demand for it and it's more versatile. EE I'm not sure is a great pick either - that field is really getting saturated as of late.
70109,Ok ok we get it Reddit. Either you're a left-brained computery-type or you can work at Starbucks the rest of your life.
70110,"[deleted]  
 ^^^^^^^^^^^^^^^^0.1687 
 > [What is this?](https://pastebin.com/64GuVi2F/42841)"
70111,"The problem is, though, that some people who study these subjects never even think about what they will do with them later on. While it's all good and well to ""learn for life"", you should never start a course that will probably make your job hunt difficult without knowing yourself what you'll use it for.

Those courses are important as they enrich our culture, and I sure as hell would not want only engineers and chemists running around. But do some thinking before deciding to take one of those courses.."
70112,"Reddit is a fickle place. In one post, you'll read posts congratulating people who quit there jobs and travel, go to museums, watch films, and contemplate their current state in life. But then the next post will talk about how doing and studying such things is a waste. Nonetheless, I enjoy this website, I just think you gotta' do what you gotta' do. If you get off to electrical engineering or Shakespeare, go for it."
70113,"Yes I agree. This story shall the good man teach his son;
And Crispin Crispian shall ne'er go by,
From this day to the ending of the world,
But we in it shall be remember'd;
We few, we happy few, we band of brothers;
For he to-day that sheds his blood with me
Shall be my brother; be he ne'er so vile,
This day shall gentle his condition:
And gentlemen in England now a-bed
Shall think themselves accursed they were not here,
And hold their manhoods cheap whiles any speaks
That fought with us upon Saint Crispin's day."
70114,"I studied Theoretical Physics. My career prospects aren't that great either. 

I'm pretty handy with a crowbar though."
70115,math major here. i regret.
70116,"Reddit is terribly stupid when it comes to majors. There's an inbetween man. I'm an English major and I run my own little content marketing firm that pays the livelihood of 5 other guys. 

The thing Liberal Arts majors suck at, though, is marketing their skills. They have shit idea how to sell their degrees to employers, which is why they end up unemployed."
70117,Anyway you could expound on your point? Maybe some tips?
70118,"The key is relationships. The frat guys in your university had the right idea all along: it doesn't matter what you know, but who you know.

Here's what you do: you pick an industry you want to work in, and you network the motherfucker out of that. I picked emerging technology and know a shit ton of startup founders. I basically landed myself where they hung out, started a blog about said founders, followed them obsessively and reached out to them via email, Skype, etc. Within 3 months, I had parlayed these introductions into relationships. Within one more month, they came to me when they needed help about something which I could do (which was writing). If they needed stuff for their blog, they came to me because they already knew me. If they needed ebooks and whitepapers, they came to me. I was their go-to source for writing the copy on their sites, and for marketing their stuff on the internet.

Be prepared to be without work for six months. In that period, do whatever you can to support yourself. In the meantime, you network like a motherfucker.

That's the secret to success: networking. Knowing people, and putting yourself out there. Liberal Arts guys have to work harder,  but trust me, if you learn this one skill, you will never be without work."
70120,">an indication of where the market is going and what jobs are in demand

The trend this article misses is that post-graduate degrees are where the real money's at (if that's your thing)."
70122,"You're right, I just think undergrads ought to be considering the bigger picture."
70123,"DING DING DING

I'm taking a liberal arts degree (History), but I don't plan on working retail. Try going to law school with a fucking Construction Services degree. That's what I thought. Also, I'll be making more than most of the things on that list, except for maybe the engineering ones."
70124,"Sorry, but I think it's yet another thinly veiled self-congratulatory gesture for STEM undergrads."
70125,"I'm not sure I'd read that the same way. As someone who has been in the labor market for a couple of decades, I'd agree that STEM graduates tend to have a higher starting salary and employment rate than ""soft skills"" graduates. However, it's also been my experience than ""soft skills"" graduates (albeit ones that have entered a professional career) have a better success rate than STEM graduates. 

Before everyone gets their panties in a wad, this is only my perspective given my experience as a hiring manager in the consulting field. Probably different inn different industries."
70126,"Facts are facts, don't fear them. STEM brings in better paychecks on average for 4-yr grads in this economy. The economy pays electrical engineers more than fine arts majors. It's not like it's twice as much or anything extreme, but it's a very noticeable difference. There's nothing wrong with that."
70127,Pardon my ignorance but what's STEM?
70128,Science tech engineering math
70129,"So, hmm, I'm not at all interested in any kind of medical shit and I suck real hard at math and other exact sciences. Where does that leave me, the gutter? 

That was my thought process before deciding to study International Relations (love politics, foreign affairs and stuff). I finished school this year and absolutely love my major. Maybe I won't get instantly employed and making 50k like if I had majored in engineering, but I'll tell you what, I love what I do and I'll work my ass off to compensate that handicap.

Actually working to get accepted on a masters program right now. Wish me luck. :)"
70130,"Sucking at math isn't a permanent condition. Like anything else, you can get better. 

Good luck with your master's, though!"
70131,"Oh, absolutely. What I meant by that is that I would never be able to put up with years of calculus and that kind of stuff just to get a degree in engineering for example. I would probably be very miserable and drop out."
70132,"Chemical Engineering undergrad here. I *love it* but it makes me miserable. The only promise in the field is that ""laboral world is easier than academic one."""
70133,"I am an IR major and I am making 50k. Don't go for the masters, you don't need to be an unemployed master.  Practical experience  is way better than 7-8 years of school"
70134,"I majored in IR as well! Really interesting subject and enjoyable course.

Don't believe all the stuff about IR majors being unemployable. I do corporate strategy for a multinational; it's a great fit for the skills learnt in an IR degree. It's also interesting and well paid."
70135,"Well shit, guess I better just kill myself then."
70136,What are you worried about?  Youre a doctor.
70137,"I love that the lowest median salary on the ten worst list is 37,000. I know many of us (including myself) are college educated Americans with expectations that are too high, but seriously that is fucking awesome."
70139,"Yes! Because who cares what you want to learn... Just choose what has the highest chance of success! Because you need those numbers on your side, you know? Those... Those... Comfortable percentages. Yeah! You want to learn more about graphic design? Just give it up. Yeah, I know you haven't even *tried* to succeed yet. I know you haven't actually spent a few years trying to hone and master your craft with your university's experienced professors, but just throw those dreams away. Flush them all down the toilet and become a chemical engineer. You'll make more money! Probably. I mean, statistically, you've got better chances. Go for it."
70140,"Bull. If you work hard, you can do good as a graphic designer."
70141,"At first I was going to correct you and say ""do *well*.""

But, as someone who truly believes that well-executed design can change the world, I will instead agree heartily with you.

(And yeah, honestly, it just takes hard work and passion to be a great designer)"
70143,And where *are* you?
70144,"I'm not saying you're lying, but that would be an extremely outlying salary, because that's a lot more than the average nurse makes. Do they work a lot of overtime, perhaps?"
70145,"I guess if you work in retail, your a bitch or something? Or a part of the sub-human population of employee?  
I don't get why working in retail is like, the indicator your not successful or something.  
Right now, having *any* job is an accomplishment."
70146,Because generally the goal of going to college is to avoid working those low-paying retail jobs.
70147,"Having any job is respectable, but virtually anyone can work retail with minimal training. I think that might be why it isn't considered to be anything special."
70148,I don't think people realize the physical and mental strength required to work retail & not kill everyone.
70150,"I stopped reading at construction services, as someone whose family is in the construction field and knows the absolute shit it is in now I can't take any article serious that recommends entering the field for money"
70152,Stuck up articles always forget the pimpin hoes degree.
70153,I'm a gay atheist philosophical anthropologist that minored in fine arts and you're all just jealous.
70154,In which case draw me a picture of Romney being butt-fucked by Immanuel Kant over an altar.
70155,With Morgan Freeman narrating the event in drastic detail.
70156,"The article doesn't include a few important points. 

First, it's more than just money. Doctors make a lot of money, but they also go to school for the better part of a decade, come out of school up to their eyeballs in debt, and spend years before they even think about working a 40 hour 9 to 5 job. They make a lot, but they spend a lot of time away from their family working a high stress, high demand job. This is just an example, I'm sure we could name ten other fields where the same type of thing occurs. A smart man once said to me, ""college is an investment in yourself. You're investing so you can work with your brain not your back, and have better hours and work conditions (hopefully). Doctors work hard but the payoff is a good career that gets better with time. They're hard workers, they just want to work hard in an office instead of a ditch. 

The list makes sense in the respect that it illustrates the careers you're most likely to find good paying and stable work in. They're not playing favorites, it's just an observation. 

Secondly, college is an investment. The money you put in should be invested with the hope that you'll pay off the initial investment and make some in the long run. your also investing in a better job, not just for pay but work conditions, retirement, benefits, hours, etc. If you have a few hundred thousand to throw at a degree that will land you a job doing something you could do without it, hey, it's your money. 

I worked on the railroad for a decade without anything more than a high school education. I made a good amount of money, but the trade off was working a hard job with shit-ass hours and no room to move up. At 28 I was at the ""top of my field"" and it didn't look good. 

Finally, there's life outside of college. I like the railroad and it's wasn't a bad job. I left because I wanted something that paid the bills but still allowed me to spend time with my family. I need money to live, but family is more important and college allowed me the chance to find a good career that didn't take me away so much. I went to college to invest in myself. I don't regret it, but the flood of college goers has me saying ""fuck it"". I'm teaching my daughters to weld and drive construction equipment."
70157,"Learning is great and I was super pissed off to see so many people there ""just getting by"". Assholes who stared hate bullets for asking a question and always wanted to leave early. I'm the old guy that was paying for every minute of some smart person's time. 

Now I do something I like, pay the bills and am mostly debt free. 

I'm not passing judgement on anyone, but if you go and spend a lot of money just to ""learn things"", then end up in a field where you can't pay the bills, it's like you invested a shitload of money in a hobby. 

Isn't there free ""extended learning"" type classes or something?

Like someone else said, I think it's finding the balance with something you like that still pays the bills."
70158,"Sorry, but this article is garbage and the comments defending it are garbage. So someone wants to study film...great! Less competition for engineers! We forget how many people are involved in making one product. In the example of, say, a camera, sure, you need someone to engineer it, but you also need factory workers to assemble it and make the parts, ad agencies to market it, film...people to shoot ads, graphic designers to design ads, and retail workers to sell it, with managers back at the company deciding what to do with profits and the costs of manufacturing. Everyone plays an equally important part. 

Basically, if the world is full of engineers and doctors, nothing is going to happen."
70159,the best major is one where you can best apply yourself
70160,"Theater/drama degree here.. Started teaching the subject.. I'm doing what I like,  money isn't the best but then again do we ever really make enough money?"
70163,"Nit trying to be a dick or anything but while I can appreciate the desire for a fulfilling career, being poor and having to eke out an existence will put a damper on anything, including your passion for whatever you do. It's not a one extreme or the other, poor/happy or rich/miserable.  On top of that, you should also consider what place family and friends rank in relation to your career as they do require funds at least time to time. These are simply the most financially  lucrative majors and the title is misleading."
70164,"So if your top three choices for a college major are all under the worst section, does it make more sense to just not go to college?"
70165,"no, you do whatever the fuck you want."
70166,"My major didn't fall under either list, but I suppose going into it I wasn't positive it would be lucrative.  I told myself that even if my degree doesn't pay off, I'd be content with the knowledge I gained of something that I'm very interested in."
70167,"To a certain extent, yes. A lot of those fields are things where employers don't care about your degree, they want to see your portfolio. You may want to think about looking for internships instead. 

That being said, taking some classes and honing your skills and doing some networking isn't a bad idea. Look into community colleges - you can do all those things, get a 2 year degree, build up a portfolio, and not be left with crushing student debt."
70168,"She forgot about computer science.  That's, literally, where all the jobs are right now."
70170,Just a fad.
70171,It should be #2 or #1 on that list if anything.
70172,"literally? 
à² _à² "
70173,"Looks like they don't teach proper vocabulary usage in CS, uh?"
70174,"Nope, just syntax."
70175,Even in the US? Lots of IT/programming work is being outsourced since it's much cheaper overseas.
70176,"Whoa now.  Don't go waving the ""outsourced because it's cheaper"" banner around.  A lot of IT isn't about programming.  It is about infrastructure.  Smart companies don't outsource infrastructure."
70177,True. Computer Science isn't only programming.
70178,"As a software engineering student, electrical engineering being there but software not is a joke based on everything I've read."
70179,"Seriously, you can make six figures in your first post-college job in CS right now."
70180,"This is a horrible list organized purely by salary, and not by anything else, like job secuirty."
70181,Did they factor in whether or not those students had major related internships in college? that's a HUGE factor in todays post-grad world
70182,"**Looks at all of the portfolios, pieces, years of art, and hard work around her**

**Realizes its fucking useless**

**Kills self**"
70183,"ctrl+f 'recession'

0 hits

Oh reddit"
70184,"Sociology was great to study, but I felt forced into Social Work. It also doesn't help that 80% of SW jobs require Spanish, and no matter how much I try, I'm just terrible at learning another language.

I wished somewhere along the time I was in school a professor pointed me in the direction of Public Health, which was my primary focus under the umbrella of Sociology."
70185,"As a fine arts graduate, if I made over 30k a year right now, I would freak out and Scrooge McDuck it into a pile of paycheck deposit slips."
70186,"I would be interested in seeing this stratified with colleges. That is, does an English major from a top-tier school (Ivies, flagship publics like UNC, UM, UW etc.) face the same terrible prospects as one from a lesser-known and less competitive school? Recruitment and internships for all majors occurs pretty regularly for all majors at my university, and all of my graduating friends over the past few years have found jobs."
70187,"Great, both of my majors of Anthropology AND Sociology are on there. I graduate in may with 2 degrees in retail apparently."
70188,"Correlation does not necessarily equal causation. It's not always the major which causes the unemployment, low salary, etc. The type of person who chooses one of the ""bad"" majors may just be the type of person who is not necessarily career-driven in general, leading to those outcomes. The major is not entirely to blame."
70189,Why is Graphic Design such a poor choice?  It seems like you can never find one when you need one.
70190,"this is the top ten list after mechanical, materials, computer, petroleum, and ~~chemical~~ engineering, right?

edit: disregard chemical engineering, as i overlooked it being on the list."
70191,"As a Graphic Design major with a very comfortable salary and recruiters knocking on my door, these list are funny."
70192,"I felt like it was weird that they had both fine art and studio art on the list, rather than just fine art as that includes studio art. I'm assuming fine art is exactly the same as studio art, but it also includes music, performance art, dance, and maybe something else? But then why do they have theater and drama under its own category if those things are included in fine arts?

And out of curiosity, do you have one full time job as a graphic designer and then also do freelance stuff on the side, or all freelancing?"
70193,"Recruiters? I'm a recent GD grad, who exactly is knocking on your door?"
70194,"I've got about 5 years of full time experience, and am currently doing mobile UI design at an agency in Seattle. Mobile is 'hot' right now, so having a few years experience and some apps in the app store helps.

Graphic design is a hard career to get into, but once you've got your foot in the door, it isn't as scary as these lists would imply."
70195,All of the worse ones are creative studies. The hard thing with those degrees is that talent is also required to get a job. There for naturally is much harder to get into and make money at.
70196,I'm not really sure why everyone is reading this list like a child. Obviously this list is about money and not happiness. How the hell could you write a list of the ten best and worst careers for happiness. Everyone has different things to make them happy. Nobody is telling you how to live your life.
70197,"so the courses that teach you just how to perform a job are the ""good"" ones and the courses that teach you how to think are the ""bad"" ones....Mmmmm,....ok, got it."
70198,"Both of these lists are bullshit: with the exception of the top 2 or 3 on that ''best'' list, none of those are things you major in, they are things you go to a trade school for. On the flip side, I disagree with Liberal Arts, Drama & Graphic design being the ''worst''. If you bust your ass and you know what you want you can get more than those salaries as well. The person who wrote this article doesn't know much."
70200,"Its articles like this that can really screw vulnerable high school kids up.  Lets say little Timmy is a flamboyant theater junkie, and has big dreams of being a Broadway star.  Little Timmy is going to read articles like these and decide to become a chemical engineer, even though he really dislikes science.  Fast forward 15 years, and Little Timmy is standing over the dead bodies of his wife and 2 children while turning the gun over on himself.  Kids, let this be a lesson to you.  
**Do not be like little Timmy.**"
70201,He never had a chance anyway. It's the more shy theatre junkies that do better.
70202,"I would like to see one of these for every country, surely they can't be the same."
70203,"My plan is to major in Motion Design, which is a combination of Graphic Design and Animation, at a very successful school. They have an employment department that assists graduates in finding great jobs, and I believe the employment rate for grads is around 90%, so I'm not worried. You should chose a profession that interests you, not what's only going to pay the bills. What will save you in money will cost you in happiness."
70204,"I somehow doubt that people are pursuing degrees in English and Fine Arts for the payoff, so I don't really see the use of this list - especially not as a rating of ""best"" and ""worst"", since I would hope few people think of the best major for them as being the one with the highest potential payoff, regardless of their actual interest."
70205,Face it. [Every Major's Terrible.](http://xkcd.com/1052/)
70206,"Neuroscience major. I want to get a PhD after school so I can go into research, as opposed to an MD like many of my classmates. I'm going to be paying roughly the same student debt as the guy becoming a doctor. The thing is, while he makes a nice, 6-figure salary, I'm probably going to be making ~40-50 K for a very long time. Sometimes I get really iffy about the academic life."
70207,This is really stupid. You could just as easily post a graph that compares someone's motivation and intelligence to their salary. The only reason those majors are at the bottom is because dumb and lazy people join in because they think they can make a quick buck without any work.
70208,"I DON'T CARE WHAT YOU SAY REDDIT! I AM MAJORING IN PHILOSOPHY AND I AM GOING TO FUCK SHIT UP AND BE A PROFESSOR. 

MONEY SHMONEY, REDDIT."
70209,AMEN! I'M STUDYING FILM IF I WANT TO GOD DAMMIT!
70210,No way! Arts majors don't make as much and have higher unemployment than engineers and people in health services? Who would've thunk it!
70211,"As a single male with no payments beyond gas, insurance, cell, internet, etc. I would be ecstatic with making $40,000 with my BA in psychology. Alas..."
70212,"A guy I know is currently getting his degree in ""African American Studies"". I don't have any idea what he could possibly do with that besides maybe teach a class on African American studies. 

Also he is the whitest person I know."
70213,Am I the only one who got distracted by [the girl in the picture?](http://hereandnow.wbur.org/files/2012/10/1005_english-major.jpg)
70214,"Okay, I am tired of this best and worst career thing. A career is defined as: An occupation undertaken for a significant period of a person's life and with opportunities for progress. The top on that list was Medical Assisting Services and Management Information Systems. Who REAAALLLLLY wants to do that for the rest of their life? In a country where the second question people ask when meeting you is, ""What do you do?"" why would you want to say medical assisting? I hate all of this bull shit of pushing people away from the liberal arts. Yeah, it's fucking hard, if not harder because most of those careers you need to work independently in order to have a successful career. It's hard to start your own business and it's easier to just work for someone else. Did it use to be? Hell no. But now that the world revolves around FINDING a job instead of MAKING a job, yeah those degrees aren't going to benefit you as much as having an engineering degree. I am not made to become a medical assistant, I could do it if I wanted, however I refuse to let that define me and bring in my income. I would rather work to have my own, selling cat toys off the street and make poverty line salary. Someone has to be the medical assistant, but someone also has to make cat toys, so fuck it."
70216,"As a Philosophy major I can say we don't earn much, but we could probably write a better article than this."
70217,Everything on the list of worst options are the only things that sound interesting to me :(
70218,"I went to college, studied Philosophy and Religion. Started working at a great company. Haven't looked back since."
70219,"Same. I work as a data analyst for a very large company and I do some programming and database design. While I got zilch of these actual skills from my time at college and grad school, I directly credit studying logic and argumentation in philosophy and theology courses that caused me to be good at what I do.  I can analyze the shit out of stuff and come up with solutions.  Studying ancient languages such as Greek and Latin only helped me quickly pick up the semantics of programming.  If you are intelligent, transformable and can demonstrate this to a prospective company, they'll consider you."
70220,"I think that getting an English degree was perfect for me. I told myself in high school that I wanted to get an English degree, become a teacher, and write. I've done the first, start the second next month, and have been writing for some time. Even if I never publish anything worthwhile, I have enough left over at the end of the month to maintain my bicycle and buy the odd bit of camera gear. I live pretty frugally, besides. Plus I get summers and all holidays off... Plenty of time with family... That's something that money will never be able to buy me when they're all dead or when I'm dead. 

I know people that have gotten ""good"" degrees (according to this article anyway) and who are absolutely miserable and have to be locked into that cycle of misery to maintain their lifestyle. They get excited with the paychecks and get 2500/mth apartments and new cars and live for their two weeks vacation. Their argument is that they'll have a good retirement. My argument is that I can go to school again, get a Master's then a Professional cert, keep doing what I'm doing, and my retirement will be just as good as theirs. 

It's a shame that people of my generation (twenties) still get suckered into the notion that it's better to work hard and be happier in old age, when your body is failing on you; if the stress of working or some cancer hasn't killed you yet."
70221,Aviation all those guys are making tons of money as pilots out of school (well at least pre pandemic  they were)
70222,As an aviation major itâ€™s looking kinda bleak right now ngl
70223,"I think it's looking bleak now but it's already starting to rebound. They'll need many new pilots after so many retirements this past year. I think Alaska and JetBlue (could be very wrong) are already hiring.

In the distant future though? There is the potential for full automation but it's so far out I think we need not be too worried yet.

(I'm a mechanical engineer major looking to get my PPL eventually, and do aerospace engineering with a commercial plane manufacturer/airline)"
70224,"I always wanted to be a pilot when I was younger. However after doing some research I heard it's pretty hard to get a job as an airline pilot. There are 3 ways to get a private pilots license and thats the civilian route, airforce, or an aviation school. The cheapest option is the airforce but I never wanted to join a branch of military. Civ route and aviation school are expensive af. Thus my dream of being an pilot for a major airline has been squashed."
70225,"Honestly after you get into the actual air force (after training), the air force is more like a corporation than the military."
70226,They literally kill people
70227,"Yeah, like a corporation."
70228,Ya because Amazon sure doesnâ€™t
70229,"Amazon probably doesn't kill people. Obviously some corporations do, but amazon just ships items made by other people, where would murder come up?"
70230,Why do you expect me to disagree with this? Of course Amazon kills people.
70231,"And other corporations donâ€™t? Theyâ€™re just more direct and honest about it

edit to clarify a few things: by â€œdirectâ€ I mean when the military kills you, the thing they did is probably what shows up on your death certificate. 

Also Iâ€™m not saying that the military *isnâ€™t* bad, or imperialist or immoral or any of those things. However Iâ€™m saying corporations *are* a lot of those things, and the military is a part of that same system"
70232,"Ahh yes, the time Target carpet bombed 17,000 iraqis."
70233,"Bombing an Iraqi wedding for oil money is:

a. A war crime

b. A gross miscarriage of justice on every level

**c. Direct and honest**

d. The mark of an imperialist superpower in decline


epic redditor moment"
70234,"Whether youâ€™re a civilian who was killed by a drone strike because the US wants the oil under you or you die from your water supply being poisoned from fracking, youâ€™re just as dead. The point was not that the US military is more ethical, or that the things they do are not wrong or imperialist, but that itâ€™s just another part of the capitalist system, and the biggest difference is that the way the military kills you is more a direct cause of death than a side effect of their main goal (which I mean it still is, since they exist to protect the interests of American capital above all else)"
70235,"Same. All the pilot programs near me were at least $50k, usually closer to $80-90k so thats a no go"
70236,Flying would be very cool
70237,I thought pilots didn't make that much nowadays unless they've been flying for a long time
70238,Pilots do not make a ton of money right out of school
70239,I wish I didnâ€™t listen to people who said you canâ€™t make money being an artist and went to art school instead
70240,"I'm so glad I read this. I want to be a writer, don't know what kind yet but I just know I want to write. People keep telling me I should major in something useful like Computer Science or something in stem but it's just not for me. Writing is my passion and that's what I want to do with my life."
70241,"Pursue your dream. But look up interviews on the writing process, most importantly how people get published"
70242,"Been there. Art school isnâ€™t cheap. If youâ€™re okay with being tens of thousands of dollars in debt for a degree that even if you complete wonâ€™t get you any closer to a job except office work, have at it but you can learn how to write without getting into debt for it. Find the writer communities where you live and go to workshops and read your ass off, learn to meditate and visualize imagery as hard as you can, and youâ€™ll be in the same boat as everyone who graduates minus the student loans."
70243,"Such a bleak outlook. Anytime a degree is broken down and categorized like this it gets depressing, just get your degree and follow your path."
70244,"The real world is depressing. Look, Iâ€™m from the generation of students that asked point blank if a creative writing degree is fine and if we could still get a job. We were assured that yes, *critical thinking and communication skills are valuable everywhere* and nobody can write so everyone will want someone who can! Cut to: the vast majority of my generation is not working in their field, because of this bullshit. Itâ€™s an unhelpful lie that if you just â€œfollow your pathâ€ everything will work out. If you come from money and have parents who can float you along long enough so you can spend a bunch of years after college writing and not having to support yourself, then yes, things generally work out just fine. If you donâ€™t, youâ€™re saddling yourself with tens of thousands of dollars of debt for a degree that wonâ€™t open any doors except maybe an administrative job (which takes any Bachelorâ€™s usually) and that doesnâ€™t even necessarily make you a better writer. Itâ€™s not cool that society saddles kids with this magical Horatio Alger shit that everything will work out even if your plan is bad and then refuses to help them when they end up in debt making $12/hour. And we should try to build a better safety net. In the mean time? It doesnâ€™t help not to tell these kids the truth."
70245,I know someone who did Computer science and the best job they've gotten is customer service on the phone for a ferry company. He was always told its a good major and he will find a job easily... that was not the case at all :(
70246,"A degree alone in Computer Science just isnâ€™t the ticket it once was. Nowadays, you need projects, a good GitHub, tons of extracurriculars, etc etc. The degree is almost meaningless nowadays, and tech companies are even moving away from them."
70247,"I'm gonna have to disagree with this. 

I'm a CS Senior with no GitHub, no good projects, and no extracurriculars. More importantly, absolutely no leetcode.

I am currently working an internship that pays me *really* well with an additional two internships after this one, with one being pretty prestigious. I was even extended an offer from my current internship, today actually, that would make me more money than I ever dreamed of making. I declined because I know a CS degree is so valuable that I can get more, regardless of how great that offer felt. 

Here's the ""secret"" to how I did it: Communication and mass applying. You don't need all those things that you listed."
70248,"It's still a good degree compared to other stem or most majors. Any way you cut it, you'll have more job opportunities in CS. Yes it takes work, but still better than others."
70249,"I disagree. Mechanical Engineering is the real skeleton key, not Computer Science. Computer Science is a fantastic compliment, but I donâ€™t think itâ€™s that great as the main focus. Iâ€™m not saying itâ€™s a bad degree. Though, I think it eventually might be if things keep progressing like they are."
70250,"I'd agree with this, I have friends that went to good schools for Engineering and they all had jobs right out of college lined up whereas the people I know with CS jobs didn't go to/finish college and just worked on their portfolios to the point where their work speaks for itself."
70251,"I guess I'm specifically talking about those who did CS in college. I can't speak from other peoples experience but where I live, it seems like those doing ""old"" popular stem degrees like Mech/EE have difficulty getting jobs whereas the majority of CS grads seem to have jobs lined up even before graduating."
70252,"This has not been my experience at all in CS. If you have good communication skills and you paid attention in college, you can get a decent job at a tech company. The extra projects only help once you want to get past that entry-level job. TBH though, internships are the most important rn because they get you close contacts at a company, and almost always lead to full-time offers. But you don't have to put in hours and hours into CS projects and EC's outside the classroom."
70253,"Former English major here who does a bunch of writing-related jobs. There's lots of ways that you can make a writing job part of your life! The good news is that you can pair it with a variety of majors and figure out what's most interesting to you. You can write copy or materials for marketing firms, get editing gigs, teach writing, write articles, go the creative route, and so much more. Having a passion for writing is awesome AND useful."
70254,"This is very true, English on it's own isn't a crazy strong major but I'm pairing mine with Professional Writing minor and Information Technology minor to hopefully become a technical writer but my current internship is in research and marketing so it's a very versatile major. The issue is if you go into English you really need to get ready to read/write a lot of stuff. It's an interesting major but it's not incredibly fun in my opinion."
70255,"hahaha I think we have different definitions of fun! I absolutely loved reading and writing new things in my classes, and my university offered lots of cool electives. I think you've nailed it with pairing an English major with a variety of minors and then exploring internship/work options. It's a bit of a bummer that so many people look down on English now because the writing, critical thinking, and communication skills you practice on a regular basis are so useful for a variety of jobs."
70256,">It's a bit of a bummer that so many people look down on English 

People definitely treat English as an underwater basket weaving degree but honestly the unemployment rate for English majors is pretty much on par with most other majors give or take 1-2%. Most of the people I know that haven't found gainful employment after college didn't try to get internships or anything beyond their degree and their resume ends up looking like they worked summers in their local grocery store, went to college and graduated with nothing in between. 

I love reading and writing but the reading aspect can be very tedious, it's not fun for me to read 17th century british literature but I stomach it. My school also has 3-4 different pairings with English where there's Creative Writing, Teaching, English Lit and Professional Writing. I took the Professional Writing pairing because it gives a lot of classes on marketing, business and technical writing which is my end goal."
70257,"You can still go to art school, itâ€™s not too late."
