idx,text
60979,No love for Comedy Bang Bang? Im watching it now and im constantly cracking up.
60980,I'm surprised it took this long for someone to mention comedy bang bang. Theres so much love for it from what I've heard. Thanks for the suggestion.
60981,Watch Trailer Park Boys. The first series are old as fuck now but they are still great. Writing is superb.
60982,"I personally thinks Orangeisthenewblack is very fun, even though I think the show fall into the drama category"
60983,for the life of me i cannot get into this show
60984,I'm right there with you. each episode feels like a 3 hour ordeal. I never got the hype
60985,Fawlty Towers and Larva.
60987,Peter Capaldi swearing at the people that get my voicemail message is the first thing I'd buy if I win the lottery.
60988,The Office
60989,Scrubs!
60990,"Scrotal Recall, Mixology,  and IT Crowd."
60991,"I love all the other suggestions! Haven't seen Frankie and Grace listed, though. Don't write it off just because it's got a cast of senior citizens as the main characters- it's hilarious and heartfelt. I'm 25 and I lose my shit when watching it."
60992,"Good to know. I had written it off, if I'm honest."
60993,"Light one up and go to town. It's great! Or, if you've got a mom or grandma to watch it with, that's always fun (but old people have sex! haha could be awkward). My mom and I watch it together long distance. But really... try it out."
60994,"Raising Hope - You have to pay very close attention to this show.  A lot of the zingers come completely out of nowhere, are delivered in a deadpan tone of voice, and are never acknowledged by any other character."
60995,I started watching this show just in time for its cancellation. Will catch it on Netflix.
60996,"Easily Archer. One of the funniest, most well written shows ever in my opinion,"
60997,Parks and Rec
61018,"Yamada's First Time, I almost died when I watched that XD"
60999,"IT Crowd, Father Ted"
61000,"The Office, Scrotal Recall, Bob's Burgers"
61001,I think they have the first few seasons of MASH now.  Definitely the best series of all time.
61002,Toss up for Always Sunny and Arrested Development.
61004,Red vs Blue. They added more recently and they have me in fucking stitches.
61005,"It's Always Sunny, Trailer Park Boys, Bojack Horseman, Bob's Burgers, and Archer are my favorites!"
61006,"File under: shows you haven't already likely heard of (parks and rec, 30 rock, etc.) 

""Scrotal Recall"" is hilarious. It's set in the UK and the main character just finds out he has an STD and needs to tell his ex Sexual partners about it (male telling females) and each episode is about the girl/lead up to sex. It's hilarious. Only 6 or so episodes easy binge."
61007,Louie
61220,Psych
61009,"Garfunkel and Oates! There's only one season, but it's still really funny. I love those girls."
61010,Short Poppies is great for fans of Flight of the Conchords or Chris Lilley-style shows.
61011,"The Office, amazing show that can be amazingly funny as well as make you love the characters"
61012,I would have to say Frasier. But I am old.
61013,The office
61015,They're streets ahead
61016,"Archer, most definitely"
61017,An Idiot Abroad
61019,Have you tried “Santa Clarita diet” or “on my block”. Both similar to your likes
61020,"Oh man, Santa Clarita Diet had some scenes that were absolute side splitters. The morgue scene was my favorite"
61021,Don't bingewatch this show. It's a treasure. So well written.
61022,"The top comedy show I think is ""The good place"".. check out people's reaction here: https://www.reddit.com/r/netflix/comments/887gaf/the_good_place_is_actually_pretty_funny_and_binge/"
61023,Definitely try out Schitt's Creek...
61024,"I highly recommend Portlandia and Lady Dynamite!!!!!  (Note, S1 Ep1 of Portlandia has some kinda gross stuff but don't let that stop you. It's just a little, the whole show is not like that.)"
61025,I’m trying to remember the “kind of gross stuff” in the first episode of portlandia?
61026,"Well...I thought that scene where Carry was dressed as the guy and Fred was dressed as the girl, and Carry's character was simulating fucking Fred's character...was gross. That's my personal thought that it was icky."
61027,"I can say you and I have almost exactly the same taste so I highly recommend you to check out Bojack Horseman, F is For Family, Master of None and Crazyhead if you haven't already. Also not so Netflix shows but Peep Show and The IT Crowd is a must watch if they are available in your country!"
61028,Wouldn't watch bojack for the comedy tho. I love the show but it's more about the feels
61029,Baroness von sketch show took the prize for me this year.
61030,iZombie!
61031,"New girl, Brooklyn 99, good place, on my block, master of none, love, lovesick, imposters,"
61033,"possibly the best british comedy show, which is saying a lot."
61034,"Todd Margaret is kind of British. David Cross and Will Arnett seem to be the only main characters that are American. I loved this show. 

Also, Little Britain."
61035,"I think that the British version of The Office still has the belt. It's just such a flawless masterpiece. Nary a wasted second. 

But I loooooove Peep Show! Me and the wife are just constantly watching it on a series loop."
61036,"those are my number 1 and 2, interchangeably."
61037,"I just couldn't get in to the British The Office. One of my least favorite episodes of the American one is the pilot, which is near identical to the British pilot. I guess I just don't like British sitcoms. I did like Red Dwarf, though."
61038,Chef was one of the few British comedies I enjoyed.
61039,I wish they'd hurry up and get moving on the last season.
61040,It's been a while.   Are they still going to do it?
61041,According to the show's Wikipedia page it's going to film next year.
61042,"And if you like that, watch the IT Crowd."
61043,"Also watch 'Father ted' and 'black books', the original work from the same writer Graham Linehan, you might need hola unblocker to watch them on the uk site though."
61044,Archer. House of Cards.
61045,30 Rock.
61046,I had to watch 30 Rock with subtitles on because there are so many jokes sometimes I would miss stuff.
61047,I always watch tv with subtitles for this reason. You miss so many jokes by not using CC
61048,It wouldn't be a Lemon party without old Dick!
61049,"West Wing. Excellent writing and dialogue. Characters exchange rapid-fire remarks and debate with each other on a highly intellectual level, but not so high you can't keep up. It has the element of believability to it too (that I think a lot of shows that tried to impersonate this one lacked) because the characters are all Ivy League graduates working in the fast paced world of politics, at the White House no less, these are professionals at th top of their game.   Also good because the writer of the series, Aaron Sorkin, doesn't rely on seven layers of snark and sarcasm or three pop-culture references per sentence to make his dialogue appear ""smart""', like some shows do. Looking at you Gilmore Girls..."
61050,"I was given the first season and watched that, now I think I'll check it out again - thanks!"
61051,"The second season is where it really finds its stride, IMHO; last few episodes of the second season are as good as TV gets. Third and fourth are equally excellent, but Sorkin left after that (after a little incident with his baggage at the airport) and the last four seasons are derivative."
61052,"You're welcome! There are some bumps along the way (I think after Sorkin left it took a bit to find their footing again) but it is definitely one of the best shows ever scripted, up there with The Wire,(which isn't on Netflix unfortunately) a show that doesn't insult your inteligence and is a great drama to boot.

And as I mentioned above, Gilmore Girls just isn't all it's cracked up to be in my opinion. I say this because a lot of people praise it and its dialouge. It starts off strong but the repetitiveness and staleness of the writing begins to show after awhile. I think I dropped out after season 2. Maybe my hopes were too high. (Also I hated all the characters except a few side ones, so that may have had something to do with it lol)"
61053,"I'm a big fan of Gilmore Girls: I watched it as it aired through high school and my early years in college and loved the dialogue. I'm re-watching it through Netflix now, and some of the pleasures in the writing is just now clicking. I find it really rewarding as a viewer, but I do recognize its repetitiveness. Maybe that's part of why I love it though: it's a reliable friend. Paris, for example, cunningly refers to the 5-hour film Shoah twice in separate seasons. 

A large part of what works about Gilmore Girls for me is actually not the dialogue. Rather, it's the small town world it creates alongside that dialogue. Now, I'm not from such a place, but GG does a damn fine job of creating *a representation of* a small town. The informed references thus sometimes have the feel of being too smart to be true: like Rory talking about Boogie Nights while still in high school and Lorelai making a reference to The Brown Bunny. ""Small town"" people presumably don't talk about these things. So I'm rambling a bit, but my point is this: the combination of the small idyllic town setting and the fast-paced references that rival an urban, Woody Allen-like world make for a heck of a mother-daughter show. It pulls off being just strange enough."
61054,It's repetitive and redundant.
61055,I'm gonna be a curmudgeon in response to this: I wish this sub were like TrueFilm where responses with fewer than 180 characters are automatically deleted.
61056,"That is a direct quote from Gilmore Girls. I am also a fan and thought you would get it. 

Gilmore Girls - Town Meeting - Cart, Kiosk, Cart/…: http://youtu.be/TUBcIhjAuOY"
61057,"Oh man, I am a curmudgeon then! The cart, kiosk, cart/kiosk permit! The formatting of the comment threw me off. You have my sincerest apology. =)"
61058,"Emily and Richard are the only clever parts of that show. Everyone else is just repetitive and growthless.

And I must say I'm surprised at your inclusion of The Wire. Not because it isn't a well scripted show, because it is, but because you have the Sopranos and Deadwood right next to it. Two shows that, in my opinion, far better showcase wit and writing ability."
61059,I 100%  agree about Emily and Richard! They were by FAR my favorite part. And the reason I didn't include Sapranos or Deadwood is cause I haven't seem them :P  but I've heard good things and have always wanted to! Hopefully when HBO launches their streaming service I can get them (if it's not super pricey)
61060,"I haven't seen Deadwood but with regards to The Sopranos v. The Wire:  I'd say that The Sopranos had better episode-to-episode writing but The Wire was a better written story from start to finish.  Each season of The Wire is a piece that interlocks with the other for one grand iteration in a very real world cycle whereas each season of The Sopranos comes off more as ""The continued adventures of Tony Soprano!"""
61061,"I agree, mostly. Like I alluded to in my comment, the Sopranos is a better show of ""writing"" on a line to line basis. The Wire's overarching story format (what I would call...crafting....schematic? I guess) is fantastic.

But The Sopranos is about far more than Tony Soprano. It's about the death of an institution, the changing of a country, and an exploration of (a)morality."
61062,"You hated them?? Ahhh! How? 

I'll give you that the dialogue did get a bit stale after the first few seasons, but not enough to really bother me.  The characters though... Most of them seemed specifically created for their lovability."
61063,"Hahaha just my personal taste I guess. My wife loves the characters and the show but to me all the characters seemed too one-dimensional. 

Luke - I'm a grumpy grump who serves food grumpily and I grumpily love Lorelai in the most grumpily obvious way possible creating an artificial ""will-they-or-won't-they tension in which everybody knows they will (I assume, like I said I just watched till season 2ish, but I would be surprise if the writers gave the audience blue balls for much longer than that) 

Lorelai - defines herself through her hatred of her parents even though she is 30 not 16. Is so incredibly self-centered that she never thinks her actions through and only looks at how things will effect her or her precious daughter who she can only see as a living saint. (casually leaving her fiancé with no consequence and flipping out on Jess after the car wreck are two good examples of why I hate Lorelai) She also has this ""hipster"" kinda attitude, if I can say that word without being accused of hipster-hating, where if you don't love all the pop-culture things she does then you have wasted your life and aren't worth her time. But really no one is worth her time because she is self centered.

Rory - Terrible, terrible, TERRIBLE girlfriend. I get that Dean is about as compelling as a soggy sock but she was horrible if I remember correctly. Also I know that she is only 16 but she acts so mature everywhere else it just doesn't fit well to act like a toddler toward boys. Also the ""I'm a super genius high schooled shtick"" became irritating fast. Really? You read the complete works of Henrik Ibsen over the weekend and want to pepper your conversations with allusions to The Iliad and obscure TV shows that were on the air when your grandma was in diapers? Sounds like every lovable highschooler I know...

Wow, I am ranting and coming across as a little Luke-ish myself. I love that others love the show, it's just not for me. Sorry :S"
61064,"If you like West Wing, also make sure to try Sports Night"
61065,Greatest show ever. I will fight to the death defending it.
61067,Better off Ted!
61068,"God I wish this show had gotten more recognition. Portia de Rossi was brilliant. Honestly, if any cancelled show deserves to be revived it's this one. I mean...you know veridian dynamics has some weird Lazarus device it could employ to revive itself. Creepy and extreme side effects be damned!"
61069,My favorite part was the sinister commercials.
61070,This show was genius.  I loved every minute of it.  Very witty dialogue.  I am glad to see this show listed.
61071,"Just don't talk about The Stuff. It knows, and it doesn't like it."
61072,I wish Phil and Lem were still on TV.
61074,"I've been watching Sherlock and I think the very definition of it is ""cleverness"""
61075,"Except for season 3. It seemed to completely change it's style to be more gimmicky, more like Doctor Who than Sherlock."
61076,Fraiser
61077,Almost every other line is a sharp tongued response.
61078,"Niles and Frasier's back and fourths were amazing. 

My favorite sitcom"
61079,"""You get the one, you get that *other one.*"""
61080,"David Hyde Pierce, the act who played Niles, does a lot of outstanding physical comedy on the show."
61081,"""Sherry niles?"""
61082,"Black books

Its a show about a bookshop owner with aspergers who hates running a shop"
61084,Doesn't appear to be on netflix unfortunately. At least not in the States.
61085,30 Rock. I have watched it through so many times and I always catch something new to laugh at because I'm pretty sure every line in that show is an A+ joke.
61086,"You know you can't have a Lemon party without Old Dick

Probably the greatest hidden comedy line I've ever heard."
61088,"I mean hidden in that unless you have knowledge of that what that site is, it just seems like a stupid line meant to make Liz's father look like a geezer."
61089,Happy Endings - an awesome short-lived sitcom. (Plus all the others on here!)
61090,Maaaaan that show was taken from us too soon. Are you watching Marry Me? Same writer and some of the same actors.
61091,Yep! Loving it! I also love that the Wayans Jr is now on New Girl. He's awesome.
61092,Archer or arrested development would be good choices.
61093,"Arrested Development is fantastic especially on the second viewing, because you can pick up on the foreshadowing you missed the first time through."
61094,Terriers
61095,This was the best dramedy I had seen in quite some time - Too bad it got cancelled.
61096,Parks and recreation.
61097,Black Mirror
61098,"I just watched all the episodes.  Although the premise is extremely clever, I don't know that I can say that many of the characters are ""extremely clever"" themselves.  It does have an ample amount of dry wit thanks to it being a British show."
61099,A Young Doctor's Notebook
61100,Yes! I love AYDN. It is indeed very witty and made me respect Dan Radcliffe as an actor for the first time
61101,Psych. So funny.
61102,You know that's right.
61103,http://youtu.be/3TJC8WeVafM
61104,I know.
61105,Have you heard about Pluto?
61106,That's messed up.
61107,"This is my partner, MC clap-yo-handz"
61108,The Thick Of It.
61109,"^this
   
is outstanding. .."
61110,Fuckity bye!
61111,[The IT Crowd](http://www.imdb.com/title/tt0487831/)
61112,Bobs burgers.
61113,SUITS
61114,"I second this. It also has the benefit of being adult themed, yet mainly clean. So something enjoyable that you can watch with kiddos around."
61115,MST3K!
61116,"What???????? I didn't know what that was at first, but wow, Mystery Science Theatre 3000 is on Netflix... !!!!!! Thank youuuuuuuuuuuuu!"
61117,Also quite a collection on you tube
61118,Come join us in [/r/mst3k](http://www.reddit.com/r/mst3k)!
61119,Thank you! I had no idea.. on my way...
61120,There's a pretty good archive of all the shows and where you can watch them free [on this site](http://www.club-mst3k.com/) too.
61121,Death note.
61122,"Buffy the Vampire Slayer, for sure."
61123,And Angel!
61124,Californication
61125,"This is a perfect recommendation for wittyness, but only for ~3-4 seasons, it really tailed off I thought."
61126,Sherlock BBC
61127,"**Life**: Only two seasons, but fantastic dialogue and acting throughout.

**Blacklist**: The writing is top shelf plus you get James Spader at his darkest.

**Misfits**: Probably my favorite television show ever. Many have said that the show loses too much after the cast changes begin in series 3, but I'm a huge fan of the differences between them all and think it works for the story."
61128,I LOVED Misfits in the first two seasons and quickly lost interest in season 3. Can you give it a go convincing me to come back to it? It always bothered me that I never finished.
61129,Rudy!
61130,ya bottled meh!
61131,It took me a few episodes but Rudy really grows on you.
61132,"Hmm. But the rest of the cast being sort of diverted into random BS kinda broke me too. I mean, I love Nathan and all and the show was lessened greatly without him but it's more the high level changes in direction that bugged me. Time travel, power swapping, etc."
61133,"Blacklist seems out of place here. James Spader is great, but the writing is average on a good day. It's so hokey, calling all the villains ""The Cowboy"", ""The Technician"", ""The Chemist"" or something similar is so low effort. Not to mention the fact that it's just as packed with (the same) clichés as any other cable procedural. I just can't call that clever.

You want a witty investigatory show? Watch The X-Files. That's clever."
61134,Yeah everything about the blacklist is just so average EXCEPT one thing and thats Spader. Somehow his performance alone somehow nullifies all the issues and results in a show thats far from average
61135,"I wouldn't go that far personally. It's shortcomings are still a big deal, he's just the only thing that makes it a watchable show."
61136,Not even Spader could save it for me. Love that man's acting talent but that is just a horrible show. I was so distracted by the lead actress' wig. I felt like I was constantly watching an 80s show with a stunt double with a bad wig who got left in the scene.
61137,Lillihammer is a great watch.
61138,Columbo! http://www.reddit.com/r/netflix/comments/2p072e/need_a_good_dose_of_classic_murder_mystery_do/
61139,"Not sure if it's exactly what your looking for, but I'm kind of surprised no one has said Doctor Who."
61140,"Utopia.  Brit humour, sarcasm and a dark theme."
61141,"It's not on the US one so you would have to change your region to Canada but Veronica Mars matches your description.

Firefly is smartly written and has great dialogue (when it comes to that any Joss Whedon show tbh) and Gilmore girls also has really clever and witty dialogue"
61142,Miss.. Firefly...sooo much...
61143,Straight up I'm into the 6th season of gilmore girls and I'm a 33 yr old male. Never realized how well that show was written. It reminds me of Aaron Sorkin and Joss Whedon type writing.
61144,Damages
61145,"I'm surprised this hasn't been said already, but White Collar. It's about a hyper-intelligent con man who starts working with the FBI's White Collar crime division to bring down criminals."
61146,"I'm shocked not to see ""Coupling"" mentioned.  My favorite sitcom of all time."
61147,lie to me is a great one
61207,Gilmore Girls
61149,"I'm really surprised at how much I like GG. For a network show, they get in so many fantastically sly bits of dialogue."
61150,"I really think Gilmore Girls is the perfect TV show. Drama length gives time to tell good stories, dialogue is ridiculously good, characters are all fleshed out really well, just enough drama to be interesting without getting awkward or angsty. I love this show. (for reference, other shows I've been watching lately include Archer, Sons of Anarchy, and Farscape)"
61151,"I'm surprised you're being down voted. I recently went back to re-watch it, not having watched it since high school, and it's way more funny than I remember. Lorelai and Rory have some great banter and make some really good references"
61152,"I started watching Gilmore Girls with my wife and I have been pleasantly surprised with how much I like it. Would never in a million years have checked it out myself because it seemed... whatever the exact opposite of ""up my alley"" is."
61153,The IT Crowd - Short but oh so sweet British comedy.
61162,Black Adder
61155,"Sherlock, Lilyhammer, Saxondale, Arrested Development"
61156,The thick of it
61157,this is the real winner
61158,The West Wing.
61159,"Frasier. 


Very witty and funny."
61160,MAD MEN! DUUnnuh DUUnnuh Duuunuh Duuunuh....
61161,sherlock
61163,"Skip the first season, though."
61165,"I don't know. While it has some good episodes (Hush specifically) much of Season 4 is tough to get through as the Big Bad is just awful in that season. We also had Riley as the Angel replacement and it doesn't work, i'm not sure if Whedon and co dropped the ball with the Character or its just that Blucas isnt a great actor and lacks any charisma but something is off . Oh and we have the episode 'Beer Bad' which has to be one of the worst episodes ever (and ""Where the Wild Things Are"" isnt much better)

We perhaps have 'Angel' to blame as perhaps that provided a distraction initially"
61166,"Hey, I love season 4. I admit the big bad isn't the best, but I think Riley gets a bad rap. He was the rebound guy. Despite what xander may have told Buffy, he was always the rebound guy, and in that capacity he was fine. Additionally I don't think beer bad is as awful as everyone says. There are also some of my favorite episodes of the series: something blue, a new man, restless, superstar, fear itself. It has spike join the regular cast, which is awesome, and even a terrible episode like where the wild things are has it's moments like Giles' coffee house gig. Season four is essential."
61167,No Community? It's in Canada I think.
61168,"Blacklist, It's always Sunny in Philadelphia, House of Cards, Lillihammer, Persons Unknown (was ok), Agents of Shield (has its moments), Bobs Burgers, Futurama, Archer, Heroes (early episodes)."
61170,I don't think black books is still on netflix.
61172,double checked and yeah in the US black books isn't streaming.
61173,"Heroes was so good, it's a shame it only lasted one season though."
61174,FIREFLY
61176,The West Wing
61177,Trailer Park Boys.
61178,This is an awesome show. You really need the right sense of humor for it though. I don't know if it's for everyone.
61179,Continuum
61180,Monk was my first thought.
61181,30 rock !
61182,"Lilyhammer, as long as you don't mind subtitles."
61183,Snuff box
61184,"If you're feeling light-hearted: Psych or Scrubs

If you're feeling a bit darker: House of Cards or Blacklist

If your in between light and dark: Dr. Who"
61185,I'd watch QI on Brit Netflix. I love that show.
61186,Californication. If you're okay with the NSFW tag.
61187,"Definitely Trailer Park Boys, that matches your liking completely."
61188,"Surprised there's no mention of **Party Down**

While chasing dreams of stardom, six Hollywood wannabe actors and writers make ends meet by working for a posh Los Angeles catering company, which tackles a different event -- senior singles mixer, porn awards after party, a Super Sweet 16 bash -- in each episode."
61189,"Great show, but hasn't been on Netflix in a long time. They do have it on DVD though."
61190,Frasier and 30 Rock immediately come to mind.
61191,Head Case was another hilarious Starz show on Netflix but I just checked and it's no longer there.
61192,Happy Endings
61193,Frasier
61194,Stargate
61195,"IN THE MIDDLE OF MY BACKSWING???

(Not really clever or witty, that line, but still hilarious.)"
61196,"The whole cast was pretty good, but Richard Dean Anderson was really the dealmaker on that show, in my opinion."
61197,I totally agree. I'm in the middle of a rewatch with my son and we are now halfway through season 9. Just not the same without Jack.
61198,Claudia Black as well imho. She filled the comedic hole in season 10 that had been missing somewhat as RDA cut back his involvement and then eventually left completly
61199,I loved her character. The Cameron Mitchell character didn't bring much to the show but Vala was a breath of fresh air.
61200,"I've seen him in person and I dint know how they worked with him. It must have been like herding cats. He's not rude, he just seems uninterested in fine details, much like Jack."
61201,"Is it even still on U.S. Netflix, I thought they took it down."
61202,"I thought so too. I couldn't find it when I looked just a few weeks ago. 

I had only caught pieces of it when it aired. I'm trying to watch it from the beginning now. Not sure if I like it so much. I'm unimpressed with the first few episodes. Is it worth sticking with it?"
61203,Start with SG-1
61204,"What was up with the last arc? It just went... different. I went between not being sure if I like it, hating it and sort of enduring it."
61205,[Atlantis.](https://www.youtube.com/watch?v=i5Y1YF5R76o)
61206,Gilmore Girls.
61208,"I want to say yes to every single show on here. Also if you can get a proxy extension, check out The Mentalist on Switzerland Netflix. The main character is extremely clever and witty."
61209,"Archer, for sure. One of my all time favorites"
61210,"House seems to be exactly what you're looking for. Suits and Sherlock are good too, and so is Breaking Bad but you've probably already watched that.

Weeds is a good one, but that doesn't necessarily highlight intelligence and I can't remember if it's still on Netflix and can't check right now- sorry."
61211,"How has no one recommended ""Frasier""?"
61212,http://www.reddit.com/r/netflix/comments/2oz3rw/i_love_shows_that_highlight_extreme_cleverness/cmrwpni
61213,"You should check out The Finder its a really good show, unfortunately theres only one season"
61214,I loved that show and hated that it ended but I don't know how it could have gone on without Michael Clark Duncan.
61215,I agree he was an amazing actor and his character was so good
61216,"the blacklist, james spader is fucking witty"
61217,Ripper Street
61218,"peep show all day
http://www.reddit.com/r/quotes/comments/2hlok5/you_promised_not_to_tell_hitler_promised_not_to/"
61219,One of the best shows ever.
61221,"Veronica Mars is like that, i was really surprised"
61222,"Scrubs for sure. Fast paced, funny, witty dialogue."
61223,frasier. cheers. firefly.
61224,"**Persona 5**, if you don't mind the slight anime aspect and high school stuff. It plays so well, the story is freaking good, the soundtrack is so original... I would say it's a piece of art on its own, rather than a simple game. Also, damn pancake plot twists.

&#x200B;

**The Witcher 3**, a classic. I tried to touch it twice and only played like 15 minutes the first two times. The third time I tried it, I got completely absorbed by it. By the time I had enough of the game, I had already 180h of playtime.

&#x200B;

**Dragon Quest 11** if you're into a more classic story, classic gameplay, classic characters, classic worlds, classic concept... well you get it. But it's a good kind of classic.

&#x200B;

**Bloodborne**, if you're the type to consider it a RPG. I love how at the beginning you feel like you're being hunted and the more you play, the more you realize how you've become yourself the hunter. I love the playability that every different weapon brings. It's satisfying, it's an immersive world and it's FREAKING FUN AS HELL! You may also try another Souls game but I've only played Bloodborne until now.

&#x200B;

**Final Fantasy**

VII - A classic, if you haven't played it yet, start here and enjoy one of the best games of all time.

VIII - One of my favorite, very underrated, excellent story and enjoyable characters. Not the best gameplay mechanics, but you get used to it very quickly.

IX - Touching, warming, a classic fantasy world with incredible gameplay features.

X - My favorite Final Fantasy story, really long playtime (got me about 200hrs to finish everything), visually impressive, soundtrack on point. It's a turn-based so you'll like it or hate it.

XII - The ""Ok"" Final Fantasy, it's not bad, but it's not on pair with the other ones. Political story, a bit of a Star Wars vibe in a modern fantasy world, inovative and fun gameplay mechanics, visually impressive as well (even tho I got bored of the same color palette throughout the game). The invocations are epic!

XV - The ""Well..."" Final Fantasy. It's a really good game but a bad Final Fantasy in my opinion. Story wise, it's fine, but lots of plot holes that rely on DLCs. Fun characters, really fun battle system, impressive visuals, soundtrack most excellent... but all in all, it feels a bit off.

&#x200B;

**Nier Automata**, I haven't personnally played but I've seen some footages on YouTube and some friends can't stop recommending me this. I've hard the soundtrack and it's BEAUTIFUL and EPIC. I also really like the whole concept and everything feels well-executed. I personnally can't wait to play this game.

&#x200B;

**Digimon Cyber Sleuth**, an excellent Digimon game (for once in a while!), looots of digivolutions, a good story for what's it's worth, really really fun and addictif. I just didn't like the long texts and conversations, it breaks the rhythm of the game.

&#x200B;

**Horizon Zero Dawn**, if you consider it a RPG (I do, personnally). A big open world, really fun mechanics, top notch story, massive enemies with impressive visuals. It's good to look at, good to play and simply a masterpiece, enough said.

&#x200B;

**Skyrim Special Edition**, if you haven't played Skyrim until now... well, drop everything you're doing and prepare to lose days or even months of your life.

&#x200B;

**Kingdom Hearts** franchise. I could tell you to play them all, because every Kingdom Hearts contributes to a very convoluted, complex story, that you would prefer to watch on a 30min summary on YouTube. But it's not a bad kind of convoluted story. The gameplay is really good, it's dynamic and fresh. I would say, play 1, 2, Birth By Sleep, Dream Drop Distance and 3 last. Even though the other games are REALLY good as well, those are the most important.

&#x200B;

**Monster Hunter World**, if you're the kind of person who loves grinding, showing big weapons and defeating big monsters, in a massive world along with other players. The game is extremely fun and you'll spend a lot of time there.

&#x200B;

**Divinity Original Sin 1 & 2**, if you like a more tactical gameplay but still very innovative, complex with lots of freedom. Story wise it's incredible and really immersive. It's a kind of game you'll LOVE or simply be ""meh"". But it never feels like a bad game.

&#x200B;

**World of Final Fantasy**. I could have put this along the other Final Fantasy games, but this feels incredibly different. The lore is 100% from Final Fantasy games, but the game itself is more like a Pokemon meets Digimon 2.0. It's soooo FUN! It doesn't have the best story or the best characters, and visually it may feel a bit childish (even though you get used to it very quickly), but damn, I can't stress enough how fun it is, it plays really well.

&#x200B;

**Assassin's Creed Odyssey**, if you consider it a RPG. You now have some side quests, you can customize your character a bit more and it's really fun to play. It doesn't feel much like an Assassin's Creed. I personally think this is a game that absorbed lots of Action and western RPG elements and tried to be both at the same time, but doesn't excel at neither. Buuuut, it has a huge open world, it's visually excellent (minus some texture problems, but nothing out of this world) and it's smooth as hell.

&#x200B;

I don't really remember other games that I have played, but some people talk about the ""Tales of"" games (Tales of Berseria, Tales of Zesteria etc).

&#x200B;

EDIT: There's also **Final Fantasy XIV**. It's a MMORPG, subscription-based, but REALLY worth it. There's content for months, the story is pretty impressive for a MMO, lots of references to other Final Fantasy games and it's ALWAYS being updated with new content, new jobs (or classes, like healer, warrior, etc), new maps, dungeons, raids, etc. And the PS3/PS4 servers are the same as the PC ones, so you get to play with anyone you want."
61225,"Damn bro, you went all out and made a guide. Very nice. Curious on your thoughts on Final Fantasy 8. I know its not playable on PS4 but I believe it is on Vita."
61226,"Oh you're right, I thought they made it available for PS4 as well (it's on PS3, PS Vita and PSP). 

Well, to be more specific about this game, it has a really diverse story. You get to adventure in the most fantastic places, from small villages to big futuristic cities, mountains with dragons, universities, the deep ocean, the space, the moon, a floating castle, a pursuit on a train and so on... Couple that with time travel, politics, alien vibes when on the moon mission, sorcery, university students fighting as soldiers and the list goes on. There's also a romantic plot that's not too much nor too less, it stays right in a good spot. 

The opening of the game is some kind of art, no one can deny it's the best opening in any Final Fantasy game. The visual effects are a really nice upgrade from FF7, the summons are impressive, the difficulty is fair and the final boss is sooooo underrated. You're fighting a time travel sorceress with 4 different forms, whose power is to compress time itself, absorb it + space + existence, possess people and bring to life subconscious thoughts... Sephiroth what now? (yes you can kill a planet, but not a time travel goddess)

But like I said earlier, the gameplay mechanics may seem a bit off to some people. You have to absorb limited magic (from monster or in the outside world) and use them as a way to boost your character and summons stats. I don't think it's that bad personally, you can easily farm magic in the game and once you have enough of some magic, it doesn't really feel that limited (and it's easy to know when to use it).

There are so many good things about this game, but people will see one negative (read it different) and it's already the worst Final Fantasy."
61227,"Would you recommend playing Divinity 1 before Divinity 2?

2 sounds like it's an absolute masterpiece, while 1 sounds like it was good, but not nearly a must-play.

I've heard you don't really need to play the first game to understand what's going in the second, and since I already have a significant backlog, I was thinking of skipping 1. Would that be a mistake?"
61228,"I don't think you really need to play 1. You'll already have LOTS of playtime on the second game, it's a better version of the 1 putting it simply. But the first game is good nonetheless :)"
61229,I own both. I’ve put maybe 10 hours into 1. I’m coming up on 100 hours on 2. 2 is one of the best games I’ve ever played. You can play it without ever having touched 1 and be perfectly fine.
61230,"I’ve played a bit of two and a tiny bit only one and I think the main difference is that one feels a little closer to true table top mechanics, just those few more variables"
61231,"Haven't played 2 but I'm going through 1 bow. I've heard 2 has way more quality of life mechanics in the game. So, I started with 1 because it can be hard to play older titles after the newer ones. But I've mostly just heard the story in 1 is eh and it's a little harder to play. Writing is still a blast, game is so much fun!"
61232,"Great list! Since you recommended Bloodborne I will also recommend Dark Souls 3. It doesn't have the same great atmosphere as Bloodborne, but there's a lot more variety to weapons and builds. Compared to Bloodborne, the areas are a little tougher in DS 3, but I think the bosses are easier."
61233,"More variety to weapons? Where do I sign?!

I'm definitely going to give it a try :)"
61234,"Not OP, but I just started Dark Souls Remastered and I would start with that one or else the story in DS3 will be confusing as hell. If you don't care about the story/lore though, more power to you"
61235,How does Dark Souls Remastered compares to Bloodborne? Are there more weapons? More builds? More difficult enemies? Is the gameplay clunkier? etc
61236,"Definitely more weapons and builds/playstyles. It takes some getting used to gameplay-wise. I wouldn't call it clunkier, just requiring more patience and being a bit slower-paced. 

There's also more NPC questlines (Like Eileen the Crow and Alfred in Bloodborne) in DS1 if you care about that stuff.

If you loved Bloodborne, you'll definitely enjoy the Dark Souls games"
61237,"Awesome! I'm gonna try it, thank you so much :)"
61238,"This is amazing man, i feel like im reading myself since we are so alike, the one thing i'd correct and please dont kill me, i know ff vii is arguably the goat but the game did not age well, i beat it when i was a kid and playing it again as a grown up was a constant: how did i get through this?. Im curretnyl playing world of final fantasy and the whole mako level was such a joy to play, i got a smile on my face the whole time.
Also, give Nier a try, i loved it so that means you'll love it too"
61239,"Hey twin! I'm glad we are alike :D 

I actually agree with you about FF7, it didn't age well at all. It's still one of the best games if you put that aside. If someone can't stand cubical graphics, it's better they don't try it lol

I'm definitely going to give Nier a try, once I finish my huge collection of unfinished games lmao"
61240,"Whelp, pack it up, threads over boys."
61241,"The only one I would add is Resonance of Fate. It's a PS3 game, rereleased on PS4. 

Great tactical JRPG with a unique steampunk setting and gunplay which you rarely see in these games.."
61242,Do people not consider bloodborne an RPG? It 100% is
61243,It is.  Action rpg
61244,"Absolutely nailed it, the only game I would add is Tales of Vesperia. The Tales of series can be shaky at times, but this is seen by many as the pinnacle and it is a ton of fun. Put 80 hours into it, would definitely recommend!"
61245,"What is it with the Witcher 3 and not being hooked the first time? I thought I was the only one but it took montha for me to play more than a few hours, but once it hooked me, it became one of my favorite games ever."
61246,"I really don't know! I saw on the internet a bunch of people in that same situation.

I personally found it was extremely clunky and unsatisfying at the beginning, it turned me off instantly. I said to myself, ""people are praising this and I can't even like the guy walking?"" or even ""there are better underrated games out there, why do I wanna play what everyone else is playing?"". 

But I realized that not every game is the same and I need to open my mind to different styles, artistically and technically speaking. 

The Witcher 3 was very different from the kind of games I would play, even compared to Skyrim if we're talking about western RPGs. It felt a bit off, but the more I played it, the more I got into it and understood the praise.

&#x200B;

Even today, I still say that the game is clunky and the combat mechanics can become a bit repetitive with no feeling of progression. But the rest is absolute madness, it's insane the work they put into it and I feel like the 20€ I spent on the game aren't enough for what it is."
61247,"Persona 5, The Witcher 3, Final Fantasy (7, 9, 10, 12), Soulsborne games, Tales of Berseria, Divinity 2"
61248,I like how your final fantasy choices skip every other number haha
61249,Witcher 3 and Persona 5
62540,Persona 5
61251,A master fuckin piece of JRPG’s
61253,"Persona 5.  

But also FFXII. It's kind of an odd RPG, as the combat is usually more about having everything set up right and just letting it play out. But it's fun."
61254,Dragon Quest 11
61255,Good game but the repetitive music (especially same music during every battle) is very obnoxious.
61256,"I agree. I must add that the dialogues are sometimes cringe and dumb, with a main character that nods instead of speaking and a story not original at all.

But the game is extremely fun and takes the J-RPG classic formula to a new level :)"
61257,"I felt the game relied too heavily on it's 3D graphics instead of it's gameplay, story, and musical compsitions that made the old Dragon Warrior games so great, but that could just be my nostalgia glasses talking since Dragon Warrior 3 waa the last game I played before XI."
61258,that's because the composer went with using electronics instead of orchestra and so some music has become real grating to hear.
61260,"yeah, they're able to actually have the orchestra when the real money came in from the PS4 sales in October. Hopefully, this can surpass DQ8"
61261,Nier Automata. One of my favorite games of all time.
61262,"It's one of the most unique games I've played. Personally the story didn't really connect with me, but it was still really well done."
61263,"Even though I platinumed it, I didn't like it. I think people who are into the arts will have a funner time with it."
61264,I’m playing it right now and I have a hard time liking it. It’s good in a lot of ways but also lackluster and mega wierd in so many other. I want to platinum it for my OCD but I pushed it so far back into my backlog god knows when I’ll manage.
61265,That’s not OCD.
61266,Without spoiling too much the platinum is extremely easy after your first play through. As in you can get all trophies you missed in a matter of like 15 mins.
61267,Yeah I’m aware of what makes it easy but I also understand that the there are 3 endings that are mandatory for the full story resolution. I mean I find the ideas in the story interesting but I don’t feel like doing everything 3 times either.
61268,Slightly misleading. You play through one ending. Chapter select the 2nd ending. And the 3rd is unlocked from doing the other 2. So one full playthrough and one 10min chapter select for 3 mandatory ending. Much easier than 3 playthrough.
61269,Wow really didn’t understand it this way. Does this not leave out a lot of important details?
61270,"No. There’s basically a choice you make right before the very, very, very end. Choose the first one, you get ending C. Then you reload from right before that choice. Choose the other on, and you get ending D. Once you have both C and D, then you get ending E, that’s the true ending and it’ll just play automatically for you when you unlock it. You don’t have to replay vast sections of an identical experience, they make it work."
61271,The story structure gets extremely weird. There’s multiple endings but it’ll never feel like you’re replaying the same part. It still feels fairly linear as you get through the multiple endings.
61272,Battle Chasers is a VERY underrated Turn-based RPG. I would highly recommend you look into it when you can. I dumped at least 110 hrs into it.
61273,"Witcher 3, ni no kuni , persona 5 and final fantasy 15."
61274,"Bloodborne 

Diablo 3 

Dark Souls Remastered

Witcher 3"
61952,Dragon's Dogma
61276,Yep this is an amazing game. Combat mechanics isn't soulsborne but holds up amazingly.
61277,Yep.... This....
61278,"Persona 5 and then the two Digimon Cyber Sleuth games, Both were fun AF even though i usually dislike turn based RPGs"
61279,"Because this thread is all the usual suspects:


**Battle Chasers Nightwar** and **Cosmic Star Heroine** are two awesome RPGs that use a similar battle system. It relies on combining attacks between your characters across multiple turns. They also have a cool system where you have to plan ahead which attacks you use because they become temporarily unavailable. Cosmic Star’s systems is particularly satisfying to experiment with.

**Deagon’s Dogma Dark Arisen** is the best action RPG on the PS4, hands down. It has combat the Witcher can only dream of, and a dungeon full of towering monsters with wild battle mechanics that makes the Monster Hunter grind look tedious. Add in a fantastic Pawn system that provides varied companion options built by the community and it’s something rather special, even if it is a remaster.


**Mutant Year Zero** is an X-Com style tactical RPG that has great presentation and some enjoyable battles. It’s not super long, but I enjoyed the time I spent with it and it’s not a full priced title.

**Earthlock** is a throwback to PS2 era JRPGs with western sensibilities. It’s not incredibly original, but the combat system is enjoyable and the stances make for some interesting mechanics. You can get it relatively cheaply and it’s competent enough to be worth your time. Cheery art direction."
61280,"That I've played would be FO4 or Witcher 3. That I know but don't own would be Skyrim remastered, DQ11, and FFX/X-2 remastered."
61281,Was going to pick up Ni No Kuni 2 tomorrow- does anybody recommend it?
61282,"Would also like to hear opinions on this one...I've been debating for a long time. Loved Witcher, liked FFXV, and couldn't get into Persona (anime stuff is not my jam). Did enjoy DQXI but tired of the music and stereotypical characters."
61283,"I've played maybe 10 hrs. It's a lot of fun, but I can't give the best review. Graphics can throw you off a bit but easy to get use to.  The characters are enjoyable and remind me of dragon quest games. Tons o' fun though. Lots of side activities to do like raising little spirit creatures and squad-based war tactics."
61284,"I certainly don't, massive let down."
61285,What makes you say that? Don’t want to drop $50 on it if there’s good reason not to!
61287,I’ve not played the first - would my lack of expectations as to what the game ought to be mean that I’d enjoy it? Seems like you dislike it because it deviates from the original? How easy is the game?
61288,Absolutely having a blast with this game. About 9 hours in. Lots of different mechanics but they all fit together and work nicely. The Studio Ghibli art style is phenomenal.
61289,Yeah great game! Especially if you like anime/cartoons
61290,It’s ok.  Not as good as the original
61291,The two South Park games.
61292,"Kingdom Come Deliverance: Unlike modern rpg's it doesn't hold your hand and actually FEELS like an rpg. I'd recommend it to anyone. It has issues technically but so does every rpg.


Dragon's Dogma: Just a strange rpg that i'd recommend simply for the weird factor."
61293,How does this play on ps4? I own it on PC and I have a hard enough time with archery with a mouse and keyboard. It's a great game; I just don't know how it plays with a controller.
61294,I think it's just one of those skills you have to keep using to get good with. I never used archery on ps4.
61295,"Depends on what falls under your understanding of an RPG. Some consider Monster Hunter an RPG, Nier: Automata is a jrpg. Those are two fantastic gamds. If that's not what you meant then I'd say Bloodborne."
61296,"Everyone's basically mentioned the big AAA RPGs already, so I'll just throw a few out indie/smaller games:

All 3 titles by Supergiant Games: Bastion, Transistor, and Pyre. All are unique games with good stories, fun characters and settings, and AMAZING music.

I would also throw Child of Light into the mix. Not an indie, but looks/feels like one. Great art style and another game with fantastic music.

&#x200B;"
61297,"Dragon age Inquisition, I know it's not the most popular but it's the one I've put the most hours on"
