idx,text
21655,I lost my shit when he told Eeyore how nice Tigger was looking today.
21656,"Poor piglet and eeyore, they're probably about to hang themselves since their friend is a douchebag."
21657,[Bonus strip for you.](http://i.imgur.com/6HNG4.gif)
21658,Stitches! Best one yet!
21659,God dammit pooh!
21660,Pooh's actually quite a lovely bear in A.A Milne's stories
21661,"Read them, they are my favourite stories"
21663,"Haha, yep.  Still bummin' around reddit."
21664,"Glad to see you're still here ""still bummin' around"" with the rest of us."
21665,Not that we give her much of a choice anyway.
21666,It says it was removed. What happened?
21667,That's a good one! I'm tagging her now
21668,Well he DOES wear his collar popped...
21669,Sheldon cooper as Winnie the pooh
21670,"Disney fuckin' ruined Pooh. The Pooh of A. A. Milne's books never would have said this shit. He was occasionally tactless, but not an ass."
21671,"The New Yorker [article](http://www.newyorker.com/reporting/2012/10/01/121001fa_fact_parker?currentPage=2) about JKRowling had a kind of funny/sad quote about Milne:

>In the decade or so after A. A. Milne published the “Winnie-the-Pooh” books, in the nineteen-twenties, he wrote several plays and novels for adults, as well as an autobiography in which he expanded on a thought expressed by a character in an Arnold Bennett play: that the artist who has early success with a painting of a policeman is expected to paint policemen forever. 

>Milne wrote, “If you stop painting policemen in order to paint windmills, criticism remains so overpoweringly policeman-conscious that even a windmill is seen as something with arms out, obviously directing the traffic.” 

>He added, “As a discerning critic pointed out: the hero of my latest play, God help it, was ‘just Christopher Robin grown up.’ So that even when I stop writing about children, I still insist on writing about people who were children once.”"
21672,more like winnie the dick
21673,"Definitely read the title as ""Whoa, Pooh has an ASSHOLE,"" and spent about 2 minutes scrolling up and down scrutinizing the drawings, thinking that must be a very discreet asshole."
21674,"I need to write a children's book: ""Everybody has an asshole"". Maybe my efforts will save other children from wasting their time trying to locate a bear's anus."
21675,I read all of those in Pooh's voice... some of them really didn't sound right.
21676,Almost all sound as if they were spoken by Sheldon Cooper.
21677,I don't get the last one.
21678,"Piglet is yelling in response to his echo instead of the echo being a result of his yelling.

This is logically impossible and, by the very fact that it has occurred, we can only infer that Piglet is a Time Lord posing as an incompetent, diminutive, cowardly creature in order to lull Pooh and his associates into a false sense of security before enacting an assuredly daring and improbable series of events that will, undoubtedly, ensure the continuing existence of reality."
21679,Ahhhh. Nice explanation. Thanks
21680,because the echo yells before piglet
21681,"The majority of these remind me right away of Sheldon Cooper, Oy, I need to get out more..."
21682,"Hmmm...not a shock. But sad to read. Pooh, it turns out, is a lot like my father-in-law. I thought he was novel in his ability to turn every seemingly nice comment into a twist of the knife but I see Pooh had the gift too."
21683,reminds me of the old peanuts comics from the 50s and 60s with lucy and charlie brown
21684,this is like the prequel to sheldon from BBT
21685,Disney Pooh is a fucktwat.  A.A Milne / E.H. Shepard Pooh is righteous.
21686,He's a POOhole
21687,Poor Eeyore :(
21688,You just successfully ruined my childhood.
21689,"Would you call Steve the Grizzly Bear ""Grizzly""? You would call him Steve. This is Winnie the Pooh Bear, his name is Winnie"
21690,"Well, Winnie the Pooh is supposed to be an [addict](http://www.omg-facts.com/view/Facts/3997) and to have ADHD. Though, I guess it doesn't entirely explain his asshole-ness.

In fact, [all the characters](http://www.cmaj.ca/content/163/12/1557.full.pdf) in the stories are supposed to represent some sort of psychological disorder, with Christopher Robin having a form of schizophrenia I believe.

Just kind of interesting IMO."
21691,Read the whole thing on Pooh's voice.
21692,"It's funny that, slowly, cigarettes are becoming more illegal and weed is becoming more and more legal. The world is balancing out."
21693,"Disney Pooh seems like a right twat.

AA Milne Pooh was a gentleman and a scholar.  Well, scratch the scholar."
21694,"ok, if you say so.

~~scholar~~"
21695,he's not an asshole; he's autistic.
21696,I sort of want to color these in using the paint bucket tool and then edit dolan in
21697,That was truly hilarious. I never knew Pooh was so great!
21698,"These are pretty hilarious.  They make him seem like such an asshole out of context.  If you read it in his voice, the way he would say it, it makes much more sense, though.

Whoever wrote these must normally write movies or shows.  It doesn't translate well as a comic at all."
21699,"I don't think pooh is mean. He's just very simple minded, so what he say is so straightforward it sounds mean."
21700,The king of subtlety.
21701,This makes me a sad Pooh bear
21702,"I read that as ""Pooh IN an ASSHOLE"". shamefully clicked it anyway.."
21703,Winnie the Pooh has always been my favourite Disney character :(
21704,The birthday bit with Eeyore kind of reminds me of Maeda in [Cromartie High](http://www.youtube.com/watch?v=361zil0iBUE#t=5m43s)
21705,I've been meaning to watch Cromartie High.. that clip clinched it for me.
21706,"dude, i'm not that bad."
21708,My Pooh!!!
21709,Right in the childhood.
21710,"So Pooh is a douche.
Piglet is nervous.
Eeyore is depressed.
Tigger is happy and energetic.
Rabbit is smart?
Forgot about the rest.

Allegory it is."
21711,"No, no, no, you're confused. Pooh comes OUT of an asshole."
21712,Is it weird that I love all things Pooh? This is no exception.
21713,"I actually found ""Don't worry, you've failed"" to be quite inspiring. Like, don't worry about being like everyone else- you're you. You're special <3"
21714,I hear the sound of thousands of redditors childhoods screaming in pain.
21715,Sass master Pooh
21716,[This one](http://i.imgur.com/IXTdWsn.png)?
21717,I am imagining winnie the pooh screeching like lemongrab in adventure time
21718,UNACCEPTABLE!!
21719,"I picture him saying that in his usual pooh bear voice 

Un-acs-sept-a-bub-bul"
21720,"Beautifully crafted, well paced, true to the source material AND bee facts? Perfection"
21721,Wait till he finds out that's a wasp hive
21722,So is it one sock day for Christopher Robin?
21723,The other one rolled down I think.
21724,Oh there it is!
21725,"Pooh needs to go to rehab. Or should I say 'beehab'...? 

...

I'm not very good at this whole pun thing."
21726,Haha he did a swear so it's funny
21727,Personally I think the comic would be funnier if it weren’t for the swears
21728,"I think it makes it better, since it's mixed with their usual phrases."
21729,Signficantly so.
21730,love it
21731,Another poor honey junkie.
21732,"Do you know da wae, mista honey addicted man?"
21733,he say the f word lol mental
21734,Why do people act like thats what the whole comic must be about?
21735,because it is
21736,"aYOOOO SO i finally got to post my own comic here :( - unfortunately it's already been seen so much so maybe it won't work aaahhhh  


 come find me here for 4 comics a week r/NelliesNest"
21737,"Sorry it kept getting reposted friend, fantastic work!"
21738,"It's the first time I see it. It's probably the best (and also the worst in a way) thing I saw today, so thank you for that."
21739,>!!<
21740,"Your art is truly disturbing, sir. You disgust and frighten me immensely and I love you for it. I did not think that I could find someone who made comics so deeply depraved that even I would get slightly uncomfortable, but I am impressed and traumatized. Have a great day and please do not seek psychological help until it is absolutely necessary, lest we might be deprived of the horribly worrying art of a truly deranged mind.

I look forward to seeing more"
21741,"I was like ""aw man, this fucking repost again?!"" but then I saw the name. You do some kickass and creepy artwork, thanks for sharing it!"
21742,"... All i saw, was a shitrain"
21743,"I hate you so much for combining Winnie the Pooh and Deliverance! 

I am absolutely appalled and when can I expect more?"
21744,"Ya know, I’ve had such a shitty hard day... but looking through your comics made it just a bit better.  Thanks lol"
21745,"I dont know, man. All i saw was a shitrain"
21746,Haha and now I’m laughing again.
21747,Is this hell? Lol fantastic work
21748,"I saved my upvore for you. And also, you're horrible and I hate it. Please don't stop doing this horrible thing. You're very talented."
21749,upvore...was that intentional? lol
21750,I can't believe you always type like that. Wtf.
21751,"Thanks, I hate it"
21752,I’ve subbed there before when someone posted your earlier work.  Amazing stuff
21753,I want to tile a backsplash with this
21754,Pls start a story with this
21755,definetaly do intend to my friend!
21756,This is beautiful.
21757,I love you but like in a sexual way. Wanna spoon?
21758,Fantastic wow
21759,Define-a-telly please do
21760,It’s a story about Asian politics I bet.
21761,i think this is ganna give me nightmares man
21762,You know... a lot of stuff on here I see the creepiness. Then this comes along and I really feel it.
21763,Creepy art but realistic bullying. This isn’t disturbing or weird. It’s just cruel. That makes it horribly effective
21764,There’s bullying and then there’s Buffalo Bill’s basement. This feels like the latter.
21765,… you’re not wrong
21766,Ok. This is this the forst thing on this subreddit that has actually made me feel uncomfortable. Jesus this is not the pooh bear I remember....
21767,"Oh man, you should check out /r/NelliesNest. It's got some great stuff."
21768,Ya me too...
21769,This is disturbing af.
21770,Xi Jinping isn't looking to good there.
21771,This comment was removed by the Chinese government
21772,-50 social credit
21773,Wow I'm going to be terrified to watch Pooh now
21774,"Please.... PLEASE tell me someone else thought Winnie was holding a honey condom.....

i only realized it was a pot when I took a second take."
21775,I love the facial expression in the last slide! Looking forward to the rest of the series!
21776,#WHAT THE ACTUAL...
21777,Poohbear: Unzips pants
21778,What country is Xi eating now?
21779,All
21781,The ones that are low on mask supplies
21782,"I like things I see in this sub, but this shit right here...I REALLY like."
21783,"Oh boy, this isn’t gonna end well"
21784,"Finally, the real artist of this strip"
21785,"In the best way possible 
What the fuck"
21786,"You okay dude? This is pretty dark and fucked up. Thanks for ruining my childhood. 


When’s the next one?"
21787,"You know, this comic has made me the most uncomfortable out of any post on this subreddit. Congratulations, you gave a grown man nightmares"
21788,"Holy shit my childhood turned into a nightmare...

I love it."
21789,Hopefully piglet escapes and kills pooh
21790,I applaud your belief that Piglet#000263 will finally be the one to break the cycle...
21791,This made me feel very uncomfortable
21792,This is the beginning of the bacon egg and cheese sandwich
21793,very into this.
21794,"This is absolutely fantastic. I just love the art style. You can almost taste Piglet, yourself."
21795,Thank you that's a dope compliment!!
21796,I'm definitely hearing pooh's usual voice while I read.
21797,"Nailed the Pooh dialogue, just what Pooh would say if he was some type of monster-fiend"
21798,"I think this happens on a daily basis and Piglet must relive being eaten by The Pooh every time he pops back into existence.

These are imaginary friends based on Christopher's toys. 

Christopher grew up and forgot his friends... This is what happens now, years later."
21799,I can't stop laughing at panel 4
21800,Genius
21801,Reminds me of SaladFingers🖤
21802,I can't help but read/see this as some sort of sex role play thing between the two.
21803,It doesn't seem consensual.
21804,"What
The actual 
FUCK"
21805,Jesus fuck.
21806,I need more
21807,......go on
21808,WHAT
21809,At the end I think it's gonna be so much better when we find out that piglet is the messed up n powerful ones and ends up torturing Winnie.
21810,"This made me uncomfortable.

Well done."
21811,Delightfully devilish Winnie
21812,woah xi jinping is not looking good
21813,I. Hate. This.
21814,Genuinely cursed.
21815,"So this has definitely happened before. He ain’t gonna eat him, just lick it off him. Hence the traumatic tears. Piglet knows what’s cumming."
21816,"Up until the last panel, Piglet just looks like he's so done with Pooh's shit.

""Aww c'mon Pooh, this is the third time this week you've done this""."
21817,Bleach? Anyone?
21818,Fuck you. Fuck whoever made this. Take my upvote and fuck you from the very depths of my heart.
21819,Jesus fucking christ
21820,"This js disgusting and I hate you but it looks like it took a lot of time to draw so have my updoot, please never make xi jinping so horrifying ever again"
21821,Xi jinping lost some weight
21822,"Hello! I was someone who commented on this post when it was *ahem* posted without your affiliation or even consent, and I just wanted to say I’m ecstatic to see it not only posted on the correct day, but even moreso posted by the proper creator. This kind of content is what this sub strives for, and the kind of horrifying subversion that this image portrays is critical to this sub’s success & growth.

It’s an amazing piece, and I’m ecstatic that I finally get to see *you* post it. And, as someone who’s been on this sub awhile, I can tell you that even though this has unfortunately been seen before on this sub due to certain unscrupulous individuals, I think this’ll still get the love it deserves :) If I can assure you of *anything* about this sub, is that people here don’t take kindly to art thieves."
21823,Not my proudest fap
21824,Pooh looking like the Newborn from *Alien: Resurrection*.
21825,This hurts my soul deeply
21826,I do not like the way this made me feel.
21827,The birthing is still in my mind
21828,r/imsorrypiglet
21829,Oh d-d-d-dear dear.
21830,"Oh man I love this, it's so disturbing yet, beautiful, does that make sense? Anyway. I really cannot wait to see your future artworks!"
21831,Im feelin so desensitized to this theme of art with the rise of Meatcanyon...
21832,I love the ears
21833,The fourth panel is the kicker here
21834,"I'm crying right now, I would be peeved!"
21835,Fucking nightmares for days. Take my invite you beautiful sick bastard.
21836,"Oh boy, colour me terrified!"
21837,It would be a lot in theme if Piglet would cut a piece of him for Winnie to eat.
21838,I love how half the people here think this is hilarious and the other half are horrified.
21839,This feels like the hundred acres variant of dolan and gooby.
21840,i think i’m going to barf this is disgusting
21841,Hahaha I laughed so hard! Takes such skill to show a character like piglet in such a state omg
21842,This is genius
21843,Hey bud... Are you okay?
21844,"All I hear is the original voice-over accents when I read this and its freaking me out!!

I love it ! Keep up the good work!"
21845,"More like ""I'm sorry reader"""
21846,"Overly long limbs are creepy, everytime."
21847,This is so fucking good!
21848,I’ve been wanting to see this comic develop since I first saw it
21849,My childhood...
21850,Imagine how Winnie would say all this has made me realise what a creepy voice he has
21851,Reading it in winnie's voice makes it way creepier
21852,I read the linking in Butters hurt dog voice.
21853,https://linksharing.samsungcloud.com/pOu6mJlUvq0P
21854,Is there a way to block a subreddit? I'm tired of seeing this shit.
21855,Too many watermarks
21856,"I hoped I was safe here, I thought you'd only corrupted Facebook...
None the less it is good to see you Nelly"
21857,This has some serious Meat Canyon vibes
21858,*unzips pants
21859,"Very MeatCanyon, good work!"
21860,Fuck i read this in john clements voice and now im sad
21861,"Jesus, you're as twisted as you are talented. Nicely done!"
21862,He’s so utterly terrified he can’t move
21863,Nothing captures the absolute hopelessness like slide 4
21864,#Dude what the fuck
21865,oh bother...
21866,"Damn, President XiJinping needs to eat more."
21867,This is scarring my brain.
21868,jesus fucking christ
21869,This is some Junji Ito quality shit right here
21870,I read it in their voices... It makes it worse.
21871,I love the subtle watermarks. It's like a little game finding them
21872,Mother of God...
21873,This is profoundly upsetting.
21874,I hate that I love this so much
21875,what kind of psycho would come up with this
21876,"Anyone else feel like piglet is just totally done with poohs shit. Pooh comes around every day and smothers him in honey, threatens to eat him then leaves.

And piglet just sits there with that bored expression on his face."
21877,"My God... this is it. This post right here is by far the most fucked on this sub.

Edit: Discount Gold! 🏅"
21878,0_0
21879,This is fantastic. I've been waiting for the real post to upvote it properly.
21880,Bro WHY are all the comics you make so cursed man it hurts 🥺
21881,I love how you can just see a small house in the background of the fifth panel
21882,т прнс?
21883,This is beyond revolting. Congratulations.
21884,Dude wtf. This is fucked up. I’ve been on this sub a while but this one straight creeps me out. Good job.
21885,Top notch shit dude. Truly disturbing.
21886,Nice. Finally the OC and not another asshole stealing it. This one has the last 2 panels too unlike the stolen one from Thursday.
21887,Weren't there 2 panels before this? I remember this being slightly different
21888,"Pooh, buddy, you need two slices of bread on both sides to make a sandwich"
21889,Incredible
21890,u/Vredditdownloader
21891,How can I give you credit for this *masterpiece*?
21892,"It's sick, it's depraved, and it's a sign of the moral degradation of humanity... And I absolutely fucking love it!!"
21894,he doesnt seem very sorry at all
21895,Why do people have to hurt Winnie the Pooh? Winnie the Pooh is the most pure creature ever. Leave him alone
21896,This is actually terrifying. I love it an unreasonable amount
21897,nelly ur the only person who consistently creates art that makes me uncomfortable on a primal level
21898,I hate this so much
21899,this makes me genuinely uncomfortable. great work.
21900,Jeez ok I’ll follow lol
21901,Is poo supposed to look like a wendigo from fallout 76
21902,Holy shit dude.
21903,I fucking love this
21904,This shit made me extremely uncomfortable but I loved it. Write a story with these.
21905,man i wanna group that poohs tits
21906,This content
21907,who hurt you
21908,Holy Christ.
21909,why does piglet look like will ferrell in the second to last panel
21910,This is so deeply upsetting to me
21911,Alright. . . That's enough reddit for today.
21912,"So creepy, Love it!!!"
21913,The true monster was piglet
21914,"I almost said ""hey! That's stolen from Ne-oh never mind"""
21915,"I fucking hate this. I checked out the sub mentioned in here and I fucking hate that too.

Good job."
21916,So ummm I read this with their voices in my head and it makes it very light hearted imo believe it or not
21917,nellie has left the nest... will he learn to fly?
21918,"In his dying moments, Piglet did the one thing he knew he could do. He took some honey off of himself and used it to make a smiley face on the piece of bread, much to Pooh’s confusion but whatever he wasn’t going to let that STALE move throw him off."
21919,"This feels like he will either fuck him or eat him, like a very twisted fetish. Great"
21920,[Were they like this?](http://imgur.com/r/tumblr/Ecq5OIa) I can't find any other comics but I think this is the artist. http://iguanamouth.tumblr.com/
21922,LITERALLY LOVE COLIN FIRTH and this warms my heart!!!
21923,"Gene Wilder, but there’s a story behind this...

I worked at a pharmacy in the ‘80s and was asked to deliver medicine to Gilda Radner (Gene’s wife) during her cancer battle.  After a long delay to make the delivery due to issues related to the getting in touch with her doctor, I was finally given the prescription and drove up to their house to make the delivery.  During my drive, I was excited at meeting one of the brightest comedy stars of the time...

When I arrived, I rang the doorbell and Gilda answered.  I knew she was sick, but even I was surprised at her gaunt appearance - she did not look well at all.  Immediately, I realized she was very angry because of the long delay in getting the medicine to her.  Unfortunately, she let loose all that anger at me.  I apologized many times (even though I had nothing to do with the delays).

After she finished and I gave her the prescription, she closed the door on me.  I was not upset at her, though - indeed, I was very sad - that this brilliant comedienne was sick and was going through such an absolutely awful ordeal...  This was an awful situation and not at all as I had hoped my encounter would go.

As I turned around to walk away from the door, I went several steps before I felt someone tap my shoulder.  I turned around and it was Gene, letting me know that his wife was very sick and he apologized many times for her behavior.  He then gave me a nice tip for the delivery service and shared his gratitude for the weekend delivery and work by my pharmacy.

I'll never forget the encounter and appreciate that I got to meet both of them, even for a brief time, under difficult circumstances..."
21924,It says a lot about you that you were able to see through her anger and have compassion for her. It sounds like your tip was well-deserved.
21925,This is a very nice story. Thanks for sharing.
21926,Ian McKellan sat down on some empty theatre steps with me and engaged in a whole conversation. It was awesome and I will never forget it!
21929,"He visited my best friend's nephew on the burn unit when nephew was 8. Nephew nearly died, had 2nd and 3rd degree burns over 80% of his body. LL Cool J visited and kept in touch for a while after.

Not my style of music, at all, but I will always be a fan of the person he is."
21930,LL Cool J was the balm he needed.
21931,LL Cooling Gel
21932,Weird Al. I've met him twice and both times when he looked me in the eyes it felt like he was hugging my soul.
21933,"Met him at a film screening a few years ago - I've been a fan of his since I was 8 and he's legitimately an influence in my own music/comedy.   


I saw him when I sat down which happened to be right in front of him. I heard him introduce himself to some older ladies who had sat next to him, just very genuine like ""Hi, I'm Al!""   


I turned around and said hello, said I had just seen a show at the Greek and said it was great, and said this is a great moment of my life and he cracked a joke and said something like ""well I guess your life hasn't been THAT awesome!"" or something like that. We took a selfie and shook hands and it was awesome."
21934,"Met him in '07 after a show during his Straight Outta Lynwood tour and 12 year old me was so star struck, I couldn't stop looking at my hand after he shook it."
21935,"I checked John Mulaney into a hotel room once. He wanted to pay for someone else’s room so he was at my desk for like 5 minutes while I set that up. He’s a genuinely nice guy.

Edit: BuzzFeed stole my comment for a listicle and this is the most famous I will ever be."
21936,I rang him up at Best Buy once and he wouldn’t stop raving about the rewards card
21937,...jesus christ...
21938,YOU’LL NEVER GET THAT BEST BUY REWARDS CARD!!
21939,"Oh man I wish so much this were true!!! Even if it isn’t, super nice reference, loved it :D"
21940,Are you sure it was John Mulaney? Might've just been a tall child.
21941,With feminine hips?
21942,I love John Mulaney! I’m glad to hear he’s nice in person
21943,"Alan Alda. I was at one of his book signings and I was so nervous to the point that all I could say was, “I love M* A* S* H!” And he took my hand for a second and made a joke about being surprised I knew about the show because I was young. Once I got past my absolute embarrassment, I realized he was so gracious and patient with me when he could have easily been a jerk. Great human being."
21944,Mr. Rogers. Absolutely as kind and gentle and lovely as he seemed on TV.
21945,"I was lucky enough to spend 6 hours sitting next to the man on an airplane. I was 7. Highlight of my life.

We ate lunch. I spilled on him. I thought I had ruined everything, but he just smiled and gave me his dessert."
21946,"Being from the Uk until I got on reddit I never had any idea who Mr Rogers was but everything I read and see just makes him seem like the nicest guy you could ever wish to meet and a national treasure


We ended up with Jimmy fucking Savile!!"
21947,:’)
21948,"Oh man, I’d give ANYTHING to go back in time to meet that blessed, wonderful man that was Mr Rogers 😭"
21949,Peter Dinklage is a lot of fun! Really cool guy. His laugh is incredibly infectious :D
21950,"When I met him, he seemed a bit overwhelmed by the enthusiasm around him, but he was still great. He wanted to take silly pictures with me and I was like, “HOLY SHIT TYRION WANTS TO TAKE PICTURES WITH MEH.” Great dude."
21951,"He and I had a funny encounter. We were both at a coffee shop in the Bowery at like 6:30 AM. We were the only ones there. He'd ordered a fancy drink of some sort so had to stand there and wait. I ordered a filter but it was a long process pour over type thing.

So he and I were stood there next to each other for 3-4 minutes. It was awkward because I don't really talk to celebrities / public figures. But at the same time it was weird because it was just the two of us and it was obvious I knew who he was.

In the end I gave him the chin nod. He winked and gave me the chin nod. That cleared the air and we were able to get on with our day."
21952,"Really the only answer is the chin nod at that time of day. I used to see famous people in NYC when I lived there in my 20's. I made a point to use the chin nod all the time, I would never, ever say a word to them. That's until I saw Sean Penn piss on a fire hydrant and I had to yell out, ""Nice dick!"" At least I think it was him, the group I was in seemed to agree."
21953,"Dave Chappelle and his family live a few miles from where I went to college, and he and I frequented the same Starbucks. I ran into him about ten times. One day he sat with me for about 45 minutes and talked about screenwriting. It was amazing. He’s as down to earth as his stage persona suggests, and it’s no wonder he opted to raise his family away from L.A."
21954,"Given that at the height of his fame, he took time out, i can totally see that, anyone who would halt the lure of fame & money to take back their equilibrium & look after the well being of themselves & their family sounds like good people to me."
21955,Yeah people talked about him turning down $50 million as if he was penniless. He was already rich. Good for him.
21956,"Mine is dave chappelle too. I was in a college group that brought in speakers and performers so we brought him in. After his act we thought he left, so we started eating all the trays of food in his waiting room. He poked his head in and joked that we were hotboxing the room. Then he came and sat with us for an hour! He sat next to me, and when I told him it was my friends birthday and this friend was a big fan, he took my phone and called this friend and talked to him. It was amazing. This was 2005, I think right before he took a big break from everything."
21957,"Having met **Hugh Laurie** in person, I can confidently state that he is one of the nicest and most humble celebrities out there. Not only is he completely happy to interact with his fans, but he also does so in a way that makes each and every one of them feel like they're a friend. He remembers names and personal details with amazing accuracy, and he makes each conversation seem like it's an extension of a treasured (and ongoing) dialogue. Add to that the fact that the man is outwardly hilarious, and you've got a recipe for a genuinely great guy."
21958,he was phenomenal in House MD. love that guy
21959,"Brother in law is a pilot who gets occasional celebs on charter flights. His go to answer is Henry Cavill's dog. (Henry Cavill ranks close second, due to his willingness to let flight crew pet said dog)"
21960,"My sisters met Sofie Turner, I had just left to go get something to eat and she apparently lined up to do zip lining behind them. They were so amazed they met Sansa Stark and showed me the picture. I'd heard she was in town filming and that she as with Joe Jonas and realised from the picture angle someone else took it. Asked them who took it? Some dude she was with.... I laughed so hard I cried when I explained it was Joe Jonas and they felt so embarrassed and shook. They said he took it like a champ and took thier picture with her and then small chatted a bit about stuff to visit in the city. 

Also met Matthew McConaughey at a beach bar I worked at. He came in with bongos and sunglasses at 8pm on our busiest night and sat alone in a corner. When the drunk guy next time home turned finally and asked ""Arent you the McConaughey guy?"" He laughed and bought everyone drinks. Then proceeded to drink some more, took his shirt off at some point and played bongos with band."
21961,"Drunk McCanughy on bongos?

That's fucking awesome."
