idx,text
8096,"You, I like you."
8097,"Nope, I feel as though the other guys were bought off by big toothpaste a long time ago. WAKE UP SHEEPLE!"
8098,"Not sure if this is true, but I heard that back when they first started making toothpaste with fluorine, 9/10 dentists recommended it. So when the commercials say that 9/10 dentists recommend this product, ""this product"" is actually any toothpaste containing fluorine. They just make it sound like its their specific brand."
8099,"That, or if they have to do a new survey they can always phrase the question as ""As a dentist, would you recommend that people use Colgate DentiPlus White Freeze Extreme, or that they don't brush their teeth ever and gargle Coke twice daily?"""
8100,"I'm seeing an almost uniform agreement that ""It doesn't matter"". So, I'll be getting that brand on my next shopping trip"
8101,Id accept a 4/5 ratio I guess if I had to.
8102,"Seriously, how is it possible that so many commercials can say this? Isn't it lying?"
8103,"Toothpaste brands are all very similar. No one is over the top better than the rest. Toothbrushes, however... Buy a sonicare, they kick the shit out of every other electric toothbrush. Credentials: just asked my dad who has been a dentist for 35 years."
8104,My dentist said that sonicare is the ferrari of toothbrushes.  I love mine.
8105,You mean they have to check my bank balance before i get to buy one.
8106,$50 for a basic one isn't so bad.
8107,Let me put it in perspective 50 double cheeseburgers or 1 toothpaste
8108,I would prefer 1 toothbrush instead of 1 toothpaste dude
8109,You have changed my whole view of the world
8110,/r/im14andthisisdeep
8111,In his head it sounded OK i guess.
8112,"I'd rather have 50 cheeseburgers, which I can then sell to buy a toothbrush and toothpaste!"
8113,Cheeseburger resale sounds hard.
8114,What would Randy do?
8115,A man's gotta eat
8116,He would host a cheeseburger picnic
8117,"You probably mean McDoubles, as double cheeseburgers are a little pricier, and they just raised the price on the mcdouble too.  So you might get 40."
8118,How much is that in beers?
8119,"They have an even more basic model for $30. 
I've been using that one for two months now and the last time I went into a dentist, they told me I didn't need to schedule a teeth cleaning. That has NEVER happened."
8120,"I got mine for $40 on Amazon. The Essence model, I believe."
8121,"I got one of their models that is like.. $110 or $120 for $70. I have amazon prime so I got a better deal, plus free shipping, and when I went to buy it there was an extra $10 instant electronic coupon. My teeth feel so awesome and clean now!"
8122,My dentist gave me one for a Christmas present.
8123,When I tell people to get a Sonicare they always say they have that Oral-B thing.  I go on to explain that it is not the same but I fell it falls on deaf ears
8124,Can I buy a sonicare at Walgreens?
8125,"I got mine years ago at a Kroger in a small town.. so probably yes.

It has totally changed my dental cleanings... before the Sonicare I was usually scheduled for 30-45 minutes because I just wasn't that good at brushing and can't get it together to floss (partly because my teeth are close together). Now it always takes 15 minutes.. they still admonish me about flossing but I'm always amazed when we're done."
8126,"Man, can't wait to get me some dental insurance. I haven't been in like 15 years. My wisdom teeth are all kinds of problems, I tend to not chew on the right side of my mouth because its uncomfortable"
8144,Is there any version of the Sonicare that is recommended?
8128,I wonder how an electric toothbrush like this compares to soft bristled nonelectric ones.
8129,"It's all about the user according to every study. many studies show poor cleaning by many with the electric because of bad technique or impatience. Thorough manual brushers who are thorough fare the best in tests.  
There are many. I am not choosing one from google to post, as I do not have the time to review the 50 or 70 tests to claim any respect for their methods. They all come out similarly."
8130,"When I went to the dentist for the first time in about 6 years (insurance!), the tech seemed downright disappointed that my healthy gumlines were the result of years of manual toothbrush use. It was bizarre."
8131,"Same. I'd been told the year before to go buy an expensive toothbrush. Read up on some stuff on the internet and changed my brushing technique, included daily flossing and mouth wash. No issues were found this year!"
8132,"*Electrifying*

It also doubles as a good ~~vibrator~~ mouth massager"
8133,Note to self: Never use /u/Nellek_God's toothbrush.
8134,Note to self: Use /u/Nellek_God's toothbrush.
8135,I think we've covered all the bases here.
8136,"No it doesnt, not nearly powerful enough. There are vibrators that use a more powerful version of the sonicare tech though"
8137,"So you are saying, we can make a MORE POWERFUL toothbrush by combining the power of a vibrator with a toothbrush? We should call it, the pleasure-brusher 3000. :D"
8138,It's a wonderful time to be entering the fast paced field of teledildonics
8139,To me it was a night and day difference; the electric was way better (and I didn't even have the soniccare brand)
8140,"I switched from a sonicare to a normal toothbrush while away at school... went home for winter break and oh my god, my teeth felt so clean using that sonicare."
8141,"That's kind of true, but it also depends on what you are trying to achieve. If you have sensitivity you should use sensitive toothpaste (ie. Sensodyne or other tooth paste specific for sensitive teeth and there are different ones with different mechanisms which I will not bore you with), if you want your teeth to be 'whiter' get a 'whitening' toothpaste (I put it in quotes BC it's not physically making your teeth whiter, just removing surface stain better), if you get cavities easily use a toothpaste with higher fluoride content (ex. Colgate prevident 5000), and if your teeth are just normal you can pretty much use whatever you want (preferably with fluoride in it) and for god sake, please floss!"
8142,">Overall, this study demonstrates that long-term use of these two electric toothbrushes improves periodontal health in adult periodontitis patients, and that the Sonicare brush is superior to the Braun brush in reducing gingival inflammation and probing depth. Moreover, 6 months' use of Sonicare led to actual improvement in probing attachment levels of periodontal pockets.

http://www.ncbi.nlm.nih.gov/pubmed/9487838


I think this proves your dad is correct."
8143,"My dentist recommended an Emmi-Dent.  He didn't sell them either, he told me I could get the best price from Amazon of all places.  I REALLY like it.  If I brush slowly like the directions say to, it really feels like I just left the dentist.  It takes longer to brush, about 5 minutes vs 2, but I am happy I made the switch, it's also about as expensive as a nicer sonicare."
8145,Dental student here. We got a toothbrush from sonicare and oral B. Both seem pretty similar to me but the oral B one seems to be a lot more harsher and I think might do a better job stimulating the gums. But I like them both.
8146,"I have a sonicare, but I hate it, electric brushes tickle the shit out of me and I'm always in tears by the time I'm done."
8147,"My dad was a dentist. We used Crest because Crest gave us enormous amounts of toothpaste for free. Like big cardboard boxes of a million tiny Crest tubes.

But as my dad would say, ""it doesn't matter, just make sure you floss, [long comma,] you [bleep].""

edit: edited for extra clarity."
8148,I read that initially as 'floss your asshole'...
8149,so wear thongs?
8150,You mean that's not what he meant?  Boy have I wasted a lot of floss.
8151,That's what a toilet brush is for.
8152,I really wish they made those with softer bristles
8153,That's what he told his wife.
8155,"In one hole, out the other."
8156,Is it supposed to come out bloody?
8157,delicately.
8158,Swallow a really long piece of floss and then wait.
8159,G-string
8160,"My experience is similar, my grandmother is a dental assistant. The difference is that she can get me ALL OF THE toothpaste for sensitive teeth that I could ever possibly need."
8161,"OH THAT'S RIGHT.

MY CHILDHOOD ALSO INVOLVED LOADS O' SENSODYNE.

this is like remembering a long lost brother. I haven't thought of that name for so long."
8162,"Both my parents are in the dental field, we use Crest."
8163,Ask your parents if some patients lick their fingers as they touch their teeth.
8164,"My dentist uses metal tools instead of their fingers. But I would TOTALLY lick their fingers, just out of reflex. If a hand comes near my mouth I lick it."
8165,">If a hand comes near my mouth I lick it.

You should definitely not take up boxing."
8166,*licks fingers*
8168,Wut.
8169,It's those feathers on a bird's head that go woosh! when they stand up.
8170,"Military here. I work in a dental unit. 

To be honest they don't worry about type of toothpaste too much.

Any toothpaste with flouride if you are cavity prone.

Sensodyne if you don't have cavities yet have Sensitive areas.

The brush itself and flossing is more important. Always use a soft bristle brush. Your layer of enamel will not grow back if you wear it down. Brush at least twice a day. 

In the morning, eat and drink before you brush. Why brush if you just coat your teeth with food again? If you drink anything acidic rinse with water to get it off your teeth.

Floss before you go to bed. Always. No exceptions.

Chew gum with xylitol throughout the day after you eat. 

Invest in a sonicaire if you can. The difference is mind blowing and you'll never go back to a regular toothbrush.

Beware soda and other high sugar drinks. If you must partake drink it fast and rinse then chew gum

Be careful of whitening agents. They open ""pores"" on your teeth. If you are partaking too much in staining agents it will have the opposite effect.

Tldr - Doesn't matter too much if you're still brushing and flossing."
8171,"I have both a sonicare and a regular electric toothbrush, and can't make up my mind which is better.  Why do people swear on the Sonicare?  Is it just because its the ""Trendiest"" toothbrush now, or because it's people's first electric toothbrush.  My theory is that any electric toothbrush is 100x better than the manual kind, so sonicare or the standard kind are both fine."
8172,are you telling me you floss when youre piss drunk and ready to pass out ?
8173,"By flossing, is regular flogging what is best, or can just using a couple of floss sticks to get between all of the teeth to work just as well?  

I'm an uncoordinated doof, who can't seem to be do a really awesome flossing job without causing gum bleeding.  But with those sticks, i feel like I get more control."
8174,"Regular flogging should work, so long as you do it with a quality beaded whip and do it in public to increase discipline amongst the citizens."
8175,Apparently my auto correct sort of outed my love of flogging my gums.
8176,Bleeding is a sign of poor gum health. It's a sign of infection. Continue to floss regularly for a week and I guarantee you will not only get better at it but you will no longer bleed. You need to get in those gums and between you're teeth. Floss and brush regularly and you won't bleed!
8178,"From what I've been told and read, those floss sticks should be for out and about and convenience. Using them to floss regularly just kinda spreads bacteria around, unless you use a new one every few teeth."
8179,"I'm curious, whats the difference between Oral-B and Sonicare? There's only 1 electronic brand available in Taiwan, and it's Oral-B. My last sonicare I got from the US I had to toss since I couldn't buy any replacement heads for it. Would you recommend getting any electronic toothbrush compared to regular toothbrushes, or stick with a regular soft bristle toothbrush if Sonicare isn't available?"
8180,"My mommy is a dentist, she says toothpaste brand doesn't matter but you should brush and floss 2 times every day and use a soft bristled toothbrush."
8181,Sounds like she should do more commercials.
8182,As long as she isn't in Canada. Real doctors/dentist cannot legally be in a commercial.
8183,Huh. TIL.
8184,That...explains a lot?
8185,"Why are soft bristle's better than harder bristles? I've tried softer ones, but I've always felt that even though the bristles move around more, they can't get any grime off my teeth. Is the flexibility that important?"
8186,"That's what my dentist said.  It's more about gums and getting that area right where the teeth emerge. A hard bristle can irritate the gums causing them to swell a bit and prevent proper access.

I have really bad teeth and I also swear by a flosspik."
8187,"A hard bristled toothbrush, or medium for that matter can damage the gums by causing them to recede (pull down from the tooth and expose the root).

Dental hygienist here."
8188,And they'll abrade more enamel off your teeth.
8189,So your bad teeth are a testament to flosspicks?
8190,No. I have bad teeth due to a variety of reasons so I have to take extra good care of my teeth. I have found the flosspik to be very effective.
8191,"I believe the reason they recommend soft bristled is because hard bristled toothbrushes can erode tooth enamel. Its the same reason they say don't brush within an hour after you eat. The acid from the food will soften the enamel, and your toothbrush will just take it right off. Once you lose your enamel, you don't get it back."
8192,That and my dentist told me it hastens gum erosion.
8193,Mommy? Are you old enough to accept the Terms and Conditions at Disney.com?
8194,Could be a nonnative English speaker.
8195,"With the username nickel pinching jew, I'm pretty sure he speaks english"
8197,And I'm proud to be an American.
8198,You and your mommy?
8199,"Floss *twice* daily? 

What food is getting trapped in my teeth between my going to sleep and waking up?"
8200,"The meat fairy sneaks into your room at night and shoves BBQ pork ribs down your gullet while you sleep.  Everyone knows that.  Fun fact:The meat fairy looks an awful lot like my uncle, its uncanny."
8201,After lunch and after dinner...
8202,My dentist once told me that it isn't even the brushing that is the most important.  He said I would rather you floss and not brush than brush and not floss.  We were talking about how few people floss their teeth.
8203,Dissolve a Reese's peanut butter cup in some cherry coke.
8204,AMA request: the fifth dentist
8205,Paging /u/the5thdentist
8206,"I'm a dental student. Yeah it doesn't really matter, as long as it contains fluoride. 

Since you asked, I use crest pro-health, but use whatever you like. 

And floss, you lazy fucks."
8207,"> And floss, you lazy fucks. 

I floss about 3-4 times a week. My teeth are in bad shape because I have very little enamel left on them from years of excessive Pepsi drinking, but my dentist says he can tell I have good hygiene because I have so little plaque. Flossing FTW."
8208,ITT: no dental experts
8209,ITT: My parent is a dentist...
8210,"My mother's roommate in college married the nephew of a woman who briefly dated the cousin of a dentist, so I think I'm qualified to give advice on this topic"
8211,Yo mama's a dental expert!
8212,*oral
8213,something something dental dam
8214,Oooooooooooo
8216,I always heard it was vets
8217,Where did you get this information?
8218,"Didn't you know? Reddit are experts on Statistics, 67% of the time."
8219,I'm actually a dental experts in disguise see? You should use Colgate because Darlie can Fresh&White your teeth.
8220,"If you want advice from an actual dental expert, here you go. First of all, like many on this thread have said, Sonicare is the way to go. It will reach deeper down into pockets in your gums better than any other. Along the same lines, brush your gums, not your teeth. Focus on placing your Sonicare right along the gumline, and your teeth will still be cleaned as well. If you do indeed have an electric toothbrush, don't move it around as you brush, let it do the work. Place it along the gumline and keep it still in each spot for at least a few seconds.

As for toothpaste, I prefer ProNamel. I get a lot of canker sores, which can be caused by Sodium Lauryl Sulfate, an ingredient used to make your toothpaste get sudsy (your shampoo too). While it does not help clean your teeth, it makes people feel like it does, so it is included in most toothpastes simply for this reason. Sensodyne products including ProNamel do not have this ingredient. There are only a few brands with a toothpaste that does not include this ingredient, so if you get canker sores often, read the label before you buy. However, if you do not have sensitive teeth or get canker sores, most toothpastes will do the trick just fine. Except Crest ProHealth. It doesn't actually clean very well. If you are prone to cavities, get something with extra flouride, such as Flouridex (you may be able to get this from your dental professional). 

As others have said, flossing is very important. Even with a Sonicare, plaque can still be left behind that only floss can get. If you have a history of gum disease such as gingivitis or periodontal disease (my specialty), there are a few things extra you can do to help save your teeth from costly repairs or replacements. Buy a WaterPik (they're about $50). I have seen shocking improvements in pocket depths and infections of the gums by simply using a WaterPik. Also, floss well and use an antiseptic rinse. Look at the label, because many brands such as Listerine offer a flouride rinse that will help prevent cavities, and an antiseptic rinse that will help clean out gum pockets and prevent infection and bleeding."
8221,"Wow, my dentist would have charged me 60 bucks for a consultation of what you just typed. Thanks internet!"
8222,"You're very welcome! I'm glad to help someone make the right choices about their dental health! Even if some upgrades (like purchasing a Sonicare) cost money now, they save you a ton in the future! And seriously, consultation charges are outrageous, right?"
8223,Betel Nut is how I take care of my teeth...why? [Im glad you asked.](http://i.imgur.com/aRu9L.jpg)
8224,Know a Mentat by the red stains on their lips.
8225,"you and rest of my moms family. 

source: Mom's said is Taiwanese and betel nuts are like crack to them."
8226,"If you get mouth ulcers, avoid toothpaste brands that contain Sodium Lauryl Sulfate. It's significantly reduced my outbreaks."
8227,What are brands that are SLS-free?
8228,glisten
8229,who left the cap off my fucking glisten.
8230,Dental experts: Any opinion on NovaMin? I heard it's a bioglass that's supposed to rebuild tooth enamel in a different way than fluoride. I'm currently using Sensodyne repair and protect with 5%w/w NovaMin and 0.104% w/w fluoride.
8231,"Where are you finding it? I bought 4 tubes of the Burt's Bees with NovaMin and burned through all of them, and then found out that everything with NovaMin has been discontinued because GSK would rather make more money by selling it as prescription only. 

I'm not a dentist, but I did a fair amount of research and it seems that NovaMin does indeed rebuilt enamel, and fairly well. Fluoride doesn't actually rebuild enamel at all, it simply hardens the enamel that's left to protect against erosion."
8232,"I'm a dentist and yes it is true brushing and flossing is THE most important part.  There are different types of ingredients in dentifrices (toothpastes) such as stannous fluoride that can be more abrasive as in the Crest TotalCare line, so not recommended for people with recession or sensitivity.  

Pro tip: if you have sensitive teeth Sensodyne is not the only brand for that, the active ingredient is potassium nitrate and is in a number of other dentifrices that are a little cheaper."
8233,He says dentrifice instead of toothpaste so you know he's an expert.
8234,"Straight white Colgate. Best shit ever. Got every blemish, rubber mark and grease mark off my old ass car. Shit works better than an SOS pad with no scratching."
8235,"If you're prone to canker sores use Toms. It's twice as expensive but it works. The foaming agent in other brands can cause canker sores if you're already prone to them and is unnecessary because the foaming is only there because people think it does something. 

My dentist recommended it and I previously had at least one at all times. Now I only get them if I bite my lip/cheek or if I don't brush my teeth."
8236,I don't think that's how cold sores work. I'm pretty sure you're confusing them for canker sores or mouth ulcers.
8237,You're right. Fixing it now.
8238,"Nothing like old school.

Get your self some chicken crap. Works wonders.

(1 out of 10 agrees.)"
8239,"Not sure about dentists, but I switched to Pepsodent awhile back because it's cheap as hell (89 cents) and I figured ""it can't be THAT bad"".

Holy shit, though, it's the best toothpaste ever.

It tastes like minty Root Beer and (surprisingly) whitens my teeth better than the fucking Crest toothpaste I paid $4 more for."
8240,Nutella.  Not a dentist.
8241,I actually am pretty close family friends with a dentist and oral surgeon. He said that it isn't the paste as much as it is the brush. Any paste can work but a good electric brush is the best for your teeth.
8242,"I would recommend something like my Sonicare. Just hide it from you daughter. I recently fo0und my in my daughter's bedroom. Not sure why she would want to brush her teeth in bed but at least our dental bills will be lower, I hope."
8243,"I'm not a dental expert, but I'm a believer in Xylitol, and make sure my toothpaste (& chewing gum) has it."
8245,"Best post in this thread.  Granted, dentists are probably the WORST people to ask for oral care.  That would be like asking a mechanic to recommend an oil for long engine life.  They're technicians, not researchers.  The fact that everyone here says ""toothpaste doesn't matter"" confirms this in my eyes.  

Xylitol kills bacteria that cause cavities (caries).  There are so many studies that have shown significant decreases in cavities after xylitol administration (gummy bears, gum, etc):

http://jdr.sagepub.com/content/92/6/512

http://www.massdental.org/uploadedFiles/5_Publications/Journal/Summer_2011/S11_Xylitol.pdf

I remember reading one study showing it worked better than fluoride at cavity prevention.  I can't seem to find it right now, but if I do I will post it."
8246,"It's getting harder to find.  I think Trident used to have more when I was younger, but a lot of the brands seem to have increased the sorbitol and may have a token bit of xylitol just for labeling.   There are a lot of good options on Amazon though.  Spry's berry mints are great."
8247,"Toothpaste doesn't matter too much, as long as it isn't the hippie brand that tastes like ass and doesn't fight cavities. (You want fluoride)

Get a sonicare! The only problem is trying to travel light and going back to a regular toothbrush. Your teeth simply do not feel clean with a regular brush."
8248,Neem tree for the win!
8250,Why don't you use spaces after punctuation? I've seen people do this occasionally and I've never understood why anyone would do that. Almost as bad as people who capitalize every single word.
8251,What.You.Gonna.Do.Mate?
8252,"Nice try, Councilman Jeremy Jamm"
8253,"In general, it IS good not to rinse. Just curious - what happened to your molars that fucked them up from leaving toothpaste longer there?"
8254,"You shouldn't blame the advice. You should blame the people who use the advice.

Source: The great gun violence debate."
8255,"You just tied in an irrelevant argument to this comment.

Kudos."
8256,My dentists usually recommend Colgate Total
8257,Burt's bees toothpaste with novamin in the afternoon and Clinpro at night. Soft bristled manual brush.
8258,"I fucking love useful threads like this.

don't fail me guys."
8259,http://www.ncbi.nlm.nih.gov/pmc/articles/PMC3053508/
8260,"Mentadent.  

Sweet-ass dispenser."
8261,"My best friend's dad is a dentist, and I actually asked him this question a few years ago. His answer: modern toothpastes are all held to such a high standard that you really can't go wrong. It's more important that you brush properly and floss regularly."
8262,"I regularly floss once in a while, does that count?"
8263,"no, you have to do it twice in a while. At least 4."
8264,Every check up my dentist asks me when was the last time I flossed totally forgetting he was there
8265,this is a good one
8266,"It's an old Jeff Foxworthy joke. 

Dentist: ""When was the last time you flossed?""

""Let's see... The last time I flossed... *you did it.*""

Edited for clarity"
8267,â€œYou only have to floss the teeth you want to keep.â€
8268,"Be true to your teeth, or they'll be false to you"""
8269,"I don't floss, should I be concerned?

Edit: so, I should be concerned."
8270,"Yes, not just because of tooth decay, but because you are leaving rotting food in your mouth. I am bad about flossing every time I brush, but I feel gross if I wait more than 24 hours. Chances are on the occasion you do floss, the floss smells gross after using it, because you've left it long enough to fucking compost between your teeth. When you floss regularly, you don't have stinky rotting shit coming out when you do. You should floss at least as often as you wash your dishes. If you haven't removed the old rotting food from your teeth, why bother removing it from your plates and silverware?"
8272,"That's how I roll. If I can feel something in between my teeth and can't get it with my tongue, out come the floss picks. Which are fantastic by the way, I could never get my back teeth with the loose string."
8273,"I honestly wouldn't floss had I not discovered floss picks. It's so much easier and quick. I keep them in sight, so if I ever go into the bathroom for whatever reason, I might just floss for the fuck of it since it's such a quick process."
8274,">You should floss at least as often as you wash your dishes.

So like once or twice a week?"
8275,"Good thing I only use paper plates!

JK. Brush your teeth, guys!"
8276,">If you haven't removed the old rotting food from your teeth, why bother removing it from your plates and silverware?

Because I don't cover my plates and silverware in saliva. People should still floss though."
8277,You don't lick the plate clean?????
8279,"Pro tip I learned the hard way: you can floss improperly. I thought I was doing okay just popping the floss in an out, but it's best to make a ""C"" shape around each side of the tooth. Once I did that my checkups got a lot better."
8280,Thanks for this... I was flossing twice a day for months with the in and out method and my dentist still said I need to floss and my gums look terrible. I was so confused.
8281,I can't floss since I have small metal rods in place after my braces. This irritates me to no end and causes tartar to build up around it and cause bad breath.
8282,Get a Waterpik!
8283,"Seconding this. I couldnâ€™t floss when I had braces, and when we finally got a Waterpik I was astounded/horrified. SO MUCH food came out even when used after brushing. And it was really fun to use! Highly recommend"
8284,Use superfloss by OralB. I have a bar behind my teeth and use it religiously ! It has a plastic end on the floss that threads through the bar.
8285,"Yep. As a 30-something adult I literally had to google â€œhow to flossâ€ because I never really liked doing it and finally made an effort to do it right. 

The goal is to clean the interior sides of the teeth, epecially below the gum line."
8288,"Yo, what did the deleted comment say?"
8289,"""My uncleâ€™s a dentist and he told me that 80 percent of the time, itâ€™s not really the toothpasteâ€™s fault. People just donâ€™t brush their teeth properly"""
8290,80%? More like 95%. Also what is his opinion on electric toothbrushes? Do they make a difference if you know how to brush your teeth propperly with circular motion and use curaprox 5460 toothbrushes?
8291,"My long-time friend is a dentist. Many years ago he gave me an inexpensive OralB electric toothbrush. Everytime I go in for a teeth cleaning the hygienist will ask, ""Do you use an electric toothbrush? Because your teeth look great.""

So, there's that for ya."
8292,Ever since I started using an electric brush mine has said the same! Healthiest my gums have ever looked!
8293,Yup. I switched to an electric and explicitly did *not* inform my dental hygienist to avoid confirmation bias. She noticed anyway.
8294,Same here. Last time I went my dentist didnâ€™t even scale and polish them for me (which is the standard NHS treatment in the UK) because the electric brush was doing almost as good a job. Didnâ€™t charge me either which was nice
8295,Didn't charge you? That's a foreign concept.
8296,"Must be one of them benefit scroungers. 


/S"
8297,"I get the same thing since I switched to electric, I don't notice a difference myself but I find it so much easier to use and my dentist is happy so must be doing something right lol"
8298,What is it about the electric toothbrush that makes it better than good ol' brushing? Is it any different from brushing in circular motions?
8299,"One of greatest benefits IMO is just that it goes for 2 minutes, and a lot will beep every 30 seconds. It ensures you brush long enough and helps you get each side evenly.

Also in my case, I tended to brush too hard. Electrics help with that too."
8300,"It's simply the high speed movement of the bristles. They hit your teeth with higher energy, more times, in more places, than a manual toothbrush."
8301,"I also use an inexpensive Oral B. It works great, my only complaint is there are these grip ridges on it that are quite annoying to clean."
8302,"Dentists definitely recommend electric toothbrushes! I was recommended one years ago when I had a case of acute gum infection and the hygienist I seen recently also asked if I use one. 

I'm prone to having problems with my gums because my teeth are tightly packed, meaning food gets stuck and it's incredibly hard for me to floss. It's cleaning **between** your teeth and under your gumline that so many people miss!"
8303,I got a water flosser after I was diagnosed with periodontal disease. It works wonders. Apparently you arenâ€™t supposed to bleed every time you brush your teeth! Who knew?!
8304,A friend of mine had an infection and the dentist said she had to brush UNTIL IT BLEEDS
8305,That's to get the infection out.
8306,I know that why I said it
8307,"Oh, they were serious. Well it was a nice chuckle I had at least."
8308,It just sounded super hardcore to me haha
8309,"Iâ€™m not a dentist but have one of those sonicare brushes, and christ I definitely feel a lot cleaner a lot quicker. I donâ€™t think it matters if you brush long and thoroughly, but I like it."
8310,"with an electric toothbrush you're not supposed to make circles. just slowly move it over the tooth surface.  


the engineering side of me says ""if it moves up and down 20,000 times a second... my moving it back and forth over my teeth at 1 time per second isn't going to affect the localized motion of the toothbrush tip."""
8311,"Seems like any movements you make could impact the angle and placement of the bristles, and potentially change how much particular areas have been exposed to the electric vibration/motion."
8312,Modified Bass and Still man are best for healthy gums.Charters methods is for fragile gums.
8313,"Warning: not activated charcoal. Repeated use (more than once per month!) will actually erode your enamel.

Edit: Source: My own dentist, all the dentists in articles, and the British Dental Journal [https://www.nature.com/articles/s41415-019-0232-8](https://www.nature.com/articles/s41415-019-0232-8) which in fact states there is zero whitening, they all lack fluoride, and it has risks from potential ingredients and complications.

It is NOT for daily use. Read the label. It is NOT safety approved for toothpaste.

Slight whitening may be seen due to abrading the enamel.

If you are going to test activated charcoal for your teeth, smear it. There is no point in brushing it.

&#x200B;

Answer to best toothpaste: Apagard. Along with NovaMin.

 [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5121804/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5121804/) 

 [https://www.ncbi.nlm.nih.gov/pubmed/27659081](https://www.ncbi.nlm.nih.gov/pubmed/27659081) 

 [https://www.ncbi.nlm.nih.gov/pubmed/29603704](https://www.ncbi.nlm.nih.gov/pubmed/29603704) 

as well as general consensus."
8314,This explains a lot
8315,My gf is gonna fight me when I tell her that she's got the toothpaste game backwards.
8317,I read â€œthisâ€ as â€œtitsâ€
8318,"Any dental question I have, I ask my dentist or the hygenist. Seems like they're spent a lifetime of training for this, while I can only search the internet and assume most answers are wrong. You can even call your dentist's office if you're between appointments."
8319,Dish eshplainsh a lot
8320,"Doesn't it whiten your teeth by literally scraping off the stained outer layer of enamel?

Edit: original comment above said to not use charcoal toothpaste more often than like once a month. Got deleted for some reason"
8322,"But r/futurology said they've discovered enamel regrowth techniques. So in 50 years I'll have it back, BAM"
8323,and a big ole pile of debt lol
8324,FYI if you see friends selling â€œmiracle whitening toothpasteâ€ on FB/Instagram this is what it is.
8325,"Many of them, like smileactives for example, are high concentrations of hydrogen peroxide, are they not?  Don't those whiten by a different mechanism?"
8326,That does not sound good.
8327,"Is it possible to brush your teeth too hard? My SO sounds like he's trying to sand his teeth off and it makes me uncomfortable. Not sure if it's just misophonia or if maybe he is brushing too hard.

*sometimes it is really surprising what things generate a whole bunch of discussion. I never would have expected so many people were so interested in talking about how hard you should brush your teeth"
8328,"Light force is all thatâ€™s required. Itâ€™s the back and forth motion that does the work, not the force.

If you brush too hard it cause gum recession which exposes the dentine, and this is temperature sensitive. Gum recession is irreversible.

If you use a good electric toothbrush itâ€™ll go into low power mode if you push too hard. The right force doesnâ€™t feel like much."
8329,"My dentist actually just told me that you DON'T want to use a back and forth motion. This can actually cause gums to recede, too.

They explained you're supposed to brush your teeth with a light motion that goes away from the gums."
8330,"Was told the exact same thing by one dentist because of gum recession. Then the next one noted plaque build up, scoffed at the previous dentist's recommendation, and told me to do the back and forth motion. There's no fn winning with dentists."
8331,You're giving me an existential crisis over tooth brushing
8332,I've also heard to brush in circles. I think both of these methods are just tricks to get you to brush lighter.
8333,I had the dentist tell me I needed to brush around my gums better because they are swollen so I was more assertive in brushing gums and in my next dental appointment he said that you brushed too hard and my gums receeded.
8334,"Do you have allergies?  I had 3 different dentists over the years tell me I needed to brush my gums better because they were swollen, despite following a good dental hygiene routine.   It wasn't until my current dentist asked the question whether or not I had allergies that I found  out the real reason for my swollen gums.  Took OTC allergy meds for several days before my next appointment... no issues."
8335,"I've had dentists tell me I was not brushing my gums correctly most of my life. Some told me I needed to improve my technique, some told me I needed to use an electric toothbrush, but no matter what I tried, they still chewed me out the next time.

I was so frustrated that I just stopped going to the dentist.

Then I started flossing regularly and went to the dentist once more. The dentist asked me ""Your gums look good, do you floss?"" I said ""Yes."" He said ""Great, keep it up.""

I don't understand why no dentist ever told me I needed to floss before. It's like that one weird trick that dentists hate."
8336,I think you went to the one dentist in the world that doesn't implore you to floss at every opportunity
8337,"I was literally wondering why the advice for bloody & swollen gums wasn't to floss, too...

A good flossing regimen when you've let (or genetically) your gums start to show signs basically looks like a week of painful bloody flossing that feels miserable, followed by a week where you'll have almost no blood and the puffiness will be down if not gone, and by week 3 you'll wonder why you haven't been doing that all along.

Gum and mouth tissue are some of *thee* quickest healing bodily tissues. A bit of pain, but likely profound health gain."
8338,">Gum and mouth tissue are some of thee quickest healing bodily tissues. 

I mean, they've got to be. You can break a leg and the tribe might support you until it heals, but if you can't eat, you're pretty much done."
8339,It's like the only thing my dentist says every visit.. Floss floss floss :D
8340,"He already had to have a surgery for receding gums, which was extremely painful. I can't stand the electric toothbrush sound either but seems like it'd be best for him to go back to one. I will buy him a very nice one."
8341,"What about if you brush too long? My brother sits in the bathroom brushing for like 5 minutes or more. I've tried to tell him that might not be good for his gums, but he's terribly stubborn."
8342,Are you sure thatâ€™s what heâ€™s doing...?
8343,Definitely stick with light force.  The dark side of the force is a pathway to many abilities some consider to be...unnatural.
8344,">Gum recession is irreversible

It'll never return to a healthy state????"
8345,My wife had to have skin from the roof of her mouth grafted to extend her gums.
8346,"Mostly because it will damage gums more than teeth.
Also consider what is happening when you brush really hard. You're brushing with the middle part of the bristle, as you're bending it over, which isn't going to clean as well as the ends of the bristles."
8348,Who would have thought sanding down your teeth with powdered rock was bad for you
8349,"well, fuck"
8352,"Cheap toothpaste works just fine, the important part is that it contains fluoride (>1'000ppm for adults). And you have to brush (gently, not forcefully, no point making your gums bleed) for a full two-three minutes. With a toothbrush that isn't frayed, so get a new one per month...

Fluoride works but it's not instantaneous, so in addition to mechanical cleaning (brushing) it just needs time. If you're a quick 15-second brusher then no matter how good your toothpaste is, it just won't do much.

It's just like a washing machine, detergent obviously works but the effect is not instantaneous either hence it's not done in a minute."
8353,"TIL@20190915

- Containing fluoride (>1000ppm for adults) is important.
- Brush for a full two-three minutes (no point making your gums bleed).

Thanks, docðŸ‘"
8354,Having an electric toothbrush taught me how to properly brush my teeth.
8355,"Having an electric toothbrush taught me that I brush my teeth way too hard. Went to the dentist with inflamed gums and they thought it was gum disease. I said I brushed twice daily, I use mouthwash during the day, and I floss. They looked closely and worked out that the damaged gums were along the curvature of my gums, and thus I was pushing too hard. 

They recommended that I don't brush my teeth for a few days (to let the gums heal) - so don't eat anything ridiculous - and use a salt wash to keep my gums clean. Then use a gentle motion with an electric brush (the weight of the brush, no applied force).

They then asked if I flossed. I said yes. They told me to stop because it wasn't doing anything. They then recommended indenture sticks instead - which apparently are better (no idea)."
8356,"Not really sure what indenture sticks are, but they might've meant interdental sticks."
8357,"No they definitely meant interdental, I'm just an idiot."
8358,Indentured servasticks
8359,"> get a new one per month

meanwhile i've been using the same damn brush since 2016"
8360,This is what my dentist told me probably contributed to my gingivitis. He reccomended I pay for a 500 dollar procedure and I thought it was a scam. Well my parents paid for it anyways and after that i've been brushing and flossing every day. Next time I show up they do the gum count numbers and they're prisitine- no charge. Blew my mind it was not a scam.
8361,In what fucked up healthcare system do you pay 500 dollar at the dentist
8362,"America, FUCK YEA"
8363,Australia also fails at making dentists affordable for most people.
8365,"Dental is not covered in the Swedish system either when you are older than 24 years.

I think it is cheaper though but cannot be sure as I don't know what type of treatment he got."
8366,In the UK you have to pay for the dentist as soon as you're 19.. Doesnt matter if you're in university or not.
8367,Iâ€™ve seen TV. There are no dentists in the UK. Nice try.
8368,"Dude, I have ONE tooth that needs work this week. $2,300 out of pocket.  USA!"
8369,"My dental plan is ""Mexico."""
8370,Canada is no different.
8371,My god man they're like $1
8372,"My dentist recommended spitting out the toothpaste, but not rinsing with water. Allows the fluoride to stay in contact with your teeth for a bit longer."
8373,"I've heard this too, but it's so gross to me"
8374,"Took me a few days to get used to it. Just don't eat immediately after  brushing, that's when it's really not pleasant."
8375,"I heard it was every three months. I struggle with bad breath even though I take care of my teeth quite regularly and floss. Even my dentist has noticed improvement. 

I think it has something to do with my tonsils though and I may have to have them removed."
8376,"Do you get tonsil stones? They can cause chronic bad breath!

I had my tonsils removed once they started appearing, because of this fun fact."
8377,"Why though? I used to get tonsil stones, adjusted my habits and they went. It was due to an increased salt intake. Once I decreased that they stopped. Went to the doctor initially about them and saw a dentist from the NHS who said to get my tonsils removed. Went to my private dentist and he told me how to sort it out"
8378,"Yeah I haven't had tonsil stones in years, used to get them all the time. I don't know for sure what it was that changed it, though I suspect it's just that I eat a lot less dairy than I used to. I wouldn't have thought it was a reason to get a tonsillectomy."
8380,"Buy a tounge scraper. Best $3 ever to fight bad breath.

For me at least it isnt enough to just brush my tounge. Gotta use the right tools for the job."
8381,"I can't second this enough. A lot of the effect is near-instantaneous, so if you have a spouse or significant other or even just a fuck buddy you can check the results very quickly."
8382,Or even one of those fancy kissing prostitutes.
8383,Do you brush your tongue?
8384,"Sounds like you may have a build up on you tonsils. Does it feel grainy when you drink water, like a weird feeling in your neck? If so then it may be tonsil stones

Quick remedy is gargling salt water three times a day and that should loosen it up enough to cough it up at some point. Warning  though, if you do, don't crush it as it smells like shit and decay

(I'm not a dentist, but had them and was given this advice and it worked)"
8385,I've never had a toothbrush fray severely. I've seen some people's brushes that were frayed to shit. How do they even do that? Wtf?
8386,"You know that closed fist scribble toddlers do with paintbrushes? That, but on your teeth."
8387,"When I go to the dentist they always recommend s type of toothpaste, like cavity prevention or for sensitive teeth, instead of a brand."
8388,"I got something similar when I had my eyes examined; the eye doctor wasn't actually allowed to recommend a specific store to buy glasses. I ended up pointing out I'd recently moved to a new country, had NO idea what their stores that sold glasses were even called, and I was now asking her as a private person where she bought HER glasses."
8389,"Also, not a dentist, but I wouldnâ€™t recommend putting cavity prevention toothpaste in your eyes"
8390,"Instructions unclear, cavity toothpaste is in dick"
8391,Also not a dentist but I wouldn't recommend putting your dick in your eyes.
8392,"Are you kidding? If you can, go ahead"
8393,You've earned it.
8394,"All American brands are inferior to the innovations they have internationally. Fluoride is OK, but now we have bioglass which forms a barrier through remineralization that will prevent cavities. There are even academic studies of kids' toothpaste in Europe and Norway with far superior performance."
8395,Are those the ones with the stuff thatâ€™s in sensodyne repair and protect? It has novamin.
8396,"Yep! That's one. Make sure it's the one with NovaMin, that's the remineralizing bioglass ingredient."
8397,I just heard of bioglass. Dentists in US are now recommending it for all children.
8398,"Not a dentist now, but I was from 1947-1968

I would always recommend Camel Cigarettes^^^TM"
8399,"That's because they hit your T zone so great!


 That's T for taste and T for Throat cancer!"
8400,They hit your T-cells first!
8401,"In north america we call that, ""love""."
8402,*taps head* Can't have teeth problems if you fucking die first
8403,"Fun fact: Back in those days, Camels were considered garbage tier cigs and not premiums."
8404,Are Camels considered premiums now in the US?
8405,No they are considered a premium in Saudi Arabia tho...
8407,Would those help with chronic asthma?
8408,If you die of lung cancer you won't have to worry about your chronic asthma
8409,Nihilistic Medicine^(TM)
8410,I used to use Colgate and my teeth were super sensitive to cold drinks/food. Started using sensodyne and no more pain when I drink/eat cold stuff!
8411,Sensodyne is amazing. I have a tooth that I wore out close to the gum line from brushing to hard. Super temperature sensitive. My dental hygienist recommended sensodyne during a cleaning. I havenâ€™t had an issue with sensitivity since I started using it!
8412,Yup! I brushed too hard as well
8413,Here in Australia 9/10 dentist recommend that stuff.
8414,What does the other guy say?
8415,He recommends drinking 2L of coke a day.
