idx,text
25668,"I generally agree with your first and third paragraphs, but I can't say the same for the middle paragraph. 

Personally, I think high quality aggressive fast bowling is the most exciting thing in cricket. Call it barbaric, but the game is raised to another level when the bowler is a genuine physical threat and not just a threat in cricketing terms. The crowd roars, and you get goosebumps all over. Every second you feel like something is about to happen. In this department the West Indies are supreme, and combined with the stylish batting of Richards (among others), the West Indies were high on entertainment. 

But I don't like what your second paragraph suggests. Liking a cricket team is a very subjective thing, but how can you imply that the Australians didn't ""wear the crown well""? During their period of dominance they were the most entertaining team by a very long way. The sheer brilliance of Warne was awesome to watch, McGrath's relentless wicket taking was a lesson to every bowler, Steve Waugh is the most clutch batsman I've witnessed, junior Waugh's batting was as sublime as anyone's, Ponting was obscenely good in that period from 02-07, Gilchrist's ability to take the game away was almost unfair. They were even great to watch in the field. Healy is the best pure keeper I've seen, Taylor and Waugh are the two best slip fielders I can think of, and whatever Ponting couldn't catch he could throw at the stumps faster than you could blink.

The Australians wore the crown pretty damn well. You don't have to love them, but I can't help feeling that associating them with the notion that ""they've not been good champions"" is just irrational bitterness."
25669,"Well, it *is* just my opinion. But there were lots of little things, you know? Not saying that there were teams that didn't have their fair shaer of knob-ends, but for all the talent and skill there was just too much lip, too many verbals, and sometimes the attitude spilt over into something that just didn't seem in keeping with the game. At my age I feel I'm firmly entrenched into the ""traditionalist"" camp. Besides, the last line of the paragraph is as good a qualifier as I can manage. Perhaps the pseudo-cloughism is poor, but I nevertheless felt happy to cheer India on in 2001.

Anyway, it is only an opinion. Not like Reddit has enough of *those*, is it? And for every single one there will be another 10 who disagree. If I prefer Lara to Tendulkar then that's up to me. If I would rather watch Malcolm Marshall then Glenn McGrath, so be it. If I would rather pay money to see Lloyd's side instead of Waugh's, who's going to deny me that?"
25670,"As for fast bowling, surely having Lee in there was exciting as well? In fact, having Lee, Gillespie and McGrath was awesome. Along with Bichel and Kasporwicz backing up here and there. We were very fortunate to have that depth."
25671,"West Indies didn't lose a test series at home for 22 years, also didn't lose a test series for 15 years. They won the first two world cups and finish runner up in 1983.

Steve Waugh's Australian side could be the most dominant for a five year time period, but considering West Indies longevity at the top would mean they are the greater side."
25672,"but how much cricket did they play in those days and how many good teams were around? No South africa, Sri Lanka were weak, India werent as strong, It was only England, Australia and Pakistan."
25673,ahem
25674,~~Richard Hadlee~~ New Zealand were the only side to beat them during that time.
25675,"my bad, I know Hadlee was around but dont know how good the Kiwis were."
25676,"I'm not sure about the amount of cricket played, but during our dominance period, say 1995-2007, we lost two series(three if you include a stand alone test) against India, and a series against England."
25677,"Waugh lost to a very very determined India in 2001, and it took a few freak performances. Also, Windies domination ended in 95 but it doesnt mean Australias domination started then, they lost the 96 WC and almost didnt make it to the 99 WC Final."
25678,"I consider that 2001 Test match in Kolkata the greatest Test match I have ever seen India play. The greatest Test fight back, under the cosh from toughest bowlers, and as the research suggests, the most dominant team at the time."
25679,I would go so far as to say the 2001 Australia v India test series is one of the best overall series I have ever seen.
25680,"70s-80s WI had to face   
England - Gooch, Boycott, Gower, Botham, Willis, Underwood, Knott  
Australia - Chappell brothers, Border, Lillee, Thompson, Mallet  
Pakistan -Miandad, Abbas, Imran  
India - Gavaskar, Viswanath, Vengsarkar, Kapil, Kirmani and the spin quartet (Not a weak team as you suggested)  
NZ was competitive with Hadlee  

Again we are talking about an era where 50+ average is pretty much impossible unlike now there seems to be couple per team.  

90s-00 Aus team had to face  

England - Peterson  
India - Tendulkar, Dravid, VVS  
Pakistan - Inzamam, Wasim, Waquar  
NZ - ??  
SA - Kirsten, Kallis, Donald, Pollock  
SL - De Silva, Murali    

So, I wouldn't come to a conclusion that WI had to face weaker sides.  In my biased opinion, WI beat everybody at home and on the road handily for a long period of time. Aus never beat India in India. That settles the argument for me."
25681,The Australian team hold the record for most consecutive test matches without a loss though. A record they achieved and then followed up to equal soon after.
25682,"I never watched that Windies team at its peak, so for me its the Aussies all the way, of course."
25683,The most of the girls can play the cooking games because the girls and play the cooking games and the dress up games both of the games are very interested and more enjoy able games. But if the girls can play the cooking games than they will learn some things from the cooking games.http://cricket.igames.pk/ . cricket games
25684,The SA team with Smith Kallis Steyn AB et al may not beat the WI/Aus sides but they sure as hell would salvage some epic draws
25685,Don't forget Amla! Prime Amla was the best SAF batsman in his team!
25686,To add to the SA team's achievements: they didn't lose an away series for 9 years (2006-2015)
25687,[This article by Jarrod Kimber](http://www.espncricinfo.com/magazine/content/story/965019.html)
25688,"That was a good read, thanks for the link."
25689,There were great teams in the past as well - Bradman's invincibles of 1948 and South Africa just prior to the apartheid boycott were better than all but the first two on your list.
25690,"Quality of opponents wasn't that good,no?"
25691,"Yea that's the problem with these comparisons. For the 1948 Aussies, England were the only decent opposition. For the Saffers, while there were 3 other very good teams (Aus, Eng, WI) around - plus 2 emerging forces in India and Pak - they never got the chance to display their fearsome potential.

One of cricket's biggest what-ifs is how SA would have fared Vs WI in the late 70s. But I can't imagine a team with Pollock, Richards, Barlow, Procter, van der Bijl (with Rice to follow) wouldn't have held its own."
25692,"Australia, no question

WI after that  

SA

IND

PAK

SL

ENG/NZ

BAN"
25693,"Australia

2-3 Greatest teams can be made And they all would be world defeating"
25694,"1. Hayden

2. Ponsford

3. Bradman

4. Smith

5. Ponting

6. Miller

7. Gilchrist

8. Lindwall

8. Warne

10. Lillee

11. McGrath


That's a team that doesn't include: Border, Waugh, Clarke, Langer, Boon, Chappell, Chappell, Hussey, Harvey, Walters, Simpson, Lawry, Trumper, Healy, Ryder, Hassett, Morris, Woodfull, O'Neill, Johnson, Lee, McDermott, Gillespie, Benaud, McKenzie, Grimmett, Thomson, Davidson, O'Reilly, Trumble, Harris."
25695,"Can add Cummins, Starc and Hazlewood to that missing out list too. Absolute fire seam attack."
25696,"This is a bit of a dumb question, obviously the oldest teams have an advantage."
25697,Yeah Australia definitely nobody can beat them but if you make a Greatest X1 for WI England India or SA you can't say England will definitely beat the other 3.
25698,"Matthew Hayden,
Bill Lawry,
Don Bradman,
Ricky Ponting,
Steve Smith,
Keith Miller,
Adam Gilchrist,
Ray Lindwall,
Shane Warne,
Dennis Lillee,
Glen McGrath.

Gonna be tough to beat, though if someone were to cook up a Windies all time XI itd probably come bloody close.

EDIT:
Gordon Greenidge,
Desmond Haynes,
George Headley,
Vivian Richards,
Brian Lara,
Garfield Sobers,
Jeff Dujon,
Malcolm Marshall,
Michael Holding,
Joel Garner,
Curtly Ambrose.

Annnnndd now I'm dying to see these two teams face off in a series."
25699,"Looking through the WI team, and I can't argue with the selections, but you look at those who missed out - the 3 W's (Everton Weekes, Clyde Walcott, Frank Worrall), Wes Hall, Courtney Walsh, Richie Richardson, Gerry Alexander - a match between the second XI's would be an absolute cracker as well."
25700,And Shiv too!
25701,Surely Australia followed by WI
25702,"It's hard to go past the West Indies - when you've got Sobers, Headley, Richards, Haynes, Greenidge, Lara, Ambrose, Garner, Holding, Hall, Dujon, Ramadhin before remembering the three W's, it's hard to see anyone beating that."
25703,"Australia

They’ve got the greatest batsman of all time (Bradman). 

The greatest WK batsman of all time (Gilchrist)

The greatest spinner, imo (Warne)

They’ve got the greatest fast bowler, imo (McGrath)

Additionally they’ve got a host of big match players"
25704,I think that’s what makes Australia the best ever in this scenario. Can’t think of another nation that can you argue has a GOAT spinner & GOAT pace bowler.
25705,"Australia, and it's not even close. Guys like Ricky Ponting, Michael Clarke and Greg Chappell (just to name a few) won't even make the team."
25706,Ricky Ponting definitely makes Australia's greatest test XI...
25707,Where would you play him? 3 and 4 are occupied.
25708,He is without question a top 3 Australian batsmen ever.  He'd bat 5 or 6.
25709,"Steve Waugh scored 9k test runs at 5&6, should be him imo."
25710,"Top 6 is Hayden, Langer, Bradman, Smith, Ponting, S Waugh.  Others might have the likes of Ponsford, Warner or Trumper open.  Or Keith Miller or Allan Border over Waugh.  But Ponting is a nailed on starter somewhere in that middle order and any Australian will say the same."
25712,"Plus, Steve Waugh would also be the captain (if Border isn't there) and he was pretty decent with the ball as well."
25713,"Yeah look being an Aussie I'm definitely biased and think we could field an A and B team that would probably be the top 2, I was just curious as to who people thought would be runner up, India has some phenomenal batsmen and Windies is definitely my pick behind Aus they've got the bowling attack to back up there hitters I just though it would be a good conversation starter"
25714,"Australia.

Greatest Batsman

Second greatest Spinner

Greatest WK batsman"
25715,Second greatest? Who is the first?
25716,Muttiah Muralitharan by quite a bit
25717,"Hmmmm. Debatable - Warne got a lot of wickets on tracks not conducive to spin. If one is better than the other, it is by a minuscule margin."
25718,Murali has a bad record in Australia and India but great everywhere else.
25719,Aus>WI>England>SA>the rest.
25720,Lol England.
25721,Would agree with you if didn't put England in there lol
25722,"Barry Richards
Graeme Smith
Hashim Amla
Graeme Pollock
AB de Villiers 
Jacques Kallis
Tiger Lance (or M Boucher)
Vernon Philander
Hugh Tayfield
Dale Steyn
Allan Donald"
25723,"Barry Richards 

Graeme Smith 

Hashim Amla 

Graeme Pollock 

AB de Villiers 

Jacques Kallis 

Tiger Lance (or M Boucher) 

Vernon Philander 

Hugh Tayfield 

Dale Steyn 

Allan Donald"
25725,"Probably Australia, but people forget how good WI were in the 80s. They were really good."
25726,"I reckon England’s would look something like this

1. Hobbs
2. Sutcliffe
3. Hutton
4. Barrington
5. Hammond
6. Botham
7. Knott
8. Trueman
9. Laker
10. Tyson
11. Barnes

Some people in this thread seem to find it hard to believe that England could be ranked highly in an all time XI, but I think England could put up an argument for 3rd behind Australia and the West Indies. And whilst there’s no right or wrong answers in a hypothetical match up between highly debatable sides containing players from vastly different eras who played under different rules, I do find it odd that England is dismissed so easily.

Opening the batting for England you have Hobbs and Sutcliffe, whilst a few select opening pairings have gone past this pair in overall volume of runs, none have come close to their average opening partnership stand of 87.81. To put that into perspective Greenidge and Haynes as a partnership averaged 47.31 and Hayden and Langer averaged 51.88, and these are two of the greatest opening partnerships of all time. 

Talking about them individually Herbert Sutcliffe has the third highest average of anyone in test cricket to have played more than 50 innings with an average of 60.73, and so was clearly some player. Likewise, Jack Hobbs was an exceptional player who averaged 56.94 and was referred to as ‘the master’, such was the esteem he was held in. Moreover, Hobbes was one of Wisdens 5 cricketers of the century, showing just how highly many people still rate him.

At number 3 is Len Hutton. Whilst he was an opener in real life in order not to break up this team he is bumped down to number 3. In a career interrupted and affected by World War Two (He seriously injures his arm in commando training and it never fully recovered) he did not allow this to stop him scoring nearly 7000 runs at an average of 56.67.

Coming in at number 4 is perhaps England’s greatest batsmen to have only played post-1945, Ken Barrington. Barrington was the ultimate big occasion player, with his average increasing with every level of increase in the standard of the opposition. Barrington was often a slow scorer who could hold a side together, and given the more exciting stroke players around him I think this would work well. Furthermore, whilst he averaged a very respectable 50.71 in home test, he averaged 69.18 in away tests, showing that he was no home wicket bully and could adapt to more foreign conditions brilliantly.

In stark contrast to Barrington at 4, Wally Hammond was an exciting and attacking batsmen who was often described as majestic by those who saw him play. With an average of 58.45 and 7,249 runs in Test Cricket, a record total that stood for over 30 years, he was clearly not just a cavalier shot maker though, but someone who accumulated runs quickly and in great numbers. On top of his batting ability Hammond was an exceptional fielder and a talented, if reluctant, bowler. Once again this would help with the adaptability of this side.

At number 6 I’ve gone for another shot maker in the form of all rounder Ian Botham. I think it’s important to remember when talking about Botham that there are two halves to his career, Ian Botham the cricket and Ian Botham the celebrity (who happened to be good at cricket. At his best Ian Botham was one of few genuine all founders the game has ever seen, in that he would have got into the side on the strength of either skill, it didn’t hurt either that he was a great slip fielder. Most importantly Botham was a match winner with either bat or ball, rather than just someone who could contribute solid numbers. He had taken 200 wickets by just his 41st match, and had etched his name in cricketing folklore with his heroics in the 1981 ashes, forever to be remembered as Botham’s ashes. And whilst in later years his body shape might have more resembled that of the ball than that of a professional sportsman, this didn’t stop him becoming the all time leading test wicket taker with 383 wickets, whilst also scoring 5,200 runs and 14 centuries.

At 7 I’ve gone for Alan Knott. Perhaps the greatest glove man the game has ever seen, and certainly one of the most eccentric. Considering the bowling talent this team posses, it is crucial to have a wicket taker who can take all the chances offered, be they catches or stumpings. Whilst it will always be for his keeping ability that he is remembered, Knott was also a solid batsmen, averaging 32.75, which is certainly very handy for a keeper of his ability.

At number 8 I’ve gone for Fred Trueman. Whilst fiery Fred might be batting a place too high, hopefully the batting talent already in the line up can ensure that this isn’t a major problem, although he could be a useful late order batsmen when he put his mind too it. Similarly to other players in this team, Trueman was also an excellent fielder, and so a keeper and slip combination of Knott, Hammond, Botham and Trueman wouldn’t be putting many chances down. But rather than catching edges it was for his ability in finding them that he gets into this team. Capable of bowling fast, and being able to combine it with the skill to swing it both ways, Trueman was an exceptional bowler, as his stats back up. 307 test wickets (again a record at the time) at an average of 21.57 show just how talented a bowler he was. This is reinforced by the fact that out of the 9 bowlers since to have claimed the record of most test wickets, none have done so at a lower average.

Coming in at number 9 I’ve gone for England’s greatest spinner and the man who still holds the record for the best figures in a match with 19-90, Jim Laker. Laker though was far more than a one match phenomenon though, as his 193 wickets at 21.24 apiece show. Laker was held in such high regard that the great Gary Sobers called him the greatest off spinner he had ever seen.

At 10 I’ve gone for Frank Tyson. If Trueman was fast then Typhoon Tyson was faster. With a claim to being the fastest bowler the game has ever seen (a claim backed up by Bradman and Benaud), Tyson offers great variety from the other bowlers on display. The ability to intimidate the opposition batsmen through sheer speed and ferocity, and with a vicious bumper always lurking, Tyson would mesh well with the more swing orientated bowlers already in the team. And whilst bowling so fast had a massive impact on his body, it had an even bigger impact on the opposition. Whilst he only took 76 wickets in his career, they came at 18.56 per wicket, this is a low record than anyone who has taken 20 or more wickets has managed since.

The final player in my starting XI is Sydney Barnes. The earliest player on this list, he still holds the record for the most wickets taken in a series with 49. Overall his 189 wickets (again a world record at the time) came at just 16.43 a wicket, the lowest of anyone to have played their entire test career in the 20th century."
25727,"That's a really well thought out and put together side, definitely backs up your position"
25728,I guess in terms of batting India can match any side but fast bowling is something which makes Australian and WI teams the better contenders for Greatest XI of all time.
25729,"Black Caps:

1. Glenn Turner
2. Andrew Jones
3. Kane Williamson
4. Ross Taylor
5. Martin Crowe
6. Chris Cairns
7. Brendon McCullum
8. Sir Richard Hadlee
9. Daniel Vettori
10. Shane Bond
11. Trent Boult  


Would beat most sides other than Aussie and West Indies."
25730,"Ahahah that teams not beating an all time SA, Pak, Eng or even SL side."
25731,Which format?
25732,Australia in tests and odis by fucking miles. T20i hasn't existed for long enough for all time 11s to be meaningful.
25733,"WI, Eng, Ind, and Pak all time XI all have a decent claim to be the best ODI sides"
25734,We have 5 world cups
25735,We need to pump those numbers up
25736,"Sure, but that doesnt really mean anything in an all time XI as players cant be pulled from different eras."
25737,"Still though, can anyone beat the following team:

Hayden 

Gilchrist (wk) or Warner

Jones

Ponting

Hussey

Bevan 

Symonds or Gilchrist (wk)

Warne

Starc

Lee 

McGrath"
25738,"At the Kotla. Yes. Other places, not so sure."
25739,"Heck, 2000s Australian team would still roll over any present team. I don't see England or India scoring over 300 easily against THAT bowling lineup. Also, I don't see any bowling lineup dangerous enough to neutralize Australian batting. Heck, even if they manage to get quick wickets, Symonds/Lee/Bichel is absolute perfect BatDeep lineup"
25740,"Obviously Australia,they literally dominated the 2000s and the 1930s 

Wi after them,then sa and Ind,SL,pak"
25741,"India- Great Batsmen, Great Spinners, Crowd Pullers

West Indies- Fearsome Five (fastest bowlers of their times, batsmen were literally shit scared to face them), Gary Sobers(36 off one over), Brian Lara(400*), first world cup winners.

South Africa- Quality Team, Depth, Never lacking in the fast bowling department, Great All-rounders, One remarkable wicket keeper, 438 and choking.

England- Pioneers of the game, Home grounds help swing bowlers, Hire and Fire Captains, Depth in County Cricket

Australia- Will go all out pace with 5 bowlers if possible, Almost every bowler is a capable of leading the attack. Most WC wins, Great Batsmen, Aggressive captains, Mind Games.

Pakistan- In-Swing, Reverse Swing, Doosra all kinds of bowlers but never slow bowlers, Batsmen with lots of talent, any one of their players is good enough to defeat another team."
25742,SA wicket keeper - Mark Boucher?
25743,AWWWW YISSSSS.
25744,"NZ - Constant underdogs considering their population. Always better than the sum of their parts despite producing some incredible players over the years.  Cliches would be, All Rounders, quick swing bowlers, speak with funny accents."
25745,I think the Indian era of great spinners is over as well. We might as well have 10 batsmen and a bowling machine in the team.
25746,south africa - ab de villiers
25747,"Negative stereotypes:

SA: Chokers, overly conservative, only guy who can actually spin the ball had to be imported.

Oz: Sledgers, simple-minded. Not one decent commentator in the whole country.

India: No fast bowlers, cannot handle short pitched bowling, travel badly.

Pakistan: Crazier than a bag full of snakes. Ageless, but not in the normal sense. Prone to imploding like a dying star.

Windies: Used to be good, now a one-man team. Horrible board that hates their own team.

England: English (admittedly only up to a point). Prone to massively overestimating how good they are. Middle order collapses if Mitchell Johnson so much as looks at it. Hates innovation, creativity and fun.

Sri Lanka: Three man team. Two of those are retiring soon.

Nieu-Seeland: Not the All Blacks. Last good player was in the 80's.

Bangladesh: Have been three years away from being good for ten years now.

Zim: Most recognisable player is a commentator."
25748,That statement about Bangladesh is so accurate
25749,So Bangladesh are the nuclear fusion of the cricket world?
25750,"Different countries have different conditions which suit different types of players. Pitches in the subcontinent are better for batting and spinners, not so good for fast bowlers. Unsurprisingly, India and Sri Lanka are known for their batsmen and spinners. Then we have an anomaly - Pakistan. They have the same kinds of pitches, suitable for batsmen and spinners. But they constantly produce incredible fast bowlers, one after another. 

Australia and South Africa always have great all round teams. Great fast bowlers and great batsmen. 

New Zealand is known for great fielding, mostly because we've often been a bit crap at batting and bowling. 

The West Indies destroyed teams in the 70s and 80s with an incredible selection of deadly fast bowlers, including a guy with the best nickname ever - Whispering Death. These days they're unfortunately nowhere near the same level but still have the ability to surprise."
25751,"India- Batters, spinner 

Pakistan- Bowler, especially pace 

Sri Lanka- Spinners, batsmen

Australia- Everything, but of recently, fast bowlers. 

New Zealand- Fast bowlers, fielders 

West Indies- Used to be fast bowlers, now they have fallen greatly, but they have a few good bowlers and batsmen 

England- Fast bowlers, good batsmen 

South Africa- Chokers. But seriously, fast bowlers and fielders."
25752,"> England- Fast bowlers, **good batsmen**

honestly?"
25753,Decent batsmen
44986,fair enough
25755,It's the gold old British optimism coming out in that description.
25756,how about bangladesh?
25757,"They usually win people's hearts and not the matches.

(wait this is not sledge thread?)"
25758,I watched a little bit of their match yesterday against Sri Lanka and they were terrible in the field.
25759,FIFA WC 2014 reference?
25760,Defiantly left arm spinners
25761,I'd say spinners. Not too sure about them.
25762,We produce left arm spinners ( usually good for one year)  and crowd at home games that is about it. Main thing is we suck. So watch our games to laugh at us at sucking so bad. :D
25763,Bangladeshi crowd is amazing.
25764,Why is the South African team mostly white? The country is only 8.9% White...
25765,It's a cultural thing. Cricket and rugby was mostly played by the white minority; football is far more popular among the black population. Transformation policies are attempting to redress this but it's slow progress.
25766,"Yeah, and I suppose availability of facilities also plays a role. Cricket isn't a cheap game to either learn or teach. Till some time back most of the Indian team used come from Bombay, Madras and Bangalore (as those three were known as then) despite them accounting for about 0.02% of the total population."
25767,"**Australia** - biggest talent pool of cricketers, dominant between mid 90s to mid 00s

**England** - team drama and underperforming in the shorter formats

**India** - producing talented orthodox batsmen

**New Zealand** - losing in semi-finals

**Pakistan** - good bowlers and batting collapses

**Sri Lanka** - performing well at World Cups, reached finals in recent T20 & ODI WC

**South Africa** - excellent touring team and choking at World Cups

**West Indies** - dominant between the 80s to early 90s"
25768,"Australia - Sledging

India - Doctoring wickets

South Africa - Choking

England - Being awful at the game they invented

Pakistan - Match fixing

Sri Lanka - Chucking

New Zealand - Having relations with sheep

West Indies - Being a dysfunctional rabble"
25769,">England - Being awful at ~~the~~ *every* game they invented

FTFY"
25770,"Doctoring wickets? That is a little extreme. Indian pitches have predominantly been either flat or rank turners. Teams visiting India will not be used to the conditions doesn't mean all Indian pitches are doctored. Having followed test cricket for three decades i can tell you whenever India goes abroad, they are invited with green tops. It is called home advantage and everyone does that. Aus playing Eng, SA, NZ, Wi will be different coz attacks are similar and so will be the pitches."
25771,The match fixing honours go to South Africa not Pakistan.
25772,"We've had one man convicted ever.

I'd say Pakistan arecomfortably winning in that department."
25773,"Were Herschelle Gibbs and Henry Williams actually convicted of match-fixing, or simply not reporting their approaches from Cronje?"
25774,"I believe herschelle is still wanted in India to go on trial. Hansie stated that he was approached and agreed to do it but did not follow through in the end. In my mind that means he did not fix anything but maybe the court would have disagreed.

Either way he hasn't been convicted of anything."
25775,"Noone's mentioned the *real* reputation for NZ -- the 'dibbly dobbly' bowler (eg. Gavin Larsen, early CZ Harris, I reckon G Elliot's up there too)."
25776,"Australia - Most successful team;   
Highlights include:Donald Bradman and the Invincibles, Steve Waugh's 17 test win team, 3 world cups in a row, Shane Warne / Glenn McGrath combo  
Lowlights: World Series Cricket    
  

England - The homeland of cricket, the reason we have the game today;
Highlights: Lords, WC Grace, SF Barnes, reclaiming ashes for the first time in 15 odd years in 2005  
Lowlights: Bodyline 

West Indies: have some of the most talented players of all time;  
Highlights: Dominant team of the 80s, arguably second best in terms of greatest XI to represent the country (Headley, Lara, Sobers, Weekes, Viv Richards, Marshall, Walsh, Ambrose, Holding, Garner etc etc)  
Lowlights: Since the mid 90s, they have had been very average in test cricket with only a few highlights

New Zealand: Mediocre most of its cricketing life  
Highlights: Paddles (Sir Richard Hadlee), Current team is as good a ODI team it has ever had.  
Lowlights: Early 2000s wasn't a great time for NZ cricket, all out for 26 in a test match innings...

South Africa: Another immensely talented team, currently the best team in cricket (talent wise)  
Highlights:  Pollock(s), Kallis, Current period of cricket 
Lowlights: Banned from international cricket for many years, 1999 world cup. Haven't won an elimination match at any world cup.   
 
Sri Lanka: Similar to WI, loads of individual talent but no sustained dominant period  
Highlight: My favourite player Kumar Sangakkara; Ranatunga and Co winning the 96 world cup.  Murali (most test wickets, has taken a 10fa!)  
Lowlight: IMO 2011 world cup final - so disappointing after their wonderful tournament.. folded like a house of cards   

I feel other people may be better qualified to discuss India / Pakistan cricket though :)"
25777,"murali has not taken 10 in an inning, his best is 9"
25778,"Pakistan has made enormous contributions in bowling department. Reverse swing, Doosra to name a few."
25779,"Saqlain, Wasim, Ajmal, Mushtaq, Aamir, Asif and so many more. All amazing bowlers."
25780,Afghani's have Rambo.
25781,And Rocky.
25782,Who on the team is Rocky?
25783,Shenwari
25784,"Cant believe people aren't saying this more.. 

South Africa: amazing fielding."
25785,"Of course we are known for negative things in most people's minds, lol"
25786,England - Good amout of players aren't born in good old blighty.
25787,"Not to confuse you but it all depends on how the tracks are prepared in home country. India has a tradition of producing spin and batting tracks so we are good at producing batsman and decent spin bowlers, we are not so good at producing fast bowlers like other countries(Aus/Pak/Eng/NZ/SA/WI). For me Aussies are well balanced among all teams in terms of fast bolwer,spin,batsman,fielders and sledging."
25788,I like how w/l ratio is not defined in 1940s because aus lost 0 matches .lol
25789,*The Invincibles*
25790,A German dude with a Charlie Chaplin moustache had something to do with that as well.
25791,Fun fact: The two of them have an age difference of just 4 days( Can't remember who's older tho).
25792,"That's true, and I think it was April 1889, dunno who was earlier but the German dude was April 20.
  
And iirc Jawaharlal Nehru was born 7 months later as well, on 14 Nov"
25793,I wonder if German Charlie Chaplin would have enjoyed cricket.
25794,"He, in fact, banned it in Germany after a Test between Germany and a touring England side ended in a draw. He believed that it was a waste of time to spend five days playing a game only to get no winner at the end."
25795,Fuck German Charlie Chaplin. Didn't like him anyways.
25796,"Yeah. My Dad told me to try to see the best in everyone, but the truth is that the more I hear about that fella, the more I don't care for him..."
25797,He did shoot one of the most evil people in history though.
25798,That's the only thing going for him
25799,"Yeah, god bless whoever killed him ^/s"
25800,Classic German dude.
25801,Funny. That's the exact reaction a lot of my american friends have when I explain cricket to them.
25802,He was right (only when it comes to cricket though). Cant believe I am saying this.
25803,"In the eternal words of Cpt Mainwering:
""The German's don't play cricket, otherwise we wouldn't be having this war."""
25804,Austrian
25805,He Kolpaked
25806,Sick of countries relying on overseas players smh
25807,They still lost that series at home.
25808,"That 80s Windies team, just nuts"
25809,80s Windies and 00s Aussies were seriously intimidating.
25810,"I still think Australia in 00 were slightly better.

They had 2 longest winning streaks of 16 tests as compared to one from WI of 11 matches.

Also no disrespect to team of 70s/80s but I think the quality of opposing teams was better and number of teams were more in 00-10

India and Sri Lanka had much better teams in 2000s. Pakistan team which lost 3-0 to Australia in 2000 was most likely their best team ever."
25811,"I have been going to test  cricket for a long long time (since the 70’s) and believe me that 80’s windies  team was the most intimidating of the lot. Not statistically but they had more presence than any team I have ever seen in any sport. Had it won before the toss when you see any 4 of the following on the team sheet garner Marshall, holding, Walsh Roberts and Ambrose. Oh and The professorial looking Clive Lloyd and the sheer swagger of Viv. 
Mind you Jeff Thomson was the single craziest thing I have seen. 
Richard Hadley the cleverest
Curtly the meanest
Malcolm Marshall the best."
25812,"Completely agree with this. From around the time Sobers got going, the West Indies went from ""strong"" to untouchable. What made it even more intimidating is that no team had dominated the game in quite the same way till then. 

In sports, it often takes a team or a player to prove something is possible and then a bunch of others follow. I'd say the Aussies of the 00's may never have happened had the 70s and and 80s Windies not shown that that level of dominance was possible"
25813,I agree with your quality of opposition argument comparison between 80s and 00s. Jus a correction that Pakistan were whitewashed down under in 1999 and not 2000.
25814,"That's a big call. Agreed weaker teams were worse in the 1980s but in 2000 there were some abysmal teams, even India who snapped their win record in 2001 had very good batsman but some pretty ropey bowling."
25815,"Also just by the stats in that graphic. 00's Australia had a win rate of 68.9% to 80s Windies 52.4%.  Australia did lose more tests rather than draw them (loss rate of 15.6% compared to 9.7%) but if we're talking Dominance it's about how often you win not how often you don't lose.

Also, just from a non-numbers argument, the Windies were stacked bowling and Viv Richards (as far as all time greats go) where Australia had Warne/McGrath for bowling (could also almost include Brett Lee as well, good cricketer, maybe not all time) and usually 4 or 5 of their top 7 in the batting order in any given test match (Hayden, Langer, Ponting, Waugh, Waugh, Hussey, Gilchrist) were all time greats. Brad Hodge couldn't get a spot!"
25816,"Windies had Clive Lloyd for a chunk of the 80s, and Gordon Greenidge, both of whom are all time great bats for my money. Certainly if Mark Waugh or Justin Langer is considered a great, they easily meet that criteria. Desmond Haynes can't be far behind either of them too."
25817,"I thought about Lloyd. Probably should have mentioned him. Mark Waugh was probably a stretch. In all fairness I was born in 1990 so my knowledge of the Windies team is lore and highlights based. Where the 00s Australians hit their peak while I was getting into cricket, as an Australian, so they take a high spot in my mind.

But I still stand by that overall point that Australia was absurdly dominant batting and dominant bowling where Windies were absurdly dominant bowling and batting that was good, anchored by Viv."
25818,"How do the West Indies stack up as a fielding side? Because for all the aussies dominance with bat and ball I think one of the often over looked factors to their dominance was there fielding. One of their best traits was they took the half chances

This has to be one of the all time greatest sporting what if’s/who would wins. Prime Windies vs prime Aus."
25819,"I remember seeing in a documentary on YouTube and from people who followed them during those days like my dad that the Windies were by far the best fielding side and were tremendously fit  athletes. Similar to what u said about the Aussies before,, many people think the Windies were a bunch of  talented people who somehow magically came together under magnificent captains. The fact is they trained very very hard on their fitness and had strict rules on vices all of which tended to a bit slack in other teams back in the day. They also studied other teams and discussed each and every weakness of opposing teams nothing was left to chance....I mean apparently Viv Richards spent hours studying the bowling of lilee and Imran khan and Indian spinners in order to catch that weakness...I guess those are the stuff which tend be forgotten when it comes to great teams or great players ...they were all talented. But the fact this they were great cos they worked way harder than others to get there"
25820,Of course aus will win. Newer generations tend to improve upon the past generations
25821,i read somewhere that Micheal Hussey only got his debut after 30. Is that true?
25822,"That is true, yes. He was exactly 30 when he debuted."
25823,It is. He was in the same category as Brad Hodge for a long time. But was a bit younger and came into the team as some of the batting line-up was approaching retirement. So when he got his opportunity he got to keep his spot.
25824,"Brad Hodge would not even feature in my top five barmen who couldn't really crack the Australian team in that period. 

The Australia second XI was probably the second best team in the world for a period there. It was nuts, and you feel for guys like Stuart Law, Matthew Elliott, Michael Di Venuto, Jimmy Maher, Jamie Cox, Jamie Siddons, Darren Lehmann, David Hussey..."
25825,"That's another non-numbers argument for Aus 00s over 80s Windies. Just the incredible **depth**. 

Sudden crop of injuries,? Missing two batsmen with career 40+ test batting averages? Here's two more coming into the squad, both still above 40 average. 


Warne's injured? Here's Stuart Magill, the second best leg spinner in the world. I'd kill to have Magill available for the current Australian test team.

Gilchrist is out? Here's Brad Haddin, still a legit as hell batsmen and keeper.


I didn't mention Clarke and he did come into the team very late into their period of absolute dominance. But he can hold up as an all time great imho too. Michael Bevan, with the bat. Stuart Clark with the ball. The list of cricketers who were legitimately very very good, could have walked into any other test team in the world but just couldn't keep a spot in that team, because it was so goddamn stacked is ridiculous. It might be a product of time but that's something I don't hear about the Windies.

Edit: Andrew Symonds!"
25826,Lehmann
25827,They had a superior bench strength ..hell even the players not picked by aus could have started in other international teams.
25828,"Stuart MacGill has to be the most unluckiest spinner ever. 

He took 208 wickets in 44 matches, almost 5 wickets every test! Only if he could control his spin better."
25829,the Australian team did lose a match to the 2nds XI
25830,"One important consideration is that, in order to ensure the WIndies bowling squad was indefatigable. 

Consider the 60-61 Tied Test. Wes Hall bowled the last over. In those days the overs were 8 balls. The last over was the 120th 8 ball over of the day... Hall only bowled 7 balls and the over still took 15 minutes.

Days of 125+ 8 ball overs was the norm.

Clive Lloyd slowed that down. The daily workload for his pace battery was reduced and became a pretty consistent 72 6-ball overs per day. This meant his guys were always fresh. 72 overs is 24 per session. 4 pacemen means only 6 overs per session.

\---

Complaints were being made about how the slow over rates were killing Test Cricket and gave force to the rise of ODIs.

The ICC eventually took action after England, in protest, managed to faff their way to 68 overs in a day - using only 2 bowlers, Edmonds and Emburey. Yep 2 spinners bowled for an entire day's play in a Test without interruption and only got through 68 overs.

Thats when the minimum over restrictions came in. All rounders and part-time bowlers became far more valuable to cover injury and fatigue. Another thing the Aussies had access to during their run was physiotherapy services so guys like McGrath, Warne, Gillespie and Lee could keep going and going too."
25831,Gives the feeling like That team played ALL of Cricket and now there is nothing worthy left to explore. They represent the epitome of a Cricket teams perfection and dominance. It’s all downhill from there...only the ruthless Australian team of 2000s comes remotely close in comparison.
25832,"Before you ask, starting from the 70s, even if limited overs stats are taken into account, the list remains unchanged."
25833,"Hey, I have a question:

Starting from the 70s, if limited overs stats are taken into account, does the list remain unchanged?"
25834,r/madlad
25836,He's making a joke
25837,Wow! Thank you for that! What about after we ask? Does the list change?
25839,Ask Schrodinger
25840,">starting from the 70s, even if limited overs stats are taken into account, the list remains unchanged

are you sure pakistan was worse then sa in that period?"
25841,Pakistan was 3rd most successful team (Test+ODI) in the 90s after South Africa and Australia.
25842,How close were Australia to SA in the 90's? Must have been pretty tight. In fact I'm shocked to see SA above Australia for that period.
25843,"Very darn tight. SA's W/L was 2.230 while Australia's was 2.160. If draws had any weightage (like 0.5, as some on this thread suggested), Australia definitely pulls ahead."
25844,ah ok ty but what if the chart was solely ODI's without the combining?
25845,"Still the same. No change. Pakistan won more that decade but they also played more ODIs than any other team.

South Africa (110 W, 61 L)  
Australia (140 W, 81 L)  
Pakistan (146 W, 105 L)"
25846,"I remember Michael Holding saying the West Indies 80s team was absolute freakish that all those great players were all at the same time. 

He reminded everyone the West Indies is not one country but many. Somehow all those players, from all those countries came together to form one incredible team."
25847,What I found remarkable in watching those high quality highlights from cricket Australia (85 tour I believe?) was the quality of the fielding that WI exhibited. Their catching in the slips but also in the covers was freaky and felt comparable to the best the modern game has to offer.
25848,Please share the links.
25849,Search for holding cricket australia- i will also check
25850,Messaging you so i can see the link too please :)
25851,"Been watching old Windies highlights

Man what I wouldn't pay to watch Viv Richards in IPL. He would be an absolute beast. AB tier"
25852,Cries happy tears like Kapil Dev
25853,Took a long time coming.
25854,That's what she said
25855,That's what she did not say.
25857,"Best part about this stat is how low India's W/L ratio is in the 2010s.

It shows how competitive teams are these days. I feel the future of Test cricket is bright in that way."
25858,"India's W/L ratio is funded by clean sweeps at home, and clean sweeps away."
25859,26 out of India's 29 test losses were away. It is definitely the reason why they haven't been able to dominate test cricket like teams of the past were able to.
25860,That just goes to show how dominant we are at home
25861,But tbh jokes apart all countries have been shit outside home recently and India does relatively well
25862,bruh
25863,Only 3 matches in the 1870s?
25864,2 in 1877 and 1 in 1879.
25865,"It was actually a 3 match series, the 2nd test took 2 years to finish"
25866,"And that, kids, is why we no longer have timeless Tests."
25867,"The test didn't take 2 years, the English returned home after 2 tests and sailed back to Australia for a third a couple of years later.

The longest timeless test was 12 days, I think."
25868,"Mate, I was of course joking"
25869,"Sorry, my humour radar is broken today."
25870,Ten days. And it was a draw...
25871,It was a joke. I am well aware that no Test has lasted for two years.
25872,I'm surprised no one has attempted such a stunt.
25873,....and hasn't the world gone down the absolute shitter since then!
25874,"The 1980s West Indies team wasn't just dominant, it was scarily dominant."
25875,"Didnt they have like 4 dudes bowling at 140+, i know michael holding was bloody quick. But im unsure about the rest"
25876,"Some lightweights like Roberts, Garner, Marshall, Croft could roll their arms over a bit. 5-6 bouncers per over."
25877,"Malcolm Marshall, fast medium, deadly accurate. Like a black Jimmy Anderson
Andy Roberts, fast and hostile
Joel Garner, tall, fast, hostile with a fantastic yorker
Michael Holding, fast, hostile, able to swing the ball away.

Result: Carnage"
25878,"I would like to know who were the second and third best in 2010's. 

Can OP let us know?"
25879,"South Africa and Australia respectively.

In fact, SA had a W/L of 1.800, which is not that far behind India's."
25880,"Can you give the number of tests, wins, fails and draw for each of the both."
25881,"South Africa (90 M, 45 W, 25 L, 20 D)  
Australia (112 M, 57 W, 38 L, 17 D)"
25882,"The invincibles vs The golden generation of WI vs The ""21 consecutive wins"" team... lets goooo"
25883,1940s Australia breaking the math!
25884,#DIV/0!
25885,"Pleasantly surprised seeing South Africa there. Wessels+Hansie's teams.

We had Pollock, Kallis, Donald, Ntini, Cullinan, the Kirstens, McMillan. I must be missing some other greats. Rice was too old to still play a major role. Hudson was OK, Dave Richardson was solid. I suppose Gibbs also played in that era. Jonty!, I almost forgot - his stats don't show it, but he was a major part of that team - I think not just his fielding, but his positive attitude was great. 

My brother would want me to say Snell - but he was never quite so good."
25886,South Africa were the most successful side in both tests and ODIs in that decade.
25887,"I honestly thought South Africa would feature in > 2000.  But I suppose their peak fell between decades, Eg. 2005 - 2015"
25888,You can also refer to the period as Graeme Smith's captaincy.
25889,Fanie De Villiers and Craig Matthews are often overlooked. Paul Adams and Lance Klusener were decent as well.
25890,"O yesss Fanie de Villiers. Pity his legs gave in. He was no 2 or 3 in the world.

Loved Zulu and gogga. Matthews was always dependable, but not the first bowler we jotted down - same league as Pringle I think."
25891,The team did win the Champions Trophy in 1998 - the only ICC trophy in South Africa's cabinet till date.
25892,That's a touchy subject...
25918,I like how the last 5 decades all have different teams.
25896,They are good in England
25897,"Mate they've won one Test in England since 2000, its not a massive sample size but still

They drew a 2 test series 5 years ago but have otherwise been whitewashed in every series since winning in 99 against probably the worst England test side of all time"
25898,"Huh, I always thought eng v nz matches were competitive, might be recency bias"
25899,2040s UNITED STATES
25900,MURICA!!!!
25901,"Wow that’s crazy, Australia and England dominated cricket for the first century."
25902,They were basically the only countries playing for half of that period anyways.
25903,Yes that was the joke.
25904,West Indies were beast during 80s bruh.... Their bowling lineup was epic
25905,The Australian team of the 2000's was nuts. They never seemed like they would lose
25906,1980s West Indies was pure OP tho
25907,Another interesting trend I'm noticing here. Any explaination for the pretty high draw % from 1960-1990? About 30-50% matches ending in a draw.
25908,"Nobody wanted to lose, I guess. I can see why ODIs seemed so exciting, at least we had a sure winner at the end of the day's play.

20 of the 26 tests played between India and Pakistan in the 80s were drawn (although it may also have been motivated by political conflict between the two countries)."
25909,"In the 1950s, it wasn't unusual for teams to bowl up to 125 8-ball overs in a day.

In the 80s, the WIndies in particular were bowling 72 6-ball overs in a day.

I think the record for least overs in an uninterrupted day in the late 80s was by England who bowled 68 overs *with 2 spinners bowling the whole day.*

The ICC took action and introduced the 90 over per day minimum. This is part of the reason for the lower number of draws - more cricket was played per test."
25910,"The 2000s Aussie team will never scare me because of the 05 Ashes. Them being so good gave us one the best series in English cricket history. I also hope we see a WI team like the one in the 80s again, what a team."
25911,The best thing about the 05 Ashes was that is caused the Aussies to stop faffing about and the 06/07 Ashes was the emphatic result.
25912,The best thing about 05 was Flintoffs over to Ponting and the fact it set England up to not lose a home ashes series since.
25913,Nahhh. My one is a better best thing ;\^)
25914,"Cool table,  thanks OP! SA 90s was the only big surprise for me. I would have expected WI or Aus. Also, a little bit Eng 70s but I guess the Windies didn't get their super team until mid 70s"
25915,"Happy cake day, mate!"
25916,2010s should be South Africa.
25917,2020: Chennai super kings
25919,Lol imagine teaching your national pastime to your colonies and convict outposts only for them to rise up and beat the shit out of u forever onwards 150 years later.
25920,Thanks to India for stopping the Aussie Juggernaut!!!
25921,Let's also give some respect to David Warner's contributions
25922,"As a 90s Indian kid, this brings tears to my eyes. 

Also, since 70s every decade has been dominated by a different team which is pleasantly surprising."
25923,So who do you guys think will rule the 2020s ?
25924,"My guess is India for the next 2-3 years, at least."
25925,Where did you get the data?
25926,"South Africas matches been significantly lower in the 90s is that due to Apartheid?  Also the W.indies is lower in the 80s, any particular reason for that?"
25927,"SA came in very early in the 90s, so that can't have been the reason. The only reason I can think of is SA and WI do not play as many tests/year as compared to England, India and Australia."
25928,"If only these stats showed how many tests were home
Vs away :)"
25929,Good point! I should have included a home and away table!
25930,"If you look at Wins/Matches played ratio, the table would look a lot different"
25931,How about a list based on the away record only?
25932,Will do that today.
25933,"Awesome, very curious to see that  :)"
25934,[Here](https://www.reddit.com/r/Cricket/comments/javys7/most_successful_touring_side_in_tests_in_each/) you go.
25935,That thumping sound you hear is the English team that had to play The Invincibles rolling over in their graves simultaneously.
25936,"Also India, South Africa and West Indies"
25937,Not really quite the same without Bradman though.
25938,I meant it's not just the English team from the 20s-40s that rolled in their graves. Other teams also lost to The Invincibles.
25939,"To us ""The Invincibles"" is specifically the 1948 touring side."
25940,"Ah, I wasn't aware of that, sorry. I assumed it was generally the nickname of the Aussie team of the 40s."
25941,"No worries.  To elaborate a little, that touring side got that name because they didn't lose a single fixture; a feat that was quite remarkable at the time as tours back then were 20+ game affairs that would usually spring up a random loss somewhere (the Australian touring side of 1964 for instance went on an unbeaten run from April to August including four tests, only to lose a random 3 day match to Glamorgan at the start of August)."
25942,"Wow, now the ""invincible"" actually makes sense. It was literal!"
25943,Predictions for this decade?
25944,"It took me more time than I'd like to admit to realize that colors are of the countries, not according to some data."
25945,"And yet in test cricket, they all play in white. I'm glad you noticed."
25946,Well they wear coloured caps.
25947,I think this shows how competitive the last decade has been. w/l don't mean shit unless above 2.
25948,Pig 3 strikes again!!
25949,It is IPL season. Why you posting about Tests? That format has been killed by COVID for sure.
25950,"Bad timing, but the decade did just end, so it was also the right time to post it."
25951,And it will be India for the next 4-5 decades
25952,"Don't know about that but for the next 4-5 years, I can see them continuing to dominate."
25953,"Its hard to see anyone beating in India in India for the foreseeable future, really. But this India side will need to beat Australia/England away over the next 18 months to really be considered dominant, imo."
25955,"India will be an excellent Test side for as long as their current amazing bowling attack stays together.

The big question will be whether India have the pace bowling depth to replace Ishant, Shami and Bhuvi in the next few years."
25956,"Tyagi, Nagarkoti and Mavi seems promising"
25957,Until the Chinese.
25958,"1. Ed Joyce
2. Will Porterfield
3. Andy Balbirnie
4. Niall O'Brien
5. Paul Stirling
6. Kevin O'Brien
7. Gary Wilson
8. Stuart Thompson
9. Tyrone Kane
10. Tim Murtagh
11. Boyd Rankin

The only Test XI we've ever had thus far (except the women's XI but I think this side would beat them)"
25960,i want to give 💯 upvotes but unfortunately i am restricted to 1
25961,"England’s 2010-11 Ashes Team is probably our best of recent times. Listed with their averages at the end of 2010:

Strauss (43.02), Cook (46.17), Trott (64.00), KP (48.53), Collingwood (40.82), Bell (43.37), Prior (40.52), Broad (27.40/35.24), Swann (23.50/27.66), Anderson (31.76), Finn (26.23).

Pretty formidable batting line up, and the bowlers only improved from that series (Finn sadly excepted). It’s funny to think that the ‘worst’ batsmen, Collingwood and Prior, have higher averages than the likes of Bairstow and Stokes, two of the best batsmen in our team now."
25962,That is such a reliable middle order. Colly and Bell could always be relied upon to score at least 30-35 when they came in to bat. Good enough as long as KP & co did the rest
25963,Absolutely love this team
25964,"I'd go with the Indian team from [this](http://www.espncricinfo.com/series/13874/scorecard/345669/india-vs-australia-1st-test-australia-tour-of-india-2008-09) match who eventually went on to have a comfortable series win.

Gambhir

Sehwag

Dravid

Tendulkar

Laxman

Ganguly

Dhoni

Harbhajan

Zaheer

Kumble

Ishant"
25965,Man that middle order is stuff of dreams
25966,"How the fuck did Zaheer and Ishant manage to take 9 wickets in 60 overs in India, when Kumble and Bhajji took only 1 wicket in 84 overs?"
25967,That was the 2008 team against Australia right?
25968,"Yikes, that is a tasty XI. Yep, better than the XI I put forth."
25969,"Yup, Ganguly post 2005 was insanely good in Tests"
25970,This is the correct answer for India.
25971,"2006 Ashes team pretty good:

Langer   
Hayden   
Ponting   
Martyn   
Hussey   
Clarke   
Gilchrist   
Warne   
B Lee   
S Clark   
McGrath"
25972,This would've been my pick too but I preferred the team with Symonds after Martyn retired. Martyn is definitely the better batsman but Symonds was just more interesting to watch bat.
25973,Stuart Clarke looks to be the odd one out there.
25974,Still took 94 wickets at 23.86
25975,"V. Seway  
G. Gemphir  
R. Dravia  
S. Tendehar  
S. Gungly  
V. Lexington  
D. Dhenier  
J. Krumble  
Hurvaj Sing  
I. Parthen  
Z. Kalm"
25976,It took me an embarrassing amount of time to realise that V. Lexington is VVS. Laxman
25977,"Doora dooora door khalisa, dooora door khalisa - does anyone remember this song?"
