idx,text
12913,"A new pair of slippers. I like starting winter with a fresh pair. And some one else to make dinner.  Oh, and hand made cards! Always so corny,  but I keep them all.  
I think Mothers Day should be about getting something practical that I wouldn't really bother getting myself."
12914,"This is only my second Mother's Day, so I'm still getting used to the experience :) Last year, my husband surprised me with new cake pans, a Boos cutting board and a mandolin slicer. It sounds cliche, but it's exactly what I wanted. It proved to me that he  listens when I ramble on about my passion for cooking/baking. This year, I'm hoping for the same amount of thoughtfulness in whatever he decides to do (since my daughter is only 2, he's still responsible for the gift giving)."
12915,Nothing expensive...something thoughtful.
12916,classic mom answer
12917,"She opens it, and says, ""Oh wow, it's a... What is it?"" You explain, and she says ""Wow, that's great. Thanks!""


And you know you've ruined Mother's day, again."
12918,"But she's going to hold on to it for the rest of her life anyway. And decades later when you're sorting through her drawers trying to remember where she left her Last Will and Testament, you find it. Your shitty Mother's Day present. She kept it and the macaroni artwork and the store-bought cards and the little notes this whole time. And you cry."
12919,VODKA
12921,"Expecting a little much from a fetus, don't you think?"
12922,"I am not a mother, but I have been dating a father for the past 4 years. We are getting married in September. We have gone through a lot with the ex-wife, who is mentally ill, and we even had emergency custody of his daughter at one point and she lived with us for several months, and during that time I dropped her off and picked her up from school, taught her to read, write, and do math, did homework with her, etc. Now that she is back with her mother, I cook with her and teach her how to cook when she is visiting, I read to her and take care of her and have fought for her and cried when we lost custody of her and I love her, and she loves me.

The point is, one year I would really appreciate it if my fucking fiance would get me a God damn mother's day card, because I think I deserve it. I'm not trying to say I'm playing Mom or trying to take that title or whatever, but just a little recognition on Mother's Day would be nice. But he ever says a peep."
12923,"Have you explained to him that you *want* to be a mother to his child? We men can be pretty dense, you have to tell him bluntly."
12925,"Obviously I don't know your situation, but it may also be that he is afraid of putting that title on you, as it may scare/piss you off.  That would be my concern.  But I agree with the responses, you guys should discuss it."
12926,To be able to sleep in. Nothing more. Nothing less.
53688,Sleep.
12928,"By far, a day for myself.  Whether it's a preplanned lunch with my friends or a date by myself to the movies.  I just want her out of my hair for a couple of hours.  Please make the decision of where to take her, don't ask me what to feed her, how to entertain her, just plan something.  I'm not an asshole, I love my family, however not having to worry about dinner, entertainment, work, school for a couple of hours would be delightful.  Monday, I'll take control again."
12929,Mom asked for a Keurig. So I'm buying her a Keurig.
12930,"You're so lucky she actually asked for something instead of saying ""nothing"" and getting pissed at what you get (or don't get) her."
12931,"It was definitely out of character for her -- in the past, she would ask for nothing, and my sister and I would usually get her some perfume. Then in mid-November she just sent us an e-mail being upfront about what she wanted. We both had a good laugh at the behavior."
12932,"my mom one year got a new kitchenaid mixer, and asked for the accessories for Christmas. then like, 3 weeks before Christmas she just went out and bought them all herself because she didn't want to wait. :[ I just handed her the one I bought and the receipt and was like 'well I guess I got you a fancy gift card then'."
12933,I made that mistake last year. I kept asking her what she wanted and she always said she doesn't know. Then Christmas came around and I forgot to get her a present
12934,Avoid the 2.0 DRM horseshit
12935,"or if you already bought a 2.0 model,[ this company](http://www.gourmet-coffee.com/Keurig-DRM-Freedom-Clip.html) makes a clip that 'hacks' it so that you can use any k-cup with it."
12936,Bitches love Keurigs.
12937,"Dude, that's his mother. Show some respect!"
12938,Bitches love respect.
12940,[Keep it clean](http://www.snopes.com/medical/toxins/keurig.asp)
12941,"I am teaching her how to swim and paying for her gym membership indefinitely at the place she's always wanted to go to.  She never learned how to swim but made sure that I could when I was a kid because she couldn't and i'd like to return the favor.  Her feet hurt her all day because she's on her feet and has a weight problem.  She has a weight problem because every time she tries to go on a walk or some other form of exercise it hurts her so...  I am making sure that she can exercise in a way that won't hurt her feet so she can be healthy, live longer and not be in pain so much."
12942,"You're such a good kid! I see older people swimming slowly or walking every time I go to the pool at my gym. There are usually aqua aerobics classes at gyms with a pool, I bet she might like that as well. Good on you both."
12943,This is awesome. The gift of health!! Her life will improve so much!
12944,"My father passed away last month after struggling for years with his illness. Because of all the expenditures and hospitalizations during his lifetime, it has been years since the last time they celebrated Christmas without having to compromise other expenses. 
This year, my brothers and I are going to decorate her house and buy her a Christmas tree and set everything up before she gets home from work on Christmas day. My sisters-in-law and I are going to make dinner and my eldest brother is flying in with his family from Japan. 
Although there will be an empty chair this Christmas, at least she will be with the five blessings my father gave her."
12945,"well, yeah, but what are you going to buy her?"
12946,Yeah! Bloody cheapskate.
12947,a tree.. he already said that
12948,You are a good son
12949,Let's hope she doesn't decide to decorate her house herself!
12950,"*""Jesus, Mom! What is this garbage? These decorations look like shit! Why did you even bother! Take them down!""*"
12951,A few years back my moms address book was falling apart so I got her a nice new leather one and copied over all the address information into it so she wouldn't have to.
12952,I bet she will love that the info is all in your handwriting. Added bonus!
12953,Depends on whose handwriting it is. If it's mine it'd pretty much ruin the gift.
12954,"I'm giving her the gift of my presence.

.............I'm moving back in."
12955,For her birthday you can let her do all your laundry.
12956,For mother's day I'm gonna let her bring me breakfast in bed. I feel this is a nice compromise.
12957,Getting the rust out of her. You are her human wd40.
12958,......this one makes me uncomfortable...
12959,She'll love the nostalgic feel!
12960,For Mother's Day you can have your friends move in too.
12961,The gift that keeps on giving. And taking.
12962,Oh god me too. I'm so ashamed
12963,It sucks. I'm 26 w/a college degree in something useful and I can't get a job. I've been looking for over a year. What's you situation?
12964,"If that's the case, you should move. There are jobs everywhere, you just need to be prepared to move where they are. Even if it's somewhere you don't want to live. Moving back in with your parents isn't doing your career any favors."
12965,"That's the problem. I don't have the ability to do that, funds, etc."
12966,If you have the skills a lot of companies offer a relocation bonus to help you move.
12967,"Ya, and I'm job searching. I just can't get any interviews."
12968,"It's definitely not cheap. But if you are willing to move with just the bare necessities (no furniture etc.) you can make it pretty reasonable.  If you want to start thinking long term strategy, I would recommend saving money while living with your parents for the purpose of moving to another state.

I was in a similar rut in my 20s and moved 750 miles for my first real job. Then I moved another 2k miles for a promotion. Now that I'm experienced I could go back where I'm from and have a much better chance at getting a job.  I would recommend looking at Texas if you don't have much experience. There are jobs everywhere in just about every field."
12969,"Cool, ya, i'm doing freelance work and working at my university right till the end of the semester. I'm willing to move pretty much anywhere, i just need to be able to pay my bills. i've got a communications degree so I can do a lot."
12970,"Cool, well best of luck. Moving to different states is always a pain in the ass but it's also cool to experience different parts of the country. If you aren't tied down with a purchased home/kids, you have an advantage over a large number of job seekers with your ability to relocate."
12971,"Thanks! Ya, I'm kinda looking forward to moving. Now if only I can find a job!"
12972,Me too! But my mam's actually glad. I moved 350 miles away last year and she's been begging me to come back ever since.
12973,"My mother recently took up golf so I bought her a pair of Nike golf shoes. They weren't cheap but damn, do they look fly."
12974,"Both of my brothers are notorious for putting zero thought into their presents for everybody and taking the easy way out. So this year I landed a great engineering job and thus have the money to get awesome presents. Instead of doing that however I've taken to figuring out what they both plan on getting our mother (I know they won't buy it till the last second) and then in a roundabout way I'll buy it for her and give it to her now and make it look like it was just a coincidence. 

I'm going to keep doing this until they pick a good present. I just bought her a stylus for her ipad last week and gave it to her under the guise that ""I already had an old one she could have"" when I came to town to visit. A STYLUS FOR CHRISTMAS TOM? REALLY?"
12975,I love your passive agressive Chrristmas sneakyness!
12976,Seasons 1-10 of Stargate SG-1 on DVD.
12977,Quality choice!
12978,I wish my mom didn't already own those. I could be a golden child like you. Thanks for making Christmas shopping hard mom. :)
12979,"I've been buying my mom a lot of little cheap gifts and it's been going well. I always show up with 10 or 20 small packaged gifts that she's into, usually little knicknacks from ebay or [fillerdeals](http://www.fillerdeals.com)."
12980,"I'm not buying her anything, I'm making her a wooden box. It looks pretty terrible so far, but I'm trying really hard to complete it before christmas."
12981,What kind of box? Like jewelry box? Good on you for some old fashioned elbow grease and craftsmanship.
12982,Honestly its a box for her pot.
12983,"Why would she keep her pots in a box? harhar - that's cool, man."
12984,"Just as a plan B if your box isn't up to your ""gift to your mom"" quality and you want an alternative, check out etsy. Lots of really talented artists and tons of cool boxes for shrubberies. Just don't go there now and keep working on your box. Some artists on there make me feel like my attempts at creativity are trash. Hope your box turned out awesome!"
12985,What's in the box???!!
12986,"I made a comment about our peeler being a piece of crap when I was making the salad for Thanksgiving, and she said I could buy her a new, good one for Christmas. So I'm gonna get her a new set of little kitchen stuffs, measuring spoons, a peeler, spatula, etc."
12987,I have no fucking idea. Will continue to read this thread in hopes of finding a good idea.
12988,"A gift certificate for 2 people for a cooking class.  She'll choose the class, we'll both attend."
12989,What if she doesn't invite you to attend?
12990,This is wonderful. The best one in the whole thread.
12991,"She's getting two puzzles and a laundry shelf.

Both of these things are so she'll stop complaining about not having anything to do and complaining that her laundry shelf is collapsing. 

Best $28.79 I could have spent."
12992,My Mom's mom (grandmother passed away) and there is a pie recipe she makes every Christmas and Thanksgiving from her mom that she worked years to replicate. So a custom recipe art print from Etsy that she can hang in her kitchen of the pie recipe so she can always be reminded of her mom.
12993,Do you have a link to the website? My mom's mom passed away a couple years ago and my mom would absolutely love having one as well.
12994,That is such a lovely idea! Good job :)
12995,"I am knitting her a pair of slippers, and making her a bunch of my homemade bath products. 

I like to make things."
12996,She's never owned a really nice purse so we're getting her a Coach bag.
12997,Try a Coach outlet store if you haven't already.
12998,"Will do, thanks!"
12999,So she still won't own a nice purse...  interesting...
13000,"Awwww, look who's snarky!"
13002,"Every year my mom and I exchange books with notes written inside the front cover. We share a love of reading, and one of my favorite things is looking through book stores for a novel I know she will love. She is the reason I am an English teacher."
13003,my mom asked for a super nintendo along with donkey kong country. you bet your ass i'm getting it for her. going to throw in some mario kart as well.
13004,Throw in Link to the Past and she'll be set for a while.
13005,"if i thought she would get into it, i would. one of my personal favorites, but she really just wants the co-op/split screen games she remembers playing with me."
13006,You better let that sweet lady win!
13007,I just set up my son's PS1 so I can play crash bandicoot. Good gift!
13008,Habanero olive oil and ginger balsamic vinegar. She likes to cook spicy stuff.
13009,"2 books, 3 seasons of Vampire Diaries and Â£15 iTunes voucher. It doesn't seem like much but it's everything she asked for."
13010,What about the other 2 seasons??
13011,[kintsugi](http://en.m.wikipedia.org/wiki/Kintsugi) on a pot I made her in high school and accidentally broke + a poem
13012,"I'm getting married next year, so I'm getting my mom a gift card to a local designer / custom dress shop so that she can have a nice custom dress made for her to wear as the mother of the groom."
13013,That's lovely. Good on ya
13014,Or get her something she wants. Jk that's nice of you.
13015,"[The Intouchables](http://www.imdb.com/title/tt1675434/).. She loves feel-goods and french movies, so I bet this is gonna be a winner"
13016,Fantastic movie!
13017,My mum is chinese and said that she wants to learn english. She has a moderate understanding. I bought her To Kill a Mockingbird.
13018,Bette Midler tickets!  She took me to a Bette Midler concert 15 years ago so it's my turn to take her!
13019,Nice! This might be what I've been waiting for. Checking if she is touring in my parents'  city.
13020,"In June my brother committed suicide and it has my mother absolutely destroyed.. but she has a giant urn on the fireplace in remembrance of him, I found these beautiful colorful stone urns I'll attach a picture in a moment, but that is what I am getting her."
13021,Nothing. She doesn't like Christmas (childhood issues) and doesn't want presents. I might make a donation to a charity in her name just to watch her being conflicted.
13022,That's normal. Sounds like you two have a healthy thing going on.
13023,"She would appreciate it, I'm just kidding. But she doesn't want... material gifts, so to speak."
13025,The Human Fund is a great charity.
13026,Money for people.
13028,"How do you feel about it? 

I've never been very big on Christmas either, probably because it was never a huge deal in our home. So I'm fine with spending it halfway around the globe from the rest of my family this year."
13030,ðŸŽ¶ Colt 45 and two zig zags... ðŸŽ¶
13031,"A card. She knows I'm about to unemployed in about 6 weeks or so and she doesn't expect me to spend a lot of money ahead of that. 

That said, as a slightly insane music enthusiast, everyone's getting mix tapes for Christmas. Mom (a country person) is getting four discs worth of music that she's either asked for or that I know she'll like. I'm doing the same thing for my Dad, brother and a handful of my friends. It's something they'll love and get a lot of enjoyment out of, and it's personalized enough to say that I care. Best of all, it means I don't have to spend money that I don't have."
13032,All my Mom really wants is a big family Christmas but I'm going to get her an old fashioned apple peeler which she's been asking for all year.
13033,What kind?
13034,"I found someone online selling her favorite perfume from the 80s that has since been discontinued, so I ordered that for her. I think I'm also getting her a memory foam lap desk because she loves playing games on her ipod in bed."
13035,Can give me a link to that memory foam bed?
13036,"I already gave her her present. Her sister, my aunt, developed lymphoma earlier this year, so she really needed to stay in close contact with the family.  The problem is that her cell phone was utterly horrible. It was a cheapo phone on a pay as you go service. It constantly dropped called and was useless to text and read emails on.

So I asked her if she wanted me to get her a phone and put her on my Verizon plan and call that her Christmas present. She said yes and is now the happy owner of an iPhone 6+. It ramped up my Verizon bill a good bit, but she's happy."
13037,Mom bought 13-piece serving set for Grandma for Christmas. After packing in car Mom says she wouldn't mind 13-piece serving set. Bought 13-piece serving set for her.
13038,A Ruger Service Six.  Yep. I bought my 70 year old mom a revolver.
13039,No clue. She has no hobbies and does nothing. I have no idea.
13040,"You should give her a nice picture of you, and any siblings if you have them. Put it in a nice, small frame. My mom's similar to yours, but she asks for stuff like that every year"
13041,"Been there, done that. She has zillions of photos of her offspring! When she wants something, she just buys it for herself and doesn't say anything."
13042,"I thought I was the only one in this situation. Same deal with my dad too, neither of them do anything. And they're divorced, so I can't just set up a nice date for them either."
13043,Find a friend and become mother lovers and bang each other's mothers.
13044,Cause every mother's day needs a mother's night.
13045,If that is wrong I don't wanna be right!
13046,Must be the second best idea he's ever had
13047,We are so cool and thoughtful
13048,Imma be her syrup she can be my waffle
13049,I like the way you think
13050,"Moms are so hard to shop for. I think I did alright this year though. She dragged me into this girly shop when she was visiting me a couple months back, and liked 2 things: a decorative vase for $100, and a set of salt and pepper shakers for $60. She said she couldn't get both and elected to get the shakers. Over the past few months, I have accidentally let slip that the store closed (locally owned, I said the owners moved out of state). She was so sad. Unbeknownst to her, I bought the vase from the store last week."
13051,"I bought her tickets to see Cat Stevens/Yusuf Islam in concert. I love buying presents that are an experience rather than something physical, and especially an experience we can share together."
13052,"This is my preferred gift.  I took my dad to go see the Trinidad vs. De LaHoya fight at Madison Square Garden because he's a boxing fan and I know he would never buy tickets for himself to go. 

I've bought Broadway tickets for mom in the past.  This year I bought tickets for the family to go see Wait, Wait, Don't tell me in Austin for her birthday because she's the one that turned my wife and I onto NPR. 

The hard part with these gifts is making sure the person you're gifting is free during the event."
13053,My mom loves him too.
13054,"I got my mom a brand old Nexus 4! It's two years old never been opened, but it's a Nexus, so it can still run Android 5.0 with zero bullshit. I spent all night upgrading it through every major and minor Android version that's come out in the last two years, and charging the battery inductively, so she gets to be the first person to actually take it out of the wrapper and peel the screen protector things off, and it'll be ready to go.. I'll be turning it over to her in less than an hour :D

After she moves into it and whatnot, I'll replace the radio firmware so that it can use 4G too."
13055,I wish my family celebrated Christmas almost a month early.
13056,Tickets to LA's Wicked.
13057,I am paying an artist/friend to paint a picture of our family dog (mum is obsessed with him) and getting it framed.
13058,Netflix subscription.
13059,"Be prepared for phone calls similar to the following:

""Whootman?""

""Yeah mom?""

""I can't get the Netflix to turn off!"""
13060,I'm paying for a lawyer because she is sueing me.
13061,Eminem is that you?
13062,A bracelet with me and my siblings birthstones on it and a facial.
13063,">facial

( Í¡Â° ÍœÊ– Í¡Â°)"
13064,"My mom is always looking to me for fashion advice, so I got her a necklace from J Crew that I loved but also reminded me of her. I even have a few outfits of hers in mind that she could wear it with. I'm really excited for her to open it :)"
13065,"I know it's kind of late to be posting... 
But I got my mom three tickets to see the Trans Siberian Orchestra. She loves music

Last year I got her ugg boots, because her feet are always cold 

Year before I got her accessories for her new iPad. 
  
Pick something thoughtful. Notice her likes and go off of them! Good luck :)"
13067,"Dyson Animal Cordless Vaccum.

nothing says happy holidays like a clean house. 

^^i ^^love ^^you ^^mom"
13068,I really hope you're my kid.
13069,"More like ""nothing says happy holidays like 'here's something to clean your house with.'"""
13070,What do you mean? Santa is bringing everything!
13071,"A donation to a charity that means something to her.  A few years ago we realized we'd all reached the age where we didn't need more stuff, so now our family gives donations for each person (money, time, items, as needed by that charity) then there's a big reveal on Christmas.  It's fun!"
13072,My mom moved to North Carolina 4 years ago (I'm im California) This summer was the first time I saw her in two years and 3 years since all of my sisters and mom and I were together. Her boyfriend had a training in LA so I got my sisters together and my mom and recreated an old glamor shot we took in the early to mid 90's. I'm a cosmetologist so I did everyone's makeup and hair and I'm having my roommate photoshop it. I haven't posted any version of it on social media so I'm hoping she forgot about it. I'm sending it to her in a nice frame and trying to get my older sister to send her the original for Christmas as well :).
13073,"A gift card for one of those paint-your-own-ceramics places.  I'll take her whenever she's ready to go, and we'll spend the day together."
13074,"She doesn't want me buying anything for her, so I'm going to a doctors appointment with her a few days after Christmas and I'm going to take her out to lunch when she's done there."
13075,Chinese food. We're Jewish.
13076,"What 8 things are you buying your mother for Hanukkah, and how many won't be as good what Henry down the street got his mother? He's a doctor. Got a wife and everything. Why haven't you settled down with a nice girl, yet? And you never call anymore."
13077,My God. Its like you condensed the entire holiday into one succinct paragraph.
13078,She asked for a boot knife. So I got her one. I'm honestly jealous of it.
13079,A boot knife? I like your mom's style!
13080,A family portrait since she doesn't have one yet.
13081,This is a great freakin idea.
13082,Thanks! My sisters are finally on speaking terms now so we can finally get a portrait done.
13083,Family portrait with actual working family. It's even better!
13085,"Be yourselves in the photo, she will love it even more (I hope). I'd rather have a genuine photo of the people I love than a fake smile pic."
13086,"http://mckayimaging.com/blog/wp-content/uploads/2011/10/03mckay-imaging_family-portrait.jpg

I recommend this one."
13087,I won a $100 home sense gift card at a convention. I'll probably throw in a book with it but yeah that's it.
13088,"Books, lots of travel books. I'll also get her an Amazon gift card so she can order some TV shows on DVD. Easy and it makes her happy."
13089,Blanket with pictures of the family on it and coasters with family pictures as well
13090,"Am a poor student, knitting mittens as I type this."
13092,Me and my siblings are all kicking in some money (there's a total of 5 of us) and we're buying my mom a ring that has each of our birthstones on it. Her mom has one (8 kids) and HER mom had one as well (6 kids)
13093,"A Tervis! She drinks tea like an alcoholic, so I got her a nice cup to drink from. Plus, it has a Walt Disney quote, and she loves ALL things Disney."
13094,i don't have much disposable income. i may print out one of her favorite photos of her deceased father and frame it for her.
13095,Nice try.. Mom!
13096,"My genius girlfriend noticed that my mum has some Wade figurines. She has part of two different sets.  We managed to find the missing two from one set and got another two that puts her other set to 5/8.

She is gonna be pissed at how much we spent so I'm also bringing the gift of lying about how much they cost too."
13097,A phone call; shes not much into the physical things and I don't see her for long periods of time due to being in the Army.
13098,Nothing. She passed away a few years ago :(
13099,A hard drive which I'm scanning every family photo into (which we have several large boxes of) and sorting them along with all our 8mm film home movies.
13100,Very exspensive wine
13101,I asked my mom what she wanted...T-Max socks. So that is what she is getting :)
13102,"The Maleficent DVD. She really liked that movie. But she doesn't know that I also got a copy of Sleeping Beauty, which she also loves."
13103,I'm having all of the Beatles album cover posters framed for my mom's home office
13104,"Nothing. Back in June she texted me a picture of her cat sleeping in a sunny window.  I plan to do a digital painting of it with some artistic flair(different lighting and exaggerated colors). The cat is old and starting to decline in health. I know she'll appreciatehaving this after it passes.

*edit* typos,typos,typos"
13105,My mom has been trying for years to quit smoking so I'm buying her one of those e-cigarette vapor thingys to see if that will help.
13106,"I know it may sound superficial, but I bought her a TV. 2 of her 3 kids are off to school now so she has alot more time to herself which she spends watching various TV shows and copius amounts of Netflix. She still has a gigantic CRT monstrosity and complains about it constantly. Last year, I bought her a blu-ray player and a HDMI to composite converter and she thought I was some kind of wizard. Now I'm in a more financially stable position so I can give her the whole experience. 

Meanwhile, my Dad cheated on her and blamed her for it. He's getting a T-shirt."
13107,Well my mom is going through a messy divorce because my stepfather cheated on her. She has no idea how long she'll be able to keep her house before she has to find a place to live and has no job because she's on disability. She doesn't have much money and has asked for only grocery store gift cards for Christmas. I'm hoping to do that and maybe stock her fridge. My husband and I don't have much money to do gifts but we'll try our best.
13108,Each year my mother gets me an empty photo album and the next year I give it to her full of pictures of her children and grandchildren.
13109,"Power tools.

Last Christmas I won a battery-powered Ryobi circular saw and drill kit from a contest at the local Home Depot. (Specifically, [this set](http://www.homedepot.com/p/Ryobi-18-Volt-One-Lithium-Ion-Drill-Driver-and-Circular-Saw-Kit-2-Tool-P826/204321512).) The saw is a little weak but the drill is nice enough, but when I showed them to my mother she was fascinated. My mother does a lot of small, simple jobs around the house and power tools make things easier for her, naturally, but all of her power tools are corded and most of them are old and extremely heavy, and these days she sometimes has trouble hanging on to them. So this Christmas I'm buying her [the complete set](http://www.homedepot.com/p/Ryobi-ONE-18-Volt-Lithium-Ion-All-in-1-DIY-Combo-Kit-12-Tool-P859/204065437). They're much lighter and easier to work with so I think she'll be happy."
13110,My mom has been looking for the original Joy of Cooking book from the 70s for a few years. I found one at a used bookstore & got it for her.
13111,"This year, I'm getting my Mom perfume (it's on her list)- but last year, we got my parents tickets to the zoo.  So the four of us went, had a BLAST, and then my husband and I bought lunch and beers after.  Lots of fun memories!!  My Mom always took me to the zoo when I was a baby, so it was fun seeing her experience as an adult and her pointing out all of the animals I loved as a kid."
13112,Nothing other than supplies to do some projects for her around the house.  My dad is passed away and she loves when I do projects for her.
13113,I'm not buying her anything. I can't afford to. I'll probably make her a painting though.
13114,Bought her some USB powered heated slippers. She has Raynaud's Disease and has to keep her feet warm as much as possible.
13115,I feel like I need to get these for my gmom. Where did you buy them?
13116,Whisky. She actually likes it. Last year a day at the spa for pampering.
13117,"Just as a side idea, maybe throw in some [whisky stones](http://dattwenty.com/pages/B00ARLHYMO) too as an add on gift."
13119,Found a nice hand carved Christmas themed music box.
13120,"I will usually find her a bottle of wine, a gift card, or give her a book that I loved. I have also crocheted her things like slippers and scarves."
13121,a gift certificate for a massage
13122,"Gift cards for food.  A LOT of people either bring food or the mom will have pre-made a ton of food, which tends to be a lot of lasagna...so gift cards to food places can be great.

A cleaning service, or for you to come over and clean.  It's easy in the first few weeks to get swamped learning new baby shit that the cleaning goes out the window.

Things you know the mom likes: Hand cream, magazines, books, candy, really great coffee.

Things you know moms always need: diapers, wipes, extra baby stuff no one thinks of until the last minute (infant tylenol, first aid stuff).

Other great ideas:  Slippers, a nice big but comfortable robe, more snacks, chapsticks, dry shampoo, subscriptions to things like audible or a meal service.

source: I am a mom and currently pregnant with twins and this is what I would be down to get."
13123,"Time:  it can be very lonely when home with an infant. Even better if you watch the baby so she can nap.

Frozen meals.

Cute hair accessories, a pretty (but comfy) cardigan."
13124,A fuck-ton of diapers.
13125,"Practical: food for mom and dad
Typical: diapers (size 1) most new parents get enough newborn and they grow out of them fast. 
Wow: gift certificate for a newborn photo session

The thing with new moms is that if they have a decent sized family/friends list is that everyone gets them stuff. 

Donâ€™t buy clothes, the kid will probably never wear it. The first few months theyâ€™re in sleepers a lot. And everyone does the â€œthis was soooo cuteâ€ had to buy it.

The best gift is to find a way to make their life easier. Walk their dog, bring them dinner, let mom and baby have time to bond."
13126,A bottle of champagne and a gift certificate to her favorite hair salon.
13127,"Your time and friendship. The second best gift? A gift certificate to a professional photography studio. Yeah, we live in the digital age of cellphones and all that, but those hard copies you can hang on a wall have real value."
13128,Go to her house and let her take a nap for a few hours while you babysit and help clean up the house.
13129,$250 dollar gift card to her favorite super market.
13130,"Jewelery, books, scarfs, fancy teacups"
13132,"Diapers, baby wipes, diaper rash ointment, formula, baby gas x, oragel, or for more personal cook a couple dinners that can be frozen or stored. Offer to babysit or help with laundry and cleaning the house"
13133,"- Home cooked food for a week, in tupperware

- The new parents will be getting newborn clothes up the wazoo. Get them some toddler clothes instead.

- When they're up for it, watch their kid for a night."
13134,A hysterectomy
13135,Book with simple fairy tales and stories.
13136,Wine!
13137,"If going to baby-showers my advice is a date night for the couple. Like a gift card to a nice restaurant. 

A lot of attention is focused on the little bundle of joy and sometimes the parents can get so caught up in preparing for the new arrival they will forget about themselves and are in a state of panic, worry, anxiousness and are probably stressed beyond belief. 

So a nice night out is a good way for them to relax, unwind, and get themselves back on track."
13138,Gift card for the supermarket. Those diapers are expensive
13139,A pack of condoms - may she learn from her mistakes.
13140,( Í¡â—‰ ÍœÊ– Í¡â—‰)
65394,no
13142,"Robe, jammies, comfy slippers, good soap, lotion and cologne spray from Bath and Body Works, earrings, bracelet, necklace, soft scarf, gloves and hat, a good book, a good puzzle, her favorite coffee or tea, pretty kitchen towels and hot pads to match, satin pillow cases, etc... I am a 50+mom and I would love any or all of these! Also, Ethyl M chocolates shipped from Vegas. The lemon cremes covered in dark chocolate are just ridiculously yummy. You can find Ethyl on the web. They really are to die for."
13143,hey!!! thanks reddit mom! hope you get all of 'em!
13144,You won't go wrong. Promise. Merry Christmas!
13145,Someone got me a gift cert to Bath and Body works. I had never been there and came away with my new favorite body spray White Citrus. Closest I've been able to find that envokes my teenage memories of Loves Lemon body spray.
13146,Augh!!! White Citrus is my GO TO weekday fragrance! My thoughts exactly about Loves Lemon! Ha. Great minds do think alike! ðŸ˜‚
13147,"I'm hitting up Williams Sonoma and getting some cool towels and those hot pot holder things. Googled ""hot pot holder thing"" and I'm told it's a trivet. 

I feel like those are good items for a mom when you don't have any golden ideas. If she doesn't have some quality ones, great. If she already has some, they'll wear down and get nasty soon enough."
13148,Oh you can't go wrong with Williams Sonoma. Get her a little box of their mulling spices. They smell soooo good on the stove. â˜ºï¸ Merry Christmas! I feel like I know you a bit.
13149,"Well, it depends on age.... but older women seem to like those capes that are out now.  Scarves work, also if there are grandkids anything with their face on it ( think Shutterfly stuff ).  My mom loves when I make calendars with the pics of grandkid."
13150,"she's 50 plus. I'm 20, got my first job that's why I wanted to give her something :D"
13151,Sweet.
13152,"My mom always goes for purfume, lotion, candles, or just pictures of family."
13153,[the perfect gift ](https://imgur.com/gallery/mNK5aNA)
13154,*insert dead pikachu meme
13156,"Mom's usually always love pictures. New and old. Have some professional pictures done of you, your family, your kids and frame them. Maybe find some old pictures and have them reprinted and framed."
13157,spa trip.
13158,"Self care things. Candles, soaps, oils, etc. My mom travels a lot for work so I got her a travel oil diffuser and some calming oils."
13159,Crotchless panties. It's a gift for her AND me.
13160,"Well, I'm not a mother, but I think that I am qualified to opine on this. 

A lot of folks will recommend a ""spa-day"" or a night at a hotel or a really nice meal or something like that. Those are great suggestions. My wife has a $150 gift certificate for a local spa sitting in her bra drawer. And it's been there for 8 months. I gave it to her three months after she had our second son. 

At three months (and in general, quite frankly) my wife had zero interest in going out and doing something without the baby or anything that would require her to adjust from breastfeeding on demand. Not saying it's wrong or right - she just feels really strongly about it. 

So that full body massage and haircut (which she said she needed - I was listening, dang it!) is just not going to get used by her. 

I'll tell you what she does love though - her Kindle Fire (substitute iPad mini, if that's your thing). All those middle of the night feedings? Slightly mitigated. Stuck in a rocking chair with a lightly sleeping baby and the sound of paper turning wakes him or her up? Never fear, e-reader is here. 

Now, you could whisk me away to /r/hailcorporate for this, but she just loves it. Plus it's small - an iPad is kinda big to juggle with a little person hanging off your tender parts. 

That or certificates to a cleaning service. Those go over pretty well and they're tres practical."
13161,YES! And I am a mother.
13162,"As a stay at home mom, gift certificate to a cleaning service would pretty much guarantee my husband as many blowies as he wanted. You know, for the duration of the cleaning service, at least."
13163,"Said certificates did not have advertised effects. 

Buying more now. 

Will update."
13164,"Stay at home mom here too, and this is my vote for the cleaning service too!!!!!!!"
13165,"My SO gifted a deep clean by maid service for our home when our daughter was about 6-7 months.  He ((and I!)) liked how much happier and less stressed about my mountain of housework I was, and continued once a month cleanings for almost two years.  When the ladies came,  we had a family date.  

The most appreciated gift he could've ever given me."
13166,"I have never heard it called a blowie.
Thank you for the new word."
13167,"As a SAHM, yes I agree with this 100%. Something special that she can use at home, or wherever she is really. Get her a gift card to go with it so she can have something to look forward to."
13168,Agreed. Rocking baby while playing Plants vs Zombies. Makes early morning/late nights doable.
13169,"I was dying for a prenatal massage, my hubby got me a gift certificate, but I never booked it, I now have a 4.5 month old, and still have a massage gift certificate - I would use it, but I have no sitters, and our weekends have been crazy. But I have a Kindle (actually, it was also a gift from my hubby, he is pretty awesome), and it is great for when I am nursing and want to do something, but the TV would wake my husband, or our older daughter, and books are kind of awkward to hold (although I will balance one on the Boppy, if I can't get the book I want from the library on my Kindle, but they have a hard copy.) I don't even have the Fire, so I am just reading, but I do love it!"
13170,"My husband got me an iPad for a combo Mother's Day/ birthday present when our daughter was a month old. If the iPad Mini had been available then, that would have actually have been better! It was a great gift. I loved reading on the Kindle app while I was nursing. Now that my daughter is 2.5, she actually uses it and it helps when I need to distract her and get something done. 

Even better than a cleaning service gift certificate is to actually book it. Sometimes it's the little things - like making a phone call to schedule a time to clean that can feel like a huge hurdle to get past in those early days of motherhood."
13171,"Listen to this man. I also have a 4 year old $400 gift certificate to a spa. I  work 60 hours a week and have three kids under six, I just don't have time."
13172,"Set up a date for her friend and her to get out for some dinner, drinks, movie, whatever.  Give her like 3 or 4 hours of carefree time away from you, the house and the kid.

Send her out, take care of the kid for a few hours and text her that everything is great(even if it's a friggin' mess).

Maybe try it a couple times because she might be so worried about the kid the first time she's away from the house, it may be a bit of a buzz-kill.  After she's gone out a couple times and is more comfortable, get a babysitter and take her out on a nice date(but be careful, this is when lots of second kids happen ;-))."
13173,"This is what worked for my wife.  Just get her out of the house and let her know you can take control of the kid situation.  Let her shop, get her hair done, go out with friends, whatever it is you think she'll enjoy the most.  But most importantly, you take the kids and just deal with whatever comes up without calling. One little text of  ""Where do we keep the sippy cups?"" could kill the whole thing."
13174,"I would have been fine with hubby calling about the sippy cups. What kills it is coming home to find that the only thing he's done is keep the baby alive - the house is a wreck (worse than you left it), he can't remember when the baby last ate or got changed, etc."
13175,"Lol, OK.  I guess that's what I mean by ""handling the kid situation.""  TCB.  Take care of business."
13176,"Yea, I had a hard day at home during my maternity leave and left when my husband got home. I had to buy a dress because I was too postpartum plump to fit into anything still, so I said ""Dinner is in the oven, I've got to go get a dress and I can't take the kids.""  Apparently he didn't listen and just sat at the table waiting for me? He called me an hour later and said ""Have the kids been fed? They seem hungry...""  I had to do a serious count to one hundred to not throw my phone across the dressing room."
13177,"Gifts are nice. If your wife is anything like mine she would appreciate a break more.

Try to make it a daily habit when you get home from work to take over all parental responsibilities for at least an hour. Diapers, bottles, everything."
13178,"This is much harder to do but it is definitely the best idea IMO.  The last hour before my husband comes home and we are double parenting is the longest and toughest.  When he comes home and plays with the kids, gets them out of the kitchen so I can finish supper or takes them for a walk I could just about cry with relief and gratitude.  While gifts are nice taking over for an hour or two each evening (or morning) can go a looooong way to easing a stay at home moms stress level."
13179,This is my favorite. I always prefer finding that one of my chores is done over getting more stuff.
13180,"I love gift cards for online retailers.  Not only do you get to shop from home, but then it comes in the mail!  Books, clothing, craft stuff, cooking tools, or general favourite websites. I could spend hours browsing stuff on thinkgeek, jimmybeanswool, etsy, or even just amazon. 

Sometimes just getting out with a kid to a store is way more work than it's worth.  Shopping online relieves that stress."
13181,"I'm not big on spas or other stuff, what I wanted was TIME!

My husband did the best thing ever and offered to have a maid service come help for a few months. It's not that expensive if you get the right one (ours visits bi-monthly and it's $60 per visit) Even when I was staying home those first few months it was SO SO SO worth it. Not having to worry about clean toilets and just focus on the kid was the best present he could have ever given me!

Forget the pretty toes, a good night's sleep combined with a maid -- best present ever!"
13182,"It all depends on what type of mom she is, and that can also change from day to day, so communicate with her; or at least listen to her really well. 
When I was at this point in the SAHM routine this is what worked for me:
Having a service come and REALLY clean the house (while the baby and I had a nice lunch outside on the patio with a friend (the friend also brought the nice lunch). ;)

Similar situation, but relative or friend brings nice dinner so hubby and I can sip wine and eat pasta at the table while relative/friend takes care of baby in the other room.

I didn't want to be away from my baby for long at all, don't wear much jewelry and wouldn't know what to do with a 'spa day'.  You really do have to know what she truly would like at this point, since she is most likely hormonal as hell and too tired to think straight. Again, LISTEN to her. 

If she likes jewelry, there are many sites out there that make beautiful, personalized pieces that any mother would cherish. 

If she likes spas, go for it! And  just make sure you have arranged acceptable chile care for her in advance. 

If she likes to look good, a shopping spree with some new/non-maternity clothes would be nice!

If she likes recording family moments, hire a professional photographer to come to the house and do a formal sitting....maybe pair that with a spa day so she looks extra relaxed?

There are sooooo many things you can do for her at this point, it just depends on her personality. The fact that you are even thinking along these lines shows that she is a lucky lady. I think you're going to do just fine, Daddy!"
13183,I think hiring a cleaning service for a few hours would be appreciated.  You give them your budget and they tell you what they will do.  It would be nice for someone to come in and get to those tasks done around the house I just Havent had the time or energy for. A weight off my shoulders.  Btw super sweet of you to want to do something for her just to show her she's awesome!
13184,Have a cleaning company come in. Best treat ever. I love it when my husband surprises me with a spotless house!
13185,Spa day
13186,If she is a person who would like that. I find the whole spa environment more awkward than relaxing but damn getting my hair and nails done would be amazing.
13187,"For a new mom, having someone just pay attention to you and take care of your needs, for even an hour would be amazing."
13188,seconded. my mom came to visit - i live out of state - and she held the baby while I got a haircut. SO NICE.
13189,"> and she held the baby while I got a haircut.

Like she went to the beauty parlor with you and physically held the baby while you got it cut or you left her with the baby?

If its the former, I'd suggest leaving the house for a few hours while the baby is with grandma, dad or someone else. I think if a visit to the Saloon (with the baby) was all the ""me time"" my wife got she'd have gone totally stir crazy."
13190,"The baby came along, but mostly so the two of us could keep chatting and gossiping."
13191,"I think this totally depends on the person. I thought I'd be like this, but after two babies I've realized that I'm less stressed when I can see the baby, at least first six months or so. If somebody else is holding, I can still relax and enjoy myself."
13192,"Hahaha I'm guessing you meant salon but a saloon is my idea of me-time :) 
   In all seriousness though at that age, for me, being away from the Baby was more stressful than not getting a break. Depends on the mom. I would say a massage and a sleep in is a delightful idea though."
13193,I totally hear you.  My husband loves massages but the idea of being rubbed by a stranger is not relaxing to me.
13194,I thought I was the only one. The spa would have to pay me to submit to that.
13195,"My only problem with that is that when you're nursing, if anyone massages your back and shoulders, it tugs on whatever mechanics controlling the milk.  My friend would rub my shoulders and invariably, I'd start to leak milk.  Maybe it was just me.  I was sort of a bionic cow when it came to producing milk."
13196,Bahaha. I have over supply and am a massage junkie. I always just put a towel under my boobs
13197,"My husband gave me a spa day when our son was 12 weeks old.  Up to that point I had only been out a few times to the pediatrician, first time mom nerves kept me home.  This spa day was such a stress release for me I truly felt like myself again for weeks afterward.

And if she doesn't do the spa thing, just give her a Baby Day Off (breastfeeding may limit this).  My husband still gives me Saturday every week to just do what I want and our son is a little over 2 years now.  Being at stay at home mom is as hard as any other job and they all get a day off, right?"
13198,"A night in a hotel. Honestly. Maybe you can schedule it when you can get some help with the baby. But book the room, schedule a 3 pm or so check in, maybe give her books, magazines, movies, snacks, whatever she likes, and let her have a night to sleep, soak in the bath, watch tv, and just relax.

Alternately, if she would have a hard time leaving the baby, I'd suggest  something she'd never get for herself like a beautiful winter coat."
13199,"As a father of a three month old son, I can't imagine this being nice for my wife.  I think this is the type of thing that mothers of multiple toddlers enjoy, getting away from the chaos.  But when you're breastfeeding a three month old, the chaos comes with you.  The coat sounds good however."
13200,Totally understand!
13201,I really like these ideas.  I agree it is important to figure out if she's be okay with a night away from the baby before booking it.  I know that I would not have considered a night away at such a young age because it would have been very difficult with breastfeeding/pumping and would have caused me a lot of anxiety.  I would have loved something I wouldn't have bought for myself!
13202,"I'll second that - at three months too much time away wouldn't have been relaxing for me - later on, absolutely, but not at 3m."
13203,I couldn't imagine being away from my 3 month-old for the night. Especially since I nurse.
13204,"Shoot, I wouldn't want to go by myself to a hotel, I'd want my husband there too to have some us time w/out worrying about the baby."
13205,"If she can be away from the baby for a while (there's expressed milk at home or formula), let her do that. Make an appointment for a haircut/color, maybe call up a girlfriend of hers and make reservations for them to have lunch, or just hand her the cash and send her out the door. The break will be best thing you can give her.What a marvelous man you are for thinking of this, BTW. Very thoughtful!"
13206,"Bring home dinner from her favorite restaurant, and then hold the baby while she eats it.  Every night for a week.  Bring flowers so she can see something bright and cheerful to remind her that you love her.  Hire someone to help clean and/or cook.  Write her a letter telling her how much you appreciate her.  With a baby that little, eating really is one of the hardest things, especially if she's breastfeeding.  You're always hungry and every time you try to make something the baby knows and screams.   Maybe books or magazines or a kindle or something if she likes to read while sitting with the baby, or netflix or something like that if she prefers to watch TV."
13207,"Give her some time - that's all I ever wanted when I was home with kids - time. During that time, however long it is (a couple hours at least) let her go off and do whatever she wants, see a movie, meet friends for lunch, shop, hike/bike/ski etc. - you stay home with the baby (or if what she wants is some time with you, you arrange babysitting) make sure to take care of any house chores your wife would normally do during this time. Don't let her come home to a pile of unfolded laundry and a full dishwasher."
13208,"A HOT MEAL.  ALONE.  When I was a stay at home mom, I nursed and had the baby 24/7 pretty much.  (Ex wasn't exactly helpful; hence - EX)  I remember going out to eat with friends and/or family involved me holding the baby the whole time and eating cold food with one arm while trying not to spill it on my baby's head.  Then I'd eat as if I were in a timed competition, because I knew I'd need to nurse or do something with my baby that required both arms.  I never finished a meal.  So, as a former stay-at-home mom, I HIGHLY RECOMMEND allowing your wife to eat a HOT MEAL without a baby in her arms at least once a week.  It's like a little piece of heaven most people don't understand.  :)"
13209,"Can you take a day off from work and let her sleep in and veg? My husband does this occasionally and it's glorious. 

I realize all jobs do not lend itself to this luxury."
13210,"If she's the type to enjoy spa stuff (I know I'm not) then something like that - otherwise, I would suggest anything that she does enjoy to pamper herself. 

For me, it would be time to go to yoga class, or maybe a new yoga mat or something else for a hobby I enjoy (even if it's just the TIME to pursue that hobby, since I'm sure she's been way too busy). Hell even a nice hotel room where she can order room service and take a long nap and relax in a jacuzzi tub might be appreciated."
13211,"As a SAHM that used to work, I find that I don't spend money on clothes for myself much anymore. I'm at home so why bother? Maybe treat her to some good date/going out clothes."
13212,at 3m post partum though - clothes can be really depressing....depends on if she's back to her size or not. Last thing I would want is nice clothes in my 3m post partum size...
13213,Cleaning service AND spa day.
13214,"a babysitter and a special night out with you doing something she would love.  Go see a play, eat at a fancy restaurant, go for a romantic walk etc.  And make sure to tell her how awesome you think she's doing.  

If you're looking for an actual gift, I've always wanted one of these [pendants](http://www.amazon.com/s/ref=nb_sb_noss_2/181-1654572-0141214?url=search-alias%3Djewelry&field-keywords=loving%20family%20pendant) or a really nice locket would be great too."
13215,"As a stay at home mom, I like things that make my life at home easier. A spa day is nice, a romantic night in a hotel sounds amazing, but these things are temporary. I asked my husband for a Dyson personally. I have all tile floors and sweeping them everyday is a pain, it's much easier and faster to vacuum the floors. He thought I was crazy for asking for such a mundane thing as a gift, but it honestly has made life easier and given me extra time to spend with LO, and that to me is a great gift. Not saying run out and buy her an awesome vacuum, but ask maybe if there is something you could buy/she wants that could make life at home easier on a daily basis."
13216,"I love my roomba robot vacuum. Seriously, you can set the timer and it will do it automatically everyday. Perfect when the kids start crawling."
13217,"You're my type of lady. I have asked for an ironing board cover as a gift on more than one occasion.

I agree about something that would help make the day easier. Though I guess with practical gifts you really have to know your audience. Not everyone appreciates a new garbage disposal on Valentine's Day."
13218,"Ha! I understand that. My mom flipped when my dad bought her a kitchen utility as a gift one year. Here I am thinking ""huh, that's practical, I would love that!"", but her, she lost her damn mind."
13219,"Practicality is so underrated! I got my husband an electric drill and a compost tumbler for his birthday this year and my father-in-law acted like I was some kind of asshole. He said ""so it would be ok for you to get an iron for your birthday?"" I kindly reminded him that 2 years prior his son had bought me not one, but TWO toilets for my birthday (complete with installation) at my request.

Different strokes for different folks, I guess :-)"
13220,"screw the dyson and get the roomba -- life. saver. 

Set the button after meals and it saved so much time. Especially during the food throwing phase. Get the scooba for mopping the floors. Best combo ever."
13221,"I didn't find out about the Roomba until after I had the Dyson. It definitely sounds WAY more ideal, but I'm going to get my monies worth out of the one I have first. Can you imagine "" Hunny, I know you just spent $500 on a vacuum, but I found one I like more, soooo yeah.."" Im pretty sure he'd blow a fuse! Ha."
13222,"the words that sold my husband were ""house cleaning robot"" from there it didn't matter. It was a house cleaning robot. He was sold as soon as he found it :) 

we still use our dyson often for the deep clean but for the under the table stuff the roomba can't be beat imo."
13223,What is a Scooba? I need to utilize google.
13224,"roomba but a mop :) Put the solution in, press button, cleans hardwoods/tile floors (bathroom, kitchen, dining room) :)"
13225,That sounds amazing! I know what I want for Christmas. :)
