idx,text
47293,I don't think that's true at all. Chicagoans are largely down to earth and friendly.
47294,Have you seen Cubs fans in the last couple years?
47295,Yes. Not sure I understand.
47296,so much better than new york
47297,Don’t forget summer baseball and festivals!
47298,"As a New Yorker, that was the impression I got of Chicago.

""It's... it's like NY. But only friendlier. And cleaner."""
47299,"A little trip through New England!  Terrific small cities.  Portland, ME, Portsmouth, NH,  Boston, Burlington VT, Providence RI, Newport, RI.    All within hours of each other and a beautiful drive.   Young, fun, interesting cities.  (and there's not many folks that are on the ""Trump train"" in these areas).   Super safe, too."
47300,"Came here to say this! These cities are so fun to visit and they give you a real sense of New England culture. They are “small town cities” in a way. I grew up in New England and now live in NYC, but Portland ME and Portsmouth NH are still some of my favorite cities I’ve ever been too."
47301,"When you’ve had your fill of cities I would suggest unwinding in my state, Montana. There are great camping opportunities, white water rafting, awesome national parks, sapphire hunting, archaeological digs, etc."
47302,Miami sucks
47303,Miami does indeed suck
47304,"Nah, though I wouldn't encourage it if OP wants to see something different."
47305,"LA and LV are interesting places to visit, it just depends on what you want to see. They both have NHL and LA has two NFL teams"
47306,"Literally any city, but I find it ironic you've heard LA/LV are no good, because they're 2 of my favorite, they have 24/7 entertainment and things like Disneyland and Universal in LA, while LV is near the Grand Canyon and can keep you busy at least a few days on the strip. 

My order would be Los Angeles, Chicago, NYC, Las Vegas, and Miami. If you heard LA/LV are bad you might as well skip everything on that list because they're all bad. 

Cities like Dallas, Phoenix, and Houston all have enough to keep someone busy a few days. Like Phoenix is driving distance to the Grand Canyon, and in my opinion the most beautiful place on Earth, Sedona."
47307,"If you want to visit the South, I'd recommend Atlanta. I was there five years ago or so, and I really loved it. The food was amazing (please send Peach cobbler) and for a US city, there's a lot of history to discover as well. Many people rip on it, but I loved it, even the coke museum. Then again, we stayed with some great people and they went to great lengths to show us around."
47308,"Mind posting your rough itinerary? I've always thought of Atlanta as a good city to live in, but not a great tourist city."
47309,"Having lived there for a while, I think of it the exact other way."
47310,"No love for Charlotte? We have some fun stuff, too :("
47311,"For the love of heaven, don’t go to the Coke museum on a weekend. People in my family still talk in hushed tones about the crowds we fought at the Coke museum one nice summer Saturday in ‘16.    

You could ha e an awesome US tour by buying an  Amtrak pass and flying into / out of Washington.  Spend a day in each of these cities.     

Washington> Charlotte > Atlanta > New Orleans > Memphis > Chicago > Cincinnati > Washington."
47312,Atlanta is probably the last city I would recommend for a tourist. The traffic is horrible and the ghetto trash that lives there is even worse.
47314,...clean?
47315,"I've never been to NOLA but if San Fran is a ""clean"" version of NOLA I can't imagine the filth"
47316,"Eh, NOLA filth is nothing a Z-pack won't clear up. Usually."
47317,Or just booze.
47318,He's not overstating the filth of New Orleans as much as he is understating the filth of San Francisco.
47319,"As you mentioned, Minneapolis or Chicago would be good big cities to visit, especially if you want to see an NFL or hockey game. If you are in the Upper Midwest, be sure to at least spend some time driving along the shore of a lake and visiting the small towns along the shore."
47320,"I recommend Chicago, personally. I went last summer and was amazed. While stereotyped as a dangerous city, this is mainly concentrated in several low income areas on the South Side. The core of the city is incredibly beautiful, safe, and very walkable. It will get quite cold if you visit during the NFL season (Chicago's NFL stadium is located downtown, right next to the famous Grant Park) but it sounds like you enjoy that!

For sightseeing, I recommend the John Hancock Building, Sears tower (These first two will give you two great different views of the city from above), Chicago River architectural boat tour (A boat takes you around Chicago via its prominent river and a tour guide explains the historical significance of the surrounding buildings), Navy Pier, the Chicago River Walk (pedestrian path built beside the river), and the L train, among other things.

If you're looking to extend your stay and see other parts of the country, Chicago is also ideal because it is one of the main centers for rail transport in the US. This includes many wonderful overnight trains with sleeping accomodations. Not only can you take the train to another city, but you can see the country's incredible scenery roll past as you get there. I took a train back to my home in LA, but if you don't want to go there as you mentioned you can take trains to Seattle, Portland, San Francisco, and more. 

Sorry for the long comment with poor formatting (I'm on mobile), I just wanted to share my experiences. My Chicago/overnight train vacation was by far the best I've ever done!"
47321,Thank you for writing this for me :)
47322,Come to Minneapolis. It's really not that cold up here. It's incredibly nice on the summer.
47323,"Boston, MA!!!!"
47324,Football season is almost over. Playoffs start in January and ends in early February. So your window for that is about to close until late August when the 2018 season starts. Plan accordingly.
47325,deleted  ^^^^^^^^^^^^^^^^0.6588  [^^^What ^^^is ^^^this?](https://pastebin.com/FcrFs94k/22686)
47326,[Philadelphia](https://travel.usnews.com/Philadelphia_PA/Things_To_Do/)
47327,"World Heritage, baby!! Philly is a great place to visit. The history, the culture, the foooooodddd!!"
47328,Philadelphia is my favorite city in the U.S. after my own of course. I looooooooooooOOOOOOOOOooooooove Philly.
47329,"Love for Philly from a New Yorker, nice!"
47330,Philly honestly reminds me of the NYC of my youth which I think is a huge part of why I love it. I would move to Philly tomorrow if I could. <3
47331,So you want NHL and NFL so I'd say Minny is a good choice. They also have a basketball and baseball team too.
47332,"I mean if you really wanted to go to LA, you could. You'd just have to let go of all things you think LA would be like. Stay at an airbnb, Uber/Lyft around and head to LACMA or The Broad or whatever other museum that sparks your interest, Little Tokyo for some good ramen, Koreatown for some kbbq, some Mexican taco trucks, etc."
47333,"Washington DC, New Orleans, Chicago, San Diego, San Francisco or Seattle. Can’t really go wrong with any other these cities, they are all awesome places to visit as a tourist and each city brings a different element of the country."
47334,"Philly. So much history is wrapped up in Independence Hall. (Such as the signing of the Declaration of Independence.) Reading terminal market is a great place to shop. You can visit both Citizen’s Bank Park and the Flyer’s stadium. See the statue of Rocky. The Franklin Institute and the Philadelphia Art museum are great places to learn. Plus the cheesesteaks are great.

More to the point though. I would say don’t go to a big city. Visit smaller towns."
47335,"A Philly to Pittsburgh trip would be amazing, actually. Small towns in the middle, beautiful countryside, Gettysburg and Hershey...

Brb planning a trip."
47336,"Minneapolis feels surprisingly east coast like in the way the city is laid out and run, but the people are definitely straight up Midwest.  We've got football and ice hockey for sure here!  Also, a lot of Immigrants live here, and they brought a lot of great food, which might be part of why it feels a little more east coast to me.

Although, if you want to see a good game, maybe go to green bay.  It's actually quite a nice city, and quite a bit smaller if that's something you're interested in.  I personally like the bigger cities, hence living in Minneapolis, but, if you're trying to get a picture of america, you need to remember that a lot more of us that Europeans live in smaller cities, towns, or completely rural.

It's been asked here before, and overwhelmingly people find Ohio to be the most generic state.  Not in a bad way, but they have a little of everything american.  I don't know if there's a specific city that I would suggest visiting, though.  I personally liked Cleveland a lot, though.  It has a surprisingly good theater and music scene, along with good food, although not very international at all.

If you want to go to a specific city that does a good job at capturing a lot of different aspects of America I might suggest Omaha.  Super underrated city IMO.  It's got a little Midwest, a little Western, and just a tad southern, but not much at all.  It's a bit smaller too, so not overly touristy."
47337,"Come to Texas!! I know that you mentioned Dallas, but I would suggest going to a city where there is more to do like Austin instead. There is a music festival every year called Austin City Limits that is pretty fun to go to, as well as a city-wide event called South by Southwest (SXSW) that is very unique as well. If you're looking for some good history, rent a car and drive down to San Antonio as well and pay the Alamo a visit. If you want to watch an NFL game, the Cowboys are in Dallas and the Texans are in Houston, but be aware that NFL tickets are not cheap (especially in Dallas). Dallas also has the Stars for the NHL, and those tickets are more reasonable and the game will probably be more fun. Just be aware that our summers are really hot (over 37 C is very common across Texas between late June and September). Along the way, try out some BBQ too!"
47338,"I'll have a check for this, I've heard of SXSW, good things about it, if Dallas isn't that great (haven't really researched) than I'll go austin, and to some of the little cities/towns as well if I have the time"
47339,"Dallas is great but it's not really an entertainment, tourist-focused city. We do have a sports team from every major league (NFL, NBA, NHL, MLB, MLS) and basically every touring musician stops at Dallas at some point. There's some good museums and the Fort Worth stockyards are pretty cool."
47340,"Dallas isn't bad; it just feels like LA with the traffic and sprawl. Austin is a pretty good city to visit, though."
47342,Big Bend NP is like a 10 hour drive from the populated part of Texas though...
47343,"If you like history involving wars, San Jacinto monument around Houston, besides the Alamo in San Antonio might be interesting places to visit. Also smaller towns like Goliad and Gonzales, but Houston and San Antonio have a lot of other interesting things to do than gawk at old cannons.

If you like nature, Big Bend is pretty. The Davis Mountains I can personally attest to being nice, but my idea of pretty is probably twisted from living in Texas and never having left the state. There's bats along the river in Austin that give the local community college their team name.

Kolaches, brisket, and beer are what make Texas, food-wise. Also Tex-Mex, I suppose. See Slovacek's around Waco, Lockhart Smokehouse in Dallas (apparently based on Kreuz's in Lockhart, small town south of Austin. I'm just gonna assume they're as good as Kreuz's) for the first two. I'm underage, so I can't speak for booze, but we've got Tito's vodka, Shiner, and Ziegenbock beer in Texas, those all seem pretty popular.

You could always try the San Antonio Rodeo. Probably a decent one up in Fort Worth as well, I imagine, that's by Dallas. A good time to sample Texan cuisine as well. Get an idea of rural Texas culture without leaving a city, kind of thing. Since that's when ranchers come in town to show off their stuff."
47344,"FWIW, I lived in San Antonio for 3 years, am from the midwest and currently live in the midwest. I’ve never heard anybody, other than a Dallas native, suggest Dallas as a good place to visit. Austin is the way to go if you go to Texas."
47345,">I've been thinking of visiting minneapolis 
 
Do it and catch a Vikings game. See if you can touch base with someone who lives there on this subreddit and they'd probably be thrilled to give you recommendations.
 
>but I also want to visit somewhere south like Dallas
 
If you're skipping NYC and LA I'd skip Dallas as well. If you want the south I'd recommend Memphis or Atlanta over Dallas.
 
I've enjoyed my visits to Chicago; I don't buy into the NYC vs Chicago Pizza debate: thin crust and deep dish are both great.
 
Kansas City is one of my favorites: if you go be sure to check out Joe's Kansas City BBQ.
 
If you want a more unconventional pick I'd point you to Lincoln/Omaha if you time it right you can catch a Nebraska home game which is a sight to behold though next year will be a rebuilding year and Morrill Hall has an interesting fossil collection. The Henry Doorley Zoo in Omaha is one of the best in the world if that's your thing, the Jocelyn art museum is perfectly serviceable and the SAC air museum is great."
47346,Chicago deep dish really isn't what the natives eat. The thin is great.
47347,"Idk if I'd recommend Minneapolis to an international tourist unless they are interested in a specific event, maybe Chicago instead."
47348,Minneapolis is pretty awesome and underrated. I could be biased because I live here.
47349,not hating on Minneapolis there are plenty of places that are great to live but I wouldn't want to plan an international vacation to.
47350,Honestly I feel like Chicago is overrated. What makes Chicago better than Minneapolis?
47351,What makes Minneapolis better than St. Paul?
47352,"Public transit is really convenient so you don't have to rent a car, there are way more cultural institutions that are better and the pizza is better."
47353,"> I love the NFL and would love to watch a game when there, and possibly an Ice hockey match

Here's a list of cities with teams in both the NFL and the NHL: Los Angeles, Boston, Philadelphia, Pittsburgh, Buffalo, Nashville, Dallas, Minneapolis/St. Paul, Detroit, Tampa, Denver, Miami, NYC

Maybe that'll help give you some ideas? :)"
47354,Also Chicago
47355,"Are the Bears still in the NFL? Oh yeah, we don’t have relegation here."
47356,"Savage haha

I’m glad we don’t have relegation. I’d never see my Phillies in the top flight again."
47357,Sorry I don't follow football. What is relegation?
47358,DC and Phoenix too...
47359,"Phoenix. Ugh. ""Gotham of the desert,"" as I call it. But if you're into a bunch of beige colored sprawl, it's just the place for you.

Go to Santa Fe instead."
47360,You could always go to Nashville! We have both NFL and NHL teams and a lovely downtown area.
47361,"If you had one week as a tourist in the US I'd recommend going 

NYC to DC with Philly, Baltimore, Shenandoah or Gettysburg thrown in 

Or 

LA to LV with Grand canyon, death valley, or Joshua tree thrown in.

A lot of stuff in the USA is really far apart and I don't think most tourists want to pay for several days of rental cars in between international flights, but if you are not afraid of that I would recommend a road trip across the west covering Colorado, Wyoming and Utah"
47362,"I'm going to suggest my personal favorite city of Orlando, Florida. There are plenty of flights between England and Orlando. I'd just suggest staying away from International Drive as you'll find it full of British tourists so probably not too interesting for you. If you go downtown though you'll will probably have a great time. If you're a big NFL fan, you can drive a couple hours north to Jacksonville and see a Jaguars game (they're doing excellent this year and they're lead by Orlando area native Blake Bortles) for ice hockey, you could watch Orlando's own Solar Bears play at the Amway Center in downtown Orlando. The only downside from your point of view is that Orlando never really gets cold (maybe 40s (Fahrenheit) at the coldest) but as someone who lives in a cold state I'd call that a huge positive TBH."
47363,"Overwhelming response and thanks to you all

Dates are still unclear, but I will be going between April and August and again later on in the season towards next winter

I have sort of a plan for the first trip, going New orleans, west towards Texas, whilst visiting Baton Rogue, to Houston than to Austin and San antonio.

I think people forget how HUGE America is, especially people like me when the size of my country is smaller than a lot of states, like literally it's just massive so there is no way I'll be able to see everything

Portland, Seattle (forgot to mention seattle, but I've always been curious about visiting there) will deffo be on my 2nd visit, and fly from 1 of these cities to see Yellowstone national park (one of my bucket lists) from here I plan to go east and visit Minneapolis and Kansas city.

Money isn't an issue, it's just visa's and whatever and will have a look at this as I am pretty clueless with it all but I think I can visit for 3 months (90 days) so it should be enough time to at least do the majority of what I want to do.

the first trip (in the south) I plan to be travelling texas/new orleans etc for 1 month, and the 2nd trip hopefully 2 months (which will be the north - around winter time)
Anyway thanks for your comment guys, much appreciated and will help me a lot when it comes to properly planning this trip"
47364,"Nashville, Tennessee. Home of the NHL team the Predators"
47365,"San Francisco, but try not to get caught in any “parades”…"
47366,Visit our wilderness areas.  We have some excellent national parks.
47367,I recommend Zion and the Smokies!
47368,Seattle is an interesting spot.
47369,Boston is super fun!! Plus it's rich in history!!! A great place to learn more about America!!!!
47370,"If your going down the west coast, make sure to spend some time in the pacific north west. I would recommenced choosing either Portland, Seattle, or Bend(a bit small, but a lot of stuff around) as a base for day trips to the natural scenery around. I would argue Portland is better for this, but there is some bias there."
47371,"Do Buffalo, you can also hit up Niagara Falls and Toronto if you feel like going to Canada too eh

hell, fly into Toronto, take the train down to Niagara Falls, check out the Falls, walk across the Rainbow Bridge to the United States, rent/hire a car, go to a [Bills game](https://www.youtube.com/watch?v=JMJox-O9H0c), maybe catch the Rochester Amerks or the Toronto Marlies somewhere in there since the NHL and NFL schedules don't really line up."
47372,"I know you said no LA, but it is a major city with direct flights from England. It's one of the most culturally diverse cities outside of NY, has pretty consistently great weather, has incredible food from all cuisines, has a ton of museums, great music scene, and you can do everything from surfing to snowboarding to hiking the desert to hiking the mountains all in the same day. Plus it's a short drive to places like Six Flags of Disneyland. There are now 2 NFL teams there, as well as 2 NBA teams, 1 NHL & MLB teams(2 each if you include Anaheim). And then 2 hours south(if you're lucky, or about 3 hour train ride) is San Diego, which is another great city. It's somewhat similar to LA, but more laid back, less traffic, better Mexican food, and one of the best destinations in the country for beer. And San Diego has a ton to do as well, from swimming with sharks to Balboa Park and the zoo to seeing the sea lions, etc. And 20 minutes south of San Diego is Tijuana and Baja California. Tijuana has incredible food, both Mexican and otherwise, diverse museums, professional soccer team that is usually good, pretty solid craft beer scene. And Ensenada has beautiful beaches, and inland from there is Valle de Guadalupe, which is wine country and beautiful. Plus great food and great boutique hotels/B&Bs."
47373,"New Orleans has a unique vibe that I haven't found anywhere else. Portland is quirky, very hipster. Chicago looks the most similar to New York but it's less diverse and the people are nicer, slower. Beautiful in the summer."
47374,"If you want a small, easy-to-see city, may I recommend Richmond? I lived there for over a decade. Great food, interesting history, gorgeous architecture, and two hours each from a major city (DC), the mountains, and the beach."
47375,"Good choice, I _love_ Richmond, and it’s often overlooked because it’s so close to DC. What a great town though."
47376,"It's amazing.. I have never known a city to have so many festivals, too. They even have one for BACON."
47377,"My suggestion would be to do a ring around Lake Michigan--you could fly into Chicago and do Chicago, which is a fantastic city in its own right. Go up to see Milwaukee, which is a fun city for seeing how heavily settler/immigrant culture has formed the culture of many American cities (in this case, German). Go to Green Bay and watch a Packers game (Go Pack!). Go to the UP of Michigan and see some of the most beautiful nature in the country. Come back across the Mackinac Bridge, which is an absolute feat of engineering. Stop to see Mackinac Island (no cars allowed on the entire island, so it's all bicycles and horse-drawn carriages; very niche and charming). Come down along the west coast of the LP of Michigan--hit Traverse City, attend a concert at Interlochen, visit the Sleeping Bear Dunes National Lakeshore, hit Grand Rapids, Holland, and/or South Haven. There's all kinds of beautiful dunes and beaches and lakeside towns along this route. Also well-known for craft beers and up-and-coming area for wines. Go to South Bend, Indiana, and watch your hockey game at University of Notre Dame. Then head back to Chicago for your flight out."
47378,"I'll push my state's major cities, as I have spent time in both. Philly is great to get a historical perspective for America. Old City has both the Liberty Bell and Independence Hall. Pittsburgh is a uniquely beautiful city because of its natural surroundings, and if you like hockey, the Penguins are one of the most exciting teams to watch. Both cities are pretty walkable, and they are probably more authentically American cities than NYC. Philly has an east coast feel, and Pittsburgh has a more midwest vibe. Both also are great museum cities, if you are into that."
47379,"One piece of advice I would give is to go to a college football game rather than an NFL game. Large colleges have bigger and louder stadiums than their NFL counterparts (8 college teams have stadiums larger than 100,000). Lots of the colleges have bars nearby, tailgating on the college campus, etc. For a lot of people, it's an all-weekend event. In most of the south and large parts of Texas and the Midwest, people care more about college football than the NFL.

If you don't want to go to LA, you might consider going to San Diego to get some SoCal sunshine. It's a little more manageable in terms of size. If you want to see some of the country's historic side, check out Charleston and Savannah, as well as some small New England towns. Boston is probably our most historic big city.

My number one recommendation would be to go out west and check out the great outdoors. Our cities can be interesting, but probably not as interesting as the ones in Europe. However, there's nothing in Europe remotely close to the desert landscapes of the southwest, the enormity of the Rockies, or just the wide open expanses found across the country. I've been to Rocky Mountain, Mount Rainier, and Big Bend national parks, but you really can't go wrong with any of the parks out west."
47380,Go to Boston! It's the heart of American independence. Home of the American revolution. Also very beautiful and historical.  The New England Patriots are Bostons NFL team and currently #1 in the NFL. It's very cold this time of year too.
47381,">Boston
>
>the heart of American independence.

I beg your pardon, but what?"
47382,Heh. I'd say he has a claim. It's not like he said Tulsa or something.
47383,"True, but all that stuff was written and signed here. It's even on money if you like $2 bills. We just get defensive about it 😂"
47384,"Oh, and rightly so, don't get me wrong. Although it *was* Bostonians who got Massacred, so..."
47385,"Five deaths isn't much of a massacre IMO, but I see your point."
47386,"Yeah I’ll give him the home of the Revolution but I’m taking the home of Independence. 

Gotta get my flair updated so I can rep haha"
47387,"My bad, I kinda forget Philly was a thing...."
47388,"I'll let that slide since it's Christmas. 

\*cough\* Tom Brady sucks... \*cough\*"
47389,I'm not even a Bostonian. I fucking hate the pats. I just thought the brit would like Boston. Merry Christmas to you too! Manning > Brady
47390,Can't think of why OP would like Boston after what they did with all that tea. Merry Christmas! \*fist bump\*
47391,Boston or Washington DC are great if you like history.  I lived in San Antonio Texas and it’s a great place to visit.  I also like Chicago.
47392,"Chicago, man. Great walking city. Great food - real deep dish, Italian beefs, pierogis, pork chop sandwiches, Chicago dogs...   And I'm not a sports guy, but you have da Bears! And the Blackhawks, even."
47393,"> (other than the president running the country but I won't start a debate on that)  

And yet you couldn't stop yourself from sliding it in there."
47394,"You want cold? Visit anywhere in North Dakota during late December to late February.

And be stuck here because nothing will start...


Quite a few ice hockey games here too. Dallas sounds interesting also"
47395,"I might have a slight bias, but Chicago rocks."
47396,"Minneapolis would be good if you want to experience an NFL game in a new stadium and a NHL game too. If you're visiting in the winter, I recommend coming around December. It's winter wonderland here around that time. There's some places too that I (or anyone in /r/Minneapolis) can recommend to visit or eat at.

Otherwise, I would suggest going to New Orleans and/or Chicago. New Orleans is an amazing and beautiful city. Chicago is a great big city to get the feel of American culture."
47397,"I'm from Minneapolis, and I'd suggest you not come here in the winter. The novelty of the air hurting when you step out will wear out fast and then you'll be bored here in the winter if you expect the likes of London or New York. We don't have world class downhill skiing like the western states, so outdoor activities are pretty much ice skating (Centennial Lake park is wonderful) or cross country skiing. Minneapolis is better in the summer when you can bicycle and the state parks in the northern part of the state (I'd recommend Gooseberry Falls, Split Rock Lighthouse, Interstate, and Scenic) are more accessible. 

For an NFL match, the ultimate would be a Green Bay Packers home game  (they're a couple of hundred miles east of Minneapolis and north of Chicago) against one of their division rivals- Minnesota, Chicago, and Detroit. 

For the south, I'm sure you've thought about Florida, and I'd much prefer that to Dallas. Another idea would be North Carolina. Southern hospitality and cooking and you have the beaches on the Outer banks as well as Biltmore estate and the mountains. 

I'd agree with skipping LA and LV. Nothing wrong with LA, but San Francisco and if possible Yosemite and Redwood Parks, are better for a first time to California. Las Vegas has it's own culture of decadence that's not typical of the US."
47398,Portland and Seattle. They are both awesome with good public transportation and the are close together
47399,"If you have a friend in LA, LA is the best place to go to (random little stuff is the best)."
47400,"You really give very little to go by in terms of what you want to see/do. 
http://www.fbschedules.com/nfl/2018-nfl-football-schedules.php
http://www.gamedaycalendar.com/schedules/nhl/2018
Las Vegas is great for kitsch and Los Angeles is great for food and theme parks.  your source is fer shi'ite.  What do you want to do ski, train spot, national Parks, civil War?"
47401,"One of the trips I'll be planning around August-September which is when I'll catch a game

I'll be doing anything that is available, anything for an experience, skiing is high on my list, and so is a national park"
47402,"I gave you the NFL and NHL schedules for planning.  The common mistake brits make is not understanding how big the US is.  Keep in mind our state of Oregon is larger then the entire UK.  August/September precludes skiing, football starts in August and Hockey starts October 8.  Here is the National Park stuff.  https://www.nps.gov/index.htm"
47403,"Unless you are going to Mount Hood, Oregon, the only place to ski 12 months a year in the continental United States, you don't want to make that trip in August or September, if skiing is high on your list."
47404,"Football is ubiquitous in September, from high school to college to the pros. The heart of football culture is in the South and Texas, but there is a game nearby literally everywhere on Friday night. 

The best weather in August and September, though, is found in the Pacific Northwest, as well as several National Parks. I like Redwood National Park, but then I'm biased. If you want to spend some time in nature, it's hard to beat this region.

As far as cities go, Chicago, New Orleans, and Seattle would give you three varied urban experiences. Washington, D.C. has some amazing museums and landmarks."
47405,"You can rarely ski even in the big cold resorts in Utah and Colorado during the summer. I know some people ski on Mount Hood in OR but you're really going to have a better time skiing in the winter. 

I would come to Utah. SLC can be a little bit dry but few people visit to come to SLC (i'll get to this later but a lot of what many states have to offer lie outside of the cities). We have some of the most amazing scenery on earth:

[one - zion](https://www.visittheusa.com/sites/default/files/styles/hero_m_1300x700/public/images/hero_media_image/2016-12/HERO%209_Utah_Zion%20National%20Park_Viewpoint_Kyle%20Ellison_Web72DPI.jpg?itok=CsUCuSj4)

[two - bryce](https://img.huffingtonpost.com/asset/59485ecd15000023004e724a.jpg?ops=scalefit_820_noupscale)

[three - zion](http://i.imgur.com/6kyd6MO.jpg)

[four - bryce](https://i.pinimg.com/originals/29/5b/c3/295bc37df58ac8d63949c686afc3942f.jpg)

[five - somewhere](https://i.redd.it/elyo6u728pnz.jpg)

[six - mount timpanogos](https://images.fineartamerica.com/images/artworkimages/mediumlarge/1/mt-timpanogos-in-the-wasatch-mountains-of-utah-utah-images.jpg)

[seven - salt lake city](https://wallpaperstudio10.com/static/wpdb/wallpapers/1920x1080/171434.jpg)

[eight - this is what the mountains 15 minutes outside salt lake city look like in late summer](https://i.pinimg.com/originals/49/b8/95/49b8957536b42bb83662f37f98872120.jpg)

[nine - this is what the wasatch mountains look like in the winter, you will not find skiing worth your time late in the summer. you might want to drop skiing from your plans or consider saving that for another time](https://c1.staticflickr.com/9/8570/16332030176_1c91120d71_b.jpg)

[ten - dead horse point](https://c1.staticflickr.com/5/4646/27346391939_93820b554b_o.jpg)

[eleven - coyote gulch](https://i.redditmedia.com/ulIY3NtXeqYk-Tu4JRT-8swLacG1Cu85JcM9GrZaiYg.jpg?w=699&s=89a20f7c0629ecb70f1ffa105107a1fa)

[twelve - alta near SLC in the summer](https://i.imgur.com/y7EyFhD.jpg)

you might want to modify your plans from just including cities (which you seem to have, i'm just a little shaky on what you plan to do but i can help you make plans), much of the western united states is filled with stuff like this that you'll only find hundreds of miles from cities. there is a ton to see in the cities but you might have more fun doing a road trip with more emphasis on what lies between the cities rather than just travelling to a bunch of cities. i know a ton of people who just come to NYC, LA, Miami and then they leave and they feel like they missed out on something. the US is incredibly big so you're never going to see it all but asking what **cities** are the best to visit might set you up for a bad vacation if you leave the rest out


also if you're coming for the cold, minneapolis is going to be 90 degrees and humid in the summer. and in the winter its not really an enjoyable cold, its just uncomfortable and unpleasant (like your face hurts and you don't want to be outside and there is ice stuck to your eyelashes). i don't know of many people visiting minneapolis for the cold, usually you see pasty white minnesotans fleeing to the tropics in the summer haha. you should consider adding alaska to your plans if you can. really anywhere in the US is going to be hot in the summer but the farther north you get in alaska and at very high elevations (12k+ feet) you might be able to find below freezing weather. it seems like you want to do a lot of stuff involving the cold so if you can, try to extend your travel plans in to december (what sort of timeframe are you looking at?)"
47408,"Arizona--go hiking in the mountains and see the Grand Canyon. I visited for the first time last summer expecting it to be a big boring hole in the ground, but it brought tears to my eyes."
47409,"Hi there, Arizonan here. Bring water if you plan on going outside in the summer. Bring about 4x what you expect to drink. Bring sunscreen and a floppy hat. And for fuck's sake, wear comfortable walking shoes.

I've seen too many tourists dressed like they're visiting Santa Monica. Yeah, the sun might feel nice for the first five minutes, but your pasty ass will get scorched red in an hour.

Don't pet snakes that wag their tails at you. They are not happy to see you.

Arizona is a beautiful place if you come prepared!"
47410,"Yes! My family visited Phoenix in August and we decided to go hiking midday. The people working at our hotel basically begged us not to go out. We brought a ridiculous amount of Gatorade and water, and finished it all in record time. But the view from where we hiked was breathtaking.

As a snake lover, I was sorely disappointed I didn't see any rattlesnakes. Our desert guide told me to come back in the cooler months if I expected to see any!"
47411,"I live in California, but have visited a lot of the US.  I don't know how much time you have, or what your budget is.

West Coast: Seattle, San Francisco, Lake Tahoe, Yosemite, Las Vegas, Grand Canyon, Disney Land (Anaheim, CA), San Diego.  That's mostly North-South, with no other ordering there.  You could pick your interests.  Big cities?  Seattle, and SF for sure.  Beach? San Diego.  Mountains?  Yosemite if you don't mind crowds, Tahoe if you want a little more quiet.  Vegas and Grand Canyon just to say you been there.

Central: Yellowstone, Austin, TX, New Orleans

East Coast: Boston, NYC, Washington DC, Kennedy Space Center (Florida), Miami."
47412,"Santa Barbara is also really pretty, and personally I prefer sequoia over Yosemite because there's less tourist. And Coronado island and visiting hotel del Coronado is a must if you're in San Diego, so is visiting the San Diego zoo. If your ever in Miami make the trip down to key west. It's an amazing island, one of these days I'm going to move out of Cali and move to key west."
47413,"New York City  - cause center of the world  
Washington DC - Retrace your steps from Fallout 3   
Pacific Coast Highway   
New Orleans - The bars have no closing time  
Yosemite - Nature on a badass scale  
Vegas - cause you need to lose a cars worth of money in an hour"
47415,"The Grand Canyon is a particularly awesome spot if you do it right. Personally, I think just going there to see it and doing nothing more would be a bit of a waste and there just isn't that much to do in Flagstaff. Honestly, not even great for a day trip if you can do it. 

However, there are TONS of multi-day excursions and camping opportunities that can take you through the Canyon. You really get lost in the incredibly beauty and vastness of the Canyon, great hikes, climbs, waterfalls & streams feeding into the Colorado, the wildlife, stars, its beautiful. I've been several times for short to quite long camping trips. Every time has been just as good as the last and the Canyon is so large that I feel as if I've never had the same experience. Just know your limits, its hot as hell and you have to climb up to get out - so don't get too tired from your journey and get stuck down there from fatigue."
47416,"If you're into nature, head for the National Parks or natural sights. Grand Canyon, Yellowstone, Rocky Mountains, Yosemite, etc. The Great Lakes are my personal favorite. 

New York City is pretty rad if you do the fun stuff: Central Park, Broadway, Statue of Liberty, etc. The pizza is amazing.

Head north if you want to eat the best cheese in the world. Napa, California for wine. The midwest for beer. 

Head south if you want spicy/meaty food. Texas, New Orleans, etc. 

Vegas is fun for like a day and then it gets boring unless you have a lot of money to blow on gambling and drinking. 

The Northwest (Washington state) if you wanna see some of the most beautiful pine forests in the world.

Yosemite is pretty cool. Went there a few years ago. Mountains everywhere, swimming in pools under waterfalls, the Redwood Trees are freaking incredible."
47417,"**Attention!** Please keep in mind that the OP of this thread has chosen to mark this post with the **[Serious] replies only** tag, therefore [any replies that are jokes, puns, off-topic, or are otherwise non-contributory will be removed](http://www.reddit.com/r/AskReddit/wiki/index#wiki_--.5Bserious.5D_tags--).

If you don't fall within the scope the question is directed to, please do not reply to the question as your comment will be removed. If the question is ""Bakers of reddit..."" and you're not a baker, your comment will be removed. All top-level replies need to be from someone who is in the group the question was asked to.

If you see others posting comments that violate this tag, please report them to the mods! 

Thanks for your cooperation and enjoy the discussion!


*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskReddit) if you have any questions or concerns.*"
47418,"Depending on how much money you can spend, I would go somewhere sort of cheap, or somewhere sort of expensive, and it depends on what you want to see, but I would suggest, either a huge city like New York (which generally has amazing food), or some sort of beach, because some of the beaches in America are really nice. I would do some additional research on prices and things like that so your trip is really nice. :)"
47419,"I can only speak from experience so I would recommend visiting Mount Rainier in Washington. It has a lot of hiking (from beginner to experienced) and some of the most beautiful landscapes! The wildflowers are a personal favorite of mine. If you enjoy lakes check out Lake Chelan (also in Washington). It is glacier-fed, super deep, and has crystal clear water. On one end of the lake is a lodge called Stehekin, and the only way to get there is by plane or boat. 

If you enjoy fishing, I'd say go to Alaska. I've personally only fished in Sitka, but it was the easiest and most rewarding fishing experience I've ever had. Plus it's beautiful up there! 

One last thing, I hope that your trip is fun, and safe!"
47420,Not Ohio. There's nothing here.
47421,"Hawaii.  
No, I don't mean Waikiki and the other tourist areas.  
I mean the more real side of Hawaii. Try surfing, go hiking (besides Diamond Head...), go scuba diving, go to farmers markets and local art festivals. Eat at the local restaurants, not the expensive chain restaurants.   
Stay at a hotel outside of Waikiki (or the main tourist areas on the other islands), or Air B&B it, or rent a cabin or something!"
47422,"Bryce Canyon, Grand Canyon, Antelope Canyon and Zion. Although every area had amazing, and I mean fucking amazing sights to see, my favorite part was coming out of my shitty hotel near Zion park with absolutely no wifi, driving a mile out into the desert with no lights whatsoever and looking at the sky. You can literally see the whole milky way, and as someone from New England, it was amazing."
47423,"If you're interested in food, you could hardly do better than San Francisco and Portland, Oregon. On the San Francisco side, you'll get the really high-end places like Boudin or French Laundry. 

Portland is where a lot of chefs who worked at those high-end places go when they want to start their own restaurants, so they're almost as good but a lot cheaper. Definitely look up the original Pok-Pok in SE Portland. It's an institution."
47424,Colorado. Just visit though. No moving here when you love it.
47425,"This is the unpretentious version here: Go to San Francisco, Las Vegas, Washington DC, New York City and Florida. 

Skip the rest, honestly.

Dead serious. The rest of America is like small town Australia, but full of absolutely ignorant people."
47426,"I'd say avoid the south in general. I live in Alabama, and it's pretty bad. My area is the best in Alabama,  but there isn't much to do for outsiders. I just wouldn't recommend going down south, unless it's for like Disney land or whatever is in Florida"
47427,New Orleans?
47428,"Nashville, New Orleans, Myrtle Beach,  San Antonio, The Ozarks. You need to explore the south, brother."
47429,"I've been to Nashville, and Myrtle beach. Never have had the chance to go to New Orleans,  but seems like an awesome place.  Thanks for pointing this out tho, I could explore more!"
47430,"Seattle's a pretty nice place to visit. I have family up there that I visited a couple years ago. If you don't mind lots of rain, then Seattle is definitely a place to go to.

Not on topic, but funnily enough, for the entire duration I was in Seattle, it didn't rain a drop. It rained the day before I arrived, didn't rain even once while I was there, then immediately began to gently rain as the plane I was on took off."
47431,for food and sightseeing on the west coast San Fransisco with a side trip to Sonoma and Napa counties is a must. then head on up to Seattle for more great food and beautiful sights and interesting things to do.
47432,I'm gonna say California. There's just so much to do and so many cities to visit in Cali. Plus there is never a rainy day (damn drought...).
47433,"Colorado.

After a couple of days in Boulder we drove out to a cabin near St. Mary's Glacier and stayed for a week.

Most beautiful scenery I've ever laid eyes on.

Plus, ya know..  I was ripped to shreds on Bubba Kush and Lemon Haze."
47434,Yep. Colorado is a pretty awesome place. Awesome scenery and the good bud :)
47435,"I got the pleasure of growing up there, I didn't realize how great it was until I left. My grandparents owned a place with a lot of land and a lake in the mountains, I miss it."
47436,I moved here and can't say I see it. The mountains are okay. They're nice but the natives fucking ruin the entire experience really. They're straight up dickbags to everyone.
47437,"You really have to get in there. People suck no matter where you go, but there are no people if you hike for more than 15 minutes."
47438,"Yeah, we flew into Denver and it seemed like any other city.

Boulder was cool, but there were still plenty of dicks.

Once we got out of the populated areas it was a whole different story."
47439,I might be moving to CO soon. This excites me.
47440,"Where are you coming from? If you're from California DO NOT DO IT!!!

They will hate you massively."
47441,"Why is this and why does it matter?

I hear CO people are generally nice?"
47442,"They are except if you're from California. They hate California almost as much as they hate Trump. 

Also they're far from nice in Denver. They're absolute assholes in Denver."
47443,"Lol well I don't give a shit regardless. I generally don't interact with people anyway and I tend to stay indoors.

I'm coming from IL, but I'm from Louisiana. I moved to Texas for a short while then IL. 

I've been in IL for a little over 2 years and I haven't made a single close friend here. I do have a few acquaintances, though. I expect the same in CO.

My gf will be with me if I go and she's more than enough company for me."
47444,"Denver is really going through an identity crisis right now. The housing market is plummeting and the tax rate is increasing in wake of trying to adopt California economic ideas that have failed. 

It's nice to visit, but not nice to live in."
47445,"Weird.

I'll be ok. The company I work for will cover an extra $1200/mo for rent and my base rate is pretty OK. Plus I travel for work occasionally and get travel benefits as well.

The company also understands that they can't keep me in any place permanently without me disagreeing to it. I can opt to go back to Texas if I want, but I lose my reimbursement."
47446,"Brother, y'all'll be fine. Texan here that grew up from Brownsville, TX to Pensacola.

You have shitty people everywhere. Plenty of yuppies and pricks, but we have our charm and friendliness, and that goes a very long way in my experience. Best of luck to you and your wife."
47447,"For what it’s worth, the other person replying has had a very different experience than what I’ve seen. Based on comments from coworkers who have moved here from the coasts, he’s an extreme outlier.

I’ve lived in Colorado since I was five years old except for a couple years in my 20s. The people are generally friendly if you try to be friendly yourself. When coworkers visit from other offices, the most common comment I get is, “everyone is so nice here!”

The comments on taxes and home prices are off base and are likely informed by his political ideology (judging from his comment history) — most of Colorado’s housing market has skyrocketed over the past few years, so a slump was inevitable. If you just bought a large luxury home over the summer, it might look anxiety-inducing; if you bought for more than $500K in 2016 or earlier, you’re still way ahead. Anyone under the $500K home value mark hasn’t really been impacted.

Having briefly lived in both Chicago and LA, I can easily say Denver’s quality of life is much higher, the taxes are somewhat lower (though not as low as they once were), and the scenery is beautiful. The only things you might miss are things bigger cities tend to have, like more nightlife, more variety in public transit, etc. But I think the pros outweigh the cons.

I think you’ll find Colorado is a great place to live!"
47448,I'm a Giraffe!
47449,Dry tortugas national park off key west coast.
47450,Been there. Awesome place
47451,"Fort Jefferson! I clicked on the topic to name this location. What an amazing place. I feel like it’s one of the most unknown, incredible trips to take in the US."
47452,"US Virgin Islands.

Haven't tasted better rum. Haven't seen clearer waters. Haven't seen cleaner beaches.

The whole time I was there I felt like I was in heaven."
47453,Never been. I’m interested in all of those things I’m gunna have to check it out :)
47454,Come visit my home! It’s awesome
47455,"Alaska for sure. Though I really wanna go out west to Colorado or something, I’ll let ya know which is cooler when I make it out there"
47456,"I just spent three months traveling, I'd have to say the best places were Zion in Utah and Glacier in Montana. Zion is great because there are so many other places to go within an 8 hour drive"
47457,"I’d agree with Zion! Grand Canyon is a few hours away, so is arches, and Las Vegas and flagstaff and salt lake aren’t crazy far either"
47458,"Just since it's been asked, Yosemite. ages ago, I don't actually remember anything of the park itself, other than my mom anxiously piloting our car along the winding mountain road. But I do remember the motel we stayed at along the Merced river, the rushing water, the bats flying along the waterway on the fall evening. It was a fairly transcendent moment, for whatever difference that made.

Having kids myself I'd like to have had the opportunity to have given them that memory."
47459,Make it happen!
47460,Yosemite is a really great place to simply reflect and explore amazing land. Great spot to check out as a beginner if you want to start looking at our amazing national parks here.
47462,"Yep, that's basically the same thing I tell people about it. The majesty is unmatched in my mind."
47463,Maybe I need to go back now that I'm an adult. 16 year old me just thought it was a bunch of rocks. I'm kinda ashamed of myself
47464,Alaska. Not a cruise. Taking a few weeks to drive around then trying fly in camping.
47465,"Definitely Maui, Hawaii. It certainly feels like another country. The water was beautiful and dark blue and all the landscapes were all incredible and very diverse given the small size. Also- no snakes! I learned that while we were hiking to a waterfall and it made me feel so much better about walking through the streams."
47466,"Hawaii is like another planet! Silver Plants, multi colored desert landscapes, endless rainbows, pristine beaches, lava deserts, tide pools, and all in like 12 miles of each other"
47467,We also have rainbow colored trees
47468,Hawaii.
47469,"Weekend of skiing in Breckenridge, CO."
47470,"Sedona, AZ.  Beautiful red rocks, classy bars,  and some great southwestern art boutiques.  Best part of the trip by far was riding horseback through the canyon.  

During the horseback ride, the place got a derpy photo of me riding the horse through a small creek. My eyes were closed, mouth was open, and I looked really stupid. They had the audacity to try to sell me the photo. I offered them money to destroy it forever."
47471,"The US is the best country in the world for a road trip. We have a great national park system. It’s the most ecologically diverse country in the world as well.  There are so many great places, but I really loved Acadia National Park and Bar Harbor, Maine.  Granite mountains descend into cool blue ocean. The people and climate (I was there early summer) are great."
47472,"Grand Teton National Park. There's nothing like majestic mountains rising straight up out of nothing. No foothills, nothing - just flat plains, then bam, mountain peaks.

Plus, we got to watch the eclipse in Jackson on that trip. Just sitting and chilling in a local baseball park with maybe thirty other people. In a place that high and dry, you could clearly feel the temperature drop from the loss of sunlight - it was pretty neat."
47473,Everyone should do Yellowstone/Jackson/Grand Teton once (read: multiple times) in their life.
47474,Burn Jackson hole to the ground
47475,Went to a cultural festival in San Antonio with my grandparents when I was like 14. It was pretty amazing. We did other things there of course but the festival really stuck with me.
47476,Maui
47477,Zion Canyon - went there for a Native American flute festival. Great festival and gorgeous scenery.
47478,My dad let me out of my cage on my birthday for 5 minutes.  The basement was pretty cool with all the bugs and leaking water.  I was able to get a few drops to drink before i was locked away again.  Always wanted to go back
47479,Nothing like a good 30 min break from Dad's salt mine.
47480,Tahoe
47481,"Went to Portland, OR for a week. Mainly so I could spend 2 days in Halloweentown and meet the movie cast. Childhood won"
47482,"This is just sort of my opinion, it won't fly with most others. But to me I really like just camping in the middle of the California high desert. There are tons of places you can go to where there's nothing. If you're more outdoorsy you can backpack a few days into the Sierra Nevada's and be literally almost a hundred miles from civilization. Something about being around unadulterated nature. Mankind hasn't ruined it. No roads or campground tables. Just you, your tent and the mountains."
47483,"Hilton Head Island, SC"
47484,"I love Hilton Head. My grandma has a timeshare there right on the beach and we go every year in June. It's feels like my second home.

I'm from Ohio and it feels like Ohioan's go to vacation spot. Every year someone on our trip runs into someone they know."
47485,I’m from Ohio too!
47486,last year. went on a road trip from seattle down to vegas. it was super fun
47487,"Canadian here. Spent 3 weeks in Kihei, Maui one winter. Drove the Hana highway, went whale watching and attended a luau in Lahaina. 13/10. Would do again in a heart beat."
47488,"Asheville, NC or Savannah, GA. 

&#x200B;"
47489,"Manhattan - There’s so much to see, visit , do and eat . I love the parks and the museums."
47490,"Mountains in Montana near Bozeman... climbed up a rockslide and the view from the top was absolutely breathtaking 

edit: also went to Yellowstone, if you're looking for more breath taking, that's the place to go"
47491,Seattle
47492,Seattle is awesome. Fish markets. The city. Beautiful place
47493,"Much better 30 years ago for a kid just making a wage and living in an awesome place, but the remains are still something worth searching for."
47494,I enjoyed the bum poop surprise on the sidewalks
47495,"How far things have gone...I used to walk the Pike Market, enjoying the smell of fresh fish, the ocean, the people shopping for the day and the tourists, on a weekend off from my job as a mechanic. And the clubs and the cheap nightlife, live music and bands back when Nirvana and  Pearl Jam were coming up. I was young, my family had worked the tugboats along the harbour, gone into the wars, turned the wrench, hauled freight and raised families.

Last time I visited was a few years back, seemed Amazon and general gentrification had transformed the place to something unrecognized. I couldn't smell the sea."
47496,"Hey, happy cake day"
47498,Great city to visit. Maybe not the greatest city to live in (although their are some cool things about living their).
47499,Walt Disney World
47500,San Diego is beautiful
47501,Couple of days with a friend on Nantucket. His family was from there so they had an old falling down beach house. Would have been horribly expensive if not for that
47502,"Cool, never been that high up the east coast :)"
47503,Happy cake day
47504,Thanks :)
47505,"I was on a car trip from Anchorage, Alaska all the way to San Diego, California. It was awesome seeing all of the different climates and people on just the west coast. When you drive 500 or even 1500 miles and you are still inside of America, it really makes you appreciate its amazing, and beautiful scale."
47506,"I did a bus tour once of the Grand Canyon and some of Utah’s parks (along with a few other places). That was pretty cool. My all-time favorite though was actually a cross country train trip. I’m in college so I’m pretty broke, but I really wanted to go camping in Glacier National Park. What ended up happening is that I took the train from DC to Glacier and camped for a few days before coming back. I took everything for 10+ days of travel and camping in a backpack. I got to see some amazing scenery and visit places I never would’ve been to otherwise. We went through Chicago, the Twin Cities, and North Dakota, and we crossed the Mississippi. It was a little bit of a crazy thing to do but it was a great experience"
47507,Went to comic con in salt lake city a few times. It was pretty cool and not too expensive. At least until I got to the part of buying stuff.
47508,"This isn't my official best, but one time we rented a nice beach house on the Oregon coast in like mid to late September lol.  It was cold and all the tourists were gone and I spent 3 days building huge sand castles on the beach quietly with one, tiny tool as my younger siblings fought endlessly over all the buckets and shovels.  Then at night we'd barbecue and I'd read quietly and sleep in this giant bed and listen to the ocean."
47509,"My bed

Also happy cake day!"
47510,"A week trip to a ski resort in Colorado called Copper Mountain. Incredible views and weather. Unfortunately I had to go home to Arkansas, but mark my words I will move there in a few years. It was extraordinary!"
47512,"I really loved Nashville. Was only there for four days, but I saw 3 concerts, more music in bars, ate amazing food, went on a cave tour about 2 hours away, met some great people. It’s just a beautiful city and a perfect getaway. I was there in October and the weather was perfect."
47513,I want to go to Nashville so fucking badly. I mentioned to my work-wife I wanted to go there (we work for a hotel chain so get discounts) and I couldn't articulate how cool it sounded when she asked why
47514,"Marco Island, Florida"
47515,I’m Mexican by birth born to an American dad and Mexican mother but moved to the US at the age of 8 As a child prior to moving we’d fly to Los Angeles twice a year to go shopping for my school clothes and visit Disneyland. It was awesome this was in the early 90s so we’d take the AeromMexico luxury flight (on a DC10) I was infatuated with planes. I have fond memories of that.
47516,"Went to Asheville NC on my honeymoon. Then again, I have a huge thing for historical homes and guilded age mansions in particular."
47517,"Disney World/Orlando area. Went twice in 2018, once for a marching band function (thinking about that makes me almost cry. 6 days in Disney with all my close friends, no worries and just hanging out.) and again with my family a few months afterwards. I had never been to Florida before that, and as a lower middle class Ohioan, going twice within 100 days was phenomenal."
47518,Niagara Falls. Awesome in every sense of the word.
47519,"Someone already said it, but definitely Hilton Head Island. It's such a beautiful island and isn't too big, isn't too small. You can easily rent bikes as a way to get around. The beaches are great and clean.

I love Coligny Plaza the best, there are so many cute shops there and a couple of cool restaurants. Salty Dog in Sea Pines is a cool experience. On the other side of the island is the restaurant Hudson's which is great for a fancier meal. 

Harbour Town is a neat area. I'm pretty sure there is a dolphin cruise near there. Kayaking is a great recreational activity.

There is an outlet mall just off the highway before you get on the island that is always a must. 

I've gone there 10 times and it never gets old. There is always something new to do. This year is the first time I'm going since 2016 and I'm so excited, I've missed it."
47520,"Sedona, Arizona was pretty cool during winter"
47521,"I've only ever gone to Orlando Florida but still the best holiday I've ever hsd. From tickets to evrry single theme park, fast passes, overnight hotels. The Manor we stayed in was fucking gorgeous, we had a really nice rental car. Food was great. I did not know that ice cube machines existed and dispensers scared the shit out of me at first but yeah. 10/10 going back this year."
47522,"California, I went alone to go visit my auntie in Cali. I went because when I was around 10 or 11 my auntie promised that one day we would both go on a trip alone to Yosemite. She is a very experienced rock climber and backpacker. She tokd me once I was 12 I could start backpacking; however our trip was delayed until I was 16  I had been once before I don't remember much of it, and I wanted to go on a backpacking trip this time. We ended up doing 2 trails. One really short one where we saw a rainbow at the top of a waterfall and the other which we actually back pavked through. It was a 3 mil hike but it fekt a lot longer with my backpack on. Considering the fact that I was massively out of shaped at the time and my auntie was in her late 60's early 70's wheb she took me (I dont know how she still does it) it Proabably should have been harder than it was. I got to see snow for the first time (it was late August but snow was still melting all the way up there). There was probably more mosquitoes than I'd ever witnessed in my life up there (and I live in Florida) but it was still an experience I will treasure for years to come."
47523,"Pacific Grove, CA and Big Sur"
47524,What should I answer if I 've never been to US?  It is still my dream to rent an old Pontiac or Lincoln and make a ride through the whole country.
47525,"Only one. 
Disney Land."
47526,"Ashland, Oregon. Their Shakespeare festival is spectacular!"
47527,"My family did a grand tour of California, Nevada and Arizona back in 2000. San Francisco, Yosemite, Death Valley, Grand Canyon, the works. We were having a snowball fight on top of a mountain one day and in the middle of the desert the next."
47528,"Road trip from Indiana to Texas. Ate some great diner meals, saw some very interesting sights from the car, and literally stood outside the restroom at a gas station while my friend was using it, because the place looked like Benny's World of Liquor in 'From Dusk Till Dawn' and we were both afraid we'd be kidnapped..."
47529,"Bike tour in Colorado from Dillon to Aspen via Vail, Leadville, and Independence Pass. Great long coast from the top of the pass to Aspen, then a few short day trips after that."
47530,Cross country road trips (4 times) and national parks (many but many still to do).
47531,"I've done two 20,000+ km(12000+ mile) road trips. The last one was amazing. Rode bikes in Manhattan, wandered New Orleans, hiked into Grand Canyon, hiked up to the top of Yosemite Falls, wandered Arches in Utah, lived fancy in Vegas, etc etc etc. Also drove a lot. A lot. From the top of Maine, down the East coast, across Texas, around the southwest and back up more or less diagonally."
47532,And?
47533,And what? A question was asked and this is my answer to it...
47534,And what was your favourite part? (Not everyone has four weeks of vacation for road trips like this.)
47535,Seattle. Went for a week with an ex girlfriend a few years ago. On top of all of the touristy stuff we also went to a Sounders game. I was a fan before but it turned me into a die hard supporter. Loved the weather and had an absolute blast. Really want to go back. I’ve thought of moving out there at some point..
47536,LA
47537,"Minnesota has the Boundary Waters Canoe Area. It is a massive series of lakes and rivers where motorized watercraft are prohibited. It's beautiful and serene. 

Giving honorable mention to Duluth and the entire North Shore area also.  

The Soudan Underground Mine is also a unique experience."
47538,This gal Minnesotas.
47539,I Minnesota so hard I'm wearing Wild underwear....Lets just says it's Twins...Shit still weird. How about Vikings.
47540,Lynx!
47541,"I'd also throw in the North Shore, it's beautiful"
47542,"Lake Superior is in fact, *superior*"
47543,"If you come to Michigan, go to both the Lower Peninsula and the Upper.  They're very different places.  

In the lower, visit Mackinac Island, Traverse City or Sleeping Bear Dunes.  In the upper, go to Tahquemanon Falls, the Soo Locks, or the Keweenaw Peninsula."
47544,The Sleeping Bear Dunes is one of my favorite places in Michigan
47545,Don't forget to try a pasty on your trip here!
47546,Is that the same thing as a pasty in England?
47547,"To add to this as a Michigander:
If you're looking for some non-outdoorsy fun check out Ann Arbor and Detroit, and if you're a beer fan go to Grand Rapids, die and go to heaven."
47548,Northern Michigan and the UP are some of the most beutiful areas of the country and most people have no idea.  When they think of Michigan all they think of is Detroit which is such a tiny part of what the state has to offer.
47549,"Also, the Pictured Rocks in the UP."
47550,"Start at Manistee, follow M110 to Onekama and then take M22 to Traverse City."
47551,"California. Forget the cities come for the nature. 

We got all kinds of nature. Deserts, rainforests, mountains, beaches. The biggest tree, the oldest tree, shit we got trees you can drive a motor home through. We got some really good trees here. 

Yosemite is here, its beautiful it it's also a fucking zoo during peak season. Big basin is one of my favorite state parks. 

But we have a lot. So get out there and see it."
47552,"To add to this, make sure you get up north. Shasta, lassen, Humboldt, the trinity alps. Northern California has mind boggling natural beauty without the crowds. There's a whole half of the state north of SF that people forget about.

ETA: Yosemite is otherworldly and absolutely worth going to, just try to hit it during the week and ideally not during summer vacation."
47553,"Also, Kings and Sequioa are really great parks to go to if Yosemite is too crowded"
47554,See the old growth redwoods along Avenue of the Giants between Garberville and Fortuna CA.
47555,"driving through Shasta-Trinity forest made my butthole slam shut. those gorges, and lack of guardrails... 

edit: however, it was gorgeous! similarly, driving north out of SF toward Petaluma during the evening twilight - that was the most beautiful drive I've ever been on."
47556,Heading up to Lassen and Burney Falls this weekend for the first time! Went to Yosemite last summer so if it's anything close to that then I'll be more than satisfied.
47557,As someone who doesn't live in a state but lives in the continental 48...you should visit the Smithsonian museums and zoo. They're all free thanks to your tax dollars!
47558,"> you should visit the Smithsonian museums

Yes, there is more than one Smithsonian museum in Washington DC and they are all amazing. 

And after people have gawked at the Hope Diamond (or dinosaur bones) in the Natural History museum, I'd recommend a trip to the incredible Freer and Sackler Galleries or to the Air and Space Museum in Chantilly, not just the one in downtown DC."
47559,"Growing up here I now know I was spoiled. The museums are some of the world's best and free to boot! When I visited other museums later in my life I was so confused about why I had to pay to visit them. 

I will also second the Udvar-Hazy Air and Space Museum in Chantilly. It's so much better than the one by L'Enfant Plaza."
47560,"If you're in DC when it's nice out (mid-late spring, early fall, or certain evenings in the summer), walking some of the monuments is surprisingly fun as well. Grew up in NOVA, and my senior year in high school our AP Gov classes had to split up into groups and research a monument each, then we had a full day of touring almost every monument in the city (including some of the cool lesser known ones that don't get a lot of traffic). 

Because the research was presented when we were *at* each monument, we ended up picking up a lot of tourists looking for a free tour (it was cool though, they were all appreciative and it felt nice to shed some light on smaller monuments that they probably wouldn't ever have found).

Now I just use a monument walk as a go-to date idea on a nice night, especially if the person I'm out with didn't grow up in the area."
47561,"Sounds like you're talking about today! It's currently 73 degrees, sunny, and with relatively low humidity!

Also, very cool trip. I wish my AP Gov class did the same thing!"
47562,"Today is exactly the type of weather I had in mind haha, walked outside this morning to go to work and was shocked, felt like a few weeks ago when I was up in the Adirondacks. Think September is supposed to be surprisingly cool, so it would be a great time to visit if anyone is considering it!"
47563,The Florida keys
47564,That's just a tricky way to make sure OP sees the whole state. Clever.
47565,Key West does have an airport
47566,I liked Key West's first few albums because they were more soulful. Now all his stuff is angry and he uses too much auto-tune.
47567,What state?
47568,The Conch Republic
47569,For real?
47571,"Utah. 

So many beautiful National Parks."
47572,I rode my motorcycle through the night once and found myself in Canyonlands National Park at sunrise. I had to stop I was surrounded such immense natural beauty.
47573,I camped in Canyonlands National Park and I completely agree with you. It was just stunning.
47574,"Utah is a GREAT winter destination. This past winter I was there and the Cottonwoods were getting 1+ feet of snow pretty much every day and Moab was like 80-85 during the day. Most days in SLC were in the 50s except the two days where it snowed quite a bit.

Brighton, Solitude, Snowbird, and Alta get amazing snow in the winter. Park City, Powder Mountain, Deer Valley, and other resorts near SLC typically get less snow fall but it can vary from storm to storm. If you stay in SLC it's not a big deal because they're all pretty close and can chase the powder if that's your thing.

The southern part of the state is extremely impressive. Arches and Canyonlands are substantially more impressive in person. You see a picture and you're like ""yeah that looks cool."" And then you go and you don't say a damn thing because you don't even know what to say. Zion is ridiculous.

Utah is, IMO, the most underrated state. It gets a bad rap because of the Mormon thing. When I've been there I've never had a problem with enjoying myself and the Mormon inspired things (like beer dispenses from taps must be 4% or less, otherwise the bar has to serve it from a bottle or can) are mostly just background noise or minor inconveniences."
47575,"Dude, thank you. I'm a Utah native living in Los Angeles, and I feel like I talk to people about how rad Utah is and they just don't get it. California's got some kick ass National Parks, (Yosemite, Joshua Tree, The Sequoias) but Utah's are just as awesome."
47576,"Can't upvote this enough. Here are the 5 NP's in Utah.

Here is Zion NP: https://www.flickr.com/photos/jonathanhouse/31818463835/

Here is Arches NP:
http://imgur.com/rat4xOV

Here is Bryce Canyon NP:
http://orig09.deviantart.net/1c43/f/2009/215/b/4/bryce_canyon_overlook_by_ciaetyn.jpg

Here is Canyonlands NP: 
https://i.redditmedia.com/ejeUtWpTq1xZAMS3yobDzIu75unz9kTbbnEb8hJJAt8.jpg?w=1024&s=dc36b552c9ef65682d5b20af838d326a

Here is Capitol Reef NP:
https://www.flickr.com/photos/utahimages/8083495110/"
47577,Not to mention the world's deepest slot canyon.
47578,"The beaches in Massachusetts (Cape Ann specifically) are fantastic, and go into Boston to see the Freedom Trail and all of the other wonderful history."
47579,"Yes, and if you come to Massachusetts in the summer you should check out Provincetown on the tip of the Cape.  

But nothing beats autumn in New England.  If you come in the fall take a drive through the Berkshires from North Adams to Stockbridge.  It's gorgeous!"
47580,"NC. We're not doing so fantastic with government lately, but we have some awesome stuff. Naturewise, coast to coast it's beautiful. The Cherokee reservation (skip the casino and the knick-knack shops around it, go to the Okanaluftee village or Bearmeat's indian den for authentic crafts and accurate history) The Blue Ridge Parkway, The Biltmore house and gardens(fun fact, Hitler wanted to live there if he had managed to take over the US), Great Smokey Mountains National park, bits of Blackbeard's ship at Beaufort, Cape Hatteras light house, a good swath of the Appalachian trail, I could go on and on, but yeah, we have a lot of nature and a lot of history. [good article with some other highlights here](http://www.onlyinyourstate.com/north-carolina/amazing-sights-in-nc/)"
47581,"The Biltmore and Asheville deserve a weekend of your life. They are exquisite. You really couldn't be let down. 

The Biltmore was also where I had hot apple cider with elderflower liqueur for the first time, and that was also life changing."
47582,"As someone who previously lived in NC - it's a great state.  Left for job reasons.  Love going back to visit - lots of cool hip cities like Durham and Asheville with cool local breweries, or more urban places like Raleigh and Charlotte, which are both bigger cities but very different from one another in their own right.  And of course, most of the NC coast is gorgeous...hmm, maybe I need to move back."
47583,"New Hampshire. Drive up 93 into the white Mountains. Then do the Kangamagus Highway. Bonus points for the perfect autumn day. 

Eat at Pollys Pancake Parlor for our regional food showcase, lol, maple syrup. Seriously though, they serve your pancakes a few at a time so you keep getting fresh pancakes. They also come with maple syrup, sugar, butter and creme. It's a hilarious treat with a phenomenal view."
47584,"Connecticut: Skip it and go to another state.

Kind of kidding but if you must there's Mystic Aquarium, Foxwood or Mohegan Sun casinos, Frank Pepe's pizza, Dinosaur State Park, Mark Twain House..."
47585,How did you leave out Mystic Seaport!
47586,"OH NO! HOW COULD I DO THAT! Seriously, I was just pulling the first few things out of my head. There's also Lake Compounce or Quassy Amusement Park, Bushnell Park, the Wadsworth now that I've thought some more. I'm from central CT so that's my frame of reference."
47587,Jerry Springer films in Stamford; that's about the most American experience you can get.
47588,Come to Houston.  There are sharks swimming on the highway.
47589,And alligators.
47590,Ohio - Old Man's Cave in Hocking Hills.
47591,"Also, if you love rollercoasters, Cedar Point's really cool. 
Cuyahoga Valley National Park is beautiful! 
Wright-Patterson is awesome if you like airplanes. 
If you're into World War II history, Conneaut has a the biggest D-Day reenactment in the country every summer. 
Great Serpent Mound. 
Rock and Roll Hall of Fame. 
Ohio-Erie Canal Towpath if you like biking.
That's all I got rn, but hopefully you consider visiting! :)"
47592,"Came to say Hocking Hills, any of the trails are impressive. OMC gets too crowded at times, but I'm picky. I like taking pictures and try to avoid getting other people in the shot. 

If you're seeking an experience consider an Ohio State home game."
47593,"In Iowa, there honestly isn't much. The Grotto is really interesting to see, and Field of Dreams is fun if you like the movie.  Pikes Peak State Park has probably the best views, especially of the Mississippi river.  Otherwise Des Moines has lots of fun things to see and do and has some really cool architecture if you're into that."
47594,"The bluffs in the NE part of the state I hear are pretty cool to see. 

My parents kayaked some rivers up there and said as much."
47595,The Herbert Hoover Presidential Library is actually pretty cool.
47596,"you can't be forgetting about effigy mounds (see native American burial mounds) or yellow river state forest tho, you can walk in valleys, meadows, in the woods, up and down bluffs...also that animal planet bigfoot show came to yellow river state forest looking for bigfoot LOL"
47597,Bridges of Madison County if you're into that.
47598,"Arizona:  It is gorgeous.  Iconic places like the Grand Canyon, Horseshoe Bend, and Antelope Canyon and the red rocks of Sedona.  We have high forest and mountain peaks over 13,000 feet all the way down to low desert and everything in between.  We have the most ecologically diverse state in the country.  If you like the outdoors then you are doing yourself an incredible disservice by not coming here and driving around for a few days."
47600,"Colonial Williamsburg

Luray Caverns

Arlington National Cemetery

Those are the ones I've been to."
47601,"This is Virginia, for anyone trying to ctrl+f. 

Speaking of historical sites, I'd also recommend Monticello in Charlottesville (then go hit up the outdoor mall, which, as a VT alum, it pains me to admit is actually quite lovely), Montpelier (really beautiful drive to get there especially), and especially Mount Vernon, which underwent some real improvements in the past 5-10 years and blew my mind when I went back. 

If you go to Mount Vernon, I'd also recommend spending some time in Old Town Alexandria - it's a really cool old section of the city with great restaurants, shopping, and is easy to walk around. Arlington National Cemetery is very close by too, between a 20min and 5hr drive depending on traffic and time of day.

Southwest VA has some really beautiful scenery, but not a lot of things in particular I can think of other than the Natural Bridge and good hiking. If you're driving south to North Carolina, I'd also recommend you take 81-77 rather than hugging the coast, because the views from the mountains around the state border are breathtaking, especially in the morning when it's still foggy in the valleys."
47602,I forgot about Old Town - and I'm from Arlington!
