idx,text
44256,I laughed at the thought that all my fears would be sausaged.
44257,"Buy an external hard drive. You can get a well-made, relatively large capacity (1 TB or more) for less than $100. Many redditors probably already own one, but learning that you should back up your data the hard way is never fun."
44258,"Better yet, buy a good internal hard drive and put it in an external enclosure. Hard drive fails or you need a new one? If your enclosure is still compatible (and it might as well be), just take the old hard drive out and put the new one in.

This might go over $100, but if you don't have an eSATA port on your computer, get an adapter to fit in one of your expansion slots. USB 2.0 is slow for data transfer. Heck, it beats out USB 3.0."
44259,Birth control.
44260,"Safety tether is attached. Landing pad is primed and ready. Current PSI reading 15. Recommend operator increase thrust-to-push ratio. ""This is Major Tom to Birth Control. Current angle of endosphere exit is within operational tolerance. Be advised that someone didn't properly evacuate the head prior to earth atmosphere entrance, so there may be some debris flying out the rear, but the danger is nominal."""
44261,"Because you are here, I believe it is safe for me to assume that you spend an assload of time in front of your computer.  

You *need* a good chair. You can get a very nice office chair for under $100. I got mine at Staples, and that is far from the cheapest place to get one. Your butt, back, and legs will thank you. You may also consider a standing desk or an exercise ball to keep yourself from being too sedentary.  

Consider a mechanical keyboard. They are sturdy as hell and usually come with nice stuff like removable/replaceable keys to dvorak it up, put special colored keys on you WASD, whatever you want. You also have a lot of choices in switch type - I use Cherry Blacks because I got the keyboard on sale, but Blues are probably the best choice. There are also Browns, Reds, Whites, Clears, and others. Do research and get the best keyboard for YOUR hands. I spend more time typing than walking, it's even more important than my shoes.  

Mouse too. Figure out how you hold your mouse, estimate the size of your hand, and then find a really good mouse of a style that will make you most comfortable. Don't skimp on the mousepad either.  

This will probably be over $100, but a second/third monitor can make a bigger difference than you might expect. I spend the majority of my life sitting in front of a computer, as I suspect many Redditors do, so it is important to make this experience as comfortable, healthy, and enjoyable as possible."
44262,"Thanks, Reddit. Now I have at least $1000 worth of stuff to go buy to increase my quality of life."
44263,"1. Empty your fucking sock drawer.
2. Throw out every single sock.
3. Decide on your favorite pair of socks.
4. Buy 30 pairs of that sock"
44264,Is this as wonderful as it sounds?
44265,New socks are fucking awesome
44266,"True, but I think it is the fact they are all the same that I like."
44267,Agreed.  Never worry about matching them again!
44268,"Who matches socks? They're socks... Just put two on and go about your day. If someone asks why your socks don't match, ask them why their life sucks."
44269,"You'll never be admitted into my gentleman's club dressed like a fool. Pah. Odd socks, indeed. Slovenly riffraff."
44270,I have done this and can testify that it is as awesome as it sounds!
44271,Hells yes.
44272,"Buy 15 pairs of summer socks, and 15 pairs of winter socks."
44273,If you live in south Texas only buy summer socks
44274,"As a Texan, I'm not really even sure what winter socks are.  I have ankle socks,  black socks, and brown socks.  That's about all I need."
44275,Pretty sure it's 11:30 and 90 degrees here in Austin right now.  Nice Texas night.
44276,I'm in this boat. Houston is basically an oven in the center of the sun while going supernova. I exaggerate only slightly.
44277,"Specifically, buy wool socks like Darn Tough or Smartwool. They don't smell or become useless if they get wet."
44278,"THIS. Merino wool is unbelievable. It's cool and breezy in the summer and keeps your feet toasty in the winter. That, and you can wear them for at the very least a week, 24 hours a day, until they need a wash. I went through a Russian winter and an Albanian summer with five pairs of Merino socks."
44279,"Ooh yes, merino. Check out the Icebreaker brand from NZ - they make all sorts of wonderful garments from merino (and they ship internationally), for men & women who want to look like it's *this year* and not just some other year on repeat.

In answer to OP's question: Icebreaker merino wool T-shirt."
44280,But my favorite socks are Smartwool and cost 12 dollars per pair.  That would cost me $360 dollars :(
44281,"So I go to eBay to check up on how much Smartwool socks are because my favourite undies are Bonds Hipster Trunks, which are $25 in store but about $8 each in bulk lots on eBay (maybe knockoffs, but they've cupped my scrote as well as the genuine article for the last year without looking like losing their stretchy sexiness).

Anyway, people are selling used socks on eBay. Used socks! Who the hell buys used socks? Goddamn people who want scrofulous fungal infections, that's who."
44282,Just ordered.  You had me at cupping of the scrote.
44283,"A head lamp. I never realized how useful these things were until I was given one. Think about it, when you actually need a flashlight, it's because you are in a situation were having both hand free is very useful. Also, you look in one direction and bam, the light is there."
44284,"A pair of slippers and a dildo.

If you don't like the slippers you can go fuck yourself."
44286,"I just put a fogless mirror in my shower and now always shave in the shower so I can enjoy the hot water longer. Very glad I started doing this. Bought it for $15 on Amazon.

Also, netflix like someone said.  I have my old laptop connected to my TV and an app on my android to control it remotely."
44287,Fogless mirror? WITCHCRAFT!
44288,Just wipe some shaving cream on the mirror and rinse off. Instant fogless for that shower time.
44289,So now I gotta shave the mirror too? Forget the whole thing...
44290,"I have one of these. It's awesome. You put hot water in the back, behind the mirror and that keeps it fro...hm, yea, it's witchcraft."
44291,A bike.
44293,"Just spent under $100 on bike pants. If you have a bike, bike pants will go a long way to making that a better experience. And if your butt is in shape, it will at least get you an appreciative fan base. Also, if you are one of those people who have a mountain bike but only ride it around town, invest in some good road tires, it will get you there faster with less effort."
44294,I hope you mean from craigslist and not WalMart
44295,"High thread count sheets and pillow cases

Good pillows

If you're under 30 or so, a month of health insurance"
44296,You can get a month of health insurance for under $100?
44297,"My Aetna personal health plan (not HMO) is $83/month. Covers everything, including regular doctor visits and pharmacy, no maximum coverage limit, no coinsurance (100% coverage)... and a $3000 annual deductible. In other words, other than regular doctor visits, you will pay for your own health care up to $3000 a year, but if something bad happens, you're 100% covered no matter how much it costs. And that's what insurance is supposed to be, pooled protection against catastrophic costs."
44298,"Not bad, seems like everyone else I know is forking over $200-300 a month for just themselves, and that's with a group rate through their employer."
44299,Cool healthcare bro
44300,"TIL about bedsheets, American health care system."
44301,">American health care system

reddit: as close as you'll ever want to get"
44302,"I tried to get health insurance.
I'm a 21 year old female. It would have been 300 something a month for a shitty plan."
44303,I want a goat so I don't have to mow the lawn.  Throw in a couple of chickens for fresh eggs in the morning.
44304,"Goats are browsers, not grazers.  They don't eat grass unless there's nothing else; they much prefer leaves, flowers, bark and such.  What you want is a sheep."
44305,You ever have an omlette made from sheep eggs? Ewe!
44306,"I tried to rent a goat to mow my lawn once. They told me I had to sign a form saying I wouldn't sexually abuse it. 

That and goats eat EVERYTHING.  Like your fence? Too bad.  The siding on your house? Fucking goats... wait. I can't fuck the goat. DAMMIT!"
44307,"Get llama or alpaca. Won't kill your trees, but it will keep them neatly trimmed at llama head height. And the lawn. And they communally poo.  And they won't climb or jump your fences. You've been warned. * You can seriously find a llama or alpaca someone will let go of for $100 if it is to a good home."
44308,Leatherman.
44309,"""I want something that says, 'I'm a dad who likes leather.'"""
44310,something that says *leather daddy*?
44311,"Hell yeah! I've carried my Leatherman-Wave at work for over ten years, never leave home without it."
44312,I'd feel naked without my Leatherman-Wave.
44313,"Agreed. I also had Swiss Army knives for years, and finally got a leatherman instead. Wish I would've gotten one years ago. The pliers are a life saver."
44314,A curved shower curtain rod. It makes the shower much roomier.
44315,I want one. I hate it when the stupid wet gross shower curtain touches me. I feel dirty again :(
44316,I pin down the curtain with shampoo bottles so it can't attack me.
44317,"I've seen curtains with magnets embbeded at the bottom, so if your bath is magnetic, it'll actually do the same thing."
44318,"I use water, hose the curtain till it sticks to the side of the tub"
44319,"Books.

Doesn't matter if they're digital or physical, a well-chosen book is almost always a good purchase, and definitely increases your quality of life. You could learn something new, find solace from your troubles, go on an adventure, or just occupy your time in a cost-effective way.

Don't want to buy one right now? Nevermind, go to your nearest public library (I hope you have one, lots of them are being closed down now) and wander around a bit until you find a book that calls out to you. Borrow it, read it, and see if your life hasn't improved even a teeny tiny bit."
44320,I just got a library card for the first time since I was a child. Best. Decision. Ever.
44321,"As a librarian, welcome back! We've missed you."
44322,a used bike.
44323,"Sewing scissors. Ultra-sharp, strong, and classy-looking. They make short work of everything.

None of that flimsy plastic-handled office scissor shit."
44325,"> $4.01

FTFY"
44326,I thought shower heads just made it easier for women to covertly masturbate.
44327,"I think you Sir, are referring to the adjustable variety. Not saying I am denying that fact but even a good fixed one beats the hell out of a crap fixed one. Although being a girl I don't like the fixed ones. You know, for hair washing purposes. I don't wanna wet my hair every time I shower and when I do I wanna be able to get in there from all angles..."
44328,I was partly turned on until I read your username
44329,Great innit... Nothing wrong with a bit of GILF anyway.
44331,"In the books, Granny Weatherwax is a virgin and not, in fact, a mother."
44332,"The difference between Apple earbuds and a pair of $100 cans will blow you away, especially if you've never experienced ""real"" cans. Check headphone.com or head-fi for some great recommendations into this entry level price point for audiophiles headphones. Stay away form Bose or Dr Dre. Look into Audio Technica, Etymotic, Beyerdynamic, Sennheiser, Shure, and others."
44333,Try the **Grado SR60** for example.
44334,How much is a fleshlite?
44335,under $100
44336,"So, did I answer the question?"
44337,No you just asked another question
44338,Has a question never been answered by another question?
44339,Do you think it has?
44340,Do you think Jesus ever got drunk?
44341,Wouldn't you think that a guy whose blood tastes like wine got hammered now and then?
44342,What's up with all these questions as answers?
44343,You don't know?
44344,"Guildenstern: ""Statement! Two all. Game point.""

Edit: From [Rozencrantz and Guildenstern are Dead](http://www.imdb.com/title/tt0100519/quotes)"
44345,"A microfiber comforter. Microfiber is the softest damn fabric in the universe, literally feels like someone managed to weave Goldbond powder into a solid sheet.

Get a comforter made out of it and you will ALWAYS sleep naked, and it will always feel great."
44346,Or just get a microfiber duvet for you existing comforter.
44347,"Amazon is just loving this post. Kleinbl00's recommendation of a spatula sent it to the top of the [""Hot Products""](http://i.imgur.com/RMKKS.png) category on Alexa. Kleinbl00 = spatula company shill ? 

*pulls out pitchfork*"
44348,"* Sock Em' Boppers.

* Hungry Hungry Hippos.

* A Slip And Slide."
44349,More fun than a pillow fight!
44350,I can't see/hear sockem boppers and not say that
44351,"Clearly the best post. All of the other suggestions were just things that require work... utensils, slow cookers, etc. Fuck that noise."
44352,"I spent a buck on a back scratcher.  I don't know how I lived without one.  Best purchase I ever made!  Sometimes, it's the little things."
44353,"> Sometimes, it's the little things.

This is wisdom. Just having a pen I like writing with makes me happier."
44354,"Amazon Prime x1000.

http://www.amazon.com/prime

Seriously the best $70 I've *ever* spent on anything ever ever ever."
44355,"And if you're a student, you get it free for one year.

http://www.amazon.com/gp/student/signup/info"
44356,"The most amazing thing about living in Tokyo is using Amazon.jp
You can order before 10am and they will deliver FOR FREE the same day.
THE SAME (pause) DAY!"
44357,there is also [Amazon Mom (and basically any family member)](http://www.amazon.com/gp/mom/signup/info)
44358,I wonder if I can sign up for Amazon Mom when my Amazon Student expires.
44359,"Well, if you're in college, you should be able to make that happen pretty easily."
44360,The one thing I FUCKING HATE about living in Canada: shopping online. Go to checkout... Free two-day delivery! Oh you live in Canada? Well that'll be three weeks and with an added delivery fee of $45.
44361,Who's laughing about their free health care now?
44362,Still us.
44363,it's like costco but lazier.
44364,Too bad it's not available in Canada. FUCK
44365,I like this question. Maybe... comfortable shoes?
44366,Wool socks.
44367,sonicare toothbrush
44368,"Dentist here. Cochrin review showed Sonicare no better then regular toothbrush. The best automatic is the Oral-b. What makes it good is the fact that the head oscillates in a circle. 2.5 more effective at plaque removal than regular toothbrush and Sonicare. I’m going to do a Reddit oral hygiene video some time.  

Edit: Cochrane not Cochrin - it was late last night and on my iphone

http://www2.cochrane.org/reviews/en/ab002281.html

Low end model
http://www.amazon.com/Oral-B-Vitality-Action-Rechargeable-Toothbrush/dp/B003UKM90Q/ref=sr_1_4?s=hpc&ie=UTF8&qid=1307633629&sr=1-4

High end model
http://www.amazon.com/Oral-B-Professional-SmartSeries-Rechargeable-Toothbrush/dp/B002HWS9GG/ref=sr_1_5?s=hpc&ie=UTF8&qid=1307634006&sr=1-5"
44369,"nice try, 5th dentist..."
44370,"=( if you get one don't use it like a normal toothbrush and brush back and forth with it.  My dental hygienist explained that i was causing permanent scratches on the enamel and was causing my gums to recede permanently.  Lovely.

Edit:  To further elaborate, she told me to just put the toothbrush against my teeth and let it do its work.  The only work I should be doing is just placing the toothbrush head in the right locations."
44371,"Common mistake. If you slowly move the brush over your teeth and let it do all the work it will do wonders. (think of it as mowing a tiny lawn) Since I started using an electric toothbrush 10 years ago I have had zero cavities and the hygienist always complements me on my brushing and flossing.

I never fucking floss.


**EDIT:** jeebus, 332 upvotes for *this*? Clarifications/answers - I have an Oral-B rechargeable toothbrush. I do floss when there is shit stuck between my teeth or I think I need to. I am nearly 50 years old. Also regarding the heredity comment - yes! My wife's family has teeth like fucking diamonds and they do not know what a cavity is. Mine are like balsa wood in comparison."
44372,"if you think sonicare toothbrushes get the shit out from between your molars, you've got a surprise coming when you hit 35."
44373,The surprise is that your molars are now diamonds.
44374,A Classic [Weber Kettle Grill](http://www.weber.com/explore/grills/charcoal-series/one-touch-silver-22)
44376,"A decent, reliable coffee maker."
44377,French press ftw
44378,a cheap french press and a good grinder.  its all in the grinder.
44379,I would recommend getting a burr grinder instead of one with blades. You get a more even grind.
44380,"1) A decent knife or two.  You don't need a set, but those laser-cut bullshit things you bought at Ikea are what's keeping you thinking you don't know how to cook.  /r/cooking goes roundyround about this but the basix are something with a real edge that can be honed and sharpened (which you can get done at the farmer's market or Joanne Fabrics for like a buck) that you don't feel comfortable putting in the dishwasher.

2) A decent pan.  Boiling water or boiling sauce can be done in any cheap shit thing.  If you're actually grilling or cooking or the like, something with some mass is good.  Lots of people love cast iron; in my opinion, so long as it isn't aluminum and isn't non-stick you're good.

3) A broom, a mop, a carpet sweeper.  If you get in the habit of [tidying every goddamn day](http://www.realsimple.com/home-organizing/cleaning/daily-cleaning-checklist-00000000000953/index.html) you'll be amazed how clean your place stays with how little effort and that starts with a decent goddamn set of cleaning tools.  Carpet sweepers are really handy for whipping out and zipping over things when you don't need to vacuum everything and they're cheaper than Roombas by rather a lot.

4) A decent wallet.  You've probably been rawking the same one you bought the last time your wallet died, which was likely when the canoe overturned at summer camp.  Go buy a $30-40 wallet that's leather and stuff.  Get one that doesn't hold every fucking piece of ID, club card, coin and photo you've ever owned.  A big boy wallet goes a long way towards a big boy mentality.  Ladies: sorry, frickin' clutches cost a goddamn mint.  

5) A grooming kit.  Bite your nails?  Cut that shit out.  When your nails get too long, *clip them.* get out the cuticle pusher.  Snip those hangnails off with the cuticle scissors.  If nothing else, head to sephora and get the cuticle pusher ($12), the clippers ($8) and a glass file ($9 or so).  A decent manicure is easy, takes very little time and radically alters the way you experience the world.

6) A rice cooker.  Just about the cheapest food in the world and fiddly to make on the stove.  Rice cookers are fire and forget - and if you're brewing up rice, you might as well put the vegetable basket above it and steam some broccoli while you're at it.

7) [Getting Things Done by David Allen](http://www.amazon.com/Getting-Things-Done-Stress-Free-Productivity/dp/0142000280/ref=sr_1_1?ie=UTF8&qid=1307581350&sr=8-1) and a cheap-ass label-maker (read the book).  Organization starts from the top down and if you make it through 2/3rds of this book you'll end up with a firm grasp on all the twiddly shit in your life that currently flies out of control.

8) A decent set of tools.  Not a big one - just one with a mild set of sockets, a mild set of wrenches and some decent screwdrivers.  Not the Ikea set.  The Craftsman set is okay although the quality of their tools has plummeted in the past 10 years and they're being sheisty on their ""lifetime warranty.""  If you have a decent set of tools you will find that household projects cease to suck and suddenly become interesting and fun.  It's also empowering - if you have always cowered in fear of assembling a set of shelves a decent set of tools turns you into Tim Taylor.

9) A decent mattress pad.  I'd say ""a decent mattress"" but those cost hella more than $100.  You likely sleep on something shitty and you don't really understand how shitty it is until you sleep somewhere not shitty.  Give ""not shitty"" a try with the help of your local B^3 . 

10) Decent cotton sheets.  Crazy thread count isn't important, but something pastel will breathe better because it hasn't been dyed to death.  Already have decent sheets?  Buy more decent sheets.  Sleeping in clean sheets is something you should do more often than every fourth laundry day.

That's a start.

EDIT:  and

11) [This goddamn spatula.](http://www.amazon.com/LamsonSharp-2-x-4-Turner/dp/B0006GSOTC/ref=sr_1_7?ie=UTF8&qid=1307581848&sr=8-7)  Holy fuck I love this spatula."
44381,"I inherited one of these spatulas from a friend. It's absolutely fantastic. I wound up buying two more just because. In addition to cooking, it's also great for cleaning pans, and cutting lines of coke."
44382,The coke makes you more productive faster than that damn self help book...
44384,I wasn't convinced until the last 5 words.
44385,By Tim Taylor you mean Al Borland?
44386,How are trimmed fingernails and cuticles going to radically alter the way i experience the world? This is not sarcasm.
44387,"Okay.  A lesbian explained this to me quite clearly.  Women look at fingernails for these reasons: 

*  it's a general indicator of hygiene.  A man with clean fingernails probably brushes all his teeth and washes regularly.  
*  If things go well, those nails will probably touch her nether regions.  If they're dirty or snaggled, you may as well be kicking off foreplay with a used cat litter litter scoop.  
*  Trimmed and buffed nails are a sign of health, and an indicator or virility.  People with fragile nails don't have enough fat in their diets, nails can indicate exposure to certain toxins.... 
*  Few people are conscious of it, but there's a reason jewelry salespeople get manicures.  People subconsciously favor this without realizing it.  
*  This is classist, but people with rough, mangled hands are treated as less-thans because of the association with physical labor.  Your woodworking hobby can cost you career advancement opportunities because you give handshakes like you work on a crab boat.  A smooth handshake sends the message that you should be paid what you're worth.  

I've been a carpenter's assistant and I play guitar.  My fingertips are like little concrete pads most days, and I own an awesome manicure kit and keep them in check."
44388,"You could do about half this list and still stay under a hundo. Good job.

If you're just fixing shelves and appliances Craftsman tools will last you forever. If you really want good stuff for cheap, check out estate sales (old guys always have great sets of tools... think Gran Torino) or pawn shops, but you won't find a ""set"". For work around the house you mostly need screwdrivers, pliers, and a set of wrenches."
44389,A good vibrator.
44390,Hitachi Magic Wand.
44391,"In addition, get a $10 light dimmer to plug the Hitachi into. It takes it from only having two settings to having infinite settings on a sliding scale. SO AMAZING. My boyfriend is a genius."
44392,THAT IS SUCH A GOOD IDEA. I will upgrade mine!
44393,"As a male, I don't see how this would improve my quality of life."
44394,Don't knock it till you try it.
44395,"Happy wife, happy life."
44396,"Having strife, grab the knife."
44397,Condoms. I do not want kids.
44398,"No no no no NO no no.

Speaking as someone who works at a public health clinic - you can take as many free condoms as you want from me.

We have different brands, types, styles, etc.

* Extra strength (for when you want to get a little rough)
* Extra sensitive (if you want to have a good cry after)
* Multi-colored (in case you want to make rainbows)
* Tuxedo-style (because everyone looks good in black)
* Extra large
* 'Snug' fit
* Non-latex
* Flavored (banana, strawberry, vanilla, chocolate, cola, grape, mint)
* Reality/Female/Insertive condoms
* Dental Dams
* Studded
* Ribbed
* Extra lubricated
* Etc.

Never ever buy condoms unless it's 3 AM and you can't get any anywhere else. And even if it's 3 AM, just go to a gay bar - we throw entire boxes at those places. (Clarification: by 'boxes' I mean 'boxes full of hundreds or thousands of condoms,' not the tiny little box that has like 5 in it)

Walk into my clinic and you can walk out with a year's supply. I've sent people off with grocery bags full."
44399,">walk out with a year's supply.

So what, like...3?"
44400,"Yup.  One to wear, one in the wash, one in the dryer."
44401,"At my rate, 0."
44402,"Is there a secret website where I can find a clinic like yours? I live in a major city, make no money, and can't get tested or condoms for free."
44403,Please leave your poopbox at home when visiting said clinic. They frown on such things. They wouldn't even let me in with my $1 menu wrapper socks.
44404,"I wouldn't say condoms **increase** your quality of life. They just prevent your quality of life from dropping.

edit: Condoms only prevent your quality of life from dropping *if* you are using them. You don't use condoms if you want to get pregnant - this doesn't apply to you."
44405,We can't forget they help against STIs!
44406,Subarus?
44407,"A rice cooker.

Perfectly cooked rice whenever you want it."
44409,Came here to say this. [$40 on Amazon.](http://www.amazon.com/dp/B0043D3ANE) 10 minute installation on your existing toilet. So much better.
44410,"Saw a bidet at my friend's house a few months ago. Had never used one, and she briefly explained how they work.

I learned something that day. Namely, that you aren't supposed to actually *shit in it*."
44411,"You can get a decent tent and other basic camping supplies for under $100, and camping makes life awesome."
44412,Netflix.
44413,Except for the fact that they took Cosmos off instant play recently.
44414,"Are you referring to the Carl Sagan series?  
[I'll just leave this right here.](http://www.hulu.com/cosmos)"
44415,too bad im canadian :{
44416,"For real? What the fuck. :(

Edit: I just checked, it's for real."
44417,"This just ruined my day. It has wallowed in my instant queue for months, always been passed over for things i deemed more urgent to watch.  It was like my warm blanket that could always comfort me with my presence, and now its gone"
44418,"Basic exercise equipment. For under $100 you can get a yoga mat, handweights, and a resistance band. You can find a ton of workout videos for free online; between that and going for walks on a regular basis you can always have some sort of exercise no matter how tired you are or how little time you have."
44419,"I do agree with you, Id buy exercise equipment, but I disagree with the specifics

Most of what you need for fitness is already there. If you have space then you can workout. A rug should do just fine if you don't have a yoga mat. 

Heres my list for what to buy

**1. A pullup bar** I bought a doorframe mounting bar for $12 at modells. You can do chinups, rows, front and back levers (google these if you don't know them), etc

**2. Some sort of sandbag to use as a weight**. If you already have a bag as a shell, you can buy 50 pounds of gravel/sand/rubber mulch at home depot for $3-5 dollars. This means you can get 100 pounds of weight for under 10 bucks to deadlift, squat, overhead press, bench press, etc. It isn't as versatile as a barbell but its still good. 

I'm averse to handweights because they don't do much. Go big or go home- 8 pound hand weights aren't going to do much (especially if you are a young male, I can certainly understand why people who are older wouldnt be able to throw around an 100 lb bag).

**3. Miscellaneous other stuff**, I suppose a mat to pad the ground. I got mine for 30 bucks
Also, you could invest in a good fitness book. Off the top of my head Never Gymless by Ross Enamait gives good bang for your buck"
44420,">1. A pullup bar

Waste of money if your local playground has monkey bars. 

**Bonus workout:** flee from cops"
44421,"I think it depends on what sort of exercise routine you are going for. I'm a former ballet dancer, so for me I use my kitchen counter as a barre and just need weights/pilates/yoga/running to add some variety and make my workouts more balanced. For people interested in the types of programs most often discussed on Fittit, pullup bars and heavier weights are a must - that's just not my type of exercise.

I think the most important thing is we agree that you can get a lot of good exercise equipment for under $100 so saying a gym membership is too expensive is no excuse. And it's definitely a worthwhile investment! :)"
44422,A 50mm f1.8 lens - if you have a Canon SLR.
44423,Cast iron skillet.  $20 or less at a thrift store and it will last generations while making the best-cooked meals you've had.
44425,I finally invested last year in a $60 pillow and the reduction in my migraines (frequency and severity) means I'd happily pay double that.
44426,A detachable shower head.  Get the water everywhere on yourself from all angles.
44427,Wireless would be great
44428,"I fucking love imagining ridiculous ways to make this work IRL. I'm thinking either:

 * A turbine engine that sucks in and dehumidifies air at incredible rates. Just don't point it the wrong way or you might get turned into aerosolized human hamburger purée.  
 * A network of water jets in your shower that computer-guided aim at the shower head, the shower head is just a gimbal and limiter that redirects the stream where you want it. Lidar or CV to avoid the streams from hitting you except thru the shower head, multiple stream sources available for seamless automated switching."
44429,"The second idea is amazing, not joking. This is the future."
44430,My wife loves hers
44431,"You ain't never had a squeaky clean butthole til you've tried washing with a detachable shower head. Especially if you get one where you can switch to a stream instead of spray.

(Well, unless you live somewhere where bidets are common, I guess)"
44432,Bidets aren't common where I'm at but I have one. Be a leader!
44433,"An electric heating underblanket. It is bliss.

I have joint/muscle pain and it's been much better since I started slow-cooking myself overnight."
44434,An alternative is to go live in an apartment so ridiculously hot you'll want to sleep naked with no blankets on when it's snowing outside. I still have no idea why that place was so. fucking. hot.
44435,"Do you have downstairs neighbors? Our downstairs neighbors regularly run their heat to the point that we often have our windows open in the dead of winter. It saves us a lot on our heating bill, but it’s also really annoying to be so out of control of the temperature of our own apartment."
44436,"It's warm at the moment in Ontario, but we had a cold snap in early October. That's when I learned my downstairs neighbours will take care of my heating bill for me this winter I guess.

I had to open windows too, and I sweat when I went downstairs to do some laundry."
44437,Heated blankets are lifesavers.  Our house is over 100 years old and can get drafty.  We had a space heater in our bedroom but the wiring is not great and I noticed the plug was melting(fire hazard!). So I bought a heated blanket with adjustable settings for each side of the bed.   Seriously amazing product
44438,"LTP: If you smell piss but cant find any piss, it could be a small electrical fire somewhere. Or it is actually piss, either way you should find it."
44439,A fabric shaver. Refreshes sweaters/coats etc. in no time and saves replacing the garments that are in otherwise good condition.
44440,Is this like a lint remover? I swear the ones I've had have been super crappy and all my jumpers end up with those little balls of fabric. Any recommendations for a good one?
44441,"It’s not like the roller/sticky paper lint remover. This is specifically for piling of fabrics and if you open it up it has actual little blades in there. I don’t have a recommendation, I just went with the most reviewed online that was under $20 and so far so good. It made a sweater that I love look so much better!"
44442,I use a dull disposable razor. It's what a fashion designer/seamstress taught me.
44443,"Use carefully. Pilling on garments is where loose fibers have come together and tangled. If you cut the ends of those fibers, you now have a lot more loose fibers to tangle. You might not notice or see a difference when wearing after shaving, but the next time you launder the garment, you may end up with a much worse situation."
44444,"A mini hand held vacuum was one of the best purchases my wife made this year lol. It’s so useful for cleaning the couches, small messes or the car.

* the one we got was this one from Amazon. https://www.amazon.com/dp/B07PRLXG3C/ref=cm_sw_r_cp_api_fabt1_bF0QFb4H0906Q?_encoding=UTF8&psc=1

It was pretty cheap so any big brand would probably be better"
44445,"If you have pets it’s also worth paying the little extra for the specialized vacuum. 

I used regular vacuums for years before switching over to one of the pet hair vacuums and holy shit it takes like half the time.

Edit: For everyone asking for recommendations, I swear by Bissel’s Pet Hair Eraser. They’ve got both upright and handheld models, some more expensive than others, but I have one of each (upright and handheld) and didn’t pay over $100 for either of them. They’re an absolute godsend."
44446,"Slow close toilet seats.

Pros: quiet, easy.
Cons: you'll forget if you go to someone else's house."
44447,We have one on our toilet since all 4 of our kids like to slam everything in the house. Anyways we took a family trip to my mother's and after using her rest room my stepfather asked me if his toilet upset me. I'm like ?? He says well you sure slammed that lid I figured it made you mad. Totally forgot not everyones toilet lid doesn't ever so slowly and gently close.
44448,Send him a soft close toilet lid for christmas saying sorry.
44449,I’m surprised you didn’t scare yourself straight after hearing the loud sound you made
44450,I moved recently and the new cabinets aren't as hard to close as in the old place. Spent the first few weeks giving myself a near heart attack in the kitchen
44451,"A good, sharp chef's knife will make cooking much easier"
44452,"Remember to budget for a sharpener too, to keep it sharp. All knives need care."
44453,"If you are going to spend on nice knives, when it comes to knife sharpening I’d highly suggest either really learning how to do it with stones / grinders, or actually having them professionally sharpened every year or so. It makes a world of difference to have truly proper geometry I don’t believe there are any reasonable consumer sharpeners out there.  If you’re just using cheap knives, a cheap sharpener woo get you back to sharper than dull - but I haven’t seen many people very happy with just buying a sharpener and sharpening their own knives especially once they compare them to a correctly sharpens knife. 

Between uses stropping should get you back to razor sharp if the original sharpening was done well."
44454,So glad I learned how to properly sharpen knives on stones. In my household we have always had dull knives and learning to use stones and a strop have all my knives razor sharp. Some knives just need a touch up on the strop to get razor sharp .
44455,"One of those headband flashlights. Buy one and thank me later.

 My brother's wife made fun of him for getting me  one for Christmas. Turned out to be one of the most practical, useful gifts I've ever received. I use it at all the time."
44456,"I want to strongly second this for anyone who hikes even occasionally (or does anything like field biology, which is me!). You should *always* have a headlamp with you. They take up next to no space/weight, and will literally save your life in an emergency situation, even if that ""emergency situation"" is just walking back to your car after dusk. 

I am unfortunately one degree removed from someone who ended up behind schedule on a hike, and was on her way back after dark. She fell off the trail and died, which likely would have been prevented if she could see the trail. Never, ever go into the field without a headlamp. You can get one for $20."
44457,"I got caught in the grand canyon once without one.  It had snowed recently and I had to all but feel my way out.  It went from decent winter afternoon light to pitch black in about 10 minutes.  I was working there and routinely did a 45 minute after shift hike.  15 down, 30 up.  I turned around as soon as the clouds rolled in, and it still took me more than an hour to get back up, nerves at maximum the whole way.  Got a light the next day.  Never go without it.  If I'm in a group, I'll bring a spare.  Because I've had that hike as well, where I was the only one with a head lamp and that wasn't a lot better."
44458,"I used to camp a lot and had 4 types of lights with me:

1. A lantern like light for the tent. Something that scattered light in the tent for general low light visibility comes in major use when you're just trying to find stuff but don't want to fuck with a flashlight.

2. A headlamp for hiking and general night time outside movement.

3. A small regular flashlight that was much brighter than my headlamp. Useful if I need to illuminate somewhere other than directly in front of my face.

4. Glow sticks. There are so many reasons you could end up needing them that I just never questioned having them. You can and should also try to keep waterproof matches with you for similar reasons, but that's not quite what I'd consider a light source since you can make fires plenty of other ways."
44459,"Ugh. I got so irritated last weekend. Went for a hike just before dusk and gave myself plenty of time. I was ten mins from the car park and passed three sets of hikers going the other direction. The one solo hiker had a light with her, but the two families didn’t.

 I stopped to talk to them both. The first family had four adults and three kids under the age of 10. I warned them that it was close to sunset and the path is hard to find in the dark—especially this time of year with all the leaves down and not enough traffic to clear them. They were intent on reaching the tower to watch sun sent. I told them they had ten mins to make a solid twenty min hike. They ignored me and kept going. No lights, but insisted they would be fine with their phones. 

Second family they didn’t know the park well and agreed that turning around at the boardwalk (about five mins farther and before any climbing) would be better. I am confident they listened. 

I gave the ranger line a call to say I was concerned about the family (also mentioned the solo hiker). I did SAR for years and still have friends involved. Sure enough they had to go up an hour after dark because the family got lost and turned around."
44460,"I'm glad at least one of the groups listened to you.  I've met a lot of folks who do SAR/PSAR, and they all seem to agree that people greatly overestimate their own abilities and underestimate the environment.

For my part, I'm totally okay if everyone else on the trail makes fun of me for being overprepared.  I'd rather be the nerd who takes extra water, snacks, a headlamp, a first aid kit, compass and topo map, and layers on a simple 4 mi. hike than risk becoming just another statistic.  I've also had to give folks some of my water on more than one occasion (too many people seem to think a 20 oz. bottle of Dasani will be sufficient for a 5+ mi hike in the desert or mountains), so I often carry an extra bottle tucked in my pack."
44461,"A second monitor! It makes so much of a difference. It doesn't need to be fancy, but being able to look at 2 things at once makes doing work so much easier."
44462,And then you start thinking that a third.screen  would make you.life even better.
44463,"It does and doesn't lol. More info up at once, but more distraction"
44464,"A shoehorn. So simple and cheap, and instantly turns 5 seconds of the most annoying wriggling and forcing into a 1 second maneuver. I'm amazed they seem to have gone out of style.

Also, a fire extinguisher on every level of your house."
44465,Nah I'm gonna just gonna keep stamping down when my foot is clearly smashing the back of my shoe but I have to keep trying because I am holding my blenderbottle and yogurt and keys and 3 other things in my hands on my way out of the house.
44466,The major benefit is saving the back of the shoe from looking like an accordion
44467,Blackout curtains (or just any way to block the light coming through your window) - I fall asleep so much faster now that my room is pitch black at night.
44468,The downside to them is that it gets really hard to get out of bed in the morning.
44469,"Every morning without blackout curtains: ""Bleh, I don't wanna get out of bed.""

Every morning with blackout curtains: ""WHAT YEAR IS IT?"""
44470,Just cover your windows with tinfoil like a crack den. 100% effective.
44471,"I actually tried that before buying the blackout curtains.  I had two problems:

* It was hard to keep light from coming in through all the seams between the pieces of foil.
* There was a slight air flow even when the windows were closed, so the foil made a constant quiet crinkling sound.

I'm sure I could have made it work if I kept tinkering with it, but it seemed like it would be a big hassle.  That and it just looked cheap and messy."
44472,"A downside to this I found was being too accustomed to it. When I had blackout curtains for a few years, I'd only be able to fall asleep in (near) pitch darkness, and exacerbated my insomnia if any other little thing was wrong.

Travelling? Multi-site camping? Crashing at a friend's or someone's place? All became completely sleepless nights. 

Naturally, this depends how much light your room gets and how often you might have to sleep anywhere else. Sleep masks work well, unless you're the sort to take them off in your sleep.

-------

Edit (after the first two sleep mask recommendations): I used eye/sleep masks as a transition period, but found it better to train myself to get used to sleeping with a bit of light. This was a bigger issue in my 20s when I'd often stay at a buddy's place or at a hook-up on a whim. I did get better curtains, but actively refrained from blackout curtains for that reason."
44474,"Timer-caps for pill bottles. Basically, the cap is a timer that resets every time you open the bottle. You can get some on Amazon for like $10.

I take my ADHD medicine every morning right when I wake up. Some mornings I'll even take it and go back to sleep for \~30 mins until it kicks in and wakes me up. Some mornings, I'd forget that I took it and went back to sleep, and accidentally take a second when I wake up. 100mg of vyvanse makes for a fucking crackhead fever dream of a day. At that level it actually makes you less productive, so you get nothing done and deal with insane side effects all day. Conversely, some days I'd accidentally go without it because I thought I'd took it already and get nothing done.  The timer cap pill bottle literally totally fixed that problem.

It also made me aware that one of my friends stole my ADHD medication. They still won't fess up to it. I wish they would. It was fucked up but I'd forgive them. We're not very close anymore."
44475,"Oh my god.  Thank you for this suggestion.  I try to make sure someone is present or that I tell someone when I've taken my allergy meds so that I have someone to ask when I inevitably have to wonder if I took it or not.  I still miss some days though out of caution if I'm not sure.

I'll definitely look into a timer cap."
44476,"I use one of those day of the week pill organizers, you can get them at Walmart for like a dollar and just look in that day's compartment to see if you've taken it yet!"
44477,Yeah maybe I’m old school but the grandma pill box works haha
44478,"This would be great for people with memory problems. I shared a hospital room with a woman who was in because of an accidental overdose. She took her meds, forgot, took them, forgot, took them etc."
44479,"2m charging cable. (braided, not plastic)"
44480,I second this! I’m not longer restricted to laying on one side of my bed to charge my phone
44481,"I've fixed this in the worst way possible...

Instead of buying a longer cable, i connected my regular charger to an extention cord.

^(Yes, I know I'm a horrible person)"
44482,"I do this too. I tried longer cables but they are never as good as the original  brand Samsung ones. I was going through too many cables, so now I just use an extension cord."
44483,"I had good experiences with the Anker brand cables. After two phones they are slowly losing good contact. In the meantime they have been regularly rolled over with an office chair, been manhandled by a toddler and been in many suitcases and backpacks. 

Also they are bright red and the only charging cables that I never had to search for long."
44484,Not if you own a cat.
44485,A gram scale. It can be used for a lot of minor measurements. It can easily measure water since 1 g is 1 mL
44486,Also very handy for drug dealing
44487,"You should use a more precise scale if you're selling anything more valuable than brick weed.  You can be off by up to 0.4g. I guess it all averages out in the end, but no sense pissing off that one guy that brings his own scale."
44488,The power of the metric system! No more measuring by volume in the kitchen is life changing!
44489,"But be careful, for volume it only works for water though (because water's density is 1g/ml)

Edit: Yeah, its a good approximation for most liquids, but I'm specifically talking about flour for example which is way off.  
I don't know elsewhere, but here most recipes have solids in grams and liquids in mL anyway, so there is no confusion"
44490,It's true; I can't tell you how many recipes I've ruined measuring molten osmium by volume
44491,"Good, high quality underwear. Not like, the 5 pack for 15 at walmart. Quality underwear from somewhere may not be majorly life changing, but the day to day improvement is amazing."
44492,Duluth trading...buck naked!!!!
44493,"Extra long. Those babies are a blessing. No riding up, no pinch, no bunch. Feels great."
44494,Perhaps don’t use babies as underwear
44495,"Saxx was definitely a life changer for me. Yes, they’re expensive, but not having things sticking together down there is worth it"
44496,"A toaster oven.  I used to think of them as something college kids have in their dorm rooms.  But at age 60 I bought one.  That was early this year, and I haven't turned on my full-size oven since then.  

I now toast things that I never would have toasted before, because the full oven was overkill.  No more untoasted sandwiches.

It also makes a nice pizza oven.  Take a tortilla and put pizza toppings on it."
44497,The naans you can get in a bag at the grocery store would probably be pretty good for mini pizzas too
44498,"As someone who has tried that... they are _absolutely_ good as mini-pizzas, and I absolutely recommend you try it."
44499,"Good socks, I wear Darn Tough and my feet feel so much better.

**EDIT:** as others have mentioned the Warranty is worth it alone.

"" Our unconditional lifetime guarantee is simple. If our socks are not the most comfortable, durable and best fitting socks you have ever owned, return them for another pair. No strings. No conditions. Socks guaranteed for life. ""

**Double EDIT**: a friend returned some that he bought on Amazon, wore out incredibly fast. DT told him they were actually counterfeit and gave him a credit to buy some real ones from their store."
44500,I used to think expensive socks were the stupidest thing. To me the only acceptable option was to buy the 30 pack (for $2) from Walmart once every 3 years. A couple years ago I bought a nice pair of socks for a cold weather excursion we were going on. Changed my entire outlook on life. I don’t own a single pair of those white socks anymore. I bought a nice set of good work boot socks and I have never looked back. They last a long time and for the money the satisfaction is well worth it.
44501,"They just feel so much better!! None of that bumpy bit over your first or last toe, not overly tight anywhere, but snug everywhere. Very rugged, no holes forming at the toes. That’s my biggest thing with cheap socks - I always get afraid people will see the holes at the toes and think I don’t trim my toe nails or something. I grew up wearing hand me downs, and socks and underwear with holes that long lived past their prime. I love having nice socks and underwear to put on. 

Duluth makes some great comfy and breathable underwear btw."
44502,"New bedding, when you get brand new blankets and pillows"
44503,Any recommended?
44504,Coop Home Goods pillows are seriously amazing. Life changing. I sleep so much better. It doesn’t go flat like down. I throw it in the dryer with wool dryer balls every 6 months to freshen it up.
44505,"A thick, cozy bath towel. Why waste all of that shower goodness just to rub yourself with sandpaper after you get out."
44506,Costco has amazing towels. I was visiting my parents house and their towels were like clouds and they said they were from Costco so I went and bought a whole new set for myself immediately and they were incredibly affordable.
44507,"Costco towels are great! I'm in love with a brand called Wove. A little pricy, but I bought one and then bought four more after I used it for the first time."
44508,"I actually like rough towels.... and washcloths for that matter. I plush fluffy ones make me feel like its not cleaning me. Bathrobes however, BIG POOF"
44509,A bra that actually fits.
44510,"r/ABraThatFits 

Some measures and a shopping trip later I own a bra two band sizes smaller and two cup sizes bigger. I didn't know how comfy a wired bra can be! No more empty cups when leaning forward or even lying down.

Edit to add: I actually cried when I got my first well-fitting bra. I don't have weird or ugly boobs (what I thought since puberty). I just had the wrong bra. Fifteen years later, I finally am content and feel sexy. And I wish this for every woman! Don't underestimate what a bra can do for your comfort AND self-esteem!"
44511,"A rice cooker. I would love to have an amazing kitchen with expensive equipment but right now I can’t. 

You can make a ton of stuff you didn’t think you could with a rice cooker, either that or a pressure cooker.

Edit: because so many people are commenting, a rice cooker can be used not just for making rice. I’ve made whole meals using it. Steam vegetables, made cakes, perfect for oatmeal, etc."
44512,"InstantPot. Seriously, get one. They are a little expensive, but worth the investment. Even the most basic model is like seven appliances in one machine, you can make so much stuff with those. Including rice!"
44513,"Command strips (hangers) I hang all my favorite kitchen utensils, pots, pans, oven mits... On the inside of cabinet doors so I don't have to hunt for stuff while cooking.  Also in the bathroom brushes, blow dryer, flat iron... If it can be hung it is."
44514,"They make those Velcro ones too.. if you move a good bit, or have brick/concrete walls, they’re amazing for hanging pictures and stuff. 

And then once you move there’s no need to spackle and sand over nail holes. You just pull a little tab and it pulls the adhesive off underneath the Velcro, and I haven’t seen it damage paint yet"
44515,"Something ACTUALLY life changing and around a hundred bucks...a trauma kit. 

Not a booboo kit, trauma kit for massive injuries. 

Booboo kit is good too, you'd be surprised how useless Band-Aids are when the damage is severe enough. Edit. Booboo kits are gauze tape disinfectant and stuff beyond actual bandaids. 






Also dmt sharpening stones. Dull knives are garbage and maintenance isn't all that hard."
44516,"DMT, got it"
44517,Now that is life changing.
44519,"It's amazing how much less the dryer eats your socks once you do this.   Oh found a single?  Toss it off to the side, it's mate will either show back up or you'll lose another one and you're back up to a complete collection:)"
44520,"Nice try buzzfeed, but I’m not helping you write another article."
44521,Thank y'all for helping me with my Christmas list!
44522,"A [shampoo brush](https://www.amazon.com/Scalp-Massager-Shampoo-Brush-MAXSOFT/dp/B074ZDXFL6/). Not only does my hair feel cleaner than ever since getting one, but my scalp doesn't itch anymore. I tried everything including prescription shampoos. I didn't have dandruff or any other issue that should cause the itching, but all the same my head itched so bad all the time I wanted to shave my head and rub sandpaper on my scalp to get some relief. 

Got one of these to help scrub my head and now while I might get a tiny itch here and there, I no longer want to rip my scalp off to make the itching stop."
44523,"Whoa, ordering one now. My husband has insanely thick, wavy hair and he gets so frustrated with it. This might buy me a few more years of a long-haired husband before he gets fed up and shaves it all off."
44524,Insoles for your shoes.  I had no idea until I got some good ones what a difference it makes.
44526,"A reusable water bottle, it's amazing how much of a difference there is in the amount of happiness you have when you just stay hydrated."
44527,Yes! Recently got a $30 water bottle and it's so much nicer than drinking from the disposable soft plastic ones.
44528,lttstore.com
44529,Is linus a hydrohomie?
44530,Humidifier. No more dry skin in the winter. No more sore throats in the morning. Mine even has a little pod that you can put a drop of essential oil on if you want it to smell good.
44531,"I'm gonna go exactly opposite and say DEhumidifier (depending on where you live). Its so damp in my town that I used to get pretty bad mold on the walls, and it definitely fucked with my lungs before I got the dehumidifier. Now? No mold!"
44532,"I grew up with both in my house.  Gross and humid summer weather, bone dry winter."
44533,Smoke and/or ~~CO2~~ CO alarm
44534,And/or? Definitely AND!
44535,Better
44536,CO alarm not CO2. CO2 you gonna notice it when you are awake you gonna cough and all that but CO you don't notice it till its too late
44538,Wait... smoke alarms are not required by law everywhere?
44539,"Not yet. It's coming. [In Aus it's all new dwellings or leased/rented dwellings leased and sold and in 2027 all dwellings.](https://www.qld.gov.au/about/newsroom/smoke-alarm-legislation#:~:text=The%20new%20legislation%20specifies%20that,dwelling%20and%20on%20every%20level.) Don't know about other places."
44541,I have a tile for my phone and keys- attaching one to the dog is BRILLIANT
44542,"Thank you. I have always 'called' my wallet and keys. ""Here WalletWalletWallet, here KeysKeysKeys."" So it seemed natural to attach a tile to something that WOULD come when I called.

 Protip- The tile sings a little song as it looks for its mates. A few treat parties for your dog while your tile sings avoids massive confusion and or anxiety for the dog later. 

Source- I have two dogs, only acclimated one. I guess if my neck started to sing a song without me I'd be disturbed too."
44543,"I bet the dog thinks it's awesome now though. If your neck started playing a song and someone gave you 20 bucks each time, it'd be something to look forward to. Sort of like a weird game show..."
44544,A decent knife.
44545,My poop-knife has changed my life
44546,"*Cut my life into pieces, this is my last resort*"
44547,*Cut my shite into pieces.  This is my fecal sword.*
44548,Weighted blanket.
44549,"Yes! I got one for my girlfriend, but found that I also sleep way better using it too. It's like having a gentle, full body hug while you feel asleep."
44550,A house plant... after a few weeks you’ll get addicted to loving it and in a blink of an eye your room will be a tropical jungle
44551,Either that or you’ll kill it almost immediately and plunge further into the despair of existential dread.
44552,"I joke I have a black thumb. There's a 100% chance any plant in my care dies.   

I flat out told my mom this. She insisted I care for her plants. I requested very specific instructions. She did not give or write any down. She told me just to water them once a week. I followed said instructions. Her plants were withering and on the brink of death when she came back. I felt bad and didn't have the money at the time to replace them for her.     

Edit to add: thanks for the advice about plants. I really don't want one and am too lazy. But it's still kind of all of you to mention ones I could have and tips."
44553,I recently got into plants. Like super into plants. And the more I learn the more I realize that of course people have black thumbs!! (I used to) these ridiculous plants require all manner of shit and if one tiny thing is off they'll collapse! I swear they're more finicky than animal care. Don't feel too bad. Without specific amounts of water per plant you were set up to fail.☹️
44554,Bro
44556,Nah i need something that tells me it needs attention.  Feeding my pets multiple times a day? No problem but giving that fucking cactus some water? Nope i forgot that thing for 3 years straight
44557,"My house cactus is a soldier. He straight does what he wants when he wants. I haven’t watered that thing in a bit and he’s still chugging over there. I never will double cross that bastard. I thought about getting rid of it one time, and that night I bumped it and stepped on it walking in the dark. That was excruciating pain, pulling those little prickles out of my foot."
44558,"This has become my quarantine hobby. Had zero houseplants before Covid, 20+ plants now. Love em"
44559,"People throw plants out constantly, nearly all of mine are ' rescues'"
44560,My house plant gives me 200 grams of weed every hundred days or so...
44561,damn what plant
44562,Tomato
44563,"Literally lights. I am more productive and happier in a brightly lit room.Fiance says diva cup, though of course this only applies to people with periods. Literally anything better than the speakers built into your tv. A cheap bluetooth radio to your car. A bidet. Wifi bulbs or outlets. Sonicare toothbrush. Cheap espresso machine (delhongi ec155)."
44564,"I am a whore for colour changing lamps, I’ve got four in my bedroom alone"
44565,"Here is the cook's version:

A digital kitchen scale. You can get a decent one under $20. Following recipes by weight instead of volume is much easier and dirties fewer implements.

Stainless steel nested mixing bowls with a grip bottom and handles.

A second set of measuring spoons and measuring cups, if you have space.

Good salt. Kosher salt for cooking and flaky sea salt for garnishing."
44566,"I put a motion sensing light switch in my garage. My beer fridge is in the garage and it's just wonderful not to have to search for the light switch when going out for a third or fourth. Ontop of that, the lights turn on when I pull the car in which is great at night. I often go in and out of the garage with full hands so having it just turn on when I enter is just wonderful. It's honestly the best thing I've done for my house."
44567,"condoms


for real, some people should really consider buying them"
44568,"Electric toothbrush, much better than conventional ones. Mine costs 18 usd. 

Brushing teeth is now much more effortless. I used to feel tired brushing my teeth properly"
44569,I got the phillips sonicate for around $40. Went from my dentists being on me about my plaque buildup to saying I've been doing a good job. Its on a timer that buzzes everytime you need to change quadrants in your mouth and you don't have to guess how long you've been brushing.
