idx,text
34759,I think it is Rice but how exactly is Montana more important than Brady to the sport? Because he played before Brady is the reason why?
34760,"I've seen people put this more eloquently than I ever will but Montana redefined the position to the one we know today.  

It's not a perfect analogy but would you list the NASA moon landings in the 60s or the recent Tesla roadster  space launch as more impressive?  To me it's still the moon landing, even though NASA in the 60s would never have been able to achieve that precision and retrieval."
34761,"Given the time frame that the moon landings happened, they were more impressive than the Tesla roadster space launch, but something happening before another doesn't always make it more impressive. I think that what Brady has done in his 16 years starting is more impressive than Montana's career, especially now that the NFL is designed to not let teams have a sustained success for a long period of time"
34762,Jerry Rice for sure. He's without a doubt the GOAT WR. He has all the records and championships to back everything up. You can't say that about many players with such a general consensus that they are the best at their position.
34763,"Walter Payton. He was a very complete player, could run, block, catch, do everything and he did it all at a very high level. He didn't miss games. He was as tough as it gets. He was remarkably powerful for a guy his size. He was on some really bad Bears teams for a lot of his career but still produced big numbers every year.

He is the GOAT."
34764,Thomas Edward Patrick Brady the third
34766,"Art Donovan, whose last name begins with the same three letters as the fantastic fried flour ring that makes Canada relevant."
34767,"This is a difficult question, but if I can define greatness as being a great player and improving a team outside of the system he is in, one of the greatest could be Brett Favre. I could see him succeed in any team when he played and improve the play of his teammates more than any other player I have seen. I think John Unitas was a similar type of player, but I never saw him play, but again, he could have gone into any team and that team would have been a contender. I would say the same for Peyton Manning."
34768,"In any particular order I think these three have the best claim to the title: Jerry Rice, Tom Brady, Peyton Manning.

Obviously Tom is my favorite, but I feel in a lot of categories you can make a serious case for Peyton over him (and of course, vice versa). I don't feel like it's clear cut at all. And I don't think Jerry Rice needs any explaining.

My top 3 disregards pre Super Bowl era players because I'm honestly uninformed enough in that regard besides just hearing the various legend's name. Defensive players get disregarded too if only because the three players I named had/have such longevity that their AV starts to get too large to ignore, especially considering the fact that all three of these players consistently put up MVP caliber seasons throughout their careers.

I think a case could be made for Montana too, considering his flawless Super Bowl record and very high skill of QB play adjusted for era. I just feel that Peyton and Tom played on an equal level and did it even longer."
34769,"It has to be Tom Brady as much as it pains me to say it. For everyone saying Jerry Rice, yes, he is the greatest WR to play the game. But he also had Joe Fucking Montana AND Steve Young tossing the ball to him.

When it comes down to it, it's all about the Superbowl and Brady has made it 8 fucking times. That is the record for Superbowl visits for any position. And the next highest QB is John Elway with 5. And Brady isn't even done yet."
34770,"Ya.  People can use bellichick as an excuse but Brady has won.  He plays the most important position. He controls the offense.  And he has made it to 7 straight championship games?  Come on.  That's like LeBron making all those finals in a row.  It's just too easy for them.  They find trouble against the very best opponents, but more times than not, Tom Brady has won the super bowl when he has got there.  

You play to win the game. He's done it."
34771,"If you ask almost any player listed here, they would say Tom Brady is the greatest of all time.  Right now, there's a bunch of fans who are going to have a hard time accepting it, and that's fine.  After he retires, I think almost everyone will admit it."
34772,Bo
34773,Think this thread should be who is the greatest player in your franchises history. Walter Jones.
34774,"Let's give some linemen some love:

Anthony Munoz"
34775,Not a name mentioned a lot but I agree he needs to be in the discussion
34776,"Probably cause he played for the Bengals, who this sub loves to have a circlejerk on."
34777,It’s Brady.  Second is Rice.  Third is Walter Payton.
34778,Easy Brady.
34779,Nelson Spruce
34780,Terry Tate
34781,Walter Payton
34783,"If I was in charge of a team and there was a draft of every player who ever lived at their prime age and I had the first overall pick, I would go Brady without much hesitation"
34784,The fact that people are mentioning anyone other than Brady is asinine. The greatest player of all time at the most important position.
34785,"Tom Brady.  No position matters as much as quarterback and relevancy is a prerequisite for greatness.  No one cares about the most skilled long snapper.  

Statistically he's at or near the top of nearly every category.  And he's lead the greatest dynasty in NFL history."
34786,Willie Beamen
34787,Nathan Peterman
34788,Best player at the most important position in the game: Tom Brady.
34789,"Man, what a great time to be a Texans fan."
34790,*gently pats you on the back*
34791,Between that and the entire Astros fiasco it's been a rough time for Houston fans lately.
34792,Harden too
34793,No write up
34794,JESSIE FUCKING BATES BABY
34795,He is certifiably \#Good.
34796,I wholeheartedly agree
34797,JB3 getting the respect he deserves! Great write-up /u/sanswagata
34799,"***no player card or writeup***


Damn lol, what did Watson ever do to deserve this? 


/s"
34800,Shoulda just posted a picture of Bill Cosby for his writeup.
34801,Someone called him DeShaun Cosby in another thread and it was kinda awful and funny all at once
34802,https://i.imgur.com/qjjC1cs.jpg
34803,Really not the best time for that either
34804,Stupid rapists always ruining humor
34805,Those bastards
34806,Truly their greatest crime.
34807,"I wish there was a write-up but I understand why there isn't one. Ignoring all of the off-the-field problems, his play speaks for itself."
34808,"So this leaves, in no particular order

Aaron Rodgers, Aaron Donald, Patrick Mahomes, TJ Watt, Derrick Henry, Davante Adams, Stefon Diggs, Travis Kelce, Myles Garrett, and ~~Kevin Dotson~~ Jalen Ramsey."
34809,I’m curious if Rodgers came in first or not. He’s the league MVP but that doesn’t mean that the rankers agree with that assessment
34810,"Pretty sure it will be between him and Donald. Every list I saw from other rankers and my own had those guys 1 and 2.

Even for me it was a real tough call. Removing as much homer bias as possible it was really very close between the two. I swapped them back and forth a few times."
34811,"Well seeing as the MVP is really just a QB/RB award like the Heisman, it feels fair to say that doesn't automatically make them the best."
34812,*Devonta Smith intensifies*
34813,It’s a QB award at this stage
34814,Packers are crazy top heavy
34815,"In order, my guess will be:

1. Rodgers
2. Donald
3. Mahomes 
4. Henry
5. Adams
6. Diggs
7. Garrett
8. Ramsey
9. Watt
10. Kelce

Maybe flip Watt and Garrett? Idk, I’m just a guy being a dude."
34816,I think you got to put Kelce higher than the receivers. He had the number 2 receiving yards in the league as a tight end.
34817,Certainly above Diggs. Dunno about Adams.
34818,That with Watt and Garrett flipped was my exact guess.
34819,donald is 1
34820,"Even as a Rams fan, I think is AR. Donald had a down year by his standards."
34821,">Donald had a down year by his standards.

Must be nice to win DPOY in a down year."
34822,Goes to show how absolutely insane the dude is.
34823,"i think it’s only looked at as a down year bc DPOY wasn’t really a lock, since tj watt was in the conversation quite a bit. it was barely a down year stats wise"
34824,"Ehh. He won DPOY, dude. Was it as good as his 2018 season? No. But that’s because ‘18 was the single greatest season ever put together by a DT. I don’t think you can call 15.5 sacks a down year."
34825,Don’t forget N’keal Harry
34826,"Josh Allen's ascension has been a thing of beauty and I hope he continues it. I remember saying that I wasn't sure he could over come his accuracy issues, but that I hope he one day proves me wrong. This last season he proved me dead wrong."
34827,"I love Josh Allen, and his improvement as a passer has been a revelation. But if he doesn't change his running style, he's going to get injured trucking somebody. 

Find me a mobile quarterback, and I will find you 10,000 of his anonymous online supporters who will defend him by saying, ""He's not like the others! He's smarter! He's more agile! He's different!"" But he's not, and Allen is too good of a passer to be laying out linebackers head-on."
34828,"> ""He's not like the others! He's smarter! He's more agile! He's different!""

Lol, he's definitely not that. He runs like a linebacker and really needs to stop. He's a big dude so maybe he can take the hits, but he never fucking slides. Makes me nervous lol."
34829,"> he never fucking slides

That's just not true. Not anymore. As of last year, what Allen never does is give up on a third down. He'll slide or go out of bounds if it's first or second down. 

But look at the play where he stiff-armed Van Noy, then broke out of Ogbah's tackle? That was a 3rd and 8. And he *never* wants to concede a punt. The plays where he's scrambling all over the place, breaking tackles, trying to run for a first down or thread impossible passes on the scramble drill? Almost all of them are on 3rd down."
34830,"Believe me, err, Billieve me!! He makes me nervous a lot of times too :/ I hope he lets up a little on the running this season, and not even just that, sometimes he is so stubborn and won't go down. [This nearly gave me a damn heart attack](https://www.youtube.com/watch?v=kVxMInnjWto) and I am shocked he was only out for one play after that. We dodged a huge bullet there!"
34831,"I’m gonna be that guy because I truly think the “he’s not like the others” arguments work, but for Lamar. 

It doesn’t for Allen, because he runs somewhat like Cam. Just a big ass dude who can and will murder you. Lamar is shifty and seems to be really good at minimizing impact whenever he does take hits."
34832,"Speed is one of the first things to go, my dude! Hopefully Jackson can keep evolving his game, because I like the guy, but it's pretty delusional to think he can continue to play that way in the long term. 

Let's just enjoy it while it lasts."
34833,Desean Jackson is 34 and still fast as fuck tho
34834,True. But it's worth asking why he's always injured...
34835,Getting Diggs was a brilliant move by the bills. Gives Allen a #1 and frees other receivers by drawing coverage. It’d be nice to see them win a super bowl
34836,If they make it over the Chiefs I wouldn't complain too much. Bills and their fans deserve a Super Bowl.
34837,with the way things went last season i would have been happier if we got knocked out by the bills and they went all the way
34838,Sounds like tempting fate with Brady breaking their hearts from an entirely difference conference.
34839,that’s true but this is all taking place in the entirely hypothetical universe in my mind where “the chiefs don’t win the super bowl so i get to choose who does”
34840,"Obviously, the elephant in the room here is Deshaun Watson. The allegations and all were coming out as we were doing the ranking process. I instructed the rankers to rank him as they would since we didn't know all that was going to happen with Watson at the time. Over time, we've all started to see the person he really is and know more now than we did several months ago.  
  
I made the call instructing the rankers to rank his play on the field in 2020 but not trying to do more than that here with a fun write up or player card."
34841,Good call - handled well.
34842,100% agreed.
34843,"Exactly the way it should have been handled, well done"
34845,"NFL really about to let this whole thing get swept under the rug.  I figured they would, but it's still surprising with the amount of accusers."
34846,"I'd be a little surprised if they can actually pull off sweeping this under the rug. Fans of opposing teams are gonna be all about bringing up the allegations during games and even a lot of Texans fans (on reddit at least) seem uncomfortable rooting for the team when Watson is present. 

Either way I guess we'll find out pretty soon if the league will step in or not."
34847,"> Fans of opposing teams are gonna be all about bringing up the allegations during games

Does Houston play at Pittsburgh this year?  Those fans could think up something with the terrible towels lmao"
34848,Something something glass houses
34849,"Maybe I’m being naive but I don’t think so. He definitely gets suspended at the least. 

There’s also the whole thing of the fact that even if this never happened, he probably would not be playing for the Texans this year anyways. They won’t be able to trade him, he doesn’t want to play for them, and they have a very good reason to not play him now."
34850,"I agree. I think the NFL is letting the dust settle a bit, and some time in August they'll say they've conducted their own ""internal investigation"" and decided to suspend him for 17 games. Once the legal matters are settled, I think he'll be back in the league in 2022 (assuming he's not in prison)"
34852,That's the correct decision.
34853,"Agree with everyone else, exactly the way that this should have been handled.  Thank you, rankers"
34854,The bull in the room
34855,"Lol, you mean 10th best safety in the league Jessie Bates, like someone had him pegged earlier in the week?

In all seriousness, glad to see him fairly ranked here."
34856,"I know some Steeler fans who wanted to take Bates at their late first round pick over Terrell Edmunds. 


In the end, they ended up with Minkah Firzpatrick who was the first safety taken in that 2018 dradt."
34857,"I’ve been very, very happy with the Fitzpatrick acquisition but would not have been sad at all if we drafted Bates. Dude is incredible."
34858,"Honestly happy he’s on here, although as a Steelers fan I could debate him against Minkah. 

Jesting aside though, Bates is so underrated on a national level and across non-AFCN fanbases it’s disturbing."
34859,"I was resolved to him being snubbed altogether, did not expect to see him at 15! Well-deserved."
34860,Thank you so much for organizing this and for all the rankers. I have looked forward to this every week and it has greatly made the off-season more enjoyable when we have dead time before camp.
34861,Get over here and kiss me on the mouth
34862,"Ya these guys do a great job, I'm glad we're past the constant negativity that was thrown at them in the comments the last couple years"
34863,They did a much better job this year.
34864,"Flair explains that 

/s"
34865,This might be the nicest comment us rankers have ever received.
34866,I've got a boner rn
34867,"Can confirm /u/MysticTyph00n has a boner right now.

It’s impressive."
34868,Well I’d say this year has been really well done. 2019 was a fuckin circus and 2020 was much improved. This is the best it’s ever been I think.
34869,"Funny, 2020 was the year myself and u/MattyT7 began ranking 🤔"
34870,🙈
34871,been a very fun experience especially with the down time during covid lockdown
34872,we get it you begged to be a part of the team.
34873,"Yay we got a dolphin on there! Hopefully he plays this year, I think our team really needs him"
34874,"So Jaire at 11 must mean Thielen is 10, right? /s"
34875,"That write up for Dalvin Cook is so sexy….good job u/Tripudelops.

Now that Dalvin has been ranked, I’ll say this for the final time:

The real travesty (I’ve said this in nearly every top 100 thread lol) is having only 1 TE and 2 RBs make an All Pro team, yet have 8 WRs with one of them being Cole Beasley. 

Waller should’ve made it with Kelce, and Cook should’ve made it with Henry and Kamara. 

Dalvin Cook was snubbed from an All Pro team after a 1900+ yard and 17 TD season, which is an accolade that greatly affects a player’s place in this game’s history, and all because the roster construction and voting system for All Pro teams are obviously flawed. I’m trying to get over it…..but it’s difficult."
34876,If you took away Cook’s pre-contact yards he would be the 8th most productive RB of 2020. That’s just stupid.
34877,Jesus christ
34878,You’d hope the huge star power around the NFL at TE at the moment would lead to a rethink on that.
34879,"FWIW, PFW and SN had Dalvin Cook as a 1st team all pro and those teams count just the same as the AP one according to the NFL CBA."
34880,That’s a lot of acronyms
34881,STFU and GTFO if you have a problem w/ it
34882,"Do they really?  I've always heard the AP one is the only ""official"" one when it comes to a player's accolades."
34883,"[Yep](https://nflpaweb.blob.core.windows.net/media/Default/NFLPA/CBA2020/NFL-NFLPA_CBA_March_5_2020.pdf). On page 136 you see that all 3 (and also SI) count the same for contract bonuses. And on [Derrick Brooks'](https://www.profootballhof.com/players/derrick-brooks/) HOF page you can see it lists him as a 6x all pro, despite only making 5 AP first teams. Similarly, [Larry Allen is noted as making 7 straight first team all pros](https://www.profootballhof.com/players/larry-allen/), but only made 6 straight AP first teams (the 7th one was a SN first team all pro).

The AP is the most well known and often used, but the other matter just the same according to the NFL."
34884,"AP is absolutely looked at as the most “important”, and it’s also the most used. 

Even the HoF website lists AP All Pro teams separately, then bunches together SN and PFWA All Pro teams and doesn’t differentiate between the two. That says it all."
34885,"> Even the HoF website lists AP All Pro teams separately, then bunches together SN and PFWA All Pro teams and doesn’t differentiate between the two. That says it all.

That's not true.

[Champ Bailey](https://www.profootballhof.com/players/champ-bailey/)

[Larry Allen](https://www.profootballhof.com/players/larry-allen/)

[Derrick Brooks](https://www.profootballhof.com/players/derrick-brooks/)

In the Career Highlights section, all pro teams are listed out like this (Derrick Brooks' page)

> All-Pro: 1999 (AP, PFWA, SN)  •  2000 (AP, PFWA, SN)  •  2002 (AP, PFWA, SN)  •  2003 (SN)  •  2004 (AP, PFWA)  •  2005 (AP)

> All-Pro Second Team: 1997 (AP)  •  1998 (AP)  •  2001 (AP)

> All-NFC: 1997 (PW)  •  1998 (PW)  •  1999 (PW)  •  2000 (PW)  •  2001 (PW)  •  2002 (PW)  •  2004 (PW)  •  2005 (PW)

And since Brooks is listed as a 6x all pro in his HOF bio despite making on 5 AP first teams, then all 3 count the same."
34886,"Good call on the HoF website. I misremembered how is was formatted. Still, it’s almost a consensus that AP is by far the most widely coveted and used All Pro team. 

HoF site also lists Pro Bowl appearances the same as All Pro awards, but that in no way means Pro Bowls are weighted the same as All Pros. It’s essentially an overview of the player’s career.

Also, SN isn’t used for compensatory picks by the league, only AP and PFWA are. Even Wikipedia says AP is the most widely recognized All Pro team.

https://en.m.wikipedia.org/wiki/All-Pro

AP is not only the most “important”, but it’s the most used and widely recognized of any All Pro team."
34887,"Agreed that it's the most recognized and therefore most important to perception, but that still doesn't mean that SN/PFWA considered to be worth less by the NFL or HOF voters.

> HoF site also lists Pro Bowl appearances the same as All Pro awards, but that in no way means Pro Bowls are weighted the same as All Pros.

I don't really understand this point. The HOF lists them as a different award, as they are, and they don't say they're weighted the same.

I didn't know that about comp picks, thanks! Weird that SN doesn't count, maybe because it's because they aren't a large collaboration of writers."
34888,Cook is electric I've never really seen a RB like him
34889,Only one of Dalvin's clips was against us? Even after he ran for like 3000 yards in one game? Woohoo!
34890,Can't believe J.J. Arcega-Whiteside made it into the top 10!
34891,The most devastating downfield blocking WR in Philly sports history
34892,"|Player|r/NFL Rank|My Rank|Variance|My Player|
:--|:--|:--|:--|:--|
|Fred Warner|20|29|-9|Bobby Wagner|
|Trent Williams|19|37|-18|Xavien Howard|
|Dalvin Cook|18|13|+5|Khalil Mack|
|DeAndre Hopkins|17|14|+3|Jaire Alexander|
|Deshaun Watson|16|15|+1|Minkah Fitzpatrick|
|Jessie Bates|15|21|-6|Deshaun Watson|
|Xavien Howard|14|19|-5|DeAndre Hopkins|
|David Bakhtiari|13|8|+5|Dalvin Cook|
|Josh Allen|12|5|+7|Travis Kelce|
|Jaire Alexander|11|17|-6|Myles Garrett|

Jessie Bates was this year's Kenny Clark for me, a guy that I never really paid any attention to who just blew me away on film. What a special safety class that appears to be with him, Derwin, and Minkah"
34893,"Can’t forget Derwin James too, really good safety class."
34894,I completely forgot he was in that draft class too haha damn.
34895,14-19 is -5
34896,Whoops! Good call!
34897,"Well done on the Cook write up!  I don't want much change in the offense next, but Cooks depth of target needs to go the fuck up ASAP.  He could be so much more than a screen RB."
34898,"The spread for Deshaun seems relatively wide for someone in the top 20. Some rankers, including myself, have him around the top 5, others not even in the top 30. I can’t help but think some rankers may have let the allegations and legal issues bias them, because from a football perspective, he had an incredible season, with the worst supporting cast out of any QB on the list."
34899,Rankers had Josh Allen as high as 3 and low as 35 and he was MVP runner-up.
34900,"With Rodgers Allen Mahomes Brady and Trubisky there was a lot of competition for top 5 qb, so makes sense some fell a little"
34901,Would've been in the MVP race down to the very end if his team wasn't so garbage
34902,I disagree. He only threw 33 tds last year. He had a pretty great season but it wasn't MVP level at all
34903,"Also led the league in passing yards and yards per attempt, and threw in 450 rushing yards with 3 TDs

I dont think he would've gotten it over Rodgers even if the team had made the playoffs, but he would've been in the discussion"
34904,"It would be disrespectful for a QB with 51 total touchdowns and single digit turnovers to not win MVP

That has never happened before, Rodgers was a lock. If Rivers didn’t win it in 2008, Watson wasn’t going to win in 2020 even with a playoff berth"
34905,It could also have to do with his team doing so terribly even when his own stats were good. Wins aren't an individual stat obviously but QB is probably the most appropriate position to take team wins into account for.
34906,"Hard to know for sure but one thing I've learned the last two seasons reviewing all submissions is you do get unexpected variance on players. We've talked about this too, from an on field perspective, Watson was phenomenal. So could be a little bit of reaction to what's happened but might not be as well."
34907,"After watching film he really wasn’t that much better this year in my opinion. Yell at me all you want, but *so much* of his volume stats especially came in garbage time against super soft defenses.

Yes, his team was bad. No, wins are not a QB stay. But yes, he did benefit a ton from playing from way behind for the second half of a lot of games. If you’d like the least appropriate comparison ever, he got the Blake Bortles BOAT Bonus. That’s not to say he isn’t super talented, but I do think other QBs did more with their own massively flawed teams."
34908,"Watson attempted more passes and threw for more yards in the first half than he did in the second. The Texans actually didn't spend that much time in garbage time in 2020 - using the [handy filter on Ben Baldwin's website](https://rbsdm.com/stats/stats/), you can see that Watson still ran a similar amount of plays as everyone else. He also wasn't [top 5 in garbage time attempts](https://www.profootballnetwork.com/kirk-cousins-minnesota-vikings-and-the-kings-of-garbage-time/)."
34909,I guess I’m getting to the age where I don’t know all players. Jessie Bates is a new name to me
34910,"He plays for Cincinnati, that's why."
34911,"Super rangy, ballhawk type of FS who has become a very aggressive and sound run sender as well. It’s nice to finally see him get his recognition."
34912,he’s on the bengals defense that’s why
34913,Do yourself a favor and keep an eye out for him if you ever are forced to watch Cincy this seaso.  Dude is smart as hell and was pretty easily the best FS in the game last year.
34914,"He kinda came almost out of nowhere last year. He had a very good rookie season, a sophomore slump, and then jumped up to being one of the best safeties in the league.

Hoping our own Juan Thornhill can do the same this season."
34915,"Some people ranked the MVP runner-up Josh Allen **in the 30s for the 2020 season only**?? 

lol."
34916,Damn and here I was sad that I couldn’t justify pushing him up from no. 13 and it felt like an under-rank
34917,Hilariously they’re gonna have Mahomes #3
34918,Why is being correct so funny?
34919,Shorts man good indeed.
34920,Four Packers in the top 15. Feels good. Mostly.
34921,"If only your team didn’t have all that other stuff going on in the off-season, I’d really have them as my favorites to make it to the Superb Owl"
34922,Remember when Trent Williams had literal fucking cancer and the Washington team medical staff was like “looks good to us.” Lol
34923,Having our QB ranked #12 in the league instead of #12 at the position makes me feel crazy things....
34924,"Tbh after the past two decades I would have even been cool with 12th in the position, this is awesome."
34925,Looking at the rankers sheet you can definitely tell who watches a lot of football/teams/tape and who just watches their team or maybe their division.
34926,"Fuck it. Name names. Punch some people in the mouth.

… unless you mean me because that Fred Warner ranking is an oops in hindsight sorry 9ers fans."
34927,"I agree, way too high ;)"
34928,Some of the rankers also have massive bias for their own team.
34929,"Absolutely. Also why I never volunteer for these sorts of things. Respect for the ones that do it, but it's really only worth it for the ones that are done well."
34930,Wouldn’t more rankers “doing it well” help the overall product? Become a ranker.
34931,All pro Fred. Pay the man
34932,"Recent 49ers and linebackers.... legendary

Navaro Bowman
Patrick Willis
Chris Borland
Fred Warner"
34933,Feels weird to lump Chris Borland in there with the other three when he only started 8 games
34934,Yeah but I am a badger fan and he was incredible in all the games he played. Almost defensive rookie maybe?
34935,"Lets goooo, two top 10 players"
34936,":) 

writing the Ramsey write-up as you read this"
34937,Man I love our defence.
34938,I love Fred Warner. His SB mic'd up was fun to listen to.
34939,I take personal offense to Watson being ranked above Wilson. Even setting aside the allegations.
34940,"If we’re talking play, and play alone from the 2020 season…. Deshaun was better than Russ"
34941,"I think that's debatable. 7 more tds and 6 more ints for Wilson

I also know Watson had a much worse team around him but they only won 4 games"
34942,"> I also know Watson had a much worse team

Being a piece of shit aside, Watson had like a 70% completion rating, and a top three yards per attempt. Meaning he was completing a ton of his passes WHILE airing it out amongst the most in the league. 

Randall Cobb, Keke Coutee, and Jordan Akins each had 400 yards. What Watson did last season was absolutely insane and honestly one of the best QB performances like, maybe ever. He could not have done more with less.

AND he threw it away."
34943,"to be fair wilson is really good but he’s throwing to freak of nature DK Metcalf and tyler lockett, compared to watsons team"
34944,"That write on Nuk was pretty funny. Maybe I’m biased though? Good work regardless, u/BeeHay! You made me have some bubble screen PTSD, so thanks for that."
34945,He did a good job with it. Hopefully the picture for his card is nice too. Tried to find a good one after that hail mary
34946,"Loving the clips in these writeups.

In the Dalvin Cook blurb, there's a play against the Titans (the hyperlink says ""massive plays"") where Malcolm Butler goes out of bounds and then comes back in to swipe at the ball - is that legal? It feels like it shouldn't be."
34947,"It is legal. During the 2019 season, DK Metcalf caught a ball and almost hulked his way through a handful of 9ers defenders, but he ended up losing a fumble when one of the corners forced it while running out of bounds. 

https://youtu.be/S-OtHWvL8K0 at about the 4:52 mark."
34948,"Interesting, thanks for the followup on that. I'd argue that the Butler/Cook play is way more egregious than the Tartt/Metcalf one. Tartt is still in bounds when contact starts, Butler is so far out of bounds that he's off the paint and runs back into the field of play."
34949,"On paper, it's very strange when it happens. There's an established field of play, but players can impact that field of play while being outside of it. 

Even stranger is that on kick-off/punt plays if a defender goes out of bounds they have to quickly get back in bounds or they get a penalty. On offense, players that go out of bounds can't be the first to touch the ball (unless they were forced out by a defender I think). 

There's definitely something that doesn't feel right with it, but there's so many rules favoring the offense and that this is relatively rare that I think it's fine."
34950,Great point! I think it was the special teams rule that really threw me for a loop.
34951,"Henry better bet top 3 at least after one of the best running back seasons of all time, especially with the decreased focus on the running game in today’s NFL"
34952,"Assuming 1 and 2 are either Rodgers or Donald, it's likely between Henry and Mahomes for 3 and 4. Depends how heavy the rankers favored QBs."
34953,One could argue a deceased focus on the running game is good for a big running back like Henry.
34954,"Aaron Rodgers, Aaron Donald, Davante Adam's, Patrick Mahomes, Derrick Henry, Travis Kelce, TJ Watt, Quentin Nelson. Who am I missing"
34955,"Quentin Nelson was already revealed in the 20's range I believe.

I believe it's gonna be all the other ones you mentioned, plus Myles Garrett, Stefon Diggs and Jalen Ramsey, barring any surprises."
34956,Nelson was 21 I think
34957,Diggs. But I think he is way (10-15 spots not 30) too high.  And probably Ramsey
34958,"It’s impossible to tell the story of the 2021 season without Diggs and Allen. 

There’s no way one of the two aren’t in the top 10 players from last year. Personally, I think Allen should be in the top 10 over Diggs, but I don’t see any issue with the WR with the most catches and yards being listed as a top 10 player."
34959,"I was down some crazy batshit amount in my fantasy *championship last year, and all I had was Diggs left. Didn’t even watch the game because I knew I had no chance.

Thank you Diggy 🙏"
34960,"|Ranking|Player|Team|Position|My Rank|Difference|Who I had|
--:|:--|:-:|:-:|:-:|--:|:--|
|11|Jaire Alexander|Packers|Cornerback|7|-4|Joey Bosa|
|12|Josh Allen|Bills|Quarterback|14|2|Derrick Henry|
|13|David Bakhtiari|Packers|Offensive Tackle|24|11|Stefon Diggs|
|14|Xavien Howard|Dolphins|Cornerback|26|12|Josh Allen|
|15|Jessie Bates|Bengals|Safety (SAF)|33|18|Chris Jones|
|16|Deshaun Watson|Texans|Quarterback|10|-6|Jalen Ramsey|
|17|Deandre Hopkins|Cardinals|Wide Receiver|28|11|Travis Kelce|
|18|Dalvin Cook|Vikings|Running Back|18|0|Dalvin Cook|
|19|Trent Williams|49ers|Offensive Tackle|27|8|Tom Brady|
|20|Fred Warner|49ers|Off-Ball Linebacker (LB)|29|9|Cameron Heyward​|

Ask away 

[My 30-21](https://www.reddit.com/r/nfl/comments/ogbgad/rnfl_top_100_players_of_the_2020_season_3021/h4ht5qd/)

[My 40-31](https://www.reddit.com/r/nfl/comments/oey5u8/rnfl_top_100_players_of_the_2020_season_4031/h4hw7ix/)

[My 50-41](https://www.reddit.com/r/nfl/comments/obqcg4/rnfl_top_100_players_of_the_2020_season_5041/h4hw29f/)

[My 60-51](https://www.reddit.com/r/nfl/comments/oabn59/rnfl_top_100_players_of_the_2020_season_6051/h3i03a1/)

[My 70-61](https://www.reddit.com/r/nfl/comments/o746rz/rnfl_top_100_players_of_the_2020_season_7061/h2ya5op/)

[My 80-71](https://www.reddit.com/r/nfl/comments/o5r11l/rnfl_top_100_players_of_the_2020_season_8071/h2o2wtx/)

[My 90-81](https://www.reddit.com/r/nfl/comments/o212fe/rnfl_top_100_players_of_the_2020_season_9081/h2o2vo9/)

[My 100-91](https://www.reddit.com/r/nfl/comments/o0hzh7/rnfl_top_100_players_of_the_2020_season_10091/h1v3ecr/)"
34961,Thanks babe
34962,https://media0.giphy.com/media/3oFzms9ePB1MOMo2ek/giphy.gif?cid=790b7611d317087ac1dcb52b3eac10f53b96f901a063fdfb&rid=giphy.gif&ct=g
34963,"Man the spread on Chris Jones is insane. I know I'm biased, but I think you've got him ranked pretty accurately."
34964,"I was very surprised he was so low. I can see how Dbuck was ranked higher by some, but Chris Jones is a menace, was my 2 after AD and I stand by it"
34965,"ya i was midget penguins supervisor, and i had it approved right away"
34966,"&#x200B;

|Player|Rank|My Spot|VAR|Player I had|
|:-|:-|:-|:-|:-|
|Fred Warner|20|26|\-6|Jaire Alexander|
|Trent Williams|19|19|Perfection|Trent Williams|
|Dalvin Cook|18|31|\-13|Tyreek Hill|
|Deandre Hopkins|17|17|Double Perfection|Deandre Hopkins|
|Deshaun Watson|16|6|10|Josh Allen|
|Jessie Bates|15|15|TRIPLE Perfection|Jessie Bates|
|Xavien Howard|14|13|1|Khalil Mack|
|David Bakhtiari|13|12|1|Xavien Howard|
|Josh Allen|12|16|\-4|David Bakhtiari|
|Jaire Alexander|11|20|\-9|Stefon Diggs|

3 perfect ones, pretty proud of that. Watson is obviously the weird one here, sure his personal stuff impacts his ranking."
34967,Why is this being downvoted? What am I missing other than Darvin Cook being a little lower than the other voters?
34968,"I have no idea, some weeks I get +10 upvotes for having more variance between the consensus and what I have.

Maybe it's having Xavien over Jaire? Even though there's an argument for it and it's only a 7 spot difference between the 2 so it's not like I viewed them that differently."
34969,16 for Watson feels pretty high to me.
34970,IMO He was pretty solidly the #3 QB in the league last season behind Rodgers and Allen.
34971,"Huh. Maybe I’m biased by how bad the Texans were last year. To me, feels weird to have the QB of a bottom 5 team in the top 20."
34972,"!nflcompare <Josh Allen, Aaron Rodgers, Deshawn Watson> [2020]


As a pure passer I would put 2020 Watson above 2020 Allen, Josh's rushing is why I think he edged Watson to be QB#2 for 2020. Deshawn was absurd and probably the greatest case study for why QB wins/losses should not matter that I've seen in a decade. This performance compared to the team performance blew the doors off of the mid 2010s ""lol 7-9 Brees"" meme. Absolutely an elite QB, even if he's a slimy disgusting person."
34973,"Rank | Player | My Rank | Difference | Player I had here
---- | ---- | ---- | ---- | ----
20 | Fred Warner | 24 | -4 | Garrett Bolles
19 | Trent Williams | 12 | 7 | Joey Bosa
18 | Dalvin Cook | 23 | -5 | Myles Garrett
17 | DeAndre Hopkins | 30 | -13 | Stefon Diggs
16 | Deshaun Watson | 3 | 13 | Quenton Nelson
15 | Jessie Bates | 15 | 0 | nailed it
14 | Xavien Howard | 14 | 0 | nailed it
13 | David Bakhtiari | 22 | -9 | Khalil Mack
12 | Josh Allen | 11 | 1 | Trent Williams
11 | Jaire Alexander | 7 | 4 | Josh Allen

ask away"
34974,Watson at 3? Did you have Rodgers and Mahomes at 1 and 2?
34975,"I had Rodgers higher, but did not have mahomes higher as I felt Watson was nearly as good with far less help."
34976,"It’s crazy seeing so many AFC north guys up here, with some in similar positions!

Jesse/Minkah at free safety both in the top 30, even though I personally think Minkah should be ranked higher than Jesse.

Watt/Garrett both going to be in the top ten

Browns OL has a ton of guys on here, as well as the RB running behind it.

Hell, even the Ravens got an RB on the list!"
34977,"I knew he wouldn’t be this high up, but how the hell is Tyler Lockett not on this list?? So underrated."
34978,"I could see him getting honorable mention, but I don't think he's top 100.  If you look at the rankings, players like Keenan Allen and Mike Evans are in the 90s.  I don't think you could put Lockett ahead of them."
34979,"The ""back end"" (wide receivers outside the top tier that obviously deserve to get ranked in a year) is always near impossible to get right. Every year I've ranked after the top 4 receivers I could put the next 7 or 8 in any order and it will always come out right and wrong simultaneously. I know MTC feels the same and sees some insane variance in the WR rankings, probably more so than any other position."
34980,Wow I’m happily surprised that Ramsey was ranked above Jaire considering I thought for sure Ramsey would only beat out Howard in the ratings
34981,"Its a hard sell for two of the top 10 players to be Tight Ends. Is Kittle really top 10? Either that or he was left off entirely, which is also a difficult sell."
34982,Well this is based off of 2020 play so Kittle is probably off the list because he only played 8 games
34983,This. Not enough games to qualify
34984,But I ranked him #1
34985,Found maad-dog
34986,Kittle didn't play enough games to be considered for the top 10
34987,So kickers aren't players? wtf?
34988,"Yes, and no one played football before 1960."
34989,well players have become better since 1960
34990,Also unlike baseball the rules and scoring has changed so much over the last 100 years. Even the size and shape of the football has changed.
34991,If you watched the show they have players pre 1960
34992,Excellent list.
34993,"Adam Vinitari is the NFL's All Time Leading scorer. 

It would be an insult to not put him on that list."
34994,FOR THE BRAND
34995,"Here’s the list since OP left it out 

https://www.usatoday.com/story/sports/nfl-100/2019/10/01/nfl-100-best-players-all-time/3785514002/

Edit- the list is in the OP now. My work here is done."
34996,"It’s a great list. Truly the best top 100 list including all eras of football I’ve ever read.

I could nitpick some things like Gale Sayers probably shouldn’t be a top 25 player (maybe not even top 50), considering where LdT is. I don’t think Elway should be above guys like Marino and Favre either.

But man, really great list."
34997,Typical recency and position bias. In the last 100 years of NFL football a QB was only a must have in the last 25 years and they are way over represented in the top 10. If you figure the average writer for USAToday is around 45-55 they remember watching football in 80s and 70s. They could have made this real easy on themselves and looked at the NFL all decade teams they did for the 75th anniversary and gone from there.
34998,"No Largent

....feels bad man"
34999,Any WR who played before the ”player protection” era is better than today's WRs. It's just a fact if a guy can still make catches and get blown up going over the middle they are a better football player.
35000,Just because you say your opinion is a fact doesn’t make it a fact.
35001,That’s how facts work in 2019.
35002,I think recency bias is fair game. Players today are on a different level in terms of athleticism and the league is about as even competition than it's ever been.
35003,Position bias as well. There needs to be more lineman and DBs in the top 20.
35004,"So sorry it is hard to see how good a player is from worn out, blurry, black and white tapes from the 30s, 40s, and 50s."
35005,"Kicking is an integral part of the game guy, come on."
35006,I don’t know what to think
35007,#4 will blow your mind!!!
35008,Jim Brown blew your mind?
35009,Tony Romo should be #1.
35010,does a list have a link
35011,Don’t know how Rodgers is that much above Young.
35012,No Jim Kelly? Really?
35013,The Joe Greene photo is so good it feels photoshopped
35014,They forgot to include Ray Lewis’  DPOY from 2000.  All it takes is to take a quick look at the Wiki page come on man.
35015,"One thing I hate is when people kind of shoehorn in older players simply for the sake of offering the appearance that they are including all eras but they don't actually do analysis into it.

Like, Lance Alworth is not the 4th best WR of all time. Don't get me wrong he had a great career and is absolutely a hall of famer. But he is not the 4th best WR of all time.

I also think don Hutson gets overrated because of this. Don Hutson is not the 25th best player of all time. Half of his competition was in Germany for his biggest seasons. Like the league was consolidating teams and cutting teams due to a talent deficiency at the time. He was still great and sure you could say he's a top 100 player of all time, but not 25.

My last complaint is that ironically, they underrate Jim Thorpe. Honestly just switch Hutson and Thorpe straight up and it's a much more reasonable list.

Early era players are hard to rate, but I think sometimes they get overrated just so author's can kind of pretend to have this historic enlightenment of the game. The beauty of it is they get to hide behind the ""played in different eras"" argument to avoid actually providing substance to their argument."
35016,They need to appease the baby Seahawk fan posting above complaining about lack of pre1960 representation.
35017,That top 5 is FLAWLESS
35018,"Vinatieri isn’t as accurate as Tucker, but he has made some of the clutchest kicks ever.  When the chips are down Vinatieri came through.  I was surprised Lechler was on the list."
35019,Can you name one big time kick that wasn’t made by Vinatieri?  I can name plenty of big misses and horrible kicks.  He should have retired a few years ago.
35020,Maybe you should be an NFL kicker if it's such a breeze
35021,The list is stupid but your take is even dumber
35022,"Seems about right from an individual perspective   When it comes to the top 4, although Peyton Manning is way too low and he should be 5"
35023,"Bart Starr- The first Super Bowl winning quarterback

Joe Namath- The Guarantee

Lawrence Taylor- The greatest defensive player ever

Jerry Rice- The greatest wide receiver ever

Jim Brown- the most dominant player in NFL history

Walter Payton- Never die easy

Tom Brady- the greatest winner in NFL history

Peyton Manning- The Sheriff

Brett Favre- The Gunslinger

Joe Green- Mean"
35024,">Jerry Rice- The greatest player ever

FTFY"
35025,I am so confused what Patriots fan would say this
35026,"A lot of Pats fans feel the same way from my experience. Jerry Rice has countless records that stand to this day, which he accomplished in an era where they should have been impossible."
35027,"Brady has the rings, but the stats are equal with the best of his own generation. Rice is beating guys 30 years later and he was in a much run heavier league. Insane."
35028,"The fact that this is downvoted really goes to show how little of this sub watched Jerry Rice... like you can disagree, sure, but to think that Jerry Rice being the overall GOAT is outlandish enough that it needs to be downvoted? Y’all are wack...

Edit: was at -3(would’ve been -4 if not for my upvote) when I commented this

Edit 2: seriously look at these fucking [highlights](https://m.youtube.com/watch?v=qOh_moZ2N0A)"
35029,"He really is the GOAT. Just look at how much better his stats are than the next closest guy to him, untouchable. Not quite Gretzky level dominance but he's right up there."
35030,"Not just that, but in an era when passing stats weren't gaudy like they are today, and he's STILL not really within reach of anyone playing at a much more pass-heavy time. The guy who'd have probably been most likely to catch him just spazzed himself out of the league."
35031,"I agree, he really was *that* good, it’s not even exaggeration... he’s the all around football GOAT imo... but then again, half of this sub probably remembers Peyton mostly as a Bronco, so it’s not like they really saw Rice in action"
35032,"The first time I ever even heard the term GOAT in reference to the greatest of all time was around 2011-12 and was about Jerry Rice. Seems like even over just the past decade, his legacy has become underrated."
35033,"Plus he has way more recieving yards than Brady, not even close really"
35034,"To be honest, there is an argument for Rice being more dominant than Gretzky. 

Gretzky was a monster, but his extremely high numbers are partly a product of playing in the 1980s when NHL scoring was at an all-time high. If you adjust for era Gretzky is still number one in points, but a couple players have more era adjusted goals. 

You can argue that Lemieux had just as much, if not more, pure talent (and dealt with serious injuries and a lesser supporting cast). You can argue Gordie Howe was the more complete player. You can argue Bobby Orr was more peerless as a defenseman than Gretzky was as a center. 

I really don't think any receiver is in the stratosphere of Rice with the possible exception of Don Hutson (and that's such a different era it's kind of impossible to compare)."
35035,"If you take away all of Gretzky's goals he is still the all time points leader. I don't care what era that's in, you can't touch that. He's that far above everyone that played in the same era as him too."
35036,"Well, if Lemieux didn't have the serious injury problems and the supporting casts Gretzky had in his prime he could have challenged these records. 

There is also more to the game than sheer offensive production. Howe scored more goals era adjusted and was a significantly more well rounded player. Orr is the only defenseman to ever lead the league in scoring (and he almost certainly would have done it more if not for injury problems). 

I think Gretzky's the greatest. But I at least think you can think otherwise and make a reasonable argument for it. 

Is there really a reasonable argument for any wide receiver being better than Rice?"
35037,Just look at his receiving yards record. The difference between him and Fitzgerald (1st and 2nd all time) is greater than Fitzgerald and Keyshawn Johnson (2nd and 41st all time).
35038,damn that's kind of cartoonish crazy lol
35039,Jerry Rice was not human.
35040,"I wish i could really remember Jerry Rice playing. I can only remember him playing for the Raiders unfortunately since i was pretty young still. 

Being a Cards fan and obviously a Larry fan i wish i could remember to judge both of their careers against each other since i want Fitz to be the GOAT WR. But obviously that title HAS to go to Rice."
35041,"It’s not outlandish but there’s so many guys you could make arguments for. Rice has stats, but you have guys like Jim Brown, Deion Sanders, Lawrence Taylor, even the QB’s. This sub likes to throw around this idea that it’s clearly Rice, and I think that’s very reductive. Between a LB, WR, QB, CB and an RB the most dependent position is easily WR.

Edit: lol I like how people got upset about this like it's a ridiculous take to say Jim Brown has a case over Rice."
35042,"I respectfully disagree that there are many you could make a reasonable argument for.  I think there are a small handful you could, but I think it's single digits for sure."
35043,"it's the opposite, this sub mentions Rice a trillion times in the offseason"
35044,Pretty much
35045,Two packers QB I like you.
35046,For some reason I will always picture Joe Green as Moe Green from the Godfather.
35047,"Namath over Montana...crazy talk.

Joe Montana - the perfect winner"
35048,"That's a pretty good list. There are only 10 spots but there are others that could fit in. Deion Sanders, Dan Marino, Dick Butkus, John Madden (the game is named after him for for God sake) mean Joe Greene just mentioning a few."
35049,Where the fuck is Joe Montana too
35050,"This is a good list, but I'd swap Favre with Unitas."
35051,"Joe Namath also: *""I just wanna kiss yoouuuu""*"
35052,"No love for Concrete Charile, the last of the 2 way players?


Or the Minster of Defense?"
35053,"i would swap Starr with OJ honestly

OJ Simpson is probably the most known football icon in history just because of the court shit"
35054,Too many QBs. I’d add Deion Sanders
35055,No Broadway Joe?  He is as iconic as they come...
35056,Jk Scott x10
35057,"Nathanial ""Natty"" Peterman"
35058,What does iconic mean for football? English not my first language.
35059,"Very memorable & honored, which is perfect for Peterman."
35060,Is there a light version of him?
35061,Can Baker be Natty Light?
35062,"Tom Brady

Peyton Manning

Joe Montana

Brett Favre

Barry Sanders

Reggie White

Emmitt Smith

Lawrence Taylor

Jerry Rice

Walter Payton"
35063,No joe Greene? He dominated an entire decade and had one of most iconic commercials ever
