idx,text
22599,And that's a famous person's story about MJ... normal people are probably treated far worse.  I know that /r/nba has their fair share of stories regarding MJ and how much of a self centered asshole he is.
22600,"I have a friend who worked at a golf course he played at from time to time.  After the round he would apparently head into the clubhouse restaurant/bar with a huge posse, order upwards of $1,000 in food and drinks, be waited on hand and foot because he's Michael fucking Jordan, and then not tip whatsoever.  Literally *zero* tip."
22602,"I used to like Chuck, but after hearing this story I love Charles Barkley."
22603,"I bartend in Philadelphia and Charles comes to our bar in the summer about once a month. I finally got to be working when he came in. He was so nice, bought everyone in the bar multiple rounds of shots, picked up tabs, and was just partying with everyone. Tipped us very generously, then when we re-opened our kitchen to make his lady friend a snack (fries and mac n' cheese), he gave our cook $100. He was joking around with us, and remembered my name when he came back in after filming his show with all the other sportscasters. YAY CHARLES!"
22604,Glad someone said this. Chuck has had some not-so-great moments on the court. But he seems like he's got a great heart.
22605,"Practically everything I've ever heard about Chuck off the court has been complimentary.  I love the guy.

As a Jazz fan, it helps that he shows so much respect to Jerry Sloan and the Jazz organization.  So I might be a bit biased."
22606,"I have a similar story, my brother caddied for Jordan when he was in high school. Now I live in Chicago and this was during the mid to late 90's, a time when MJ could have pretty much killed someone during a live televised press conference and gotten away with it. Jordan never said a word to my brother, other than a direct order, and when he was finished he told my brother that his tip was caddying for him."
22607,Makes me feel less sympathetic that he lost 1/2 his money to his wife
22608,"A friend of mine used to work at a bar. He said that one night Jordan and his huge entourage show up drunk as hell and fairly obnoxious. They're out on the patio drinking more and smoking cigars. Long story short, Michael Jordan caught this lady's hair on fire with his giant cigar. So, there's that..."
22609,"I saw Laurence Fishburne outside of a grocery store. I'm a fan so I speak up and politely say ""Mr. Fishburne."" He SPINS around while kinda grunt/yelling ""What?!?"" I instantly regretted my decision to speak but I had to say something so follow through and  meekly say ""I really love your work, sir.""

He smiles the biggest smile and says ""I really appreciate that, thanks for watching"" and was absolutely as nice as could be. 

But in those seconds between responses, the thought crossed my mind that I was about to catch an Ike vs Tina Turner style beating."
22610,You should have called him Lawrence. Calling him Mr. Fishburne makes you sound like an agent.
22611,It's been a while.... *Mister Fishburne.*
22613,I just saw an article today saying producers/casting agents recognize her talent but her drama is not worth having her on set so they go other directions.
22614,"Too true, notice how she's never been in another Judd Apatow since Knocked Up, despite the fact that he usually uses a lot of the same people."
22615,This is because she came out against the film after they did it.
22616,Which is evidence of some of her issues I referenced earlier. She tends to bite the hands that feed her.
22617,She's got a failing career so I don't blame her.
22618,Career? OH! You mean that time she was in 'Knocked Up'?
22619,She's also on a new Nyquil commercial!
22620,"Her career is failing *because* she is a tantrum queen, so yeah - blame her (and her mom)

http://www.hollywoodreporter.com/news/katherine-heigl-knocked-up-nyquil-625405"
22621,"For British people, my friend's dad is a producer on QI, and he says Alan Davies can be a real dick to anyone he doesn't think is important enough.  David Mitchell is lovely though."
22622,You've put the biggest smile on my face. I couldn't handle it is David Mitchell wasn't lovely.
22623,Even as a male I think he's lovely and cute. I wish we could have tea and discuss things quietly in a small neat kitchen.
22624,"Well, he did bite someone's ear."
22625,"I expected Mitchell to be pretty shy and awkward, so that's great."
22626,He will always be mark corrigan to me
22627,"Buzz Aldrin, the second man on the moon. I met him last year and he has completely lost touch with the public. He seems to think that he is the greatest thing since sliced bread. It made me really sad because I had looked up to him for my entire childhood."
22628,"Does he want everyone to neil before him?

Edit: damn ask me how pumped I am you guys like my pun!"
22629,"Working at a studio in Ireland Tom Cruise came by to promote his latest movie and was the direct opposite of what I expected. I honestly expected a bat shit crazy Scientologist asshole who thought he was above us all to enter the room. He came in, walked past the host of the show and shook hands with every single one of the crew in the room first. Asked us all how we were doing and I actually think he genuinely cared about the answers. He asked us questions about Dublin, laughed with us and then when he was finished introduced himself by name to the host and pre recorded his interview. After the interview he did the whole thing again in reverse. 

Been in this business over ten years and he was the single most genuine person I have met.

Macy Grey was a complete asshole by the way and for some reason I thought she'd be lovely."
22630,"I knew that Cruise was a good guy when some spectator threw water at him at a red carpet event a few years ago. Cruise turned around and said something along the lines of ""Why did you throw water on me?! What did I do to you?! You're a jerk! Do you get that?! How would you feel if someone just threw water on you?! You, sir, are a jerk!""

Something about the way he was calling out an actual jerk made me realize that he was not part of that group."
22631,"*Yes.*  I remember when i first saw that video (I think it was on Digg actually) everyone was commenting about how much of a douche Tom Cruise was being.

In reality he was incredibly cool headed.  None of the ""do you know who I am bullshit.""  Just was pissed at the guy's being a dickhead.  Not only that, you can tell the guy who did the prank *immediately* felt like a child."
22632,"My mom used to work as security for the WB in Burbank, California, and she met tons of celebrities during her time there. I think one of her favorites was Lena Headey (300, Terminator TV series, Cersei of GoT). She is absolutely **gorgeous** without makeup, and is a total sweetheart. I believe my mom said they were both in the bathroom washing their hands, and had a nice chat, then met again a few weeks later, and Lena recognized her and came over to say hello.

I believe George Clooney was a bit of a jerk she said, but he left all of his supplies in his office trailer when he was done shooting something with WB, so I am now the proud owner of George Clooney's printer paper.

She once gave a man his parking designation, noting ""You look a lot like Jack Black"". He responded with ""Yeah, I get that a lot"" and handed her his parking pass; Jack motherfuckin Black. Total nice guy.

I'm trying to remember the ones she said were assholes, but I think they were mostly no-names anyway, trying to pull the ""do you know who I am?"" card when they just showed up to the lot without proper authorization. I'll try to find out and edit if this gets any interest this late in the thread.

Edit: Hehe was actually not expecting this amount of interest! It's almost 4am here, so I will update tomorrow for those who asked :)

**Edit 2:** Okay so I talked to my mom today. It's mostly celebs that are nice with a few douches. Lauren Graham from Gilmore Girls is super nice, but Alexis Bledel is a bitch; very demanding on-set and whiny. Clint Eastwood is friggin awesome, and my mom got to drive the car from Gran Torino to a secure parking structure (I'll see if I can find pics). Charlie Sheen and Jon Cryer are great guys, very down-to-earth, but the kid is a little shit, even before finding Jesus and condemning the show that gave him notoriety and fame in the first place. 

Michael Rappaport (War at Home and Chepelle's Show) is an asshole, but the kids from the War at Home show are really nice and humble. The daughter from the show was actually feeling like she wasn't very attractive, and my mom cheered her up and gave her some confidence. She actually tried getting me a date with her, but I guess she already had a boyfriend :P The son (also from Malcolm in the Middle) was a big dork but really chill, too.

A client of hers when she had a house-cleaning business is a [costume designer](http://www.imdb.com/name/nm0277472/) for a ton of movies , and also the uncle of Brad Pitt. Mr. Pitt is of course a good guy, although apparently doesn't talk to that side of the family much. As for our friend's work, he was fitting a costume for Roseanne (yes, that one) and he asked what she thought of it. Her answer: ""I hate it, it makes me looks fat"". It took all of his willpower to not state the obvious.

I hope none of this sounds like name-dropping, even though it clearly is, but I am simply repeating what I heard from my mom. Hope you guys enjoy."
22633,"Deadmau5 was a former bullied kid who got rich and famous, and his revenge on the world was to become a bully. Dude is a wiener."
22634,"yea, joel is a dick.

I had a friend who scored some backstage passes to a festival he was playing at. This was sometime right after he DJ'd at the VMAs (i wanna say that was 2011 but i don't really remember) so they hype for him was pretty high. We were just hanging around backstage while he did his set, he came off stage, ditched his mouse head, and started digging around in one of the coolers for something to drink. Not realizing who it was i asked ""Hey buddy, mind throwing me a drink?"" and he turns around, askes ""Don't you know who i am? i don't get paid to be your beverage boy, so get it yourself"" and he storms off.

now granted i didn't recognize him at first because this was a music festival and seeing some scrawny guy back stage covered in shitty meme-atic and video game tattoos was like being a piece of hay in a haystack. and you could kind of excuse it as coming off of an hour long set in a hot mouse head. but apparently he used to (or still does, i'm not sure) stream his time in his studio and its pretty clear that he's just an all around cunt. He's like the worst parts of /b/ personified, which makes sense since he's claimed he posts there"
22635,"Met JLo and Jane Fonda while I worked at a private FBO (an operation at a major airport for rich people to fly out of) and I said hello to JLo. Nope, not even a response. Jane Fonda on the other hand, said hi back, and asked me how my day was. This was when they were filming Monster in Law. She was a nice lady."
22636,Why am i not surprised about JLo
22637,"Shawn White.  When I was a snowboarding instructor, my boss used to work at The Burton Academy.  It was common for famous riders to take the lift and talk to other visitors, Shawn would have the whole park closed and taken up by snowmobile.

Worst story I heard was when his manager booked a whole day for him to snowboard with kids from the make-a-wish foundation.  He rode with a couple in the morning and then ditched to go ride the half pipe.  He can't apologize to those kids because they're dead"
22638,man i cannot stand that kid.
22639,"The problem with Shawn is that he is exactly the opposite of what snowboarding is about. He goes for medals, tries to be the best ever, and only does pipe and spins. Considering this is such a small part of snowboarding and the culture, he's pretty much been ostracized from the community.

Honestly, I think the guy just needs a friend."
22641,...go on
22644,What pisses me off most about that show is the idea that $40 a day for food for *one* person is a minuscule amount.
22645,"Yeah, my friends sister was actually offered a full-time position on her staff after interning on her show, but she turned it down because Rachel Ray was such a bitch."
22646,"Also, not on thread, but the writer of the Redwall series, Brian Jacques, was in Atlanta doing a promo on his book one day, so some friends and I skipped school and drove there to meet him. One of my friends, Chuck, had introduced us to the books and we had read them all. Chuck had all of his books, even the non-redwall book, and was the reason we were going.

When we got there, the bookstore had a policy that Mr. Jacques would only sign his name on books, no personalized messages, and would only sign books that had been bought there. My friend Chuck was devastated.

I bought my books and waited in line to get them signed, and when I got there I told Mr. Jacques about Chuck and he signed a leaflet to him with a personalized address.

After the event was over, Mr. Jacques walked right by us and saw me, and asked me which friend was Chuck. I pointed and he stopped, got out his pen, personally addressed every book to Chuck that he had brought with him, (This was about 9 books or so) even writing ""Brian Jacques"" in the ""This book comes from the library of"" sticker in the non-RedWall book he had brought.

Totally awesome guy and the world is worse off without him. He was the Steve Irwin of teen-fiction until he passed. God be with you, sir."
22647,"Thank god... I started reading this and was horrified that he might have been a douche...


REDWAAAAAAAALL!"
22648,That was exactly my thought as well. So glad that he was a genuine person. Logalogalogalogaloga!
22650,"Are you white?

Fun fact: My roommates were good friends with Denzel's son. When all the friends came over, Denzel would smile and be extremely cordial to the black friends. He wouldn't even smile or shake hands with the white friends; just stared at them almost like in Training Day."
22651,"Scottie ""no tippin"" Pippen 

Cheap, cheap man."
22652,I guess  riding shotgun with Air Jordan rubs off.
22653,"Anytime I see one of these celebrity being a dick threads I have to come in and say that Mike Rowe is the coolest dude on the planet.

I hung out with him and his cameraman and drank beer with him for like an hour with my buddy while traveling for work."
22654,"Thank god, I don't think I could live if he was a terrible guy."
22655,"Kinda makes sense.  His job description is ""Get blue-collar down-to-earth people to open up on camera about their job and how it makes them feel sometimes"" and you don't get people to open up by being a dick.  His job is literally to be a fantastic guy."
22656,"Oddly cool:  Bill Gates.

He stood in line like everyone else, and made the poor counter girl do a double take when she grabbed his card.  Even tipped well."
22657,Imagine holding that card...^^^my^^^precious
22658,"I went to a BEYONCE concert and was very excited. It was a concert in Tokyo, Japan. Basically, she got upset that no one was standing up and cheering, and after like 3 songs, she wouldn't come back on stage. For like 30 minutes, the crowd just sat there and the announcer kept coming out telling us we should start chanting her name. At that point, a lot of people started leaving. Finally, after 45 minutes, she came back out in the same outfit as the first song (she had previously been changing her outfits for each song), and said ""let's try this again,"" and did the first three songs OVER AGAIN that she had already sung and then ended the concert. Afterwards, we were supposed to get to meet her but we were told she wasn't having a good night so it wasn't going to happen."
22659,"[John de Lancie](http://en.wikipedia.org/wiki/John_de_Lancie) does not like it when you exclaim, ""Q! STOP THIS!"" to him. Otherwise he's cool."
22660,"I took my oldest daughter to say hello to him at Salt Lake Comic Con last weekend. I went up to say hello dressed like my Star Trek Online character and while he was pleasant enough, he seemed like he could care less I was there and said hello. I introduced my daughter to him as ""This little lady loves My Little Pony"" and his eyes lit up and he engaged her into a conversation about Discord; he seemed very pleased that she knew who he was."
22661,"Jennifer Lopez.  

I met that cunt at Ramstein AB, Germany during a USO tour.  Every fiber in her being is to be a cunt to everyone around her.  I interacted with her a few times over two days for a ""Salute the Patriots"" music contest/tour, and literally couldn't stand to be in the same building with her by the end of it.

She also made a friend of mine stay in tears most of the time J-Lo was there.  This friend (in base services) worked really, *really* hard to ensure the USO visit was a success (and it was), and she had to spend so much time meeting that cunt's ridiculous needs on her rider.

I was so put off by my experience with her, that I've asked my wife to never play one of her movies or her music in the house.  EVER.

TL;DR - J-Lo rustled my jimmies."
22662,"Zoey Dechanel is a mean person.

Source: my friends and I all have worked as extras on the new girl.

Terrible."
22663,Is she just rude? Do you have any story in particular?
22664,"I'm not sure if this makes Joey Fatone a dick or not, but it's still a funny story. My friend and I were at a restaurant in Las Vegas and our server told us that Joey Fatone was in a booth around the corner. We were too shy to say anything so we just walked by him and his two friends. Somewhere between the booth and the elevator my friend gets up enough courage to yell ""I STILL LISTEN TO THE BACKSTREET BOYS!"" He yells ""THATS NICE!"" 

He was in 'N Sync...Not the Backstreet Boys."
22665,"Quentin Tarantino. Almost universally respected, amongst both casual filmgoers and critics alike. Acts like an insufferable 5 year old brat."
22667,"Eh, he does come off as a dick, in my opinion. No surprise there."
22668,"Here's a back asswards answer.

My dad works as a flight attendant for united and he had Bam Margera on his flight. He said he was one of the most polite, kind, and patient people he's eve had on a flight. Apparently he even denied any alcohol that was offered on the flight."
22669,Prince. Prince is a fucking tool
22670,"On WTF with Marc Maron, Weird Al tells the story about attending the Grammies. Said he was seated next to Prince. Weird Al says that he received a letter from Prince's people in the days running up to the event , saying that Weird Al was not to make eye contact or interact with Prince during the event. So, yeah, there's that..."
22671,If I was Al I would have stared at his face awkwardly the whole time.
22672,He smashed Kirk Douglass' vintage 1961 Epiphone Crestwood guitar after borrowing it and then refused to sign it. Douchebag levels over 9000
22673,"Off threadish but w/e

My buddy's cousins live in Swan Valley, Idaho. They were at a little gas station, picking up some odds and ends, when somebody drives up on a motorbike, and walks into the store with his black helmet on and visor down. He grabs a candy bar, a few other little things, and goes to pay. The cashier starts ringing him up, and in an effort to make small talk, and figure out who the guy was, says in a cordial tone,
""Who are we today? Darth Vader?""

""Nope,"" the man said, flipping his visor up. ""Han Solo,"" said Harrison Ford."
22674,My family is semi-close to the Manning's and we were invited for Thanksgiving dinner one time and when we got to their place Eli and Peyton were sitting in front of the TV arguing like kids just like in the commercials...probably one of the funniest things ive seen
22675,TLDR: Fuck Michael Jordan
22676,"Owen Wilson is only nice to attractive females.

~~Kurt Russell~~ Patrick Swayze was just a general entitled ass.

\*Edit: Whoops"
22677,I worked with Luke Wilson though and can say he was pretty cool. And I'm neither attractive nor female.
22678,Luke is hotter
22679,"Don't you ever speak ill of Kurt Russell again.  
Ever.  
**Ever.**"
22680,Oh shit... it wasn't Kurt Russell... edited.
22681,You're goddamn right it wasn't Kurt Russell.
22682,"Easy, Kurt. It was a mistake, we all love you."
22683,That's because Kurt Russell is a fucking boss. Any man that can escape from LA in pants that tight is a beast.
22684,"Lets try and cheer this thread up. Keanu Reeves is an awesome dude. Gave up most of his salary to make the cgi people of the Matrix millionaires, pays for catering on his sets, and took a pay cut so they could afford Al Pacino in that one movie.

And a semi personal story. He rented a car, he doesnt own one, to pick up my friend's uncle from the airport."
22685,"A friend of mine has a story about him. She used to live in Santa Monica and had gone to the store with her kids in her eco-friendly minivan. As she is walking out to her car she sees some dude scoping out her car. As she gets closer she realizes who it is. He asks her what kind of gas mileage she got and her response was ""do you know who you are?!"". He laughed and responded with ""yes, I do."" He wanted to buy the same vehicle for a relative."
22686,Apparently he lives in a regular sized apartment and is just a really normal dude when he's not shooting movies.
22687,"I have spent a lot of time with Mel Gibson.  Despite the reputation, he is the most gracious host ever.  Been to his house informally for lunch twice, and HE made the sandwiches...kept asking if everything was OK..got up to get drinks...cleared the table and did the dishes (not that there were a lot)

He just acted like WE were the celebrities.  Crazy.  And was always just very thoughtful.  Hated the superficiality of Hollywood...said he'd never go for that plastic surgery stuff...and would just age normally..etc.

I know the stories, but from my personal experiences, he is a complete gentleman"
22688,A buddy of mine had a very similar Mel story from a film set. Always checking on everyone else.
22689,"Mel would come into my friends work all the time and just sit next to the guy to shoot the shit. My buddy is an chef at a country club and because it was so slow he would just sit at the computer for hours on end and do admin type stuff. Mel would walk into his office, flop on a chair and chill out for an hour or two. Then leave. My friend would get annoyed because he had work to finish before leaving. It became a bit of an exaggerated joke between us about how annoying Mel is."
22690,"Joe Rogan is the antithesis of this thread. after a show he sticks around for hours signing everything and taking pictures with everyone. EVERYONE. also, it's not uncommon for him to tip someone $1,000."
22691,"I feel ripped off. He did a show at the Irvine Improv, and I yelled out ""good show Joe! "" and he just replied ""thanks dude!"""
22692,What a dick!
22693,"Jamie Lee Curtis...she can turn the charm off and on like a light switch to the point that it's scary. If you are part of the ""peasantry"" be prepared to be completely ignored. I was in a 10' by 10' room with only her and I and I smiled and wished her good morning. I got no response, it was as if wasn't even there. Enter in someone of importance and suddenly she was all sweetness and light, but then this was back pre-Activia days so maybe she was constipated.

In a similar situation Tom Hanks, NICEST GUY EVER. Offered to get him some water or coffee and he'd have none of it. He said it wasn't my job to wait on him if I would just be nice enough to point him in the direction he'd help himself. And it wasn't like ""famous actor being nice to fan"", he just seemed like a genuinely nice, polite man."
22695,"I personally saw Bette Midler berate some poor unpaid volunteer at the Sundance Film Festival to tears because this poor girl didn't have enough tickets for Bette's entourage to the hottest movie at the Festival (how many tickets she got was not this girls decision).

She pulled the ""Do you know who I am"" card.

She's a cunt.


EDIT:   WOW.   So much karma for trashing Bette Midler.   [It's a dream come true!](http://mrwgifs.com/wp-content/uploads/2013/06/Spongebob-Rainbow-Of-Imagination-Reaction-Gif.gif)

Thanks everyone.   My only hope is the girl who dealt with her is a redditor and reads this and claims the karma as her own."
22696,"Would the correct response have been ""one of the least important celebrities at this film festival""?"
22697,"""Do you know who I am?""

""_No._"""
22698,"""Some old bitch wasting my time?"""
22699,"King Richard the Lion Heart. He despised Britain, loved killing people and was a shit soldier who pretty much bankrupted his country by getting caught on his way home from the brutal crusades and having to be ransomed out."
22700,"banned from /r/normandy /r/aquitaine, /r/gascony, /r/anjou, /r/nantes, and /r/brittany."
22701,You are now a moderator at /r/HolyRomanEmpire
22702,"And here I was, hoping this was an actual subreddit."
22703,"If I see this guy, I'm totally not gonna ask for his autograph."
22704,"Britain: ""We love you, King Richard!""

Richard: ""That's one of the islands I own, isn't it? See if they can cough up some more taxes and soldiers."""
22705,"Let's not forget the reason he hated Britain, (and why Britain actually hated him) HE WAS FRENCH"
22706,"Not dicks: Penn and Teller, Teller was ULTRA nice while signing autographs and taking pictures after the show. Penn didn't seem like he was in a good mood that night but dutifully took pictures with everyone. Penn is also SCARY huge. I wouldn't want to be on his bad side. 

Protip: Penn and Teller sign autographs and take pictures with everyone after the show."
22707,"I was an extra in one of the early Harry Potter films. One of my friends was standing near Emma Watson in a scene, and tried to start a conversation with her during one of the long-ass breaks between shooting (there were a lot of special effects to reset). She looked him up and down like he was a piece of shit. That was many years ago now, though, and I guess it's fairly likely she was just being a young teenage girl about it.

Rupert Grint was a legend though. I met him at another film I was in, and he remembered me like a year later. Only had a brief chat but he was clearly a genuinely nice guy."
22708,"Rupert is king. His first big purchase was an old ice cream truck, which he drives around fully stocked and hands out free ice cream (he's not allowed to sell it without a vending licence). He brought it to the last day of filming on Harry Potter while the crew was having a barbecue."
22709,"Pink came on holiday in 2010 to island I was living/working on. She came into the pub and just hung out like a regular person. People asked for autographs, she chatted with people as if they were new friends, played pool for about three hours. Three of my friends jokingly asked is she'd like to come to their party they were having in their room that night (thinking she would decline). She said she would love to hang out with some of the staff that work on the island. She turned up and stayed for about an hour. 

I don't personally like her music, but when she comes in and acts like a regular person with no stupid demands and even goes to a random party, she is alright by me."
22710,"Jeremy Piven is a complete Asshat, I was at the 2010 concours d elegance in pebble beach with my soon to be fiance (I proposed later that day) anyway myself and my lady were admiring the Porsche 918 spyder in front of the lodge and Jeremy Piven and his bimbo came up and were looking at it also and I smiled and said ""hello Jeremy, how are you?"" And he huffed and puffed and mean mugged me and turned and walked away.


On the opposite end of the spectrum at another car show when I was about 16 (15 years ago) at the cow palace in San Francisco I saw James Hetfield (lead singer of Metallica) from afar and he was just by himself looking at the cars and my brother recognized him first and told me. I then got really excited and went up to him and he was super friendly and we talked for about 10 mins and I was telling him how I was learning guitar and was learning some Metallica intros and so on and he was just the coolest guy and was showing (what appeared to be) genuine interest. After talking he asked if he could sign anything for me so I gave home a program to sign. 

Later on about a hour later I saw him again from afar and he yelled out ""hey whitechevelle!"" 

Left a huge impression on me after all these years"
22712,I read somewhere that he divorced his wife after she gave him a kidney. Thats just cold..
22713,Would you want a wife with only 1 kidney?
22714,"He only has one joke: Mexican people and white people are different. Just thousands and thousands of variations on that theme. Lots of shitty black comedians fall into the same trap. And shitty middle-aged white comedians usually rely on one joke as well, which usually amounts to basically ""I don't have sex as often since I've been married."" See: Everybody Loves Raymond, King of Queens, and basically any comedy featuring an attractive wife and a fumbling buffoon of a husband."
22715,it would probably happen less if he had talent.
22716,"Jerry Seinfeld: I played basketball in college and on road games our team actually was in the same hotel as him a few times. First time we were all sitting in the lobby waiting for the SID to finish checking us in and he came walking through. Being college kids were surprised and all just kind of staring, he looked right at us and I kid you not said ""Unbelievable, I'm in a hotel with a bunch of f*cking dumbass jocks"" then just kept walking shaking his head. Ok, well maybe we thought he was just trying some insult humor on us. Then 3 weeks later we were in the lobby of a hotel (same hotel chain different state) waiting for our bus to arrive to take us to shoot around that morning. He comes walking off the elevator with a plate in his hand. He marches straight to the front desk slams the plate down and begins to give the poor lady the riot act about how his eggs are not ""over easy"" and he rants on and on for at least 2-3 minutes. He looks over at us and not sure if he remembered us or not but when looked at us he stopped and goes ""you gotta be f*cking kidding me"". We all just lost it while he walked off and immediately got on his phone and started yelling at someone to stop booking him at the ""F*cking Hyatt"" but he is definitely an asshole in my book. *Sorry for any grammar or format issues, typing on my phone.*"
22717,"*PLATE SLAM*

""WHAAAAAT IS THE DEAL WITH THESE EGGS?!"""
22718,These eggs are making me thirsty!
22719,William Shatner told me to fuck off when I accosted him on the street once. Loved it.
22720,"Opposite!

I met Tre Cool of Green Day in 97. They're touring after the release of Nimrod, and I'm at the front door waiting with a couple friends to get in for the show. I'm, what, 14 15 at the time. He steps out the front door and walks past me, and my mind reels. He walks past the line (huge at this point, around the block) and into the music shop next to Bogarts. We follow him in, he's placing an order or something. When he finishes up he turns around and sees us. We're obviously there for the show, all decked out in our green day swag. He grins and starts the conversation (good, because we were nervous kids unsure how he'd react). It was awesome. He asked if we were there for the show, asked what our favorite songs were, if we played any instruments - I told him Mike was the reason I picked up Bass. He signed my shirt, some CDs, stuff. Then he said to hold on while he got his order, and escorted us back to the front of the line. Told the bouncer we had been there and he was the show tonight and wanted us back at the front. I was surprised he noticed that part. Dude was amazing - my favorite band then, and now, and the whole time in between, and they're all incredible. I've met them all now and they're really very nice and personable. BillieJoe is very sarcastic, Mike is really down to earth, kinda quiet, Tre is loud and happy. It's cool. I haven't met Jason White, that would be cool, but yea. Green Day are awesome guys."
22721,"I heard this story about Tom Hanks driving past a wedding while filming in South Carolina. He stops his car, jumps out and runs over and greets the entire wedding party and bride and groom. Funny thing is the photographer was in such shock he forgot take any pictures. So Tom Hanks turns around, gets in his car, jumps back out and does it all over again."
22722,"Regis.

I think I was like 7 or 8 and my family was on vacation at Disney world. My mom bought me an autograph book at one of the souvenir shops so I could get all the characters to sign it. I was having the best time collecting all these signatures and thought it was SO cool.

Anyway, our hotel room was located on a concierge floor which is basically a floor with a 24 hr buffet on it (you pay extra for the perk and have to use your key in the elevator to get to the floor. My dad was a big corp exec at the time, which allowed us some expensive shit, don't judge.)

So we were up there one morning having our breakfast as usual and I spot Regis across the room drinking coffee and reading the paper. Apparently ""Live"" was doing shows there all week. I start to freak out like the little school girl I was and asked my mom if I could go over and get his autograph. She of course said yes.

So I pretty much skip over there, my heart ready to explode with excitement. I get to his table, hold out my book and say, ""Excuse me Mr. Regis, can I have your autograph?""

He peered over his paper at me and said words that crushed my tiny little spirit and hardened me for life - ""Scram kid. I'm having my coffee.""

Fuck Reg."
22723,Regis ALWAYS makes these lists. ALWAYS.
22724,"Worked on a movie set. Zooey Deschanel is very aware that she's a big deal. Not downright mean, but remarkably entitled. 

Also, Alan Rickman...is totally a nice guy. Brought us tech guys donuts one day. 

EDIT: Since people are really curious about Rickman, I worked with him on Love Actually and later in a movie called The Promise, and the donuts he brought were a mix of glazed, chocolate twist, and rainbow sprinkle because he knew a guy's little girl was coming to work that day. Yes, Alan Rickman brought donuts for a little girl he didn't even know. Also, we got him to say that if we didn't admit who ate the last donut, ""we would all be found...e...qually guilty.""

 Definitely in my top 5 life moments. 

EDIT 2: Have received boobs, they are great and I need more to satiate my endless hunger"
22725,"You got donuts from Alan Rickman? Seriously? Man, I DO envy you!!"
22726,Thank God you said Alan Rickman is a nice guy.  I would be heart broken.
22728,"I got to admit, when I heard Rickman is a nice guy I smiled....dude's awesome."
22729,"I too met Alan Rickman! He was super nice when we approached! We said the usual ""We love your work"" etc. We asked if a photo would be okay but he said no because they were actually doing some pre-production work at the time, but he did offer to sign something! 
This was at Blenheim palace earlier this year."
22730,"Honestly, I think there should be no stigma against a celebrity just saying ""No, please"" to a photo request."
22731,"Keanu Reeves. Was at coffee shop and no place to sit, a man said please join me here. I sat and realized it was him and talked about comic books for about 30 min. Normal as can be."
22733,"""You can sit here if ya want.""

-Keanu Reeves"
22734,"When I was a kid, like 2 or 3, I often saw an old man at a grocery store with a small, white dog.  The man came up to me one day and handed me a basket.  He said I could walk the dog while filling up the basket with candy (which he then later paid for).  This became the routine whenever I saw that man at the grocery store.  Walk dog, get candy.

That man was Gene Wilder.  I got candy from Willy Wonka himself."
22735,"I love Gene Wilder, absolutely one of my favorite actors and I wish he were still acting. It's so sad about Gilda :("
22736,"A few years back, my grandmother (then about 75 years old) and Adam Sandler's father had back-to-back chemo appointments in Boston. Every week she would see Adam Sandler, in sunglasses, come with his father to chemo. Her cancer was stage III at this point and she was under a great deal of stress, and honest to God, Adam Sandler used to rub her back and ease her nerves before going in. Unfortunately his Dad died that year, but my grandmother made a full recovery. Never really liked Adam Sandler's stuff that much, but the way he treated my sick, elderly grandmother was incredible.

I hope this doesn't get buried, I tell this story all the time and nobody believes me. But it really, really happened. What a great guy."
22737,"Dave Chappelle has a history of running very long comedy shows. My buddy and I saw one of his shows a while back. It ran very very late, until almost 4am (on a weekday), by the end, almost the entire crowd had trickled out- to get up early for work the next day and what not. Only about a dozen of us remained at the show by this point. Dave invited us to all play basketball with him the next afternoon. He had rented out an entire gym for an hour. Of course my buddy and I took him up on the offer. We played pick up hoops with Dave Chappelle for over an hour. After everyone finished playing, a handful of us stuck around and shot the shit with Dave. He bought us all fruit smoothies and gave us free tickets to his show the next night. SUPER nice guy, just like he is on TV. Couldn't have been any cooler"
22738,"I remember reading a story about him from someone who lived in the same town as he did in Ohio. The author was a bank teller at a small bank and in walks Dave Chappelle with his son. They withdrew 5,000 dollars and asked for it in one of those unmarked money bags. They then proceeded to full on sprint out of the bank and back to his car. Seems like a fun dude."
22739,"Paul Rudd.   I was at a Decemberists concert, and in between opening acts, I headed to the women's bathrooms.  Paul Rudd was standing outside of the bathroom, obviously waiting for someone.  Do you ever have one of those moments where your mouth just says words without the permission of your brain?  Yeah.  As I passed by Paul Rudd, I did finger guns at him and said, ""Hanging out in front of the women's bathroom?  That's a good way to pick up women."" and kept walking.  I could hear him laughing as I entered the bathroom.  I was torn between being pleased that I made him laugh and being mortified that I was such a dork.  When I left the bathroom, he saw me and started laughing again, so I went over to him and said I had no idea why I said that.  So we had a little laugh together, and had a nice little chat.  He was a really nice guy, not even as a celebrity, just as a cool dude.  

Although thinking back on it, no woman came out of the bathroom and came over to him while he was waiting, so I still don't know why  he was hanging around outside of the bathrooms.  Maybe he WAS picking up women.  &#3232;\_&#3232;"
22740,"Well, he picked you up..."
22741,"Michael Caine. My family and I were having lunch at a restaurant and he was sitting at the table next to us... My sister's boyfriend cracks out a line that his character says in Children of Men... 

Ok, the Human Project gives this great, big dinner for all the scientists and sages in the world. They're tossing around theories about the ultimate mystery: why are all the women infertile? Why can't we make babies anymore? So, some say it's genetic experiments, gamma rays, pollution, same ol', same ol'. So, anyway, in the corner, this Englishman's sitting, he hasn't said a word, he's just tuckin' in his dinner. So, they decide to ask him, they say, ""Well, why do you think we can't make babies anymore?"" And he looks up at 'em, he's chewin' on this great big wing and he says ""I haven't the faintest idea,"" he said, ""but this stork is quite tasty isn't he?"" 

He chuckles and acknowledges our presence... when he stands up to leave my mother tells him that she just has to tell him that he is her favorite actor, that anything he makes, she loves... he walks up to her, kiss her on the had, and tells her she made his day."
22742,"Tom Hanks. 

Was at a friends wedding at the Wynn in Las Vegas and were taking pictures in the Atrium (also the VIP Entrance). He emerged from the double doors behind our group and said ""Hey! Is this a wedding? Can I be in the pictures?"" Everyone was quite pissed off until we realized it was Tom-Fucking-Hanks.

He took pictures with the whole group and was a general all around great guy.

[Wedding!](http://imgur.com/kdFVe)

EDIT: [Here's the moment we all realized it was Forrest Gump.](http://i.imgur.com/ArrTZ.jpg)"
22743,Bride finally gets her day --> Upstaged by Tom Hanks
22744,The best part? He's by far the dorkiest looking guy there and looks like he's having an AWESOME time.
22745,"i love this cause if it's a random guy that wants to be in the wedding photos, fuck him. but tom hanks in a polo shirt and yankees cap, by all means"
22746,"Tom Hanks doesn't just seem like the nicest guy. I was a nanny for a Hollywood family, met hundreds of A-listers. Most of them were self-obsessed wankers, but Tom took the time to shake my hand and made sure he learned my name. He never forgot it. Also he would always say ""There's a snake in my boot!"" for the youngest of my charges, which obviously made him laugh hysterically.

EDIT: I could do do an AMA, although out of respect for the family I wouldn't be able to reveal who I worked for. Maybe I will sometime soon. Is there a way to get my AMA on the schedule so people can see it ahead of time? Or is that reserved for actual celebs? (I'm pretty new to Reddit)."
22747,"Believe it or not, Marilyn Manson. This was 2000. My brother had cancer and got the chance to meet him. He brought my brother all sorts of memorabilia and sat and chatted to him for a few hours, playing TV games with him, playing guitar, even reading Beano comics. All in the comfort of my own home. My brother passed away 3 weeks later and was in his M.M t-shirt when he passed."
22748,I believe this; he is supposed to be incredibly nice.
22749,Watch any interview with him.  He is a calm and gentle man.
22750,and very intelligent too.
22752,I met Clint Eastwood and his wife. Both of them were so genuinely nice.
22753,"Working in a magic shop in my 20s, Muhammad Ali came in. My boss (huge Ali fan from back in the day) was visibly staggered. I guess Ali was his idol when he was younger.

Ali hung around for a couple hours, we did some tricks for him, he did some for us (pretty good, too, considering his hands trembled and he didn't talk). He was totally beyond cool with us taking some pictures (he posed my boss punching him in the chin), and wrote a ""thank you"" post card to us a week or so later...

...he signed it ""Cassius Clay, oops, I mean Muhammad Ali"""
22754,"Cool Ali story from the 1980's: My Dad has been a huge Ali fan since his early days. One time in the '84 or '85, Dad was on a plane flight with my older sister (who was a newborn). He hears someone say ""You have a beautiful baby girl"" from the aisle. Lo and behold it's Muhammad Ali. Apparently Ali asked to hold her and kissed her forehead."
22755,Don't ever wash your sister's forehead.
22756,"""For my next magic trick I will make your boss disappear"".   
*Boom. Uppercut.*"
22757,Do you have any of the pictures? They sound great.
22758,"Ryan Gosling paid for my parking on Hollywood Blvd once.  We had parked in the same parking lot.  He was leaving and we were arriving and I struck up a convo with him real quick.  

He asked where I was from and why I was there/who I was with. (Spring Break, 9 friends, 2 cars).  And he was like ""Oh you guys have 40 bucks to drop on just parking? Must be loaded"" I chuckled and was about to say something back and he just says the coolest thing to me.

""Don't worry about parking today man, I'll cover you all for the weekend.  Have a fun spring break!""

It was so cool.  He is JUST as nice in real life as you think he would be.

[Here's the Proof, I'm in the White.](http://i.imgur.com/VAoJj.jpg)"
22759,"How does one go about marrying Ryan Gosling? I have yet to hear anything but wonderful stories about him. Plus, he's hawt as faaack."
22760,"I'm male and I would also like to know how I can marry Ryan Gosling. You know, because he has a lot of money and stuff... yeah that's why..."
22761,I went on the Pirates of the Caribbean ride at Disney with Tony Hawk. He had given me his autograph earlier at a convention and we just happened to be in line together. He was really cool.
22762,I always forget that Tony Hawk is a real person and not just a character made up for those video games
22763,Don Cheadle. Gave me a tip on some salmon to buy at Whole Foods.
22764,I shook his hand once.  Softest hands I've ever felt on a man.
22766,"At Bonnaroo I met a chick that works with Jack White to some extent. She said her rolls with a posse of the 6-12 of the hottest, weirdest, creepiest, spookiest girls you could ever imagine. She also said he's really nice."
22767,Maybe they're that lady-goth rock band that did that song with Stephen Colbert.
22768,"Victor Wooten. He was signing a Flecktones CD for me after a show and I shook his hand and said ""I hope 1% of your talent rubs off on me."" He said ""Hey I want some of what you have."""
22769,"Just happy to see Victor Wooten mentionned. A semi-god for some, standing in the shadow for many."
22770,"Adam Savage of the Mythbusters.  Very nice and personable, and that child like excitement he has on the show is definitely not an act."
22771,"I got to meet him after Maker's Faire in San Francisco last year. He was awesome, and stuck around at least 45 minutes after he was supposed to to get through the line of people waiting to shake his hand. Definitely the coolest celebrity I've encountered.

**EDIT: Video I took of him dancing to the Doctor Who theme as performed by Arc Attack right before I shook his hand: http://www.youtube.com/watch?v=sjtzib0G9Rs"
22772,"Alison Brie.  Ran into her and a few friends at a really tiny winery in Sonoma.  Super cool, took some pictures with us and had us take some goofy pictures with her and her friends.  She was awesome and kept saying how nice we were for telling her we loved her!

Go Trudy!"
22773,"Clint Eastwood. Had dinner with him while he was directing Mystic River. Great guy. Some of the others in the cast of that movie, not so much. I'll elaborate if anyone wants to hear about it."
22774,Woohoo! Story time!
22775,"I posted my last comment before I realized there was a ""Douchebag Celebrities"" thread, but I'll post the story here, too.

When I was 16 or 17, my friend and I got to visit the set of Mystic River. At the end of the visit we met Mr. Eastwood. We thought it would just be a quick handshake and maybe a photograph, but he invited us to have dinner with him. My friend and I were directing a play at the time, and Mr. Eastwood seemed very interested in hearing about it. I can't remember much else about the conversation, but I do remember that he was polite, soft-spoken, and funny.

And now for the part that you probably care about more. Before meeting Clint, we were taken around the area by an assistant to meet various cast members. We met all of the lead actors except for Lawrence Fishburne, and the assistant went to find him. She discovered that he was in a trailer nearby, so she brought us over to the trailer and knocked on the door.

""What's up?"" Fishburne asked from inside.

The assistant stuck her head in through the door. 

""Mr. Fishburne? There are a couple of high school students out here who would like to meet you.""

As I said in the other thread, he probably didn't know we were standing right there, but I still wasn't too impressed with his response:


""Tell'em to go fuck'emselves."""
22776,"""too bad. may we have a autograph from your daughter instead? we're huge fans"""
22777,"This is inline with my experience with Laurence Fishburne. I waited on him a few times during the filming of Tuskegee Airmen and he was fairly unpleasant. Not as bad as Malcolm Jamal Warner, who is probably the biggest ass I've ever had to deal with, but still. Cuba Gooding Jr, on the other hand, is genuinely nice and very funny."
22778,"Ironic, seeing as Mr. Fishburne's daughter fucks people for a living now."
22779,http://i.imgur.com/KOpfe.gif
22780,"I waited on John Malkovich a couple of years ago. Fairly low key and unassuming, he seemed just as strange as you would expect him to be. We had butcher paper and crayons on the tables at this place (kind of an art themed joint) and he drew picture of a little house. Still have the drawing to this day."
22781,Was he sitting at every table?
22782,"George Takei. He stopped a press conference I was observing to meet a little boy and sign his doll because he was sick and going home, and the meet n greet wasn't scheduled until later. The reporters looked a little put off, but George gave that little kid 100% of his attention for two minutes or so. I could see the kid's day was made."
22783,"Dwayne ""The Rock"" Johnson. He was walking out of the restroom at my work place. I commented, ""I smelled what The Rock was cooking"" as we passed each other in the hallway. He turned back and gave me the [People's Eyebrow](http://gifsoup.com/view/3738992/the-people-s-eyebrow.html). Actually got to chat with him a little while, and led him to the edit bay that he was looking for."
22784,"I didn't know The Rock lifted at the same gym as I did, as it was in Central Virginia and was unaware he owned property there. When I saw what was a Rock look-alike, my natural ""confused face"" propelled my eyebrows into different directions: one up, one down. We made eye contact when this happened. I later found out that it was actually The Rock, and I had unwittingly given him the People's Eyebrow."
22785,You essentially challenged a silverback gorilla in it's natural habitat and got away with it.
22786,Establish dominance!  Establish dominance!!
22787,Pee on him! Mark your territory!
22788,Why am I raising my eyebrows after this comment?
22789,"When I met him, he gave me the People's Eyebrow and pretended to be Mexican."
22790,You sure it wasn't just a large Mexican with an over-active eyebrow?
22791,"I have to vouch for The Rock.  I met him at a Wal-Mart when I was 11.  I saw him in the home and garden section, I said something dumb like ""Whoa The Rock!"" he was dressed in one of those $500 dollar shirts with fancy glasses and turned, took the glasses off raised his eyebrow and said ""What are you looking at jabroni?"" then started laughing and shook my hand.

Still not sure what he was doing looking at fertilizer in the middle of Kansas though"
22792,"Dwayne Johnson actually does seem like a genuinely intelligent and nice guy. I don't care what anybody thinks, [The Rundown / Welcome to The Jungle](http://www.imdb.com/title/tt0327850/) is one of my favourite movies of all time. Perfect mix of action and comedy, in my opinion. And his performance in it was fantastic.

Shit, now I feel like re-watching that movie again."
22793,"Robert Downey, Jr. 
Met him a long time ago when he was filming U.S. Marshalls. He is just a really nice guy. 

(on a side note, went out of my way to search for Tommy Lee Jones at the same time, finally caught up to him, and he was a complete prick)"
22794,"A girl here on Reddit posted a story on how RDJr helped her grandmother when she fell and hurt herself in an award show or something, even using his suit to help stop her bleeding and walking her to the ambulance. She then bumped into him years later when he was going through his tough drug abuse times and thanked him for it and it he was touched, said ""he really needed to hear that"". 

EDIT: 1100 Upvotes for briefly mentioning a story that I read on Reddit once? Lot of RDJr love in this place , I see!"
22795,Man a lot of people give him a bad rep for the drug abuse (especially my mother) but he just comes off in interviews as a genuinely nice and happy guy. I'm glad to hear a story about him that doesn't involve him being a terrible person for doing heroin. We all have our bad days and RDJ certainly has been through a lot of shit and beat it...
22796,"Honestly, I respect him so much more for being able to pull himself out of that hole.  People who hate on him have no idea what addiction is, he fought a war single-handedly and won.

My hats off to him and even better to hear he is a swell guy!

Edit: Also, if you have known anyone that has gotten hooked on smack, you know they usually show permanent signs of damage once they are clean(e.g. broken speech, inability to communicate ideas/thoughts well, muscle spasms or ticks).  RDJr got lucky and inherited a Hunter-S-Thompson-esque playboy demeanor that really shines, especially when he plays Iron man (that movie really grew on me)"
22797,I can confirm that Tommy Lee Jones is a prick.
22799,"In a Q&A with a camera man I had, the camera man said Tommy Lee Jones was a nightmare to work with. He said he chewed out a different person everyday. Camera man noticed he did it right before he would perform so it was very tense and awkward for everyone. He theorized he literally could not act until he embarassed someone on set."
22800,"I've told this story a couple of times on reddit, but I'll give a short version.

When he was filming The Fugitive in Dillsboro, NC, he was just an all around asshole to the locals. He also nearly started a forest fire with a discarded cigar, and when it was mentioned to him he said that someone ""less important"" than him could deal with it."
22801,"Ewan Mcgregor, Ewan Mcgregor, Ewan Mcgregor.

Literally the nicest guy ever in existence. Also, he can put the booze away - drunk a 6 foot 2 security guard mate of mine under the table."
22802,"I was an extra on Harold and kumar 3 and I got to meet some of the cast, I ended up talking to kal pen (kumar) for a while. Later he added me on Facebook and gave me his email. Turns out we were interested in the same academia. We've kept in touch since and he told me he owes me a beer next time he's in the area. Coolest guy I've met and thankful to call him a friend."
22803,"**Ronnie James Dio.**

I managed to sneak inside the backstage area after a Dio concert. My friend was too scared to ""get caught"", so he waited outside for me. 

The guy was one of the nicest persons *(celebrities)* I've ever met so far. We talked for about twenty minutes about more or less everything. I had totally forgot about my friend for those twenty minutes we had talked, but I asked Dio if it was okay for a friend of mine to come inside as well. I called my friend and told him that Dio said it was okay for him to come inside. My friend is extremely modest and told me that he didn't want to bother him. I then asked Dio if he could ask him to come inside. He took my phone and talked. ""Hey, it's Ronnie, do you want to..."". My friend hung up (he later told me that he really regretted doing it).

We talked a bit more until Dio asked me if I smoked. I told him that I didn't smoke, he just smiled and chuckled. ""Sorry, I didn't mean that kind of smoke"". He introduced me to my first joint. After he had smoked me out he asked me if I was hungry. 

We got served Italian food. Dio drank red wine with his food and I could wish for whatever drink I wanted. After the dinner he thanked me for staying for dinner and told me it was always a pleasure to hang out with fans.

And here is the evidence: www.i.imgur.com/fm96J.jpg"
22804,"My girlfriend's mom lives in a house on a private island off of Miami Beach.  The girlfriend and I are down there on vacation last summer and I am fixing the tail light on her mom's car when I see Lenny Kravitz walking up with his little dog.  He says something along the lines of, ""I have never seen you around before.""  I said I was visiting with my girlfriend.  I will never forget this ""tall chick?"" ""Ya.""  Then he got this big smile on his face and said, ""right on."" He high fives me and walked away.  At that moment I knew what cool was and I knew I would never have it."
22805,"I hate to break this to you, but Kenny Kravitz slept with your girlfriend."
22806,That Kenny Kravitz is nowhere near as nice as his brother Lenny.
22807,"Fucking autocorrect. Whatever, I'm leaving it so your post stays relevant."
22808,Good guy non-comment-editor.
22809,He passed the cool to you through the high-five. Awesome.
22810,"Bruce Campbell. I waited on him three times at a restaurant in Ashland, Oregon. The first time I was nervous as shit so I was very awkward with him. The second time, my coworker and I started drinking Irish coffees on the job and I began talking to him immediately. Convo as follows:

(me taking order, take wife's order first, turn to Bruce): And for you, Bruce?

(this visibly surprise him, stutters his order, his wife chimes in): Now how did you know he was Bruce?

me: I'm kind of a big fan.

(Bruce takes off his glasses, puts out his hand): What's your name, son? I'm Bruce and this is Ida  . . . sweet as apple cida

me: alrida

We continued talking about film school and such. The 3rd time I waited on him he remembered my name and it was awesome. Hail the king!"
22811,"Nicest - Marie Osmund. My ex-girlfriend used to babysit her kid. I met her on some riverboat party that she was hosting for something. She was lovely.

Coolest - Dave Grohl. Had some beers with him in Las Vegas. I asked him if her was playing in town, and he said ""No. Just hangin' out."" So we drank beer and talked about stuff.

Worst - Dr. Phil. He was berating some waitstaff in the ""high roller"" room. In her face, screaming, red-faced.... He saw me giving the disapproving stare and screamed ""What are YOU looking at?"" I said ""A piece of shit"", then walked away."
22812,Up vote for calling Dr Phil a piece of shit.
22813,That's not the first time i hear that Dr. Phil is a total asshat. Sucks that he's convincing the housewives of America that he has all the answers.
22815,"I was coming in here to say Jimmy Fallon. They filmed Factory Girl in my home town. I saw him in a restaurant with Sienna Miller (who is very tiny). He couldn't have been a nicer person and in the middle of meeting him Heath Ledger called him.
 He answered the phone ""Heath, I wish I could quit you."""
22816,He always seems like a genuinely nice guy on his show. I'm glad to hear this.
22817,"Rowan Atkinson and his family were in the same heli-ski group as me and my family in Chamonix, France. (It was a private group company, but the guide we hired had a pretty bad injury, so they had to join groups.) My family was really excited, as we all really love Blackadder, Thin Blue Line, Mr.Bean, etc. When he, his wife, his daughter and my family first met up, we introduced ourselves as huge fans of his, and if he would mind if we got his autograph. He said he'd do us one better, and take us out to dinner after we finished skiing.

That was the funniest dinner I've ever had.

**tldr;** Went skiing with Mr.Bean in France and he took my family out to dinner afterwords."
22818,"Tom Hanks and The Rock. I used to live on Edwards AFB in the Mojave Desert of California. During this time, I was witness to several movie and television productions. Tom Hanks was shooting scenes for From the Earth to the Moon which, he was a producer for. The filming for that was happening adjacent to where my mother was working, my brother and I were there (parents couldn't afford a sitter, so her break room and the TV was our sitter). Mr. Hanks came into the building, I guess to use the rest room, my brother and I got to meet him. Very nice, very polite, was very fascinated in the history of the base.

Next, a few short years later, I met the Rock. He had filmed some scenes for The Scorpion King on the fringes of the base where it was a bit rockier and more desolate. As a thank you for using the base and many airmen as extras, the production company showed the movie 2 weeks before it hit theaters. After the film there was a Q&A and autographs. I was wearing my football jersey, my brother and I had come from practice immediately to the movie theater. Having played football, the Rock asked my brother and I about our team, our record, etc. While we had a brief conversation he generally appeared interested in our small little team. 

So yea, Tom Hanks and Dwayne ""The Rock"" Johnson were very nice."
22819,"I met Dom DeLuise a bunch of times when I was a kid. I guess he owned a house nearby, and he shopped at the same grocery store as my family. Every time I saw him he'd do little magic tricks and give me a two-dollar bill. Once he let me help him put his groceries in his car, and I almost crushed his tomatoes. He shouted ""Kyle, watch the tomatoes!"" and laughed. Guy liked his tomatoes. He was just a ridiculously sweet guy."
22820,"Hayden Panettiere, who is the only celebrity I ever met, which was at Philadelphia Comic Con. She was super nice and took the time to talk to me and answer some of my questions and make small talk with me. Her publicist or whoever it was at the booth with her was trying to rush me along, as was the comic con staff/volunteers - but Hayden was like 'no, I want to talk to him let him say what he wants to say"". It really meant a lot to me."
22821,"Probably too late to jump in this conversation, but I filmed a documentary on clean water and sanitation in rural villages in India.  Matt Damon contacted my group (about 5 students on a low budget) and said he heard about what we were doing and that he'd be in India.  Ended up spending some time with him and his brother (and Gary White) and traveling from village to village.  People didn't know who the famous person was (they knew one of us was famous though) and would come up and great all of us with equal excitement.  The whole time Matt just chatted us up about what we wanted to do with our lives, basketball, issues related to our film, etc.  Seriously a great dude.  I have loads of respect for him.  He also gave us a killer interview and in one of the villages, the kids had prepared a song for him...he responded later in the day by singing a song for them."
22822,"Luke Wilson.

He golfed at the private course I work at. Could not have been nicer. Chatted with me for at least half an hour and answered all the crazy questions I had about Old School, That 70s Show, and Idiocracy. After all this he asked me where the men's locker room was so I obliged and he slapped me a 50$. I work at a non-tipping course so he knew he didn't have to. As he left he said, ""It was nice meeting you, 500channels,"" to which I replied, ""The pleasure was all mine, Godfather."""
22823,"Met Johnny Depp and didn't realize it until the next day, and he was awesome and shook my hand and everything.

I was at Comic Con and saw an amazing Captain Jack Sparrow. I complimented him because his costume looked exactly like the one from the movie. He replied by shaking my hand and then asking me, in the perfect voice ""What costume?"" and then swaggering off with the same sort of walk he used in the movie. I thought I had just met the best cosplayer ever, then I saw on the news the next morning that Johnny Depp had been at the convention walking the floor in the original movie costume.

My face:

http://www.reactiongifs.com/wp-content/uploads/2012/05/VU7DZ.gif"
22824,"Morgan Freeman flies into my work semi-regularly. We handle the fueling for his jet. He is one of the nicest people I've ever met. And yes, his voice actually does make you tired. 

Nolan Ryan was a complete dick, he too flies in every once in awhile. I love the Rangers, but I can't stand him. 

Reba McEntire is one hell of a sweet lady. Still pretty attractive for her age too. 

Bill Clinton brought me and my coworkers steak fajitas from El Paso when he flew in. He's incredibly nice and had a real conversation with me about my job and school and such. He actually listened and asked questions, not normal for someone famous. Best fajitas ever. 

And NASCAR teams fly in all the time. We actually have some flying in tomorrow night for fuel.  Always a hell of a time when they're here. Most of the time they're nice, but there's always a couple assholes."
22825,"Emma Stone.

As I was being all tourist-y in the NBC Store at the Rockefeller Center in New York, I heard someone with a very familiar voice chatting it up with the cashier. I remember the cashier asking that person when she's going to go the natural route with her hair color again. Lo and behold, it was Emma Stone. Her name escaped me at first but I mustered the courage to go up to her and ask if she's ""the one who's gonna play Mary Jane Watson in the upcoming Spider-Man remake."" She smiled and said no, but she was going to be Gwen Stacy. She had who I'm assuming is her assistant with her and they seemed to be in a rush because she was going to host SNL that time but she graciously posed for a picture with me.

[Proof.](http://i.imgur.com/q5iyk.jpg) I'm blurred out a bit because the assistant guy was the one who took the photo and he was the one scrambling to get out of that place."
22826,"George R. R. Martin

I was walking around at a convention a couple years ago, and saw him just ambling around. Being the ridiculous fan of both ASoIaF and Wild Cards that I am, I of course approached him and started talking to him. We ended up standing there for ten minutes or so, just standing in the aisle between two booths chatting about his various projects.

He has to get that kind of thing all the time (especially now that the TV show is so popular), but he was extremely friendly and seemed completely unhurried to end the conversation."
22827,"you are the reason he isnt finishing the books, you jerk!"
22828,John C. Reilly is exactly as affable and pleasant as you assume he is.
22829,"I met Sam Rockwell the other day! He was totally cool about it and asked me my name when he had every right to tell me to piss off, given that I'd pushed the door open to meet him. What a neat dude."
22830,"Dick Van Dyke. I met him while doing a performance for Disney's Candlelight at Disneyland one year. He was super nice and talked to everyone who asked him questions. He told us all about his past career and how much he enjoyed talking to people who enjoyed his films. He was super polite, told great jokes, and he listened to all the things people had to say about him. 

Not like Mickey Rooney the year before. That guy was a prick."
22831,"Just a few that come to mind:

Danny Devito. He bought *personalized* gifts (i.e. a nice juggling set for a for a person who he only talked to once that happened to mention he was an amateur juggler) for all the production assistants on set.

Al Pacino. Had dinner with him and he was intense about his latest project but also super nice and genuine.

Alan Cumming. Had dinner with him and he was hillarious, down to earth and a blast.

John Lithgow. Coached my girlfriend's basketball team. Awesome dad and person. Great coach.

Not so nice: Mariah Carey... enough said."
22832,I met Sir Killalot from Robot Wars once. Much nicer than he's portrayed in the TV show
22833,"Paris Hilton. My car broke down on an autobahn in Germany. Managed to coast to sort of layby thing with a burger van and toilets in it. I was in a bad state because I can't speak any German, my phone had no credit and I didn't have my breakdown details with me so I had no idea what to do.

I unsuccessfully asked the guy in the burger van for help and he apparently didn't speak English so rather pathetically I started to cry. Then this big old American guy appeared and offered me a cup of tea in his motor home (it wasn't proper tea but that's besides the point). In the van was another guy and friggin Paris Hilton! I kid ye not. 

She was sweet and made me a sandwich and gave me a hug then proceeded to talk to me for 30mins about some old radio bits she'd bought in some show in Freidrichshafen. I didn't understand most of it. She said that when she wasn't working she liked to drive about Europe going to radio and air shows as if she put a hat on nobody ever recognised her.

Then they towed me to a garage at about 40km per hour (scarey stuff on the autobahn). Oh yeah and she sat in my car and asked if it was ok before she smoked. 

**TL:DNR Paris Hilton saved me in Germany and towed me to a garage**"
22834,Paris Hilton made you a sandwich? That's going to be hard to top.
22835,This reads like a fever dream.
22836,"I saw her randomly at whole foods in Hollywood, I immediately recognized her and began to do an awkward peeping around the aisles and staring dance. Finally I squared my shoulders, walked over and said ""Paris? Can I take a picture with you?"" that's when I see she's on the phone and am about to walk away when she puts the person on hold says ""sure sweetie"" and takes a couple shots with me. Whenever I tell this story, people always ask "" was she stupid?"" it gets me all angry because I feel like we're best buds now and I have to defend her."
22837,"George Clooney. A while back I was living with my best friend and his dad. His dad worked for a trucking company that was contracted to pull the actor trailers/Set peices/ you name it/ for the set of The Ides of March. Once in a while they would drive the actors to set if they were told to do so. Everyday when he got home I'd ask him if he ran into George since I knew he was directing/acting in the film, most of the time he didn't see anyone but he came in from work and told me that he actually got to talk with ""Mr. Clooney"" as he called him. 

Apparently he was walking around one of the trailers and almost bumped into him. Instead of getting pissed George just kinda laughed and starting punching his stomach jokingly then told him ""What if I was carrying coffee, Mike?"". Now, according to my friends dad George had only heard his name once before when George had asked him to do something for him about 3 weeks beforehand. Then they chatted about life and all that for about a half hour.

So, not only did George Clooney not get pissed when my friends dad about plowed him over but he remembered his name after really only hearing it in passing and then just chatted up with him."
22838,"Morgan Freeman. 
We're both from the same state (Mississippi). I was having lunch near his home town when I noticed him. He took the time to talk to me, despite my epic fan grin, and paid for my food before he left. 
Best lunch I ever had.

So in conclusion I met God. 

Edit: Corrected the word I forgot to type. Oops! That's what I get for doing it on my phone. :)"
22839,"I second this about Morgan Freeman.

I work working at an event in Hollywood, and my entire job was to greet the celebs as they got out of their car and walk them to the elevator. The distance between car and elevator was maybe 30 feet or so, in other words not long at all.

When Morgan Freeman drove up, I walked up to him and said my spiel ""Good evening Mr Freeman, welcome to the <Event name here>, I will be your escort to right about here.""

The amount of time it took me to say that was the exact amount of time it took to walk from the car to the elevator. After I said that, he stopped and looked at me and said: ""That's it? We don't get to spend any more time together?""

I said ""No sir. This is the end of the line for me!""

He looked at my name tag, shakes my hand and said: ""<Name>, I'll never forget the time we spent together."" Just him saying that to me gave me chills. Later in the evening when the guests were leaving it was a mad house, but in the midst of the crowd I see Morgan Freeman. We are walking toward each other when he recognizes me. He points his finger and says ""Never forget"" as he continued to walk to his car.

This was, of course, one of the most badass moments of my life."
22840,"That is the coolest experience ever. ""Never forget"" would have sent chills down my spine and probably resulted in a weird boner."
22841,You met God and the guy who is always narrating everything we do.
22842,"""The smile on his face was about the length of five football fields, just shy of half a mile."""
22843,god dammit.
22844,"""I must admit I didn't think much of fultron first time I laid eyes on his comment; looked like a stiff quote would blow him over. That was my first impression of the man. """
22845,"""I wish I could tell you that fultron fought the good fight, and the trolls let him be. I wish I could tell you that - but Reddit is no fairy-tale world. 

He never said who did it, but we all knew. Things went on like that for awhile - commenting on reddit consists of routine, and then more routine. Every so often, fultron would show up with fresh downvotes. 

The trolls kept at him - sometimes he was able to fight 'em off, sometimes not. And that's how it went for fultron - that was his routine. 

I do believe those first two years were the worst for him, and I also believe that if things had gone on that way, this place would have got the best of him. """
22846,"""Titty Sprinkles"""
22847,"Neil Gaiman, at the Edinburgh Book Festival. It was pouring, and some of us were waiting in the rain for about two hours to get his autograph. I asked him how he was and he told me how sorry he felt for everyone outside. I told him they were in Edinburgh; they could hardly be surprised if it rained."
22848,"When Joe Biden was a Senator I accidentally walked in on him while he was in the stall of an Amtrak bathroom. He sat there awkwardly for a second and then said ""I'd shake your hand but I don't think either of us want that."""
22849,Yep. Sounds like Joe Biden.
22850,"As a Delaware native, it's safe to say that 80% of it's residents have had some kind of encounter with Joe Biden, all of which are amusing and/or adorable.

EDIT: The 20% who don't have a personal encounter with him know at least three people who have."
22851,"I was hoping you'd say ""...all of which were in bathrooms"""
22852,That would be Larry Craig not Joe Biden
22854,TIL you broke Ringo's heart.
22855,"I wouldn't sweat it. Musicians understand their demographic and a 12 year old kid isn't exactly the topic expected fan of Ringo Starr, especially on his solo All-Starr ventures. He was there more for the adults that would appreciate his music. It's not like you shattered his hopes or anything, he went on to be as successful solo as he could hope for. 

Also, I loved the store telling vibe on this ""eyes like saucers, like I was shaking hands with Charles Manson."" Have an upvote."
22856,"Arnold.  Met him at ""The Arnold"" in 1996 and at a bodybuilding gym in 2000.  No cameras and he was still super motivating.  He told everyone how its obvious how hard they work and how great they look.  He signed pictures for kids and smoked cigars like a chimney.  Great guy.  100% real man."
22857,That's very cool because im 1996 he was one of the biggest stars in the world ( just past T2 and True Lies).
22858,"Ted from Scrubs, and then I completely froze up and looked like a freak =)"
22859,"Chuck Norris- tipped me $150 bucks... on a $30 bill, was right around the time the Chuck Norris jokes were becoming popular, and while i was taking the order I overheard a coworker make one of the jokes, saw chucks face just sorta tighten like ""not this shit again"" and I politely excused myself, took the other employee aside and told them to leave him the fuck alone so he could eat"
22860,"My dad is a Blackhawk pilot, and during one of his Iraq tours, Chuck Norris came through the country on a USO tour, and my dad was lucky enough to get to fly him around while he was there.  He said Chuck was a really genuine guy with a great sense of humor.

EDIT: found a picture, not very good quality though :( http://imgur.com/IXFdS  The other guy in the picture is Marshal Teague."
22861,"When Chuck Norris tips, the bill is 20% of the tips."
22862,"I met Kristen Wiig at a retail job I had a few years ago. She was with her parents. I mentioned something complimentary to her dad because I don't like bothering celebs, but he responded with, ""Hey, Kristen! You've got a fan over here!"" She came back down the stairs, shook my hand, introduced herself. She was very pleasant.

I also recently met Rich Sommer (Harry Crane from Mad Men). I rang up his wine at a prominent, known-for-cheap-prices wine shop. I didn't say anything until the transaction was about done, then got a handshake so I could say I'd officially met him. He was a nice, normal guy. No story there, really. I was just super stoked to meet him."
22864,"Eddy Izzard. 

Met him once whilst working a drinks reception, him and Ruth Jones where having a chat (she's lovely too) and they both just started talking to me, Eddy more so. The manager thought i was harrassing them untill they told the manager they wanted all the food i was holding and where thus inticing me with their charms. 

Nice people."
22865,"Joel McHale. He actually tried to make me laugh (and did and even laughed at my jokes.) He was ""on"" even though I was the only one he was talking to. It was clear he cared that I was a fan and wanted me to continue to like him. 
Also, Penn Jillette said I was tall and beautiful. I was standing in a crowd and was head and shoulders above the crowd so he saw me even though I was far off. Actually, Joel McHale said I was the tallest girl in the room. 
I guess celebs are confident to point that kind of thing out."
22866,"Mila Kunis. 

Met her @ a bar in Manhattan several years back (IIRC during the tale end of That 70's Show). My buddy offered to buy her a drink, she turned it down in hilarious fashion. As he went off distraught I chatted with her for a good half hour. Pretty sweet gal."
22867,You are the worst wingman
22869,"I was at a shoe store in cleveland about 4 years ago. . I think it was Finishline.    And I'm looking at the new Lebron shoes, (mind you that I'm only 18 at the time), and a huge shadow appears over me.  And i turn around, and it was Lebron fucking James standing there.   He smiled and said ""you want my new shoes"" I stumbled over my words for a few seconds then said yes I think I'm going to buy a pair right now.   He then asked me my size, went up to the front desk and bought me 2 pairs.   1 he signed, and he said the other was for me to practice my post moves in.   One of the best days of my life."
22870,"I live in miami. I saw him in a restraunt and I know he must get hassled alot, so even though I'm a big fan I didn't say anything to him. Almost everyone else in the restraunt was running up to him and trying to take pictures with him, but he was just trying to enjoy his meal. My friends were going to go up to him, but I stopped them and said, Just leave him be to finish his food. Well, he must have seen this ordeal because before he left, he came over, paid for my lunch and thanked me for respecting his privacy. We started talking for a little while and he's actually seems pretty intelligent/really nice/ and very humble. All in all it was a great experience and I have a newfound respect for him."
22871,"When I was eight or so, my grand parents and I ran into Brendan Fraser in LA while he was shooting MonkeyBone.  I wanted an autograph, but I didn't have any paper or marker, and neither did he.  He personally took my address down in his BlackBerry, and later mailed me a signed headshot.  My parents told me to write him a thank you note back, so I did.  He wrote back and thanked me for the thank you note.

A little over a year later, out of nowhere, he mailed me a signed copy of MonkeyBone on DVD."
22872,"I bought Kevin Smith a beer at a airport lounge, we wound up shooting the shit, after a while he bought a piece of pie and we split it."
22873,Were you on a date? Why not get 2 pieces??
22874,"Maybe Kevin's intention wasn't to split the pie, but OP thanked him as the pie was arriving, putting Kevin in an awkward position where he had to split it."
22876,"So you know Free Willy? Yeah I met him when I was a kid... I got to feed him fish and pet his head... even rubbed his tongue and he was super nice and didn't bite my arm off. 

Keiko, what a great guy. Seriously, they say he is a killer whale and he spared me... such an outstanding orca."
22877,"I used to be a big Barenaked Ladies fan.  The first time I went to one of their concerts, I was not aware that they usually do a meet and greet after the show if you wait outside by their bus.  So, before the show I see their bus and I wait around hoping to meet them.  Well, I see Kevin Hearn walking into the arena about 30 feet away from me.  I yell over and ask for an autograph.  He starts walking toward me when a guy comes out the door and tells Kevin, ""Come on, we need you now."" He stands there for a moment looking at me and at the door, genuinely torn on what to do until the guy repeats that he is needed.  So, he turns to me and tells me, ""Wait right there, I will be back.""  So I wait.  A half hour later he comes back out, gives me an autograph, and chats with me for about 15 minutes before heading back inside.  He was really the nicest and most down to earth guy ever."
22878,I went to highschool with a couple of them.  They were genuinely nice guys right from the get-go.
22879,"Neil Patrick Harris. Met him at a show in NYC, and he leaned over a couple times to drop a one-liner. After the show ended, I went to shake his hand, and he hugged me, complete with a full fledged ass grab."
22880,An ass grab by NPH is the ultimate compliment.
22881,"Dale Earnhardt Sr. It was 1995 and I was 6 years old. My parents were big NASCAR fans and entered me into contest to sit in his car while we drove (slowly) around the track, there were about 15-20 drivers doing this. 

The plan was to make two laps around and then we were done for the day, they were staggering them to make sure each driver had plenty of space. 

Dale was cool, asking me a bunch of questions, and when our second lap ended and the guy was waving him in, Dale just punched it and went right around him. He did this the second time around too, we almost rear ended another driver as they were starting the lap.

I stopped watching NASCAR the day he died. Was never the biggest fan of the ""sport"", but I always needed to cheer for him."
22882,"Lady Gaga.
I sat down with her and had someone take a picture of us. I complimented her on her show but I was overall super nervous and flustered. I quickly got up to walk away but she grabbed me, told me to sit down, and demanded we talk some more and take a few more pictures. It was glorious."
22883,"I've made it my life's goal to ask her on a date. I dont even want her to say yes. Because I'd probably die. But I figure if I could ever work up the nerve to ask her out, I'd never have butterflys in my tummy again when asking a girl out."
22884,"The scariest part of that is if she did say yes. I mean, how the hell would you impress Lady Gaga on a date?"
22885,I have no idea. Unless she's into ping pong. I have a decent ping pong game. So there's that.
22886,"Penn and Teller need to be at the top of this list. At the end of every show they do (which is at least 5 per week) they literally run out of the doors ahead of everyone else so that they can personally shake everyone's hand and thank them for coming. They'll sign whatever you want for free, talk to you, and take pictures. They've been doing this for over 20 years and always talk about how appreciative they are of their fans. I haven't met them on the street, and it is somewhat anecdotal, but I hear they are exactly as approachable outside their shows, too, and will make time to chat/sign things as well."
22887,Does Teller talk?
22888,"Yes, he does.  He's really fun to talk to actually!"
22889,"I played paintball with Robin Williams and made it a point to run straight to his bunker and shoot him right in the face, he was going to be my prize. He was a good sport about it and spent the rest of the day giving me a running commentary/riff track on the game as it progressed. Really nice guy considering I just shot paint into his face."
22890,"I've told this story on Reddit before, but I guess every year he does this event at SF Zoo where someone can buy, in an auction, a slumber party at SF Zoo and then get to have dinner with and a story read by Robin Williams. My dad's best friend had a bidding war with another lady, but was ultimately outbid. When RW heard about it, he agreed to do two nights, one for the lady and one for my dad's friend. 

I can never thank RW enough for doing that. It had been about a month after my father passed away, and needless to say my family was devastated. We almost couldn't handle going. But I'm glad we did; he was such an amazing person that for one night my family was happy. He laughed when I called him Mr. Williams, and read us ""The Emperor's New Clothes"". He was so nice and I'll always be grateful to him."
22891,"Ice T was on the same flight as me, my mom, and my sister when I was younger.  My sister needed help getting her bags off the carousel but I was too busy reading Harry Potter and basically told her to fuck off.  Ice T comes walking over, shoots me the worst look, then grabs all my sisters bags and helped carry them to our car.  

I learned a good lesson that day; never help anyone because it's easier to let a celebrity do it for you."
22892,"*Zoom in on Ice-T's face. He shakes his head.*

""That's messed up."""
22893,it would have been funny if your parents didn't know who he was and tried to tip him.
22894,Or called the Police on him.
22895,He may have killed the cops
22896,DAMN RIGHT
22897,"George Clooney.  He was filming at my University 2 years ago, and was extremely social with us students.  He even ate at a bar uptown with us on green beer day at 4:00 am!"
22898,Ed O'neill. Met him on a shoot for a remake of Dragnet... awesome dude.
22899,Adam Sessler bought us a round of Irish Carbombs when we told him we can't stand Morgan Webb. Helluva guy.
22900,"Why do people seem to hate Morgan Webb? I only watched X Play in the very beginning, i get the feeling that something happened in the later seasons?"
22901,I was fortunate to work on a film with Danny Trejo. At lunch he told us stories about growing up in East LA and his time in prison. Really really cool down-to-Earth dude.
22902,George Carlin. Spent 10 minutes talking to me after a show changed my life forever to meet someone that smart and funny and gracious.
22903,"Russell Brand was an absolute peach to me. I interviewed him for my blog and he stopped mid-sentence and said, ""You're beautiful you know that, right?""...and my favorite compliment from anyone, ""You've got lovely cheeks!"" *note: please read in British accent.

Edit: [photo of our ""cuddle""](http://i.imgur.com/pwYqR.jpg)

Edit 2: [link to the blog post](http://onwardstate.com/2010/04/20/jonah-hill-and-russell-brand-tell-all/)"
22904,"I met Russell at his 2nd book's book signing in NYC a few years back. I can confirm that he is indeed, a ""peach."" So very nice, and very very funny."
22905,"Did he tell you to ""Come have a cuddle""? That's one of my favorite lines of his. haha."
22906,YES. YES HE FUCKING DID I LOVE YOU FOR ASKING THAT BECAUSE NO ONE BELIEVES ME.
22907,"I went to shake his hand and he said ""no, no mate. give a cuddle come here I don't bite"" and hugged me."
22908,"I got a voice mail from my girlfriend 2 years ago, it was a super drunk Bam saying: ""have fun at work dud, your girlfriend is hot!"" 
[edit] I was supposed to meet my gf at CKY show in SF where she went to school but I couldn't get work off. Before the show I guess her friend got CKY autographs tattooed on her and my gf told Bam I was a huge CKY/jackass fan and thats when they called. My original comment sounded like they called when Bam was balls deep in her or something.. But hey you never know haha. Apparently he was a rad dude and wanted to drink and have a good time."
22909,"Bam Margera?

Sounds like he fucked your girlfriend."
22910,Maybe he did. What a Jackass
22911,I waited on Bam Margera and his girlfriend at my restaurant in Philly last summer. He was indeed a nice guy.
22912,Girlfriend? Didn't they make a big production out of his wedding a couple years ago?
22913,"A week after 9/11, my father (an NYC carpenter) stepped into an elevator with Ben Affleck. It was just the two of them in the elevator and they were both going to one of the upper floors of a very tall building. They ended up talking about the attacks on the twin towers and got into a deep conversation about how human beings are cruel to each other for a bit. According to my father, he was a really cool, intelligent, and down to earth guy. I know that it is supposed to be about a celebrity that I have personally met, but I thought that this was a cool story."
22914,"I met Summer Glau a couple months or so ago, she was absolutely lovely. Really sweet and down-to-earth. Extra gorgeous irl too."
22915,"Met Adam Devine of workaholics. He was obviously hungover but still took the time to be a nice guy. Real tight butthole. 

Snoop dogg was also a really laid back dude, but what do you expect."
22916,Landon Donovan is a pretty nice guy. Shot the shit for a couple minutes when he didn't have to. Most of the US Soccer guys are insanely nice.
22917,"Ellen McLain, the voice of Portal's GLaDOS.  She was really sweet, very chatty, and willing to sign whatever.  I met her at a convention, and no matter what time of the day I met her, he had a big smile on her face, and was never anything but super nice to her mobs of fans.

She is a very classy lady."
