idx,text
36332,"White wine... I can get a bottle for $5, it doesn't upset my stomach like beer, and doesn't get me fucked up like hard alcohol. Plus to me it's more enjoyable to drink than red wine."
36333,And when you drink it every day people just think you're fancy.
36334,Sangria. It taste good and gets me drunk.
36335,Yes! I found one that used real orange juice and was under 10$  Weekend made. Have you ever tried mulled wine? Sometimes it reminds me of a warm sangrea with cinnamon.
36336,Can’t say that I have but it looks great
36337,Trader Joes has the best and cheapest. You do have to add a bit of sugar.
36338,We don’t have Trader Joe’s where I live but I’ll keep it in mind
36339,German weissbier
36341,"2 really - craft beer and red wine.  

I own a small winery in Northern California and I've been around wine most of my life.  When I'm doing my own thing I'm visiting breweries.  A fun thing I get to do is when I'm doing weekend work such as helping out at the tasting room I have some beer I picked up earlier that week in hand."
36342,"Jim beam, Hennessy , fireball occasionally"
36343,"Miller Lite.

Of the basic/starter beers, this is the best of them."
36344,Mezcal! Mmmm smokey
36345,Mezcal
36347,"Good ole' pale ales.

Or red wine mixed with a diet shasta. And it HAS to be diet shasta. Idk why, but it works."
36348,I like a simple rum and coke
36349,"Flemish Sour Ale.  

Rodenbach Grand Cru is one of the better ones."
36350,Ethanol
36351,"Red wine, I prefer Merlot but I'll drink whatever's there. 

Big Whisky fan but that can really dry out my wallet. When able, I'll buy a bottle of Highland Park, Old Pulteney or Glendronach.

Used to be a vodka and redbull drinker but that shit would make me go mental."
36352,"Colt 45 if I'm going to a party, Jack and Coke if I'm at a bar"
36353,Bourbon
36354,Had a few sips from my dads beer. Molson Canadian and Corona seem the best so far
36355,12 year old scotch.
36356,With a nice cigar
36357,Tequila: espolon or dulce vida
36358,Sparkling wine. Because I can't afford champagne but it can taste similar if you get a good one. Gets you drunk af too.
36359,Pendleton and Pepsi.
36360,"Canadian beer, or rum."
36361,"Used to be wheat beers of sorts, now though since I'm trying to limit my carbs, I switched to wine, dry, dark reds are my go to."
36362,"Tequila and rum.

Although, being that I am a fancy bitch, I have a soft spot for elderflower liqueur. It tastes amazing mixed with lemonade."
36363,Isopropyl. Go big or go home.
36364,"Vodka, straight."
36365,I have loved beer since my first tiny sip as a child.
36366,"A pale ale is almost always good.

Pilsners are usually good"
36367,Beer. Bourbon. Wine.
36368,"Really really cheap vodka mixed with diet soda.

Get blasted for 3 bucks.

I combine my frugality with my shocking alcoholism."
36369,The cheap kind.
36370,"Vodka, Brandy or Gin"
36371,Cold and free.
36372,Jagermeister...jagerbombs. Body doesnt know what to do
36373,Ethyl
36374,"spiced rum is great, vodka gets you fucked up, guinness since i’m 1/12 irish and it tastes okay and COLT. 45 to act like a thug. underage drinking is the best"
36375,What kind of question is this.
36376,A cheeky tequila
36377,"Or as I like to call it, cheequila!"
36378,Alchol
36392,Free
36380,Tubi 60.
36381,"Cant list one. The liquor speaks to me.  Listed by price range

Bourbon:  Ancient Ancient Age / Larceny /  Basil Haydens  / Blantons / Orphan Barrel line (DONT JUDGE I LIKE OAK!!)

Rye: Redemption / OYO Rye / Michters / Angel Envy / Whistle Pig

Gin: Bols 18 mo Limo aged

Vodka - Any plain good vodka / Nut Liquor Peanut Butter Flavored Vodka with milk - nutty russian

Rum: Pyrat / Atlantico / Admiral Rodneys / 1931 Select 

Scotch: Dalmore 12 / McCallan 12 / 18 / 17yFO

Cognac: Dusse VSOP

Whiskey:  Corner Creek / Wasmunds 

Tequillia:  El Mayor Reposado (havent tried Anejo yet), Sauvicito Anejo / Herradura Seleccion 

God I love Liquor."
36382,"Hard Cider. It’s not what I drink to get drunk, but it’s my favourite just to drink."
36383,Everclear.
36384,"We came across a nice little drink about a month ago from a friend call mini beer shots. Its licor 43 and heavy cream on top. It looks like a mini beer and its not stingy at all going down. the cream really makes the drink taste wonderful.

picture of said drink: http://www.licor43.com/en/cocktails/minibeer-43/"
36385,"Jager, peach schnapps, ice tea. For some reason the schnapps completely negates the Jager and the whole concoction goes down like water."
36386,"Tequila and Rum. Can't choose which I like more. Also, palm wine but it's not readily available in the US."
36387,Cider any from the fridge
36388,"i just like cold beer.  as long as it isn’t a wheat beer.

this citrus IPA craze has been my jam in particular, though."
36389,IPAs
36390,Cabernet Sauvignon 😍
36391,"Specifically, Iced Cake Vodka. Tastes amazing and it doesn't burn."
36393,I just visited Florida recently and I couldn’t stop drinking 30A
36394,I could drink good tequila all day long. I may pass out at some point and have a killer hangover the next day. But god I love the stuff.
36395,"Beer - Bud Light, microbrews, whatever"
36396,Absinthe.
36397,I would recommend sticking to ethanol
36398,"Favorite beer: Hoegaarden 

Favorite bourbon: Woodford Reserve 

Favorite scotch: Lagavulin 16"
36399,"Gin cocktails have become a staple of mine lately, esp. Tom Collins."
36400,"Whiskey. I used to be an Irish whiskey guy, but lately Bourbon's been really growing on me."
36401,"Jim Beam, honey. Straight and on the rocks."
36402,"Corona if I'm eating, Labatts Blue if I'm chilling, Cube Libre if I'm wanting to get smashed"
36403,"Red wine. Liquor takes too long to make me drunk so it's pretty easy to overdrink, whereas wine makes me feel it pretty quick."
36404,"Bourbon. Sweet, sweet bourbon."
36405,"Whisk(e)y is the lord of all alcohol. Beer is the best ""go to"". But in terms of practicality, wine is actually the best. It's a nice medium. Unlike beer, you don't have to drink as much to get pretty tipsy, while on the other hand you can drink a pretty good amount without getting wasted, unlike liquor."
36406,A nice golden Puerto Rican rum. I can drink that stuff straight from the bottle all day long...
36407,Used to be anything but now only beer is tolerable. Nothin beats a classic Budweiser. Or Modelo
36408,"Gin, tastes like juniper had sex with vodka. So good."
36409,"It’s St Paddys, all the drinkers are out drinking. 

But I’m a drunk, so I’m home drinking vodka."
36410,"Straight dry gin, real men."
36411,"Beer with pizza, wine with pasta."
36412,Nothing beats a mojito on a hot day for me. Any variation of it is awesome.
36413,"Rum & Coke Julian, Rum & Coke"
36414,"Just alildrinky-poo, Blulian"
36416,Just another touch of the white liquor
36417,Have you ever tried just the mixer?
36418,I've actually forgotten the taste of Coca-Cola without liquor in it. Tried it the other day. Tasted off.
36419,"I did this. I don't drink pop unless it's mixed with alcohol. One day I took a sip of coke and asked a friend if it tasted wrong to them, if maybe the syrup at the restaurant had run out. Turns out I has forgotten what coke tastes like without that rum flavor in it."
36420,Frig off Randy
36421,Sexian. Watch yer goddamn tone.
36422,Beer. Cold Beer.
36547,With the boys?
36424,Cracked.
36425,Hangin with tha boiiiiiis
36426,"Relevant:

https://m.youtube.com/watch?v=ZEvQOPUHGH8"
36427,"Beer. 

If i'm feeling fancy though...I make ""The Fuckhouse."""
36428,"You can't just mention something called ""The Fuckhouse"" without telling us what it is."
36429,"Kraken rum (No other rum will do. None.)

RC Cola OR Dr. Pepper

Chocolate Syrup."
36430,I was wondering what could possibly deserve that name... but that... that fits
36431,How much chocolate syrup are we talking? Just a little dab for flavor or do I get to choke on that shit?
36432,All on you there bud. I don't put much.
36433,I think you need some gummy tentacles in there as well.
36434,Well then it ceases to be a Fuckhouse and becomes The Cthulhu.
36435,I threw up a little.
36436,"Don't knock it until you try it! (at a friend's expense...you know, in case you don't like it.)"
36437,"That...actually sounds pretty good. I haven't had Kraken in a long time, you just reminded me that I need to."
36438,Good old gin & tonic
36439,"If you wanna change it up, the gin gimlet isn't a bad choice."
36440,Great as a social drink; awesome at parties; perfect for sad day drinking.
36441,"Way too sweet for me and a shit load of calories if you're watching your calories at all.

Gin and soda water muddled with lime and a dash of bitters. Not riddled with sugar, tastes more refreshing/less syrupy and has zero calories from the soda."
36442,It blew my mind to find out how much sugar was in tonic.  I had figured it was more or less lightly flavored soda water.  Boy was I wrong
36443,"Haha! That was me too. Tried to cut down on calories by switching to single tall gin and tonics from beer. After doing that for a week or two a more nutrition conscious friend asked why I switched. 

He literally spit out his beer when I told him it was to cut calories, then explained how poor a decision that was when he was done laughing."
36444,"If you're watching your calories alcohol in general should be avoided. 9 calories per gram of alcohol, same as fat. But Indian tonic water is naturally lighter and I'm my opinion nice for gin and tonic."
36445,Gin and lemonade?
36446,"With lemon, lime, or cucumber?"
36447,"Usually none of the above, I'm kinda lazy that way"
36448,Bourbon Old Fashioned
36449,Rye old fashioned for me.
36450,cranberry and vodka. leave me alone i know i'm a basic bitch.
36451,"Ya know, I generally drink whiskey straight with no ice, no mix. Just in a glass if I'm not just blasting it down from the bottle.  

BUT I was over at my buddy's house and all he had left was some vodka and cranberry juice left over from a party. And goddammit if it wasn't really fucking good."
36452,Jameson & ginger ale
36454,What's the difference between ginger ale and ginger beer?  Are they made differently?  I don't think I can taste a difference.
36455,"Ginger ale is much more mild than ginger beer. Ginger beer is usually spicy tasting, it's also actually brewed and fermented and is often not as carbonated."
36456,Can't go wrong with a Jamie & ginger!
36457,"Warm, cheap vodka. Straight out of the bottle is fine."
36458,mom?
36459,Vladimir?
36460,Bonus points if the bottle's plastic
36461,Makes less noise when you're trying to smuggle the empty bottles out of the house without getting caught doing it. *Sigh*
36462,i just got heartburn reading that...
36463,You sound like a person who likes their skol Respect
36464,"Skol!  It was $9.99 for a 1.75L in High School, and it's still the same price 12 years later.  I'm not a vodka drinker, but if I am going to have some, I'm not gonna waste my $ on the good stuff."
36465,I would do it the other way if I'm not a drinker. I drink a lot so I buy the cheap shit. If I only drank occasionally I'd go for the expensive shit
36466,"Fuck, nothing like doing some shots before work because anxiety makes it hard to talk to people"
36467,"Same here. It's the cheapest and quickest way to get drunk because tbh, nobody drinks it for the taste do they, aha. No point spending a few extra pounds just to make nail varnish remover taste like strawberry infused nail varnish remover."
36468,"If you're a proper Swedish student, you only drink [Jelzin vodka](https://www.drinko.se/media/catalog/product/cache/1/image/5b4ce2e974906a11297266e0d7bca680/b/o/boris-jelzin-3l_1.jpg) straight out of the bag in box. Preferably bought at a German border shop."
36469,r/ANormalDayInRussia
36470,Bloody Mary
36471,"Glenlivet 12, neat."
36472,"For the not-so-huge jump in price, go with the 15. Much more smooth."
36473,Yes! I was gifted a bottle on Father's Day and haven't looked back. I would like to try the 15 now.
36474,"The 18 is simply fantastic, the 25 is one of the finest things I've ever had."
36475,Mead. Been brewing it for eight years.
36476,"Holy shit, drink it already."
36477,I'd be a lot warmer and a lot happier with a bellyful of mead
36478,"I love good mead. I had a roommate that brewed it. Bad mead, on the other hand...."
36479,"Well yes, there's good and bad of everything. But I could make a gallon of mead for $10 (give or take, depending on ingredients). Good commercial meads start at $25 - $30 for a 750 ml bottle. So even with an occasional bad batch it comes out ahead."
36480,Absolutely. I wasn't knocking your craft. Good mead is probably my favorite alcohol.
36481,It's a fair criticism: would be kidding if I claimed to never mess up a batch. One of the good things about this hobby is that the savings is so significant that it's worth the risk.
36482,"Mead is so good, but can be rather hangover-inducing for me"
36483,"Nice. I'm into my third year, myself."
36484,"Long Island Iced Tea (or any variation thereof). Might not always taste the best, but it sure gets the job done!"
36485,Yeah ive had an L.I.T. that tasted like unwashed celery before. It was a pretty rough bar though.
36486,"To be fair, they aren't easy to make properly, let alone well."
36487,it tastes pretty damn good considering how much different alcohol is thrown together
36488,I wonder how many people died getting it jjjuuusssstttt right
36489,"It's a dangerous ass drink for sure. Whenever I'm around someone who orders a Long Island, I'm immediately weary, like ""this person might turn into a monster later tonight."""
36490,"I've been told several times by several different bartenders that I would have normally been cutoff by the sixth LIIT, but they all said that I'm surprisingly not being an asshole.....yay, me!"
36491,I'd rather just do shooters if the plan is blotto.
36492,L.I.T with lemonade not coke!
36493,With Mai Tai Mix instead of the Sweet and Sour and Coke - great for hot summer nights at the pool.
36494,"There is a bar by my house where ""Long Island Ice Tea"" meant ""Fill this cup with an assortment of liquor and splash the top with lemonade"". We love going there."
36495,Rye Manhattan
36496,Just starting in on these.  Haven't made it at home yet.  What brand do you recommend?
36497,"Get the best rye you can afford, Martini & Rossi sweet vermouth, Fee Bros. bitters (my fav), and Luxardo cherries"
36498,Angostura or gtfo
36499,"I work at a whiskey bar and if you want to up your cherry game, buy dried cherries and put them in a mason jar and fill with rye or bourbon of your choice ( we use bulleit, but really Jim beam or something cheaper would work just as well)."
36500,"Martini Rossi is classic, but you know what's better? Dubonnet! It costs more but it's so worth it"
36501,Templeton is a solid middle shelf rye I can recommend.
36502,"Whatever pairs well with what I'm doing. 

Hot summer day? A nice frosty summer ale is in order. Fine steak dinner? Dark red wine please. Dessert? Bring me some port. Chilling on the lake with friends? Pass the jungle juice!"
36503,"Agreed, fully. I live in hipster IPA haven, and the number of people that won't drink an icy Natty Light at tailgate is unreasonable. I like hops as much as the next guy, but even 'crap beer' has its place. My husband and I split a bottle of pricey-as-fuck pinot noir for our anniversary dinner and it was splendid, but I would use it to cook. Context matters!"
36504,Absolutely! I laughed at the IPA haven comment. I'm guessing Seattle or Denver.
36505,"I think San Diego is sorta the American birth place of the IPA, so probably there"
36506,But I don't think hipster when I think San Diego
36507,"I go full circle on Seattle beer snobs by unironically drinking nearly exclusively Rainier. I like good beer though, just not every day."
36509,Ever try Ace Pineapple Cider? Oh so good!
36511,Me too thanks
36512,Have you tried that methanol shit? I've heard it's a real kicker!
36513,"it'll get ya blind drunk, i know that."
36514,Tequila soda mainly because of the low calories. No time for extra fat going down the gullet this time in the season.
36515,Does that work? I'm an alcoholic trying to lose weight. I can usually get myself active and eat healthy but the booze holds me back.
36516,"Yes, it absolutely works but you have to be consistent. Alcohol-wise, beer is the main enemy when trying to lose weight to any effect. You just can't drink it. Wine is a bit better but not much. I stick to the hard liquor and try to limit myself to one or two drinks. I don't know how comfortable I feel telling an alcoholic to stick to the hard liquor but if you can contain yourself, that's what works for me, as far as weight loss goes."
36517,I'm fat in the belly just because of beer. I just love it so much!
36518,Caesar or dark n' stormy.
36519,Red bull and vodka. Little upper with my downer.
36520,Vodka with Sprite. It tastes like sprite and gets the job done. And as long as you dont go full alcoholic you wont get a hangover.
36521,"Well, you never *plan* on going full alcoholic. But drunk you might decide it's a good idea."
36522,"Neat Scotch, Burbon, or any other type of whiskey really."
36523,"Leap Into an Open Grave: 

1 shot vodka, 2 shots Pernod, 1 shot Baileys, 1 shot Poteen, Pineapple juice, a raw egg, and a dash of mint."
36524,This isn't a real thing. It just can't be.
36525,"Cheers Specialty Cocktails ~ Leap in to an Open Grave

“You’re going to like this, I only make it on special occasions.  It’s an old family recipe… My Uncle Joe stumbled across it when he was making a car bomb.  Now keep those glasses moving so the fumes don’t burn a hole in the ceiling.  No one in my family lives past 43.”  ~ Carla Tortelli

“Oh, my God, Carla! You killed her!  Oh, Carla… You made her an Open Grave…  She’s half cold!” ~ Sam Malone

1 shot vodka, 2 shots Pernod, 1 shot Baileys, 1 shot Poteen, Pineapple juice and a dash of mint (as theorized by grad students at the turn of the century) In the episode she also adds a raw egg while mixing."
36526,"Carla, stop trying to kill Diane."
36527,Keep the glasses moving so the fumes dont burn a hole in the ceiling.
36528,Raw egg? Wtf for? Does it just help everything adhere?
36529,It's an emulsifier. In a nog or ale flip it'll make it smooth and creamy. In here it'll feel like a loogie in your mouth because it'll have curdled.
36530,"White Russian, but that's just, like, my opinion, man."
36531,whiskey
36532,Don't mind if I Tullamore dew.
36533,Blanton's.  Sometimes slightly chilled.
36534,[Black Russian](https://en.wikipedia.org/wiki/Black_Russian)
36535,"UMMMMMM..... African American Russian

It's 2017 for fucks sake"
36536,Thank you for giving me a name for such a coveted of drinks. Always enjoy how well the liqueur covers the vodka taste. It ends up tasting like some drankalicous Liqueur with just a bit of extra fire in the after taste
36537,"A nice, heavy stout or a hoppy IPA depending on the season"
36538,Or combine the best of both worlds with a good black IPA.
36539,70% Isopropyl
36540,"I know OP is joking, but just in case, please do not actually drink this."
36541,"Well I mean, I know I probably shouldn't. But I'll still get drunk if I do, right?"
36542,"And really, has vision ever been anything other than a burden to you? :)"
36543,"It's isopropanol, a different chemical to ethanol, the alcohol we usually drink, and iirc the only one we can metabolise. Drinking other alcohols may get you drunk, but will also cause blindness and likely, death."
36544,Whatever is cold and free.
36796,Scotch. Neat.
36546,A Cold One.
36548,There's no other way to do it.
36549,"Whiskey, straight up"
36550,"Vodka and orange juice. Perfect for any meal or occasion. All in all, best way to get screwed is with a screw driver"
36551,amaretto sour
36552,"Fireball. I know its bad for you, but it's so damn good"
36553,"It's not bad for you, is it? I thought it was just bad?"
36554,what alcohol isn't bad for you lmao? drink up fam fireball goes good with anything
36555,Jameson Old-Fashioned
36556,Prosecco :)
36557,Dark & Stormy -- so easy to make but soooo good.
36558,Pint or Vodka Redbull
36559,Whiskey. Neat.
36560,"Bourbon, neat. 

Occasionally I will grab a red ale. With steak, I insist on a nice dry cab, malbec, or pinot."
36561,"caipirinha

Good luck finding cheap cachaça in this part of the South Pacific though..."
36562,double bourbon and gingerale
36563,Moscow mule made with absolut or a cold shiner bock poured in a frosted mug
36564,Ever try a dark n stormy? Its essentially the same thing but with dark rum its fantastic
36565,"The Jolly rancher. Dragonberry,cranberry and a splash of DonQ"
36566,"One of my oldest friends is a bartender, and we've actually come up with a fair number of cocktails together. 

Here are my two favorites.

------

**Blue Topaz**      
\- 1/2 Cup of Crushed Ice    
\- 2 Measures of Sparkling Wine    
\- 1 Measure of Blue Curacao    
\- 1 Measure of Chambord

1. Pour the Blue Curacao into a hurricane glass, followed by the crushed ice.
2. Pour the sparkling wine over the ice.
3. Gently pour the Chambord across the surface.
4. Garnish with two maraschino cherries.

------

**Red Vine**    
\- 1/2 Shot of Jägermeister    
\- 1/2 Shot of Balsamic Vinegar

1. Combine both ingredients in a shaker.
2. Shake.
3. Pour into a chilled shot glass.
4. Sip.
5. No, really. Don't knock it until you've tried it.

------

Beyond that, I like Lagavulin when I want Scotch, and I like to experiment with high-end rum."
36567,"Whiskey Sour if I am at a bar.

Radler (or a Shandy, Arf&Arf, or Alster) when I'm outside on a hot day

White Russian when I'm home (watching the Big Lebowski)"
36568,Captain Morgan's or Kraken and Root Beer. I call it a Black Pearl.
36569,Bourbon on the rocks with a splash of water.
36570,Well whiskey. I'm cheap.
36571,"Gin sodas. They're cheap, easy, low-calorie, and so refreshing. 

I want one now."
36572,Usually an Adios Motherfucker. One or two of these keeps me nice and buzzed for hours.
36573,Can't beat a pint of Guinness.
36574,Brazilian Caipirinha
36575,Red wine.
36576,"Besides beer, a Pim's cup."
36577,The ole Jim and coke always does me right.
36578,Gin&Tonic or Long Island Iced Tea.
36579,"Beer: Hoppy - be it pale, IPA, DIPA, IIPA, IIIPA.  
Rum: Pampero Aniversario is preferred, Appleton Estate otherwise.  
Gin: Hendricks only.  
Tequila: Don Julio is preferred, but most quality options are okay."
36580,Waiting for someone to mention one of the signature cocktails from Danger 5.
36581,"Not sure if it has a name or not: vodka, club soda, grapefruit juice."
36582,"There's no name for that specifically as far as I know, but vodka and grapefruit without the club soda is called a ""Greyhound"". And if you add salt to the rim of the glass, it becomes a ""Salty Dog"""
36583,"For me, it's entirely dependent on the situation and the time of year, but my usual go-to is a half rye, half cognac Sazerac.

However, on a hot summer day, NOTHING beats an Aperol Spritz"
36584,"It depends what I'm doing really. I have favorite bars with favorite drinks. And certain situations (to me) dictate certain types of drinks. It's all about the pairing. 

There's a local bar in town with 92 tequilas available, best place to drink margaritas on the patio on a warm summer night. 

Another local bar has what they call pre-prohibition libations, interesting cocktails you don't see many places. Also, Pisco, which makes a great capirinha. 

Another local bar is an awesome whiskey bar, they make great summer drinks. 

Then there's the Irish pub, where a Guinness, a Jameson, and fish & chips is a must. 

Warm summer day at home, an ice cold wheat beer. 

Cold winter night, a thick stout or porter. 

Making a fine steak, a glass of quality scotch (glenlivit or balvenie). 

Sometimes, I just get in the mood for an islay scotch. Laphoraig and lagavulin are in the cabinet. 

I swear I'm not an alcoholic. 

https://imgur.com/gallery/bXq4p"
36585,Adnams beers or a Guinness.
36586,Laphroaig 10.  It is at the nexus of affordability with amazing Whisky.
36587,"Ever try lagavulin? It's another islay, it's wonderful."
36589,"Old fashioned, no cherry, hold the sugar, extra bitters."
36590,Isn't that just iced whiskey with bitters???
36591,And an orange peel
36592,Oh duh forgot the orange. A non sweetened old fashioned sounds pretty good I suppose.
36593,"I've recently been making similar - whiskey, extra bitters, a few dashes of orange bitters"
36594,Gin and Tonic
36595,Dark rum and ginger or coke.
36596,"Gin and soda with lime

Diet coke (or coke zero) with rum and lime

Vodka soda with lime

Bourbon on the rocks."
36598,"I just searched for [Classic Margarita Recipes](http://www.seriouseats.com/recipes/2015/04/classic-margarita-recipe-tequila-cocktail.html) and found the linked one.  Would you say the one you drink is comparable?  What kind of tequila do you think would fall into the ""quality tequila"" stipulation mentioned in the note on the recipe?"
36599,"I usually order a G&T, Malibu + pineapple juice, or a regular old beer."
36600,Tequila and lime.
36601,A cold lager
36602,Whiskey and Coke. It's manly AND sophisticated.
36603,Apple cider
36604,Dirty martini.
36605,"Vodka lemonade and lime, double. 

It's light and it's tasty. And I can also swap for water/no vodka if required; not that I've ever actually done that."
36606,Obviously a cold one with the boys.
36607,"Bourbon on the rocks.

Preferably Buffalo Trace or Eagle Rare. Two damn good bourbons for under $40"
36608,It was a neat glass of rum. Now it just might be Jägermeister.
36609,An AMF with frozen pineapple cubes instead of ice. Oh hell yes.
36611,"* Beer - Old Rasputin or Lion stouts.  Just incredible.
* Liquor - MacCallan 25 year.  A friend hit a BIG financial gain and bought us all a bottle to share.  Fucking delicious, but I'd never spend $1200 on it."
36612,"Old Rasputin, great call, man. Heavenly and heavy beer."
36613,"Try Lion, it's a slightly better version of Rasputin.  Oddly enough, from Sri Lanka, of all places."
36614,Is it hard to find?
36615,"I live in KS and we even have it around here so...no, probably not."
36616,"No, not really.  I'm lucky to have 2 VERY good beer distributors by me.  Even if I can't find anything, they'll custom order it for me."
36617,Bloody Mary.
36618,"Oh, you know Coleen's sister?"
36619,The most easily accessible cold beer while I'm on a tropical island.
36620,White Russian
36621,Pimm's.
36622,"The 007

A James Bond Classic- Gordon’s Gin, Svedka Vodka and Lillet Blanc Liqueur, garnished with a Lemon"
36623,I like the Johnnie Walker - Blue Label.
36624,Nothing beats a glass of Johnny Walker Black Label with just one ice cube on a winter's night on my couch covered with my blanket.
36625,"A Mojito at [El Mason de Pepe](http://www.elmesondepepe.com/) in Key West. Absolutely perfect - not too sweet, not too minty, with a little umami courtesy of a few drops of bitters."
36626,"Sazerac.

Favourite cocktail, so smooth. Absinthe rinsed glass, sugar, peychaud bitters, angostura bitters and rye whiskey!"
36627,Malibu with pineapple juice.
36628,"Before my uncle died of ALS he used to make ""Apple Pie Moonshine"" in his shed. I had heard of moonshine, but not this variety.

It was like drinking a warm slice of apple pie. Barely any bite, even though it was something like 150 proof. That was a dangerous jug he kept on his shelf."
36629,"This used to be the drink of choice around my dorm room for a while freshman year. Absolutely delicious.

Sorry about your uncle. ALS is an awful disease."
36630,"Vodka martini. Shaken, not stirred."
36631,Irish Trash Can
36632,"Oh, you know Colleen too?"
36633,So you know op's mom by name?
36634,Yes and yes
36635,Jack Daniels
36636,"Where I live it's a shot made by the bar called ""the okanagan asskicker"": bacardi 151, tequila, jd. Definitely sets your night off right"
36637,Lagavulin 16
36638,Please describe!
36639,"I don't drink much anymore (in my 40s), but I like the current trend of alcoholic carbonated flavored water (like boozy la croix). My fall-back drink is a cuba libre (just rum and coke plus lime). I also like tom collins - kind of like a way less-sweet lemonade. Oh, and hot mulled cider is the best.

Edit: OMG, when I was about 21, I loooooved Midori Sours. Way too sweet for me now, but yeah, loved them."
36640,Like the White Claw hard seltzers? I had one at my state fair this summer. Perfect for if you want a bit of a buzz but still want something refreshing on a hot night.
36641,YESSS! That's my favorite brand!
36642,"I was so into the White Claw that it became my nickname with the local liquor store owner, but I'm ashamed to say I'm now super into the Svedka ones.  They're *obscenely good.*"
