idx,text
64699,"Me too, they're so cheap and never had any problems with them."
64700,I love my lunarglides! They're so comfortable....
64701,"I got lunar glide 3's a month ago, I love them."
64702,I was a big Nike Free 3.0 fan until I tried my Saucony Kinvaras...man those things are amazing!
64703,Any news on the Structure 17 release date? Thanks for the post!
64704,"Yeah, time to look at new releases. Let me check"
64706,October 1st.
64707,Where'd you find that?
64708,Nike catalog at my specialty run shop.
64710,"I found a shoe I like, Brooks Ghost, and have never ventured out to try anything new.  Just keep buying what ever previous season's shoe is on sale.   

Will any of these new technologies make a difference for me?"
64711,"I gave the Ghost6 a try and within two weeks had stress fractures. Definitely not for me, though my buddies seem to like them."
64712,"I had a similar experience with the 5's, got tendonitis in both my big toes..no fun"
64713,"I really like Nike running shoes.  I have a heavy foot fall and at 190 lbs my ankles and knees do not like a minimal shoe at all.  I like the Lunarlon quite a bit.  I wear out the outside of my shoes fairly quickly and they keep my ankles from hurting too.  

I have a thick foot with a high arch.  I have owned Brooks, Nike, Asics, Adidas, and New Balance.  I like Nike the best, with New Balance coming in a close second and preferred for trail/hiking shoes.  

It all depends on what you are using them for and how they fit your foot.  Just comes down to what feels best for you."
64714,Spot on post! I get a lot of questions over these shoes and now I have a good source to point people to.
64715,Love my LunarGlides. I've put about 200 miles on them so far and they feel AWESOME
64716,"man, I wish I saw this when I was first getting into Nike shoes.. I like their stuff but the product line is so huge and confusing!"
64717,"I have a neutral arch feet and I'm afraid to purchase anything at the moment. I'm running on really old nike athletic shoes and they seem to be doing the job fine, I'm just worried that Im not getting what I should be getting after my runs. Which shoe is best for neutral arches??"
64718,"No sweat shop shoes for me, thanks.


http://www.businessinsider.com/how-nike-solved-its-sweatshop-problem-2013-5

They've turned things around a bit, but their shoe empire was BUILT on poor labor practices. I still prefer Asics and Brooks anyway."
64719,"Nike and Adidas both make great shoes, so do a lot of other brands like New Balance and Saucony, even Skechers these days."
64720,"The Pegasus, Vomero and Elite 9 are great running shoes."
64721,"Two of my favorite running shoes are by Skechers: Gomeb Razor and Ride 7.  They're killing it, lately."
64722,"So all these brands make good shoes.  Adidas and Nike also make a lot of cross trainers and fashion shoes that are not really designed for serious running.  Brooks, Hoka, Altra, Saucony, etc. basically only make running shoes, so a lot of specialty running stores tend to carry those.  But Adidas and Nike make plenty of great running shoes.  I currently have both Brooks and Nike shoes in the shoe rotation.

Sometimes before shopping for shoes, I'll browse websites that review shoes because I have a general sense of the type of feel that I like in a running shoe and it will narrow down shoes to try out.  Sometimes you can also demo shoes at running store group run meet ups too. One site I like a lot is this one: [http://www.roadtrailrun.com/](http://www.roadtrailrun.com/)"
64723,Yeah that site is great.
64724,"1. Wear shoes that feel comfortable to YOU.

2. The advantage to Brooks at al. is you know you are getting a *running* shoe. Nike, adidas, etc also sell non-running shoes--soccer, basketball, ""lifestyle."" And yes, even at sports stores like Lady Foot Locker. So there is more to sort through when it comes to the all-around brands."
64725,"On the other hand Nike get bad rap on running forums like reddit because someone went to a running shoe store and the salesperson told them that ""real"" runners don't wear Nikes, they wear \[fill in the brand that store sells the most of\]."
64726,Very true. What’s fashionable and what’s actually a good running shoe get mixed up.
64727,Try on at least 15 pairs of shoes at the running store.  Don’t avoid any brands and go with what feels best on your feet.  The more you run the more you will know what you need in a shoe.
64728,"Oh believe you me my wife was ready to commit me for shoe obsession. I must of had at least 15 pairs of shoes delivered by Amazon and then 10 more I get from running shoes and returned.  I feel like I’ve been banned from running shoe stores in the area. I finally have settled on Hoka Nepali, Brooks Ravenna 9 and New balance 1400. 
I’ve been running for over 10 years but have only recently become obsessed with picking the greatest rotation ever."
64729,"Wow, you might have an obsession. :-)"
64730,Ahh Hoka’s. I love Hoka’s! I’ve got ahari 2. And nike zoomfly for my tempo runs.
64731,"I live in the Portland area (Nike's world HQ and Adidas' NA HQ), and I don't see those brands at the forefront of local running communities.  I know that Nike's made some good running shoes, like the Pegasus, Zoomfly, Vaporfly, Lunarglide, and I occasionally see a 'swoosh' during my runs.  I very rarely, if ever, see Adidas, though."
64732,"I ran exclusively in Brooks for like ten years. Then they discontinued the shoe I liked. Switched to Nike and was super happy. But it's really a matter of personal taste. I settled on the Brooks shoe after putting hundreds of miles on several different brands/models. Same with the Nike shoe. Definitely buy from a store that will let you try the shoes out on a short run, and go with what feels best."
64733,Yeah there's a couple of stores here that will let you run on the concrete to test them out.
64734,"The New Balance 320 from 1976 weighed about 9.6oz.  40 years later similar cushioned running shoes still weigh 8oz.  They also have more comfortable midsoles.  For arguments purposes, that may be less than 4 seconds per mile for a typical 9 minute miler. Let's say 1 second per decade or 0.1 second improvement per year.  

There is no real cutting edge in running shoes.  99% of your performance comes from your legs.  All of the running companies make entirely competent shoes. None make shoes that are significantly better than the rest.  Most make their shoes for less than $5 in a third world country. They all have marketing departments.  

We all buy into something.  
- Some of us would never wear brand X
- Some of us only brand Y
- Some of us enjoy being early adopters of each new tech
- Some of us like to be part of each new sub-trend (minimal, maximal, zero drop) 
- Some will wear the same model shoe for 10 years (even if it's changed beyond recognition in that 10 years and so have they)
- Some of us enjoy spending too much on our passion
- Some of us enjoy spending as little as possible on a great hobby that the only gear you really need are the shoes.
- Some of us enjoy reading this Reddit and devour each new ""which shoe is best"" thread.

I'm sure that there are multiple marketing departments that have lots of flip charts with all of these categories and more on them.  They probably know shoe X is more likely to appeal to type F and will probably sell better in NY than Oregon and will ensure that their stores are appropriately stocked the week after runner X wears them in race Y.

Don't even get me started on 100% polyester $50 running shirts  ;-)"
64735,In the future I’m going to try to not spend more than $120 or even $100 if I can. The fact that I’ll have to ditch the shoe anywhere between 350 and 700ish miles makes it hard to stomach a $150 shoe.
64736,"What about mizonu wave rider?
One of the best runners I have used"
64737,I love my wave riders!
64738,"I have the same, i'm actually so worried about replacing them in case nothing ever fits as well as they do!"
64739,"I didn't understand the importance of a great - not just good - fit until I bought a pair of dress shoes that fit me *perfectly*. I mean, literally like a glove. I've been looking for the same level of comfort in a running shoe ever since and I realize now how everything else is secondary, including weight, flexibility or level of cushioning"
64740,Absolutely although one problem I've had is something feels comfortable in the store and then I go for a run on concrete and start noticing problems. I good example is the Nike Free RN. An extremely comfortable shoe and a good running shoe for some people.
64741,"I'm at the point now where I look for certain specs in a shoe - weight, offset, type of support, amount of cushioning - so I usually will try out a few brands with the specifications I'm looking for and go with the one that feels the best in the store.  In my 8 year running career I've worn New Balance, Saucony, Asics, Adidas, Brooks, On, and Mizuno.  I don't really have a preference but I've taken a liking to certain models."
64742,"All the above make great shoes. I personally have 3 pair in rotation right now. An ASICS, an Adidas and a Saucony. The Saucony is my favorite right now"
64743,"In some ways those companies are in the cutting edge of technology. ""Foam"" technology is the latest trend and it really took off under Adidas and now Nike has become the gold standard. 

I've never bought either brands because of personal comfort, but I definitely think every other shoe company is trying to keep up."
64744,"Santa Barbara urchin really is amazing. I recommend that you go to the [harbor/marina](https://www.yelp.com/biz/santa-barbara-harbor-santa-barbara) early Saturday morning, around 8am. There are a few fisherman who sell in the morning, and there usually is a guy with a cooler full of live urchins. If I recall correctly it'll be around $12 / ea. Bring cash. You can probably pay the [fish market](https://www.yelp.com/biz/santa-barbara-fish-market-santa-barbara) close by to break it open for you if you don't know how. Or bring a metal spoon and knife and watch a YouTube tutorial.

I'm not a fan of [Arigato](https://www.yelp.com/biz/arigato-sushi-santa-barbara) - fish is decent quality, but the price is high for what it is. It is relatively good for Santa Barbara, but to be honest a random Manhattan sushi place that delivers to your apartment would probably give you similar quality. If you want to spend a bit more for a unique experience + excellent fish I recommend [Yoichi's](https://www.yelp.com/biz/yoichis-santa-barbara). As a warning, it is more on the fine dining side of things, so I'm not sure if you would want to go solo. 

~~[Ia Fish Market](https://www.yelp.com/biz/ia-fish-market-and-cafe-santa-barbara?osq=ias+fish) is a fish market with oysters / poke within the Santa Barbara public market. Its a pretty chill place to get oysters, and you can check out the other stores / people watch after.~~ Think of this place as the smaller Santa Barbara equivalent of Chelsea Market. I was here a few weeks ago, but yelp says that it is closed. Hopefully not, though. If it is I'm sure you can find some other great happy hour oyster recommendations from other people in this thread.


Go to happy hour at the [Boathouse](https://www.yelp.com/biz/boathouse-at-hendrys-beach-santa-barbara) for some clams, chowder fries, and a beer at a decent price. This is right along a dog beach, so you can enjoy the sunset while seeing some cute dogs run around. If you miss happy hour your food will definitely be on the expensive side, but I believe it runs a bit later than most, to 6pm.



For bar food, I'm a fan of [Llama Dog / The Nook](https://www.yelp.com/biz/the-nook-santa-barbara). Good burgers, and nice beer selection. Expect to spend around $15 for food.  This is in the Funk Zone, which means there are plenty of trendy wine bars to check out after you eat. 


I think Santa Barbara has excellent budget food. [Lily's tacos](https://www.yelp.com/biz/lillys-tacos-santa-barbara-2?osq=lily%27s+tacos) is amazing. I'm a big fan of the lengua (tongue) tacos. Prices of all the tacos are the same, at a low price that you would never find the city. 


If you haven't eaten [In N Out](https://www.yelp.com/biz/in-n-out-burger-goleta) definitely hit that up. In my opinion it is one of the best price / flavor ratio you can find anywhere.


Lastly, as somebody who lived in NYC for a few years, I will tell you straight up that most ""New American"" type places in this city will likely not impress you. Not to say that they are all bad, but I just want to make sure you set your expectations accordingly. 


I hope you have a great time in Santa Barbara! It really is a special city, and you'll definitely find something tasty to eat."
64745,I'a is indeed closed (I saw it a few weeks back.) However I definitely second the early morning jaunt to the harbor! The fresh fish is worth it.
64746,Thanks! I will definitely head to the harbor/marina early Saturday morning. Fresh seafood sounds great.
64747,"Apparently Santa Barbara is known for the urchin, and I'd say the best sushi in town is Arrigato (spelling might be wrong) and has a perfect bar to sit at. A little pricey, but well worth in my opinion. Mony's is my favorite Mexican spot in town, but people die over Los Agaves. Also, if you can, I'd try to eat at Finch and Fork (medium-to-high priced), which is absolutely fabulous cocktails and food, also a good bar to sit at. 

Edit: forgot the most important place. Norton's. Order the Ham and Swiss melt and instead of the ham get the crispy pastrami. Fuck, it's so good."
64748,Dude's from NYC. Probably should not be recommending deli sandwiches to him.
64749,Or worry about pricey recommendations.
64750,I mean the spot was on a famous food show. I'm sure it's pretty good to anyone's standards. Otherwise it wouldn't be on the show.
64751,Once you've had legit NYC Jewish deli pastrami you realize that Norton's is shit. That fish and chips place that was on DDD was also mediocre and has since gone out of business.
64752,Katz's...
64753,Never been to NY so I stand corrected ;)
64754,"I don't believe that Mac's went out of business because of the quality of their food, I believe it was a family decision to spend time with kids. I thought their fish and chips was great and also was the only place I can think of to get haggis in town. Or mushy peas."
64755,Yes! I walked past Friday for the first time since they closed and got so bummed. I loved getting fish and chips and mushy peas and taking them back over to the Joyce.
64756,To each their own but that statement says it all about your tastes.
64757,"Lots of good food in SB so you really can't go wrong. Definitely go to Los Agaves. Lama Dog in the Funk Zone for craft beer, good food, great environment. Arigato is legit sushi but yeah, pricey. Yume Sushi is also downtown and has equally phenomenal sushi without the price tag and long lines. Olio E Limone and Olio Pizzeria are both fantastic. Bouchon is probably the best restaurant in town, but pricey. Ca Dario is a bomb Italian restaurant for less than Olio."
64758,"These are good recommendations. I'd also add Milk and Honey for tapas and drinks. Los Agaves is the best Mexican food anywhere, full stop. I live in San Francisco now and dream of their menu constantly."
64759,Seems like everyone that I have spoken to is raving about Los Agaves. I will have to try. Can't wait!
64760,Agaves enchilada or Agaves burrito for the win
64761,"It's really good, try one of the molcajetes, or the Agaves burrito, or the Chiles Nortenos.

But my personal can't-miss-when-in-SB place to get mexican food is [Corazon Cocina](https://www.facebook.com/SBCorazonCocina/).  The tacos are absolutely incredible, I cannot recommend the Quesadilla de Mercado enough.  Check out a few of the pictures in that link and you'll probably be convinced to give it a try."
64762,I just don't understand the monys hype. Had the nachos and they were not impressive. Nothing
64763,"I just love mole plates. An acquired taste I guess you could say. Also, monys and lillys are the most traditional places I have found imo. Open to suggestions tho!!"
64764,"You're coming from the fine-dining capital of North America, and visiting a town of 90,000 people.  Adjust your expectations accordingly.

Get a fish taco at Shoreline with your toes in the sand.  That, you can't get in NYC."
64765,"Shoreline Cafe is my go-to place for visitors (when the weather is nice, which it usually is). Full bar, good food, choice of sitting on the covered deck or sitting at a table on the sand."
64766,"I would say [Brophy Brothers](https://www.brophybros.com/) at the harbor might be your best bet for seafood.  For urchin, you'll probably have to hit a sushi spot.  [Sushi Go Go](http://www.sbsushigogo.com/), also at the harbor, is decent and no-frills."
64767,"A Ton of the suggestions here are fairly Touristy...Being in the industry for over 15 years, I can suggest the following (Im not going to give you long descriptions, you have the internet, you can look up my recs if you want): 

Lucky's Steakhouse Montecito (Fine Dining) 

The Stonehouse/Plow & Angel at the San Ysidro Ranch (Fine Dining)  

Toma (Italian) 

Yochi's (Sushi) 

Belmond El Encanto (View) - I would recommend the bar menu

Cold Springs Tavern (Sunday Brunch) 

Island Brewery Carpinteria (Brewery)

Ca Dario (Italian) 

Olio y Limone (Italian) 

Bouchon (French) 

The Lark (slightly overrated but delicious - New Fusion) 

... Im sure I forgot some, but hope this helps"
64768,"This is a great list! Only commenting to second two of these suggestions:

1. Toma - SO GOOOOD. My favorite restaurant in town! (Edit: Pretty sure you can eat at the bar at Toma)
2. The trip tip sandwiches on Sundays at Cold Springs (up highway 154) are delicious and the vibe is awesome - biker bar in the mountains with live music around 2 or 3"
64769,Best sushi place in SB is Sakana in montecito. They serve local sea urchin. I prefer them to Arigato.
64770,"My wife is from SB (her family is still there so we go back at least 3x a year). We both currently live in NYC. Here are the spots I always hit up when we go there:

1. [Mony's](https://www.yelp.com/biz/monys-mexican-food-santa-barbara) for Mexican food. They have great al pastor. This is food you 100% can not find at any price level/quality in NYC. Trust me, we've tried. We had them cater our pre-wedding dinner, it is that good. 

2. Los Agaves also really good, they are a bit pricier and ""nicer"" than Mony's. 

2. The Habit for a decent burger. It is more backyard style when compared to something like Shake Shack. 

3. I'll defer to the other posts for sushi/uni. High end sushi experience is better in NYC but there is nothing like fresher product in CA. 

4. Cold Spring Tavern for tri-tip sandwiches. You can't get a proper tri-tip cut from even some of the best butchers in NYC. 

I saw recommendation for Finch and Fork. I'd avoid, you'd just feel slightly ripped off."
64771,"Seafood dive: I highly recommend [On The Alley](https://www.onthealley.com/welcome-santabarbara/) at the harbor. Get the fish tacos or fish and chips and a beer. Ignore the rest of the menu. Sit at communal table or walk out to breakwater. You now win at dates. 

Mexican dive: El Sitio — you know it's legit because they don't have some fancy pants website. Just plastic tables, spicy pico de gallo, and the greatest burritos on earth. Get the rajas or pastor burrito. Get both and eat for a week. IMO, all respect to others opinions etc, Lily's tacos is mediocre and to be avoided. 

Burger Dive: Go to the original [Habit Burger](https://www.habitburger.com/charburger/) location in Goleta. Better than In & Out any day. Then walk down to the Mercury Lounge (bonus round: chillest bar) to drink a beer and play jenga. Or go to the location on State St. and watch as people walk by and glare enviously at your double charburger and onion rings. 

Breakfast Dive: Get an acai bowl from [Backyard Bowls](http://www.backyardbowls.com/menu-2) and walk it next door so you can have coffee from Santa Barbara Roasting Company. This is not even close to the best coffee in town, but go anyway because eating something partially frozen for breakfast requires a cup of hot coffee or tea. That's just math. 

Bonus (not a dive): Go to [C'est Cheese](http://cestcheese.com/cafe/) for lunch. Baked goods, sandwiches, and beautiful seasonal salads, and very good coffee. 

Protip: This town is full (FULL!) of overpriced and mediocre tourist trap restaurants. usually they are suspiciously empty, but some have mastered the disguise of quality (looking at you, Pascucci). When in doubt, identify locals from our tote bags, yoga mats, and patagonia nanopuff jackets and sneakily follow us to see where we eat. 

Good luck & enjoy!"
64772,Yea that in&out comment is debatable
64773,Definitely don't leave santa barbara without trying a habit burger. And if you're looking for really good mexican food I highly suggest Del Pueblo. It's kind of a hole in the wall little restaurant but damn is it good. And it has a cool atmosphere.
64774,I love del Pueblo. I don't think it's a whole in a wall. Its authentic Mexican decor.
64775,"**[Barbareno](http://barbareno.com/)** for something classy (but not overpriced). **El Zarape** for authentic Mexican food (I don't get the fascination with Los Agaves--if you're in the mood for less authentic, **[Los Arroyos](http://losarroyos.net/)** is MUCH better). And [The Blue Owl](http://blueowlsb.com/) is the food I crave when I'm away from SB, fusion food like nowhere else with lots of local ingredients."
64776,"I like Mesa Verde for creative, delicious vegetarian food."
64777,"Try local fare at the Santa Barbara Chicken Ranch. This is a must. Some other favorites include The Lark, Pascucci, Brophy Bros., The Palace, Stone House, breakfast at Tupelo Junction Cafe. There are more I am forgetting, but have a good visit!"
64778,"Boathouse is a great restaurant in general, though it is a bit pricey."
64779,"Joe's Cafe is a solid choice. Good menu selection, full bar and decent prices for a downtown spot"
64780,Joe's food is overrated and in my opinion gross; they do have some stiff drinks though!
64983,"I agree that there aren't good bagel places, the best is probably Bagel Cafe in IV, but that's a trek and it'll be filled with hungover college students. 

Mexican food: La Super Rica, Los Agaves, and Lily's Tacos are all pretty good and very affordable. Mony's is supposed to be pretty good, although I'll admit that I haven't tried it so I can't offer a personal recommendation.

I'm a big fan of Zen Yai for Thai food, and Tap Thai is pretty good too. China Pavilion has greasy/Americanized Chinese food, and China Palace in Montecito has a good lunch special. Something's Fishy has really cheap and pretty decent sushi, but you have to sit at the counter, not the grills. Kai also has fairly good sushi, and it's definitely cheaper than somewhere like Arigato or Sakana. Not sure about Banh Mi, the only somewhat okay one I've had in SB was at Blue Owl, but it wasn't stellar. Noodle City in Goleta has the best Vietnamese in town, but it won't compare to that of LA or SF.

Happy eating!"
64984,Super Cucas and Taquerilla Buen Gusto are also have amazing mexican food for a good price
64985,Seconded Bagel Cafe! Get out there during summer or before 10am on a Sunday and you'll probably avoid many of the college crowd.
64986,"Check out Edomasa for cheap and decent sushi. It's more a late-night spot, opens at 6pm every night. I'll do Daily Grind if I'm looking for a bagel but don't expect NY/PHL bagel quality/taste."
64987,"Ahi IMO is second best to Sakana as sushi goes and it is more reasonably priced. Also you're SOL with asian food in SB. You gotta take the 1:30 min drive to LA for that. 

Bagels, if you like Einstein Bros you can get their bagels at Costco."
64988,"For Mexican food, Mony's is the way to go. Awesome tacos + burritos with a huge salsa bar. Los Agaves and Los Arroyos are also awesome, but are definitely more expensive. Mony's is only open for lunch M-Sat  unfortunately..."
64989,"Mexican: Lily's Tacos (+ Santa Cruz for groceries)
Thai: Your Choice (+ Indo Chineese market for groceries)
Bagel: Java Station
Asian: I do not know any really good /and/ affordable places; there is Goleta sushi house , but it is not perfect..."
64990,You guys should get the Santa Barbara Axxess card. Def worth having if your new to the area and will expose you to different places with the benefits of savings.
64991,"There's not a ton of good Asian food in SB, but Muen Fan for Thai is not bad. 

For Mexican I really love Taqueria El Bajio (their tortas, sopes, gorditas...YUM) and definitely Lillys Tacos. 

There's also Flavor of India for Indian, which is pretty good too.  

Slightly more expensive but Zaytoon has good mediterranean/middle eastern food and a great ambiance, lovely outdoor garden seating."
64992,"Not exactly what you were asking, but if you are just looking for sashimi check out Kanaloa Seafood. Hell check it out even if you aren't. Really good seafood market, probably best in the area. Really high quality."
64993,"For Mexican food also check out El Sitio and Super Cucas. Have to agree that La Super Rica and Lily's Tacos are both some of the best Mexican restaurants in town. There's always Los Arroyos and Los Agaves, but in my opinion those are a bit too popular and packed, and frankly not as authentic and awesome at the other places.

Sorry there isn't as much of a restaurant selection as you'd hope for, but as you get to know Santa Barbara better you'll find some awesome places that you'll love. Welcome to Santa Barbara!"
64994,"Born n' bred Barbarian from the west-side/Mesa so I'm a little biased toward my half: 

Cheap Mexican: El Zarape and Super Cucas are both cheap and great. El Zarape also offers a bit more variety if you're adventurous. Super Ricas is good, but there is a ton of hype around it thanks to Julia Childs (her recommendation was totally overblown). You can always expect a large crowd of tourists and locals at Super Ricas, but the previous joints pretty much only cater to locals. 

Asian food: You're SOL for the most part. No place is down right awful, but don't expect super high-quality, super accurate food. Sushi-Teri on Bath and Szechuan on Cliff come to mind."
64995,"I too was spoiled by living in SD for a few years before coming here. You will never find any equivalent to the quality/variety of Asian cuisine here but I've found Mexican food that makes me happy.

Mexican: Hands down, El Sitio in Goleta off of Calle Real. Many people will say Lilly's which is pretty good but nothing has satisfied me more than El Sitio. If you want good sit-down Mexican food go for Los Agaves. It's excellent quality.

Thai: I've tried a couple Thai places and they have all been kinda just meh... They satisfy the craving but they're nothing like SD places. If you find a good one just let me know, I've been going to Pattaya Thai on Hollister.

Indian: I've tried 4 Indian places here and the best one by far is Tamira on Figeuroa and State street. Best tasting, priced just right, and excellent lunch buffet. The owner is super nice and actually remembers me every time.

Chinese: I've failed to find anything other than greasy American style Chinese food. It's great when I'm drunk/hungover/high but otherwise it's just average so I can't recommend anything.

Pho: I've only tried two places: Noodle City and Saigon Noodle House. Noodle city wins easily. The broth at Saigon was way too salty and the ingredients were scarce. I'll admit I only have limited Pho exposure while in SD but Noodle City is closer to what I like and remember.

Indonesian: Sama Sama is the place to go. Just do it. It's tapas/family style and pretty good.


Honestly, I was initially very disappointed with the lack of cheap, delicious food here in SB (I can't get carne asada fries at 3am? What the hell is that‽). Over the past 3 years though I've found a collection of restaurants that I love to dine at. Admittedly, most of the excellent places are more on the pricey side, but I can still afford to eat there once or twice a month. I can suggest a few places to check out that don't fall into the categories you were requesting:

Olio e Limon and Ca' Dario are excellent romantic (kinda spendy) Italian places. Of all the place I've tried, these were by far my favorite. 

Olio Pizzeria is amazing higher end pizza. They have a good selection of imported beer and make fine cocktails as well. The pizza is delicious and priced nicely.

Milk n' Honey is great tapas. They also have a large drink menu and everything I've tried from it has been exceptional. This is probably my most visited restaurant on the slightly more expensive side of things (it can be cheap, my bill is usually 50% alcohol).

The Lark is, in the words of one of my good friends, jizz worthy. This is definitely a special occasion type place though ($$$).

Brazil Arts Cafe is a good place to go eat some authentic Brazilian food and watch soccer games. Not very expensive either!

Mesa Verde is all vegetarian and vegan food. I was pleasantly surprised by it. The jack fruit chorizo with blueberry chipotle tacos were amazing and I never felt like I wasn't eating something meaty and satisfying.

Cielito's I've been to once. It was tasty Mexican tapas. It was spendy but going during happy hour made it better.

Places that I haven't tried yet but have heard good things about: Blush, Black Sheep, The Hungry Cat, Finch and Fork, and Zaytoon.


Hope your food endeavors in SB go well!"
64996,"Nice write up!  To clarify on your El Sitio, are you talking the one on Calle Real behind 7-11 up on the 7300 block?  Or the one on Fairview which isn't far from Calle Real but just across the freeway?

I think they're both good, but tend to go to Fairview El Sitio as it's a little closer to where I live now."
64997,The one by 7-11 is my go to place.
64998,This was super helpful :)  Thanks for all the suggestions!
64999,"La Super Rica RULES !!! Undoubtedly the best food, second to none - in price, taste, choice, and quality.  However its restaurant ""environment"" is nothing to speak of, - it is what it is.  No servers, you place your food order and pay for it standing at a window, you  pickup the food at a second window, and you eat it on a picnic table under their roofing, or you bounce out and take it with you (always MY choice)."
65000,"Tarascos in Goleta has the best Cubana Torta in town, IMO.  It's like molly for your mouth.  You just want to keep rolling... I have to get it to go because it's so good, as soon as I'm done I want to eat it again."
65001,"First, adjust your expectations. San Diego population = 1.3M. Santa Barbara population = 90k. The reason this is important is some guy isn't going to open an Ethiopian restaurant if nobody is going to eat there. With that said, SB does have some great food, especially with Mexican (people love it here, especially White people).

Mexican - La Super Rica, El Sitio, Del Valle Grill, Freebirds, Los Agaves, Los Arroyos

Asian - this is not about getting good Asian, it's about getting the best _for the area_. Sushi High End - Ahi, Sakana, Arigato. Mid Range - Edomasa, Itsuki, Sushi Teri (I'd argue this is straddling the mid-low line)

What else is bugging you? Lack of: Korean BBQ? an IKEA? Target? Good Middle-Eastern choices? Wild Animal Park?"
65002,"There's actually a Korean BBQ place on upper State, I think it's called iGrill."
65003,"Yeah it died a horrible death because it was terrible. Now it's owned by the Sushi Teri people and it's ok. I don't mean that there's no Korean BBQ in SB, I am saying there isn't any good Korean here."
65004,"Monys Mexican is the best for lunch, Craft Ramen is really good, Tamira is good Indian, Zaytoon is good Mediterranean with an awesome atmosphere"
65005,Came here to say Mony's.
65006,Loquita and get the paella. Sama Sama for tapas and cocktails.
65007,"Here's some low price, high quality options:

Los Agaves

Empty Bowl

Corazon

Lucky Penny

Mesa Verde"
65008,“Low price.”
65009,"Obviously low/medium/high price is subjective, but for high end stuff the list would be things like The Lark, Arigato, Toma, Loquita, Olio, etc."
65010,Cuca's is my favorite burrito. Craft Ramen is in high rotation these days. Mesa Burger is pricy but decadent. Taffy's is dope.
65011,Galanga if you’re into Thai
65012,"The other Thai joint down the street seems to have changed owners, don’t think it was a positive change."
65013,The shop for breakfast.
65014,"Norton’s Deli is a great place to go for lunch if you’re interested in a great pastrami sandwich. I do recommend the “mom’s PLT”. And they sell hot dogs as well. Pretty great, I highly recommend."
65015,Best pastrami sandwich I’ve ever had.
65016,Corazon Cucina is the best ever and the public market is an awesome place to hang out anyways
65017,thanks for the suggestions..
65019,Sushi Teri is delicious but expensive. Kyles Kitchen is high quality sit down fast food. Noodle City & Pho Saigon are both tasty Pho places.
65020,Sushi Teri only if you’ve never had sushi before. There’s barely decent sushi in Santa Barbara and you won’t won’t find it at Sushi Teri.
65021,Besides the unique setting I find Cold Spring Tavern to be not that great. It might be worth it for a tri tip Sammy and a beer but the full dining experience in my opinion leaves a lot to be desired.
65022,Honestly I think Shalhoob Patio has a better tri tip sandwich but Cold Springs is fun for the experience.
65023,I was actually disappointed when I tried their tri tip plate; it was decent but I would take CST's tri tip or venison sandwich over it for sure.
65024,"I don't want to be contrarian but I also don't get the allure of CST. I have been there plenty of times, yes for tri tip and live music and yes for their ""exotic"" game dishes for dinner. I simply don't get the appeal and popularity of it. It's super mediocre food, decor, and service."
65025,"Don't go for the restaurant, go mid afternoon on the weekend for tri-tip Sammy and the music."
65026,Lol I can't believe I mentioned tri tip and music and you still recommended it.
65027,"It’s a piece of Sb history. Way before the hippies and nimbys, before the 101 freeway, before old Spanish days (tourist attraction - nothing to do with real history), there was a stagecoach stop there and that was how gold rushers from SF came south"
65028,No way should La Super Rica be on this list. Is that restaurant ever mentioned without name dropping Julia Child? Give me a break. El Bajio down the street is infinitely better.
65029,I kinda like it on lists because it keeps the local Mexican spots less full of tourists. I get the Julia Child love but the lady didn't like cilantro so her views on best Mexican are suspect at best.
65030,Some people have a genetic issue which makes cilantro taste horrible.
65031,Yeah but I'm not going to take Mexican food advice from those people either.
65033,Lmao true.
65034,My only problem with El Bajio is their price point. I took a group of co-workers there and was shocked at the $13 Tortas. That’s ridiculous!
65035,"I don't get it either.  I've eaten at every Mexican place on Milpas and wouldn't put La Super Rica at the top of those restaurants, much less list it as one of the top restaurants in SB.  I think there was a list of favorite local restaurants in this sub recently, and it didn't seem to have been mentioned there.  The tortillas are good and I like some of the items, but I just don't understand its legendary status."
65036,"I feel like La S-R is still pretty good, and it's still cheap. Sure, you can get more interesting tacos at Lily's, or more complex dishes at Los Arroyos or Los Agaves, but when you just want a simple bowl of cheese and chorizo, super Rica delivers, as they have for decades."
65037,True story. Pipeye blows it away with one hand tied behind its back.
65038,"Pipeyes is amazing! From the fresh tortillas, well seasoned meats, fast and friendly service, solid salsa options, and they take credit cards. I haven't eaten at Super Rica in years but I tend to hit Pipeye at least once a month."
65039,Superrica is where you find all of the dipshits from LA lined up feeling smug because they think they know an insider secret.
65040,It's a good way to get the la tourists to hang out together and stay away from the real spots.
65042,"kinda disappointed barbareno was removed, still think its the best restaurant in town"
65043,"I work down the street. It, unfortunately, was never busy. It's a really tough location."
65044,"I think I've only eaten at Barbareno four or five times, so this is purely anecdotal, but I've never eaten there when the dining room wasn't mostly full, including the bar."
65045,"How did Test Pilot make it on the list? While I enjoy going there, they are not a restaurant. Also, there are a bunch of other swanky places that serve amazing cocktails (Good Lion, Blackbird, Glass-House, and Shaker Mill just to mention a few)."
65046,"I was thinking the same. The title of article even says ""restaurants""!!! I think it's most likely a paid placement article... that or someone on the Eater staff shagged one of the bartenders at TP.

BTW - TP is owned by the group that owns Good Lion and Shaker Mill"
65047,"$5 days its paid advertising, and that group wants to get more people into Test Pilot."
65048,Tiki bars are a big deal
65049,I haven’t heard of half of these and I’ve lived here for over 7 years....
65050,SB law states no one shall be made aware of brophys until the 8th year of their residency.
65051,Get out more?
65052,Do you think this is a knock against the article or you?
65053,I am a big fan of Eater and I am really surprised they made a map of SB restaurants. Thanks for the link.
65054,"Handlebar may still be the best coffee in SB, but it's gone downhill unfortunately. We've been huge fans from the beginning when we still lived there, we loved that place, it could turn a bad day good. Grabbed some drip last time we went through and it was fucking awful, like I've had better donut shop coffee awful. We were actually sad. Every shop has a not great day, but that place used to be really reliable. This happens to so many joints in SB, I'm not surprised. Anyone know of a better place for coffee next time we're there?"
65055,Caje is a name I haven't heard in a loooong time.
65056,"Drive to Ventura and go to Beacon, lol."
65057,"I lived in Ventura form 2016 to this year, I grew up in Ojai. Beacon coffee is just a huge disappointment in every way, I've been to both spots. I'm not into poorly roasted and poorly prepared espresso served by a man bun. What can I say, I'm the worst coffee snob I know besides my bf. We suck."
65058,I'm sure you've both been to SLO. What do you think about Kreuzberg and Scout?
65059,"Funnily enough I'm in SLO now, we haven't been to either unfortunately tho. We've only been coming up here for about two months since we moved and an hour and a half away (we're closer to Santa Maria, but man that place sucks a big one). We will definitely try both places, Scout looks promising!! Thanks for letting me know they exist!!"
65060,"Scout (on Garden, just off Higuera) is always my go-to chill spot when I visit SLO. The interior is delightful, the coffee is great, the sweets are delicious, and they have killer seasonal milkshakes in the summer. Kreuzberg (started by Cal Poly grads) is rad, too. The place is full of art, there's ample seating, they roast their own beans, and they serve breakfast all day. What more could you want in a coffee shop?

Honorable mention always goes to Linnaea's, SLO's first coffee shop."
65061,"Dune Coffee Roasters (French Press' new name), Caje, or Low Pigeon are all great."
65062,"I've gotten so much attitude from people working at French Press in the past, and the worst most overpriced crap I've actually returned it, which I never ever do. My partner used to work at Caje when they were still in Carp, Ryan holds it down as they serve Verve, and the employees are usually nice and make pretty good coffee. We ran into him a while back and he was talking about a new place he was opening, I can't remember the odd name. I'll definitely try Low Pigeon as they are actually roasting their own beans, thank goodness!! SB really should be a world class place for food and drink, but I've always found it meh, people usually have more money than taste unfortunately."
65063,"I've heard that about FP from a lot of people - I'm friends with a couple baristas there so maybe I get preferential treatment! I typically buy their beans more than I get coffee to go, as well.  
  
Caje's new spot on Hayley is super cute - their pour overs are delicious and the lunch menu is an added bonus.
  
Low Pigeon specializes more in espresso - it's a little pricey but definitely the best I've had in town. It's also directly across the street from Caje."
65064,"I haven't been to FP in years, they are probably better now after the rebranding, used to get a lot of snarky boys who thought they had the best coffee ever.

I haven't been to the Caje on Hayley, I think that place was supposed to be the new place, he was saying they were going to do coffee in the day and cocktails at night, but those licenses are hard to get I know. Still a good idea!

I'm excited about Low Pigeon, an old acquaintance is roasting there so that gives me hope. SB needs more places like that, not pseudo fancy eateries everywhere. It's already hard enough to pay too much for rent, people have to have affordable and good places to go so they can enjoy the city too."
65065,"Caje is doing cocktails at night! The cocktail bar is called Lab Social and they block off the front door, play silent movies, have electroswing tunes on in the background, and have a pretty decent selection of drinks! Kind of a speakeasy vibe, though the nighttime entrance isn't too hard to find ;)"
65066,Oh that's awesome!! We'll have to check it out next time we stay over. Sounds like fun!!
65067,It's not on this list (rightfully so) but I went to The Project - Corazon Cocina & Taproom (next to Loquita) the other day and haven't been able to stop thinking about what an unpleasant experience it was. Employees so rude that it was actually kind of funny to be honest. We dealt with at least 5 different employees and the bad attitudes that emanated from each one was astounding. The food was just OK.
65068,"They have the service so wrong there right now. You pay some top dollar for food, and its very confusing as to how it is meant to be done.

In my opinion, they should do order the counter + waiters bringing the food + salsas etc out. Let the waiters have the ability to order more drinks and/or food for those in the Corazon side. I imagine there is some weird laws regarding the waiters serving alcohol from the taproom in back, which is why I feel like this place just isn't meant to be.

Can't have food that pricey / fine, and have it be such a clusterfuck inside."
65069,"Ha! Bibi Ji - hopefully they have their shit together and fired the rude bitch waitress. Went their twice based on friends' recommendation when they first opened. First time we went the RB at the door would not take a reservation and became very rude/condescending to the woman in our group that was trying to make the reservation (oh, that's right, that's their culture /sar). She ended up also being our very rude waitress. 

Second time we went she again was our waitress who became rude when we asked about items on the menu. She got our order wrong, did not deliver all of the food we had ordered but was included on our bill - oh yeah, and charged us for two rounds of drinks when we only received one round. When we pointed that out instead of taking the second round off the bill, the second round suddenly arrives as we are trying to leave!!! At one point we actually started talking about just walking out, then the owner stopped by the table and apologized. Fuck this place if that rude bitch still works there. 

The food is pretty good so it's too bad that they have someone working there that is so rude we will never consider going there again."
65070,"The only restaurants I wouldn’t remove are brophies, la super rica and coldspring tavern (just for the atmosphere). All the other places are overly bourgeoisie hipster places that aren’t special."
65071,Blue Owl!
65072,We went there! Thanks for the suggestion.
65073,Chubbies is low key fire
65074,Buena onda 🤤
65075,"Based on the description you gave in the original post, I second Buena Onda! Everyone else shared a place to get a full meal, and while their empandas are filling, I can usually down 3-4 before being truly full. Huge bonus that you can grab a crowler of Draughtsman or some coffee and donuts from Hook & Press in the same stop to take to a shady park or the backyard."
65076,"Mony's. Quick and easy. Plus, they have the best mole enchiladas in town!"
65077,"bettina hands down best quarantine food i've had so far

 \+1 to blue owl"
65078,Fuck dude I've had some good pizza in my life but Bettina was.... real good. so good
65079,Los Agaves
65080,Harry’s
65081,We just had Harry’s this week & they’ve adapted great.
65082,Mesa burger then walk over to the park next to it.
65083,"Mollie's on State Street is open.  Sat outside with a group of friends for the first time in two months.  Good food, good host, good time."
65084,Barbareno is still solid.
65085,Costco food court
65086,This right here.
65087,"make the trek to el sitio in goleta and get a torta de adobada. 

mmmmmm^mmmmmmmmm^^mmmmmmmmm^^^mmmmmmm^^^^mmmmm^^^^mmmmmm^^^^^mmmmmmmm ^^^^^^^^^mmmmmm ^^^^^^mmmmmmmmmmm


~~If you are first year~~ get on your bike and go on the bike path to the mesa and go to mesa burger, eh, maybe not that kind of journey requires a beer to make it back actually. but good way to see more than just IV if you want to kill a morning/afternoon"
65088,Wait are they no longer on pardall??
65089,since late 2013 (when i started) I have not heard of an el sitio on pardall. 2 in goleta though
65090,Ya they closed on pardall within the past year or so
65091,can confirm el sitio is delicious
65092,Lily's tacos
65093,Lily's is sooo good
65094,"Get the tostada from freebirds. It comes out to $5, and is a filling meal. Not on the menu cause its half the price of everything else. Great deal, very slept on"
65095,My favorite is Buddha Bowls hands down!!!!! I go whenever I have the chance:)))
65096,Chow mein or curry over rice at [Gimeal Cafe](https://www.yelp.com/biz/gimeal-cafe-goleta-4) in old town Goleta.
65097,Haiwai has cheap spam masubi
65098,Is the pho place still there? Hella cheap bahn mis there
65099,Hana Kitchen is pretty good value in my opinion.
65100,Their mini bowl is a whole ass meal. Looks tiny but I almost didn't finish it.
65101,Aladdin's!!!!
65102,Root 217 in ucen
65103,Rosaritos on Wednesdays
65104,Nook at lama dog
65105,Def not reasonably priced though
65106,PizzaRev! Build your own pizza. Soo cheap and good.
65107,Noodle City in Old Town Goleta. So good!!
65108,Honey Bee cafe downtown is pretty great and it has a bunch of vegetarian/vegan options!
65109,"Also there is this boba place in iv, cant remmebr the name, but it was really nice. A popular place to go is also the iv deli to get buffalo chicken fries, its ok in my opinion, but not my fav"
65110,Ike’s Sandwiches on Seville(?) There’s something for everyone.
65111,Hana kitchen
65112,Sushiya has discount days for california rolls. Super good value.
65113,"Tbh, I’d put T-mobile up there with AT&T. Their coverage is pretty good and in some cases faster than them. Not to mention they have a better price. While, Verizon has the best coverage, I feel that they’re a bit overpriced and slower than AT&T and T-Mobile overall."
65114,"Verizon has really good loyalty bonuses

They reduce your monthly payment by $5 after you stay with them 3 mo, and then another $5 after 9 mo.

I have a $40 plan and pay $25, another $5 being deducted necause I have autopay"
65115,When did they implement that? I was with them for years and only ever saw my bill go up
65116,A year ago or so. I also didn't know until my friend changed from ATT to Verizon and ended up paying twice as little as I
65117,"I'll add Verizon also has excellent customer service, and the authorized retailers near me are well managed."
65118,"Verizon has excellent customer service?? That must be regional bc they are atrocious in my area. I was with them as a customer for over 10 years & never had a good experience with a customer service rep ever. Also, never got any incentives for being a loyal customer if anything they treat long time customers worse than new ones I Finally left around 2019 for TMobile."
65119,"From my experience and others local to me, yes they do.  But that could be because they're the #2 carrier here.  ATT is by far the worst locally but also the most widely used."
65120,"Wait what? I've had Verizon for like 10 years and any time I call them to lower my bill they switch me to a ""better plan"" that's usually the same price or a few dollars more."
65121,Yeah I also learned that not long ago
65122,"If you’re somewhere like NJ with Verizon Fios for utilities, they do really nice bundle deals with wireless."
65123,"I had to re-read this a few times but I think I get it 

So after a bunch of loyalty rewards, you pay what I pay for a line normally? Except my carrier pays for my Netflix too.

I'm not sure you're helping the ""overpriced"" reputation."
65124,"What carrier is that? T-mobile? I can't find a plan less than for $60 for 1 line.

Also note that T-mobile coverage is non-existent in Nebraska"
65125,"While they don’t have native coverage, they do have a lot of roaming coverage."
65126,Which is basically emergency only if you are more than a mile away from I-80 :D
65127,Yeah… I haven’t ventured that far out before…
65128,"I’m not sure if it’s changed, but at one point TMobile had limits on what percentage of the time you could be roaming (I think 50%). If you hit that for more than a month or two, they’ll kick you off the service. My sister got removed from our family plan because of it"
65129,"Depending on where you go. In Illinois, TMobile is terrible.  If I travel to DeKalb about 1.5 hours west of downtown Chicago, I lose cellphone signal.  When we traveled to Waterloo Iowa, I literally lost cell phone signal from DeKalb until we got back to DeKalb. In short, Verizon was a necessity for me because T-Mobile was literally costing me too much money for my business with how much cell phone service died out unless you were within one hour of downtown Chicago"
65130,Still varies by area. In my area Verizon is atrocious and T-Mobile is great.
65131,"I agree that it definitely depends on area.

I'm on Verizon and the service coverage in my area is nearly spotless* and I get 5G all over town.

^(Well, inside one particular Publix I can have trouble getting service.)"
65132,"I second this.  I had Verizon for years.  I rarely ever lost service, the only time it happened was when I was in certain buildings that cause problems for all networks.  I switched to TMobile and I hit dead spots pretty frequently.  Sometimes my service will randomly go out when Im chilling at home which is really odd and certainly never happened when I was on Verizon."
65133,"Funny, up in Central Jersey  when we had Verizon it was near perfect.  We have T-Mobile now (company supplied) there are dead spots galore.  

Otherwise they were pretty equal as far as speeds customer service etc in my experience."
65134,I've heard T-Mobile is great on the West  Coast but spotty on the East Coast. I'm on the East Coast and it has tons of dead spots where I am as well. Never had any problems with Verizon and I lived and worked on a military base for a while. You could be in the middle of nowhere on a field opp and still get service with Verizon. Not so much with the other carriers
65135,"T-Mobile was great for me until a few months ago. All of a sudden there was no reception at my house. I'm pretty sure they lost a nearby tower and didn't cop to it. I spent a month working with them to ""troubleshoot the problem"". Having that happen during covid was extra frustrating. We had to change providers."
65136,"Verizon is the best in CO. I hear AT&T rules east of the Mississippi, Version in the West."
65137,"Verizon is top in New England, but AT&T has been catching up."
65138,"AT&T is miles ahead of Verizon and T-Mobile in Western Mass, so much so that I only know three people who don't use AT&T, and one of them is me, and the other two work at T-Mobile."
65139,"Interesting, around Boston AT&T and Verizon are pretty close but head up to NH or Maine and Verizon comes out way ahead."
65140,AT&T is pretty crappy where I live
65141,ATT covers more of MA than Verizon
65142,That's been the case almost everywhere I go.
65143,"I never should have joined sprint. Canceling my service was like trying to take a steak away from a Rottweiler. (,Edit from I'll never go back to sprint.)"
65144,"Well it no longer exists, so it should be easy to keep your resolution"
65145,"I did it a few years ago, and I remember it being super simple. I ported my number out, and they closed my account after the one remaining payment on my phone was auto-drafted."
65146,"That was definitely not my experience. This  was back in ...2007, 2008?"
65147,Depends on what you think best means? I'm with T-Mobile because I can get unlimited talk and text for $25/month with a few gb's of data. I am always by a wifi hotspot and have my music / videos downloaded on my phone in case I'm out without data. That's great for me and my needs.
65148,T mobile support is great for me
65149,"It really depends on where you live and where you use your phone most often. If you often travel outside of urban areas, then Sprint and T-Mobile are kind of useless IMO. If you live in a rural area then ATT and Verizon (or a carrier that uses their networks) are your only real options. I use Visible, they use Verizon's mobile network and it only costs me $25 per month for unlimited everything."
65150,"Depends on what you want, but most Verizon seems to have better coverage by a significant margin, the downside being that their plans are most expensive. T-Mobile and Sprint are combining soon, and Sprint towers are being upgraded or torn down, so it gives me hope, since I have t-mobile indirectly by using google fi."
65151,"It's gonna vary by area. 

Used to have AT&T and parts of the town I live in, a good chunk my commute and some of the places I go to hang out on weekends were all deadzones. 

Ended up switching to Xfinity because my girlfriend has had good experiences with them and I was able to get a bundle with the internet since I was also looking to get away from Uverse. The difference is like night and day.

Back where I used to live it was pretty much the opposite. AT&T was killer and Comcast was hit or miss depending on which street you were on."
65152,"Overall Verizon has the best coverage probably. 

But I've switched from them to T-Mobile about 6 years ago, I guess, and my coverage with T-Mobile has only gotten better. Drove all the way thru West Virginia and didn't lose my signal once, and that was always the worst spot I had to travel to. Plus when I go to the Bahamas I get free data there (and like 100 other countries)

Editing to add: my plan is 3 phone lines with unlimited everything (after 50 GB they can slow you down but it's never happened to me), and 20 GB of tethering data, and Hulu. I think it's $123."
65153,"If you have a 5G phone, T-Mobile is likely the best.  If not, Verizon still wins.  So far T-Mobile is the only carrier to have widely deployed 5G on dedicated frequencies."
65154,Tmobile in my area
65155,T-Mobile can kiss my ass.
65156,"I have T-Mobile. We switch from at&t ac a couple of years ago since at&t had gotten super expensive. 

I like them, I don’t usually have issues with service."
65157,"Same here. We switched a few years ago. Currently paying about $130 for 5 lines, unlimited, an iPad and an Apple Watch. They pay for our Netflix and MLB.tv subscription."
65158,"I don’t understand anyone who thinks ATT is in the running for the best spot. Its coverage is no better than either of the others and its business practices are just horrible.

Verizon’s business practices are shit but it at least has the best coverage to make up for it.

T-Mo is the best company to deal with by a mile and when you have signal, it’s usually good signal (faster). Their coverage is not as good as Verizon though not nearly as far behind as they were a decade ago. If you spend most of your time in cities like I do, t-mo is a no brainer."
65159,"Google Fi. They use multiple carriers worldwide as their network. Best carrier I have had, and especially the best with travel to the EU with by far.

They also have the most consumer friendly data plan I have ever seen. It's $10 per gigabyte for the first 6gb, which is pretty standard if not a little spendy, but once you hit 6gb it automatically just becomes unlimited. If I stay around wifi for the month I just bay the $20 base for calls and texts, but if I travel I know I will never have to pay more than $60 for my data no matter how much I use it. 

It entirely removes the possibility of huge bills for over use of data, and data is part of the exact same plan in most EU countries as it is in the US. I've use it in Italy, Greece, Spain, France, the Netherlands, Belgium, UK, and probably more I'm forgetting, all without paying more than I would for the same usage in the US and without any sort of special plan.

That said, I haven't traveled internationally since January 2020 thanks to all the fun the world has been having, but with all the lock downs I'm always on wifi, so at least it's cheap!"
65160,I have been happy with AT&T but recently we have been getting close to the data cap. I think my wife has been using her phone off wifi more or something.
65161,"Verizon > T-Mobile > AT&T > (Sprint when it was around) for me. I've had a Verizon signal in the middle of nowhere. But T-Mobile was 100% nonexistent on the Oregon coast, I've never had a situation except then, when there is absolutely zero signal instead of just a bad one that's hard to get."
65162,They all suck
65163,"I had Sprint for years (pre-merger) and never had an issue, liked the service and the plan. 3 months under T-mobile and I noped right outta there."
65164,"I've had T-mobile for about 4 years now. I thought they were quite good up until this last year. Coverage has gotten spotty and at times it's just so slow. Been thinking of trying out Verizon recently as I've never had them. Feel their service isn't as expensive as it used to be. 

Have had Sprint/Boost mobile and AT&T in the past as well."
65165,Verizon used to be perfect. Now it’s super spotty. More and more often i can’t get a signal almost anywhere it seems.
65166,I've  had Verizon since 2002 and I usually have a signal when friends on other carriers might not.  But I fee the gap between them all isn't as large as it used to be.
65167,Verizon is generally the best. I don't know who's the worst out of the four.
65168,"Verizon and ATT in my experience have less spotty reception in very rural areas, although in the middle of nowhere-land there's still plenty of coverage holes all over the place.

T mobile MVNOs can be extremely budget friendly, so that's my choice.

T mobile also doesn't follow ATT's practice of banning any device except for a narrow list of approved devices."
65169,I'm loyal to T-Mobile after I had to go to different countries and didn't have to spend on communication because my plan gave me free talk/text/data.
65170,"T-Mobile is great, but then their headquarters is only a few miles away."
65171,"I’ve had Cingular/AT&T for over 20 years, first for about 3 years in Atlanta and now for 20 in Chicago. It’s been good other than a year or two as iPhones first started getting popular and the data network couldn’t keep up. But they’ve been fine for at least the past 5-6 years again."
65172,I’ve had Straight Talk for quite a few years and I haven’t had any problems with it. Of course they don’t own the towers they use to broadcast over. Where I live right now they use Verizon’s towers and some areas use AT&T towers.
65173,In my experience Verizon is the best but it really differs from area to area. A lot of people say ATT is great but it's been really bad in my area.
65174,"Where I live, Sprint/T-Mobile is absolutely terrible. ATT  and Verizon are still the best. They vary by area, but where I live, Verizon probably has the edge."
65175,"T-Mobile is fine. I've lost coverage from time to time, but not enough to justify the other carriers higher costs."
65176,"Kind of a regional thing.  When I was in the midwest, US Cellular was great.  Now that I am back working and traveling not just in the US but worldwide, I use Verizon.  Way better for international calling.  Used ATT before too but did not like their international coverage.  T-Mobile had good international coverage but would drop calls often."
65177,"As far as coverage it is area dependent. From my own experience in a city they typically work with lower signal pockets for each in different places. The moment you get outside a city T-Mobile and Sprint in my area can be very spotty. I have seen places where Verizon is the only one that works and other places where AT&T was the only one. I live in the city and I just use a AT&T MVNO and my wife has a Verizon MVNO.

From my own experience in my area Verizon > AT&T > T-Mobile > Sprint"
65178,ATT and Verizon is the best bang for your buck. I have both (one is work phone) and I rarely have no service. ATT is the worse of the two but the different is negligible for the common consumer. Both city and rural. Sprint is still shit but its going to be moot once they finished the merger with T-Mobile. T-Mobile right now is perfectly fine in urban and city areas BUT its completely unreliable in rural. There are exceptions but youre better off assuming it doesn't work. I know T-mobile has been aggressively expanding their coverage and added with the Sprint infrastructure that may change things. Recent years I've only heard of improvements in their reliability in the urban/suburban areas. I still hear complaints in rural areas.
65179,"I will say this:

As far as it goes, only a few years back T-Mobile sites in our market were just thrown together. They'd give us a couple days, keep as much of it on air as we could, and fuckin get er done.

Verizon and ATnT have high standards, but att is super anal about small details, and run more than they need; a lot of their stuff is still running coax which is a lot slower and more unreliable than fiber optic.

Verizon is nice to build because they give us the materials for it, we tailor build to site design. It always looks real clean to get on a new site.

Now Verizon and Tmo are trying for the same sleek designs as well as running full fiber optic whereas I still see att running a lot of coax.

It's still a pain in the ass to build these sites, but they seem put together a good bit more competent than before.

Can't speak for service. I use Verizon. They cover everywhere I need them too and I have wifi for where they don't. I think tmo might be worth it, but I'd sacrifice hours of coverage at a time when I build their sites."
65180,"I've had Tmobile for like 12 years, they've always done right by me. Strangely, I get spotty service around my house (so I use wi-fi, That's not an issue), but have always had good reception when I go out, even at different areas in the state and when I traveled to Florida."
65181,Verizon is the best. Actually works in the woods and mountains.
65182,In my area Verizon has the best service but I was with them for over 10 years then they changed their plans to no longer include unlimited & my bill was ridiculously high so I switched to TMobile. It's almost just as good for 1/2 of what I was paying at Verizon. Verizon isn't really worth the money unless you travel for work or frequent places with alot of dead spots.
65183,Going to be honest I think I’ve met like 4 people in my whole life who use AT&T
65184,Verizon flawless-att ridiculously expensive in comparison. Verizon customer service is better too.
65185,"They all suck in their own unique way, also depends on where you’re at, it’s cut up like gang territory."
65186,"A few years ago, when I was living in North Dakota, Verizon was the only one that consistently worked in my town. I was on AT&T when I moved up there and had to switch. Apparently AT&T didn't have their own towers in the area. I would even drop calls in my apartment, so Verizon it was. Both AT&T and verizon work in my home town where I live now, but Verizon is better imo. My mom dad and sister switched, because the verizon family plan cost less than the AT&T option. I was already on verizon at that time since I had them from when I moved.

I would guess 99% of people use either Verizon or AT&T in my area. Sprint and T mobile don't get used much here.

If you don't pick unlimited plans a lot of bigger companies have discounts on phone plans if you work for them."
65187,"I would say that GCI is probably the worst cell carrier in the US, but they're exclusive to Alaska so most people will never have to deal with them (be glad, they're *awful*)

T-Mobile is still probably the worst of the nationwide carriers."
65188,Verizon has been the best for me
65189,"T-Mobile is my favorite of the big 4 (3). 

We had em all and T-Mobile is the cheapest, and featured; ie never had a stupid error on my phone about “calling and web browsing at the same time is not supported” - sprint and Verizon 

Att was good but in some areas it’s not as good as other (obviously everyone is like this) and for the price it wasn’t worth it IMO 

T-Mobile also has free shit every week and year (I use mlbtv) 

And overall just a good experience"
65190,"I would say Verizon is the best, it’s way cheaper than at&t but basically just as good, not sure about t mobile and sprint but in my area Verizon would be the best"
65191,"Depends on the area at&t is the worst in my city

Sprint/tmobile are ok"
65192,Where you are is going to have a lot to do with it. More rural areas don't get great Sprint/T-Mobile service but cities seem to do well. I will not switch to them just because I live in medium sized town where you have to go through the middle of no where for like 20 mintues to get to any of the close by towns/cities. I don't want to break down and then not have service. So I stick with Verizon. Only complaint is how expensive they are. Never have had any other issues in the 10 years I have been with them.
65193,"There is really no difference in 99% of places. Verizon is not really that much better than T-mobile in a lot of places but they go by the Apple philosophy of charge more and people assume that means higher quality. The caveat to that is more rural areas or off the beaten path in places like that you will likely find some better than others.

I work on a concrete building that gives a lot of people issues and my work is not far from a concert venue and my T-mobile has SO many less issues with the building than people paying more for AT&T or Verizon and when a concert is going on people I work with that have those tend to see their service more bogged down from the crowds than mine ever has.

A lot of money is spent making people think one is going to be better than the other in a big metro area or along a massive interstate, but rarely have I actually seen that be the case."
65194,"I switched from Mint to TMobile (same network). Never had an issue anywhere in the country, and I've been all over."
65195,"the US is a big country. couldn't tell you nationally, but t mobile is the best where i am. but because of how cell companies have cut up usamerica, it really depends where you are."
65196,"Depends on where you are at... in Alaska, once you are out of Anchorage they all suck."
65197,I use T-Mobile with international data. No issues. I've heard great things about Google Fi too.
65198,Wouldn't Sprint be the worst? I've heard of so many who have switched away from them recently.
65199,"i live in between Iowa, Nebraska, and south Dakota, in the larger city areas, Verizon  has pretty good speed, at&t has decent speed, but on the edge of the cities or just outside of the larger cities, at&t get ridiculously fast speeds, while Verizon slows to a crawl, they both seem to cover the same areas, i just got t-mobile, they don't cover a lot  of this area outside of the larger cities with their own towers, but you still get coverage with them through roaming towers ( usually at&t or cell one NE Colorado towers from what ive seen) and the speed seems to be okay outside of the city"
65200,"What plans are you all on?  My T-mobile bill is $160 a month for 1 line. I’m obviously doing something very wrong.

I have the Magenta Plus plan with the phone protection plan and PlusUp data.

Edit: Changed $200 to $160 (- $40 for phone)."
65201,Yes. I just switched from consumer cellular ($30) to mint mobile ($15) and happy with both
65202,"Are you paying off a new phone as well? If not, that makes no sense."
65203,You’re right on the phone. That’s $40. I put the plan data in the post above.
65204,Whaaaaat? I pay $45 a month for unlimited everything on Verizon
65205,Stetson you are awesome
