idx,text
26291,"They discuss things like affirmative action, reverse racism, P.C. language, etc. It's nothing about white superiority."
26292,"Oh, I guess I didn't really read your first post that told me what category it went in, so I guessed. Changed it to your suggestion."
26293,/r/EconPapers
26294,"Thanks, fixed."
26295,yeah you should also just add every major sub since they all have devoled into politics
26296,Mfw no bisexual Christian progressive libertarian market syndicalist subreddit
26297,"Haha, hahahaha, ha ha  hahaaaa."
26298,"You don't make major strides in politics without stomping over people.

You will never find a genuinely good politician."
26299,Anyone who goes in that profession is not a good person. I don't care what anyone says or believes.
26300,"Sanders, Warren, Pocan, Gabbard"
26301,Beto O'Rourke
26302,James K Polk
26311,Ron Paul
26304,"BS, he’s as corporate as they come"
26305,He was one of the only politicians that read the bills that he voted for
26306,"I totally read the comment as Rand Paul. However, Ron Paul was a self proclaimed Libertarian which is about as pro-oligarchy as one can be"
26307,I wouldn't say that most Libertarians would say at the end of the day your right to choose what you buy it keeps businesses in check
26308,NJ Senator Cory Booker
26309,ron paul
26310,Joe Biden
26313,The hand model?
26314,Drumpf
26315,Ron and Rand Paul.
26316,"Henry Clay was really important towards the formation of the Missouri Compromise and the Compromise of 1850, which were negotiated to ease tensions between the North and South before the Civil War. Of course, we know that didn't work out, but he was still a very noteworthy politician for a very long period of American history."
26317,">> we know that didn't work out

Clay died in 1852.  From that time onward, the awful Civil War became more and more a certainty.  America had lost its middle."
26318,"Good point. I guess I was just viewing the Civil War as inevitable and no amount of compromising could have put it off forever. But history is contingent, and maybe if there had been another Henry Clay calibre politician around at the time things would have gone down differently"
26319,"[The Senate's list of great senators is a good starting place if you're looking for non-presidents that still had a big impact on history.](http://www.electoral-vote.com/evp2016/Info/greatest-senators.html) If you want to understand the South then you've got to know Huey Long (who you mentioned) and George Wallace. Chicago's got a long history of colorful politicians, too, like Richard Daley."
26320,"""Boss"" by Mike Royko is an excellent book that describes the life and career of the first Mayor Daley in Chicago.  Great, quick read if you are interested in a little Chicago political history."
26321,"FDR, Eisenhower, and Bill Clinton are worthy of the list.

If Nixon hadn't devolved into a paranoid mess who authorized criminal activity, he was actually a pretty good one and would have a good rep otherwise."
26322,"If you want some information about president personalities and short histories, I recommend listening to the Presidential podcast by the Washington post."
26323,I think that all of Abe Lincoln's administration were pretty good politicians. People like Hannibal Hamlin and Andrew Johnson were really a driving force behind Abe. If we're going by president id say FDR
26324,"William Seward was too.  Especially considering, Seward was the one that Lincoln beat to win the Republican nomination in 1860."
26326,"This is something I believe a lot of young people (under 30) will realize far too late, whether they are interested in politics or simply a professional type career.  Just imagine how many future senators are killing their political careers right now on Instagram..."
26327,"My girlfriend actually regularly tells me ""I can't tell you this in a text/email, ill tell you in person."" Not sure if she's paranoid or smart (she's super ambitious.)"
26328,"Well it is all being recorded.  In some states any lawyer can get anyone's text message records for barely any reason at all.  Just a law suit against someone.  Its primarily used for proving infidelity in divorce proceedings from what I've heard.  

Edit: this information comes from a report I heard on NPR."
26329,"Wouldn't they have to have some sort of cause to get the records?  Maybe if the accused party needed proof to back up his claim of whatever he was doing (besides cheating), then the accuser could use those statements. But I don't think that they could just take the records because they need that evidence to prove infidelity."
26330,"If it's about drugs, probably smart"
26331,even in person she technically has no privacy.  let me know if you're interested in buying the tapes...
26332,"I'm not so sure, we're basing the expectations of current voters and their general understanding of technology and social media with the voters of the future. Much in the same way as politicians try to seem normal, the guy you would want to have a beer with, past drunken facebook pics or stupid retweets might just show voters that the candidate is normal. Young people who manufacture a social media personality for future political gain would be the kind of psychopath I would run a mile from, who's to say future voters - who will have spent their whole life with social media - won't feel the same?"
26333,As it becomes more commonplace it'll become less serious
26334,In 30 years we'll be electing politicians who have nude selfies in circulation.
26335,What a time to be alive!
26336,"I joined the Navy when I was 18. I had no idea 18 and 22 were so far apart attitude wise.. But I was 22 nearing the end of my time in and new people would get to the boat and be 18 and 19. 

A lot of people don't realize this but 18 - 23 year olds kind of run the Navy. They are the ones out there actually doing the serious things that makes things operate and function. And some of them are morons..

Every time before we'd pull out they'd tell us, *Don't give out dates, times, locations, etc.* And what would they do? (especially the females...) 

They'd go on Facebook and post how our ship (Yes, they called a US warship by name when doing it..) would be here around this time, or over there around that time.."
26337,"Damn. That's...isn't that worthy of a court-martial? ""Loose lips sink ships?"" Did you ever see someone disciplined for that sort of thing?"
26338,Loose tweets sink fleets.
26339,I shit off my Facebook in 7th grade because I had that thought
26340,"> I shit off my Facebook 

Talk about smearing campaign..."
26341,"I have to imagine that Tumblr is probably SMASHING a lot of future careers, and I for one think that's super."
26342,how so?
26343,"Tumblr is like reddit but often less anonymous. They circlejerk about different things but the amount of shit is similar; the difference is that each user has their own blog, and many have their names prominently displayed."
26344,*Tumblr
26345,Fixed that for you Ser Stickler.
26346,"20 years ago, Clinton having smoked pot was controversial to some. Now no one talks about Obama's pot use. 

In the future, there will be more leeway given to sexting, for instance. Almost everyone will have done it. So a dick pic won't kill your political career."
26347,depends n the dick. a microdick wwont win any elections.
26348,I want my president to have a big dick
26349,"And LBJ fan, I presume?"
26350,I voted for Jumbo
26351,Old Lyndon 'Big Guy' Johnson.
26352,And the balls to match.
26353,"Just don't tweet the goddamn pic, fuck."
26354,No one talks about his use of weed because he admited to doing harder drugs and he didn't use a ridiculous line like i smoked but did not inhale. Also you can't criticize Obama's drug use without being a racist.
26355,If your campaign is facing attacks based on what you did when you were a teenager that must mean you did a pretty good job of adjusting to being a professional adult. I wouldn't really worry about this if you are looking to be a politician in the far future.
26356,If people can successfully make a story out of something they will. Do you think obama's minister is really a muslim terrorist who controls policy decisions? No? Well plenty people were talking about it anyway
26357,Or a team of very dedicated volunteers who will go back through your social media history to the beginning of time and delete the sketchy stuff or come up with a strategy to address it if it appears in the media.
26358,I think Snap Chat will end some future politician's career.
26359,"Connections.

You don't have to start with oodles of cash - but you have to have them to get in your position. That's where your friends come in. They introduce you to their friends, who know a guy who owns a business. You promise him you'll keep their interests at heart and...boom! Money. Not to mention a few strings attached.

Soon, you'll meet real politicians. If you're a young up and comer, maybe you'll woo them enough to really back you - a ""fresh"" face to the staunch party lines is always great. They'll vouch for you when they can, hide your mistakes, forgive your shortcomings. There's another string attached. 

Finally, you need to connect with your voters because it's almost reelection time. Your term is only 2 years but hey, in 18 months you're going to have to convince those connections that you've done everything you can to help them out. Better get out and meet new people again!"
26360,"Yup, this is why so many politicians went to super preppy schools.  Being really preppy is a political negative on it's own, but those connections are worth a ton.  Far more than money alone."
26361,Upvote for correct answer.
26362,Money!
26363,"More importantly, friends who also have money"
26364,"And if you don't have friends,  at least have other greedy rich asshole who want the same thing as you."
26365,Or companies who want the same thing as you! Companies are people too!
26366,"You got it all wrong, you don't have to want the same things as companies do, you just have to ask what companies want."
26367,"Don't you worry about blank, let me worry about blank!"
26368,"That's not even necessary, you can just find greedy rich assholes and do what *they* want."
26370,"Buy a mirror. ""Practice Speech"" for 8 hours. Gain 3 friends and 5 acquaintances to move to the next Charisma level. ""Practice Speech"" for 10 more hours. Congratulations! You're the President.

That's ^a ^^Sims ^^^reference"
26371,Would've been better if you didn't mention it.
26372,"As someone who has worked on a successful campaign before, Money fuels elections, but people win them.  You can flush thousands of dollars of your own money into a campaign, but if you don't have a group of dedicated volunteers to help you strategize, knock on doors, distribute literature, etc., you will fail.

To win an election, you need to start long before the election is even announced - building connections, making friends, earning respect of the community.  Once the campaign starts, these friends will become your volunteers, and they will bring money as well as other friends who will volunteer or bring money and so on.

If you have enough people backing you up who are willing to work hard for you, you can win an election with very little money of your own, substituting sweat and shoe leather for money (for us, it was like a second full time job).  Chances are you will likely still need to put up a good chunk of your own money though so that people know you are serious."
26373,♫ It's a hit! ♫
26374,"I'm not entirely clear on the specifics when it comes to American politics but when was the last time a president was elected that wasn't considered 'wealthy'? 

Also, how common is it for an average Joe to be elected to congress? Is it even possible these days?"
26375,Harry Truman had very little money and lots of expenses after leaving the White House. He became president when FDR died and left the presidency with only an army pension and some money leftover from selling his memoirs.
26376,"The important thing is that he got the presidency through succession rather than being elected to it.

But there is actually a pretty cool wiki page on this:

http://en.wikipedia.org/wiki/List_of_United_States_Presidents_by_net_worth"
26377,Doesn't the president receive an emeritus salary in perpetuity?
26378,"Last I checked, something like 3 congresspeople didn't have college degrees. 
(This was on a wikipedia binge a couple years ago though, so grain of salt.)

Not quite what you're asking, but 'average joe' isn't usually included on survey forms."
26379,"Such a waste of talent. He chose money over power. In this town, a mistake nearly everyone makes. Money is the Mc-mansion in Sarasota that starts falling apart after 10 years. Power is the old stone building that stands for centuries. I cannot respect someone who doesn't see the difference.

https://www.youtube.com/watch?v=LYnnm3L12fA"
26380,Actually not true. Running for state congress doesn't require much money in many cases.
26382,"Also, be able to remember everyone's name and at least one thing about them.  If you see someone once, then a year later remember their name and that their grandmother had been in the hospital, that person will vote for you."
26383,"Really, this one. Most responses in this thread are incredibly cynical, but you don't need to be incredibly wealthy (In Canada at least) or a psycho. Charisma and intelligence will get you places."
26384,"Even in the US if you start local you don't need much money and if you're ""number 1"" and can socialize well then you can gain popularity through a good record. 

I always find the question interesting if people get money because they're sell outs or do they get money because they're the best at expressing ideas and have a likable record."
26386,Sup Dale Carnagie
26387,Nixon wasn't a people person
26388,ITT: How to become Frank Underwood
26389,There are two kinds of pain: useless pain and pain that makes you strong. I have no patience for useless things.
26390,"Right when he said that, I knew it was going to be a good series."
26391,"A clean record. No crimes, no pictures of illicit activity on social media, nothing."
26392,Shit man the last mayor of my city was caught on film smoking crack and didn't lose his job. Maybe Canadians are *too* chill sometimes.
26393,"...actually it's my city too. I get what you're saying but to be elected you probably need a clean record. 

Also, Rob Ford is now going to be a joke for the rest of his life."
26394,"the crack isnt ther eason, its all his actions after"
26395,Uhh really? I thought the life of some of the more powerful politicians are filled with escorts and drugs
26396,"Yeah, like that Peter Russo guy"
26397,"No soul, morality, and the ability to lie well."
26398,Or Doug Stamper
26399,One thing. ONE thing.
26400,"No soul = 0 thing

No morality = 0 thing

Ability to lie well = 1 thing"
26401,I think we found the politician!
26402,"No, we found the lawyer!"
26403,Can't argue with that.
26404,We got a congressman here
26405,"*Well*, When you put it like."
26406,/r/firstworldanarchists
26407,So can we just synthesize that all into the ability to not be a human fucking being and exist only as a corrupt hellspawn?
26408,ONE THING!
26409,Every politician ever. There. One thing.
26410,Aka frank underwood
26411,"Money! 

Even the poorest US presidents have been (relatively) independently wealthy before becoming president (though a few hit hard times after their terms were up). 

James A. Garfield - who's jobs before president included university dean, lawyer and brigadier general -  is often cited as having the 'poorest' upbringing. That says about as much as I think needs to be said."
26412,...I need a better job...
26413,Yeah but would you want a president that isn't successful. Understanding money is important when running a country.
26414,"Still, when you look at Romney vs. Obama, wealthy means wildly different things. 

Only successful people rum for the presidency, so they are probably in the top 1 percent."
26415,"> rum for the presidency 

That's my kind of election!"
26416,"I mean to be fair, people are probably not going to vote and gather around someone that was generally incompetent in their personal life for president. Seems to me very obvious that the president would have had a successful career."
26417,"I feel stupid but I now know why Craig Pelton from Community keeps saying ""dean"""
26418,"Lot of stupid answers ITT, I am going to give you an honest one.

I work in municipal government, but I'm not an elected official.  I do hold a separate elected office though.  

If you are talking about local and not national level stuff, what you really need to be is honest, and by honest I mean brutally honest with people.  If something can't be done or something is unrealistic that people might want, you need to be open and honest about it and explain why it can't be done.  Even if people seem angry, in the end they will appreciate the fact that you gave them a straightforward, truthful answer.  

One of the biggest things of my job is the ability to give people bad news and make them understand that there is no simple answer to their problem.

In all honesty, I think that is the best advice.  You need to be social and talk to a lot of people but above all be honest.

If you're looking at national level stuff, most of these people are right you're going to need a considerable amount of money."
26419,Charisma!
26420,"Skin.

Have you ever seen a successful politician without skin?"
26421,"Oh, that's easy: Membership in either the Republican or Democratic Party. You won't go very far without it.

(Given that you're in the US.)

*Edited for words"
26422,The ability to compromise your values.
26423,"Compromise your values or just compromise? I doubt people would be upset if more politicians ""compromise their values"" and came together on issues to govern rather than draw lines in the sand and squawk about who's the most ideologically pure."
26425,YOU ARE ENTITLED TO NOTHING!
26426,[Anyone that posts stuff like this shouldn't be running a country](http://www.reddit.com/r/AskReddit/comments/2uvf5i/what_is_the_moment_you_wish_wouldve_lasted_forever/coc0caq)
26427,"If you are American, faith in the Christian God."
26428,"Here, allow me:

If you are American, professed faith in the Christian God."
26429,"Just claim you've read and follow the teachings in the Christian Bible at some point in some interview really, you don't have to own that identity unless your opponent does."
26430,"Katie Couric: Which Bibles, specifically, have you read?

You: Oh, you know, just all of 'em."
26431,"This is actually really important. Non-partisan polling indicates that atheists are viewed as less desirable in office than violent felons. 

Republicans would rather have a gay or muslim president than an atheist one, which is saying a lot."
26432,A mistress
26434,"A BIG one. Like, 12 foot across."
26435,Are we talking about the mistress or the cigar?
26436,"Eh, which ever takes your fancy."
26437,Why not both?
26438,And my Axe!
26439,"Looking at this post, you need to have good boobs and an attractive figure/face:

http://www.reddit.com/r/pics/comments/2xwixa/the_girl_to_the_left_is_the_danish_politician/"
26440,"You need an education, you need to put in some time working on political campaigns, and you need to start establishing contacts within the party of your choice.  It does not hurt if you have some military or business experience, and lots of money."
26441,An opinion
26442,No morals.
26443,A tie.
26444,Actually winning is better. ;)
26445,Go away dad!
26446,"A broken background, everyone sympathizes with a president with no parents."
26447,President Peter Parker
26448,What if the president was spiders//!!1!!?/?/?////????
26449,What if the spiders were spiders?
26450,What about those spiders? Im scared
26451,What if spiders spiders spiders spiders?
26452,What spiders spiders spiders spiders spiders?
26453,Probably  expend all day on the web
26454,Claire Underwood
26455,Male genitalia. Pale skin would also be up there.
26457,Does that 77% include Hispanics?
26458,Yeup. Whites sans Hispanics are 2/3 the US population more or less.
26459,"But what about Hispanic politicians, where do they rank?"
26460,"Off the top of my head, some of the most prominent politicians in the US are Hispanic. Ted Cruz is top dog politician of Texas, possible candidate for presidency (but not born in the US so let's see how that turns out). Here in Florida, Marco Rubio is the top dog for the Republicans in the state. The governors of New Mexico have been Latinos since probably forever, Nevada has a Hispanic governor, Florida had one, it wouldn't surprise me if Texas, California, Arizona, New York, New Jersey, Colorado, or Illinois had Hispanic governors. There's one in the Supreme Court. The Treasurer of the United States has been a women of Mexican descent 3 times in a row. There's probably more but I can't think of many off the top of my head. I should probably check some state, brb.

Edit: I was mistaken about the New Mexico thing. Only the last two governors were Hispanics (both Republican). Interesting since New Mexico is the only state where Hispanics outnumber non-Hispanic whites. California none within the past century, Texas, none that I see, Florida has that one guy from the late 80s (also R), Nevada that guy still incumbent (also Republican), Arizona 1 from a long time ago, no one else that I know of. Let's check the House: [36 Hispanics](http://pressgallery.house.gov/member-data/demographics/hispanic-americans) for 8% (Latino population is twice this). Although it does kind of make sense since to get into Congress, one usually had to climb up the ladder and have experience, aka they're old and Hispancs made up a smaller percentage of the population back then. The average age of Congress is [60](http://online.wsj.com/public/resources/documents/info-CONGRESS_AGES_1009.html), more or less between both parties and in both chambers.  60 years ago was 1955, where Hispanics were around 2%-3%. But then again, most Hispanics are probably young, just guessing, so make of this what you will.

Here's the list of every Hispanic congressperson ever (excluding local Peurto Rican politicians, for obvious reasons): http://www.wikiwand.com/en/List_of_Hispanic_and_Latino_Americans_in_the_United_States_Congress"
26461,"Male genitalia *and* male gender identity. Trust me, ladies with penises tend not to get too far in politics at the moment..."
26462,Not strictly true.  [Georgina Beyer - Trans mayor and MP](http://en.wikipedia.org/wiki/Georgina_Beyer)
26463,As a trans-woman who kinda wanted to be a politician.. Fucking Rip
26464,"Hey, stay at it. It wasn't too long ago that no one could even imagine a Black president. Or an openly gay US senator. Now we have both those things. Times change, slowly but surly. Don't give up. Someone needs to be the first."
26465,A great poker face.
26466,A marriage.  In America anyway.
26467,Sex scandal.
26468,You must be cunning.
26469,I would say an honest answer would be to be able to convey your message to everyone in a relatable and understandable way.
26470,To have more experience than just obsessing over season 3 of house of cards  **op**
26471,Lack of a moral compass
26472,"A SuperPAC, unfortunately."
26473,Loose morals.
26474,Just a couple corporate sponsors
26475,A pokerface
26476,Lack of empathy.
26477,"People skills, no skeletons in your closet (or if there that won't be found), joining the right political party in the right area. A political belief would be good too, but know many politicians that have no plans/ideas"
26478,[A Leo McGarry.](http://youtu.be/lKWmlIExRAo?t=1m30s)
26479,"Turn 'the death of civility' into the new family values in order to appeal to everyone.

Who could possibly argue against turn signal awareness, [the waiter rule](http://i.imgur.com/564sy.png) or staying off that goddamn cell phone when someone is trying to talk to you?

Tell a few apocryphal rude douchebag stories and you can get more votes than those welfare queen tall tales garnered for Reagan back in the '80s."
26480,A concubine
26481,If you are in america and you want to have succes. You need a christian faith sadly.
26482,[Underboob](http://www.reddit.com/r/pics/comments/2xwixa/the_girl_to_the_left_is_the_danish_politician/)
26483,"Conviction, if you have enough of it you could tell them you will bring gas prices down to $0 and they will believe you."
26484,A unique appreciation for the flavor of donor dick.
26485,"Salesmanship. It's the difference between being funded and underfunded; being voted in or vetoed. If you are a good enough salesman, you can get anywhere you want with other people thinking it was their idea in the first place."
26486,A majority of the votes in your electorate
26488,Be good at lying.
26489,"Integrity.

Lol, jk, money. You need money."
26490,In America: religion.
26491,I thought we weren't supposed to have career politicians.
26492,Lying skillz
26493,A veiny dick... Nah I'm just kidding you'd need a lot of money for bribes though
26494,"More importantly there is something you should not have, a soul."
26495,No conscience or morals
26497,"Mental illness. 

If you can fake it you'll do just as well."
26498,In the US? Money or friends with money.
26499,"well, since you're going to become a politician...you no longer have a soul..."
26500,"A stunning lack of morals, shame, and other things that prevent sane, functioning members of society from becoming politicians."
26501,"I'll tell you one thing you dont need to have!

Honesty"
26502,At least 2 faces
26503,Lie like a rug.
26504,Teeth to lie through
26505,The ability to lie.
26506,A good set of teeth for constant smiling and the ability to lie relentlessly without feeling remorse. Also you need to deliver speeches in a way that it seems you might be taking both sides of a debate without ever deliberately stating what you think. Ride that fence.
26507,"You don't have to have anything but here are something you can't have

1. Spine

2. Brain

3. Heart"
26508,Membership in one of the two parties. You are pretty much done after that.
26509,Questionable ethics.
26510,White skin
26511,The ability to make promises you can't keep.
26512,"A penis. 

At least if you want a good position."
26513,A small dick
26514,"A conscience.

lol jk"
26515,A good bullshit face. Those politicians know when they're lying.
26516,Powers of Deception
26517,Money and no moral compass.
26518,A selfie-stick-camera so you can tell your plans to an imaginary audience
26519,A nice speaking voice.
26520,no brain cells
26521,"This list is not going to be my top 10 favorite games, necessarily, but it covers some of the most common gateway games that almost everyone loves. 

1. **Codenames** - Every single person I’ve introduced this game to has had a blast, even if they don’t play board games. It’s a fantastic game for parties or small groups. It’s a clever word game where you have to give one-word clues to link your target words for your team, while avoiding accidentally giving a clue that suggests your opponent’s words. It plays best with at least 4 but you can go as high as you want because teams don’t get any advantage from player count. Very easy to learn, quick to play, creative, affordable, portable... just all around great game. 

2. **Forbidden Island** - A great introduction to cooperative games. It has a fun theme (treasure hunting on a sinking island) and is very easy to learn, but it can actually be quite hard to win. You work as a team to try to collect all the treasure while keeping the island from sinking until you can escape on your helicopter

3. **Pandemic** - Very similar to Forbidden Island, with a slightly more mature theme and deeper mechanics. You play (as a team again) as doctors/scientists trying to cure 4 diseases spreading around the world before they get out of hand. It can be deceptively difficult and is the natural evolution from Forbidden Island, but it’s totally reasonable to skip to this if it’s more appealing. There are also some great expansions, as well as **Pandemic Legacy** which is a fantastic gaming experience. 

4. **7 Wonders** - This is a great introduction to card drafting games, with a great theme (building and customizing an ancient civilization across the ages). Alternatively, **7 Wonders Duel** is a 2-player variant that’s actually really well made and lots of fun. Another card-drafting alternative that I really love is **Sushi Go**, and in fact I may like it even more than 7 Wonders. It’s super portable too so it’s easy to take anywhere 

5. **Santorini** - It may be personal preference but I just love this game. You play as a Greek god controlling two workers (each god has a special power) on a small chesslike board - it actually feels a bit like chess to play. You’re trying to move your workers around to build towers and climb to the top of a tower to win, but your opponents can try to block your movement or cap off your towers with domes. Simple to learn, but very deep strategy-wise. 

6. **Ticket to Ride** - A classic gateway game. You’re trying to build massive rail systems across the country, cutting off your opponent’s routes and ruining relationships. Very popular among new board gamers because it’s quite straightforward and not overwhelming, but has much more strategy than most “mainstream” games like monopoly or risk. 

7. **Sheriff of Nottingham** - A fun bluffing game, especially fun if you can get your group into the spirit of striking deals/roleplaying the Sheriff. You play as merchants trying to smuggle goods (both legal and illegal) past the sheriff, who must decide which bags he wants to check. You can bribe him to check someone else’s or leave yours alone; you can bluff looking suspicious while having a totally legal bag to trick him into searching you then having to pay you for the trouble. (side note: if your group likes the bartering/deal-making/social interaction aspect, a great evolution is **Cosmic Encounter** - it’s different gameplay-wise, but has some very fun alien-diplomacy/deal-cutting).

8. **Splendor** - A great introduction to “economy/engine-builder” games. You start collecting small gem cards to build up the requirements to collect bigger and better cards, then attract nobles for bonus points. Another fun, simple (but deep), quick game. 

9. **Telestrations** - A really fun and silly party game, best with 6-8 people who have been drinking. Each person has a dry-erase flipbook and you start with a secret word. You pass your book to the left, have 1 minute to draw the person’s word you received, then pass again and now you have to guess a word from someone else’s drawing. 

10. **Terraforming Mars** - I only hesitate to put this because it’s not an introductory board game, but it’s my all-time favorite game and everyone I know loves it. You play as different corporations trying to make Mars habitable while establishing yourself as the most powerful. Tons of variety in the cards and corporations so it always feels new. 

So the above is a list of intro games I’d recommend; but the deeper games I’d recommend after (including the alternatives mentioned above) are: **Agricola** (phenomenal game), **Blood Rage** (better version of Risk in many ways), **Alchemists** (very fun, unique math-y/logic-based puzzle-ish game), **Terra Mystica**, and **Istanbul** (very fun, strategic merchant game)."
26522,I would definitely replace **Forbidden Island** with**Forbidden Dessert** of you are also planning on getting **Pandemic** as Dessert differentiates itself while Island feels too much like pandemic light. I would also put **Sushi Go Party** as the main recommendation with **7 Wonders** as the alternate. Last I would replace **Splendor** with **Dominion** as I feel it had more staying power and scratched a similar itch for me.
26523,Mmm...forbidden dessert.
26524,Slogan of my childhood ༼  ◕◕ ༽
26525,Splendor has been kicking ass as my new gateway game.  Every time I put it on the table a new person joins the fold.  My friends got new boardgames for Christmas this year because of Splendor.
26526,Splendor has become the go-to game for me and my wife - it plays quick but with so much depth
26527,"Yep, agreed. Anytime **Splendor** hits the table, people are all in and want more lol."
26528,"I love both Splendor and Dominion, but i would definitely recommend Splendor for new gamers. Neither game has much of a theme, but Splendor has better art and a more intuitive engine building system."
26529,"But less staying power. Dominion is the better choice, IMO."
26530,"I'm going to agree that Dominion is the better game, but playing on my phone spoiled me. I never want to shuffle physical cards again, lol."
26531,Splendor is easily the best intro game I got. For some reason people won't touch Dominion but will play Splendor. Splendor doesn't look Nerdy it has poker chips.
26532,I disagree I find splendor has huge staying power and is fantastic for casual players
26533,"My initial reaction was why a forbidden game when you put in Pandemic? I like em and all but they are just way to light to last. Especially when you want to play a coop you just bust out pandemic! 

I like the sushi go add and probably the dominion add, but what are your thoughts on Concordia and clank!????? 

I might throw those in personally."
26534,"I thought about that as well but did not go that far. I don't really think you need a stepping stone to Pandemic, it is still the best gateway coop game imho. Haven't played Concordia or Clank! So can't speak for them."
26535,"Nah I think Forbidden Island is just fine as ""Pandemic Jr."". It's good for introducing people to board games or for groups that can only handle super light games (like family nights). If I'm going to up the complexity, I'd rather just play actual Pandemic."
26536,"I'd put **Coup** or **Bang! The Dice Game** in place of Sheriff of Nottingham. Otherwise, that's a great starting point for people."
26537,"I second both of these. These are the only two games I’ve had people purchase on their phones we are playing them. Fast, easy to learn, and cheap."
26538,"My family was more interested in Sheriff of Nottingham, and I feel the bluffing games get a lot more elaborate and funny with it as the game progresses. Bang! The Dice Game is short, but comparatively complex. Sheriff of Nottingham is not complex until you get to the point-counting stage."
26540,Agreed. Feels like the same game to me.
26541,"Definitely. I would replace one with a deck builder. Dominion is my jam, personally."
26542,This is a great introductory list but I would maybe buy a couple of these first and then see if you'd want to move onto more advanced games (aside from Terraforming Mars which is pretty advanced). I found that soon after getting into games I wasn't really excited about playing my introductory games anymore. But some games have more rest value than others.
26543,"This is somewhat true yeah. I still play Codenames, Santorini, Mars, and Sushi Go regularly. Sheriff, Telestrations, Ticket to Ride, Pandemic, and Forbidden Island generally come out with my friends/family who don’t play many board games, but they still get used! 

At the very least, it’s nice to have a set of introductory games to engage people who haven’t played anything but monopoly"
26544,Very true. I'd still any of the games on this list.
26546,"You could absolutely make that argument, especially for people on a budget. However, I do think starting with Island helps ease the transition to Pandemic by teaching you the basic formula; then pandemic teaches you more fundamentals of “deeper” board games (much wider pool of actions and number of actions per turn, much more value in movement efficiency and utilizing your special ability, etc) so I don’t think it’s bad to have both — especially for new gamers. However, if you have some experience in gaming already I’d suggest just going with Pandemic"
26548,"Yeah, as a top 10 to own, just go with one or the other. I own both, but I have way more than 10 games and really own forbidden island in order to play with my niece and nephews."
26549,"I just bought forbidden desert with an Amazon voucher i had for Christmas over forbidden island since ive heard desert is better, what's your opinion on desert vs island?"
26550,Desert is more complicated but has a LOT more replay value IMO. Island is a good introduction to co-op board games but Desert has way more variety.
26551,I agree. My into game has been Desert for a few years now and it’s been way more successful than anything I’ve used before. I don’t even own a copy of Pandemic anymore. Desert is just game even my veteran gaming friends suggest pulling out from time to time.
26552,"Finally! I've been pushing this for years now. Pandemic is a good game but very abstract in its mechanics. Desert just makes sense right out the gate. 

If OP is reading this it will take a second of reading to get it, but don't be intimidated it's very basic and fun for years."
26553,"My very first game of Desert I played by myself to learn the rules. Normally, I find a solo learning game to be really boring, but in this one I managed to enjoy the experience, especially thanks to the way it ended:

I was down to my very last drop of water. I had gathered all of the pieces of the ship and was making my way back to the launch pad with no equipment or anything. I try with all my might to reach the pad, but I stop just one move short. GREAT, I think, this is it. It's time for the storm, and if I draw one sun beats down card then I'm dead.

I start drawing and the storm is doing its thing, and on the last card the storm BLOWS ME AWAY from the launch pad and buries me, salvation suddenly further out of reach. Through sheer calculation and determination I was able to land on the launch pad with my final action and win the game.

Since then, me and my friends and family have played it countless times."
26554,Am reading ;-)
26556,"I haven’t played Desert, but I’ve also heard from plenty of people who prefer it to Island. It changes up the formula a bit and sounds like it has some fun mechanics; I bet it’ll be great!"
26557,I've liked Desert more than Island. They're similar but the sand storm mechanic had been more interesting to my partner and I.
26558,"Have not played desert, but Island, IMO, is very simple.  We usually play on an easier setting because games should be fun, but the rules are pretty simple and it loses replay as a result.  Would love to try desert because more mechanics are fun to me."
26559,"Forbidden Island is VERY basic. Great for teaching children cooperation. Great intro to coop games for anyone but as adults, my family played it once, enjoyed it, but not enough to play it a second time.

I've heard Desert is better for adults/experienced players."
26560,"I guess I'll be the lone person saying that I like Forbidden Island more than Forbidden Desert, only because Forbidden Desert feels a lot easier to win. I enjoy the mad dash to escape at the end of Forbidden Island, where you know that despite making the best moves you could've, you can still lose if you're unlucky. 

Of course, you can still get screwed over by randomness in Forbidden Desert, but it's more of a slow death if that makes sense. I agree though that it has more interesting mechanics, with the sand and the sliding tiles and all. Both are fun, hope you enjoy it!"
26561,"I think viewpoints in this subreddit are somewhat skewed, as in my experience more people prefer island to desert. It's simpler, yes, but it still gives off a great ""skin of your teeth"" feeling almost every time you win"
26562,"Just to add to the chorus, Desert is the better option. You have a lot more freedom of action. And better feeling of exploration.

Island to me feels tight, but is too simple to find the best action."
26563,"Interestingly the theme of Ticket to Ride is not about building routes, you are racing to travel more trainlines than your opponents in a great race like scenario.

But everyone feels like they are building trains."
26564,Whu...whu...whu...WHAT?!
26565,Why do you think it's called **Ticket to Ride** and that you are given **Destination** cards?
26566,"I am new, and just getting into the boardgame / tabletop world. I was wondering which of these games have the most replay value? Since I currently have somewhat limited funds I'd like to get a couple games that will last me longer than a few hours. Obviously this is very different, but Cards Against Humanity is an example of a fun game, that becomes dull after a couple hours of playtime. Any suggestions if I am only purchasing maybe one or two board games a month to build a nice collection? Thanks. Currently I play games like Munchkin, Settlers of Catan and Secret Hitler. Thanks!"
26567,"Pandemic is what you are looking for. Get Pandemic or Pandemic Iberia. Pandemic Legacy (season 1 and 2) is not what you want, as they have a limited number of plays in the box (minimum 12 plays if you win every game, maximum of 24 if you lose every game)."
26568,"I'll definitely look into it, thanks for the suggestion, friend."
26569,"Terraforming Mars has held the most replay value for me so far. The game itself takes a couple hours to play, but it’s always a blast and it’s somewhat of an evolution from Catan. It also has a decent solo-play variant. 

If you like Munchkin, Cosmic Encounter plays very similarly (you play attack-value cards and other players can add to yours to help you, or add to your opponents to screw You) but is considered a much better game. It has TONS of aliens, each with a unique power, and many expansions, so lots of replay value. It can promote some fun player interaction with trying to squeeze alliances out of people before backstabbing them later. It’s pretty widely loved in the boardgame world. 

Additionally, I’ve had a blast with Santorini. It works best as a 2 or 3 player game, and the games are usually quite quick; typically we’ll play 3-5 matches in a row before moving to a different game, but I’m always down for more so I think it’s got lots of replay value. 

Lastly, Codenames has the most replay value of the party games but you probably will be ready to move on after a couple hours. However, we’ve never gotten tired of bringing it out. So we’ll usually get a good 2 hours out of it in a night, then be ready for more the very next night. Not bad for such an affordable game (and Codenames Duet is supposed to be a great 2-player variant). 

I’d add that the “deeper” games like Agricola and Terra Mystica will have much greater long-term replay value, but they’re consequently more difficult to learn as a new player."
26570,"Thanks a lot for taking the time to respond to my question! I'll look into Terraforming Mars, and play a couple games of it on Tabletop Simulator before I decide whether or not I want to get it, but I've watched a couple videos on Codenames, and it seems like it would be really good for me to introduce some of my friends to something other than Monopoly / CAH."
26571,"I'll add that telestrations is very enjoyable, but especially if you have a little kid or two in the mix. Somewhere around 4-6 years old. Where they kind of understand what they're looking at or reading, but can't really write or draw. You know, a young drunk person."
26572,Everyone loves Codenames but you have to have a nominally competent set of players and a large party to make it worthwhile.
26573,"Although it is fun with a big group, I've had some amazing nights of playing Codenames with only four people, and even some great times doing cooperative two players over wine with my SO. Just a different experience."
26574,I prefer Codenames with 4
26575,"We tried Codenames *once* with 4 people and there was a lot of downtime, minimal engagement, and the game mechanics were too simplistic for it to be actually interesting/fun.

I've watched so many reviews but I'm lost on what keeps people interested about it. A game of Betrayal at House on the Hill, or Pandemic kept people much more engaged. Personally I also like Azul, but I can't tell if I'm the only one, yet."
26576,"I don't think any Forbidden game needs to be on this list as Pandemic already covers the co op mechanic very nicely. I'd rather put in either Resistance, One Night Ultimate, or Secret Hitler to cover the bluffing/betrayer genre of board games. Other than that it's a pretty complete list."
26577,I'd add Camel Up to your list. :)
26578,"Why no catan? I'm no expert, and the only games I know on your list are Splendor and pandemic, but settlers of Catan seems such a lovely game to get people hooked."
26579,"I guess I left it off because it’s got much more name recognition than these, so most people already know about it and it wouldn’t contribute as much to the list. 

I agree, though, that it’s a good gateway game. I was really into Catan for awhile which ended up feeding my interest in more board games."
26580,"Catan also gets quite a lot of hate from this subreddit. People think it's too luck based. Honestly after all the more complex games I now own, Catan still sees play in my group and I always enjoy it."
26581,I think **Ticket to Ride** took over **Settlers of Catan** as *the* gateway game. I think it's a more time efficient game and each turn you can do something (unlike Catan where bad luck can cripple you).
26582,"I've actually picked up two copies of the 12 player pack for Telestrations so we can play with large groups.

It's a total must play and we always look forward to being able to play it.

My advice for the game is to effectively forget about the rules entirely. Ignore the dice, ignore the drawing and writing rules, just do what is fun. It's a game built on the foundation of simply having a good time.

We also frequently pull out other games for cards like Bucket of Doom and CAH. That really gets the ball rolling lol"
26583,"Oh yeah we ignore the point system, it’s all about hectic ridiculous drawing fun. We keep the dice but we’re not strict about enforcing it, and we keep the time limit + “no words” rule. At the end we usually just vote (loosely) on whose notebook turned out best overall and they “win”. Really it’s all about the laughs"
26584,"Tellestrations is a scam. Just get paper, cut it up in 4ths, and number all your pieces of paper. It’s all about the laughs anyways. Used to do this in college all the time"
26585,"I would honestly replace Agricola with Caverna. You have a solid list though.  A newer game that I kick-started that I absolutely love is Cthulhu Wars. Similar to Risk, but huge on strategy and depth."
26586,"Forbidden Desert >>>>>>> Island by a vast amount, there's no reason to own island."
26587,"I’ve heard this, but I never actually played Desert while I have played plenty of Island so I hesitate to make that comparison without experience"
26588,"I'm only recently getting into board games (asides from playing a bunch of the classic family games when I was younger) and read a lot of great things about Pandemic Legacy. Just curious, but would it be too much to take in going straight to that without having played the base Pandemic game? Also, do you know of many other games that I would enjoy after really getting into Settlers of Catan after only a few times playing?"
26589,"The nice thing about legacy is that you can play the base game on the legacy board prior to starting the campaign. Just play a few rounds ( you might want to look up instructions online rather than try to follow the rules from the legacy manual, I’m not sure how confusing it would be otherwise) with the one objective of finding cures to all four diseases. Ignore the trigger of looking through the legacy deck at the second epidemic or whenever the trigger is. Definitely doable."
26590,"So I had played Pandemic once before, and my boyfriend and our friend had never played it, when we got Legacy. We played vanilla pandemic using the Legacy game (just ignoring the extra components) until we won a game, then we moved onto the Legacy stuff. I think that’s the best way to do it, because you do want to understand the game well before starting your Legacy journey since mistakes in early games can have consequences on all subsequent games. It’s a fun experience for sure though. 

Some of the games I’ve found to be Catan-like are Terraforming Mars and Agricola, maybe Castles of Burgundy as well. These are all notably more complicated to learn, but give a deeper experience as you aren’t entirely at the mercy of dice rolls and can plan your actions more meaningfully. I’ve also heard Caverna and A Feast for Odin are similar/just as good as Agricola. Basically, they all revolve around building your colony/settlement/estate by strategically acquiring resources or resource producers"
26591,what's your favourite board games?
26592,"Right now my top 3 are Terraforming Mars, Agricola, and Castles of Burgundy"
26593,"There are many ways to classify boardgames and I think you should first think about what kind of gaming experience you want before reading all of these lists. Here's what you should look for:

**1) Number of players:** Some games are deigned exclusively for 2 players, while others are designed for higher player counts.

**2) Weight:** Not all games are equally complex. Weight is subjective, but if you want a general idea:

- *Light:* simple rules that can be explained in <5 min. Most of these games play fast as well, usually lasting 5-30 minutes. Some of these are also labelled as party games. Usually come in smaller boxes and don't take too much table space.

- *Medium:* slightly more complex rules. Usually can be explained in <10-15 minutes. Tends to last longer too, around 30-90 minutes and often takes more table space.

- *Heavy:* complex games with lots of rules. Usually take >20 minutes to explain and >90 minutes to play. Often take the whole table. Some of these games you need to play a couple times before you get a good grasp of the strategy.

**3) Type:** Games are often classified by the mechanics they use, but for now the main thing you should know is:

- Cooperative vs competitive : Some games are cooperative, which means players are working together and trying to win against the game.


Now if you want suggestions, I would reccomend sticking with light/medium games at first and then work your way to heavier games if you think these would interest you. Many other answers to this thread have some great suggestions."
26594,"Faves in my group in no particular order:

**7 Wonders** is a good solid light (vanilla) to medium (with multiple expansions) weight game that everyone seems to like.

**Scythe** is definitely the new hotness in our group. By Kheinom's definitions it pretty much marks the medium-heavy border (I expected it to be well into heavy), and it's just a really well-thought-out design in general.

**Lords of Waterdeep** is another solid contender for the ""middleweight champion"" spot.

**Ticket to Ride**, preferably with the Europe board, has repeatedly shown itself to be a fun, surprisingly light gateway title.

**Amun-Re**, haven't seen anyone mention this auction-based medium-weight title but it's been a favourite since I got it for my brother-in-law for Christmas a few years back.

Lately our lightweight game of choice to start off the evening's entertainment has been **Karmaka**, an easy to explain little card game with lots of room for enjoyable skulduggery. (This spot could easily have gone to **Exploding Kittens**, but there's one guy who really doesn't care for it so it gets played a lot less than it would if not for him.)

We're actually kind of split on **Race for the Galaxy** but those of us who like it, including myself, *really* like it. Others prefer the mechanically similar **Puerto Rico**; I can't get into it as much but that's probably partly because I'm really good at RftG but decidedly mediocre at PR. I tried **Roll for the Galaxy** and thought it was even better, but I've only played it the once so I don't have in-depth knowledge there. Race plays best with the first two, but not the third, expansions, or with Alien Artifacts but no orb game. Anyway, consider this spot to be occupied by whichever of these three games you like best.

**(Settlers of) Catan** is a classic for a reason and still gets brought out reasonably often. I like it vanilla but most of the other people I game with greatly prefer it with the Cities and Knights expansion. We have pretty thick skins and so aren't one of those groups that needs to play with unwritten house rules that you can't use the robber to maximum effect and so on, but it must be admitted that we have had some games of this degenerate into very un-fun scenarios where some people had no chance of winning. But it still has enough going for it, even with its reputation for ending friendships, to make the list if only because without this game lots of the others mentioned here wouldn't exist.

We haven't been playing it lately, but **Pandemic** is one we've had hella fun with. The knock against co-op games like Pandemic is that in a lot of groups one person ends up playing solo with the rest just moving pieces around at their behest. But pretty much everyone I play these games with loves Pandemic. I guess we have the right combination of compatible skill levels, respectful ways of giving and taking advice, willingness to take each other's ideas on board, and when all else fails thick skins that the table-talk never degenerates the way you sometimes hear about. Actually, in some play-throughs I'm one of the dominant players and in others I just can't brain and actually welcome the opportunity to let others do the heavy lifting, go on autopilot, and still feel like I'm part of the game.

There's a few reasonable candidates for the last spot but I'm gonna go with **Power Grid**.

___________________________________________________________________________

So there's a top ten, albeit unordered and with one of the ten spots in a quantum superposition state among three games. A few others outside the top 10 I'd like to say a few words about:

Probably the heavyweight (heavier than Scythe) game we've had the most fun with was **Clash of Cultures**. I've enjoyed **Terra Mystica** far more myself, and if I were just giving my own opinions here rather than trying to synthesize those of my various game peeps TM would easily have made the above list. But until I got it for Christmas last week I'd only ever played it at cons and otherwise outside my usual circles. I definitely look forward to inflicting it on my friends.

Honourable mention to a relatively obscure game I won at a con, **The Dutch Golden Age**, which turned into a surprise hit with our group. Just a nicely put-together victory point Euro with genuinely multiple paths to victory."
26595,"Cut and Eugene have given great meta answers, so I'll just give my list of 10. These are pretty much the first 10 games I owned, and are mostly gateway-style, easy-playing to help get your buddies into the hobby. (The numbers aren't a ranking, just a way to let me keep track of how many I've said.)

1. **Settlers of Catan**
2. **Ticket to Ride**
3. **Love Letter**
4. **Castles of Burgundy**
5. **Carcassonne**
6. **Pandemic**
7. **Codenames**
8. **Dominion**
9. **Cosmic Encounter**
10. **7 Wonders**

Honorable Mentions:

* ""Two-players only"": **Jaipur**
* ""I'm ready to go deeeeeper"": **Agricola**
* ""My personal favorite, a.k.a. I hope you have 5 hours to spare"": **Game of Thrones 2nd Ed.**
* ""Perfect theme/mechanics mix"": **Battlestar Galactica** 
* ""I like zombies"": **Dead of Winter**

Hooray subjective lists! So, whatever, top 15."
26598,"My ""significant problem"" with Catan for groups of mixed experience is that so much of the game is determined during the initial placement portion. The experienced players have a huge advantage that can't really be rectified short of taking decision making away from the newbies, which is suboptimal to say the least. Dice randomness to me is dice randomness (and can be eliminated via Event Cards), but I'm sure plenty of people consider that a significant problem as well."
26599,I tend to agree. It is pretty rough to new players and has no way to catch up if you have a poor start.
26600,"Isle of Sky is better Carcasonne in my opinion, go with that instead if you want a game of that style."
26601,"Disagree. While isle of sky may be the better game for gamers, you can teach literally anyone Carcassonne and keep their attention (especially if you take out farmers for the first game.) It's the perfect way to get hesitant people into games and is really good to have around because of that."
26602,I always explain how farmers work either at the second game or once we've already gone through most of the tiles
26603,The style of game is very different though. Carcassonne is about territory control. Isle of Skye is about objectives and the market mechanic.
26604,"All of these lists are going to be different but for someone new I would tell you to consider these games: 

**Magic Maze**: a cooperative maze running game that's best at 4-6 players. You and your friends work together in real time to move each character with each player being assigned only one direction of movement. 3-15 minutes, $25

**Century: Spice Road**: a fantastic little game for 2-5 players about acquiring spices and turning them in to score points. It's between print runs right now but you can buy the beautiful Golem Edition for $40 from the publisher (Plan B Games). 30-45 minutes. 

**Junk Art**: the best time 2-5 players will ever have stacking things on top of other things. Easily converts to drunk art with the addition of alcohol. 10 mins, $30. 

**Sushi Go**: a very simple drafting game that's accessible for anyone. 20 mins, 3-6 players, $10

**Azul**: a beautiful tile drafting game for 2-4 players. Somewhat mean at four, cutthroat at two. It's on between print runs right now but retails for $40. 

**Santorini**: a great little two player game that gives that chess like feel with beautiful components and enough variety to keep you coming back. 

**Good Cop Bad Cop**: a 4-8 player deduction game where each team is desperately trying to find and eliminate the other teams leader. 15 minutes, $15

**Monikers**: what charades was always meant to be. Laugh out loud hilarious. Don't play it in public. 60 minutes, $25. 

**Concept**: a brilliant little game where one player tries to communicate a concept using a board of symbols. 30 minutes, $40

**Klask**: basically air hockey the board game. I could play this all day long. Highly, highly recommend. 15 minutes, $50."
26605,I second Magic Maze.
26606,"Great additions. Both lists look like they have good recommendations and your list has a few games I hadn't heard of.

I'll be checking out Klask and Good Cop Bad Cop. Thanks!"
26607,Magic Maze is great. It's a new game from this past year and is an excellent party game.
