idx,text
38501,"I read it for the comics and the puzzle page, on weekends I like to read the article that some crazy preacher writes. It lets me feel smug and superior."
38502,"I read the Boston Globe when I'm home for the summer because my parents subscribe to it. I read my school's paper occasionally. 

I'm not sure if I would pay for a subscription myself though..."
38503,"I think it's better if everybody switches to e-papers. We save paper/trees, information is a click away, it's easier to read, and we have access to the LATEST updates. As much as I love newspapers(they were a big part of my early years), I must accept that electronic mediums are more feasible. Nothing like reading the news off my PDA on the way to work."
38504,If the Economist counts then I've been reading that for the last twenty years (eek). Find me something more perfect for consumption on the throne and I might change my ways but electronics and bathrooms simply do not mix.
38505,My mother.
38506,"When I was growing up, there were 4 newspapers in our city & we received every one.  Today, I receive the WSJ six days a week, local paper seven days & almost daily read at least one (of the remaining 2) of my hometown papers online."
38507,"I often read one of the crappy newspapers that are in dutch busses when i go to school, and we have get a newspaper at home every day (except for sundays). I like reading newspapers who are actually made of paper more than e-papers, just because paper reads better than pc-screen."
38508,"I read Baltimore's City Paper every week (or as close to it as I can get). It's an independent free paper with a focus on city news, local music and arts and has awesome columns like Savage Love and comics like Maakies. Their website is pretty cool, but it's awesome to be able to leaf through something now and then."
38509,THE WIRE
38510,"I haven't read a newspaper or watched the news (in full) in several years. It's just disappointing to have to wait days for information that I learned online, or where the only new information is a local murderer or rapist. 

Throughout my childhood I always looked forward to reading the newspaper before school, but now it just isn't good enough."
38511,The newspapers I get for free in the morning and evening in the metro/subway
38512,"I read the funnies, when I'm out to breakfast."
38513,I read the free ones they gave out at the subway station.
38514,I can't have my morning coffee without picking up The Onion.
38515,I only get the Sunday paper for the coupons.
38516,"I get the NY Times everyday, thanks to my neighbor being a delivery guy (there are always a few left over that otherwise just get junked). I rarely read the thing, tho. I get most of my news online. They just pile up until I have a moment to pull out the special sections (Tuesday Science rocks!) and I read through them in the bathroom. 

The only paper I actually read through is our local freebie, the Mountain Xpress. It covers local politics, culture, happenings, opinions and other local interest stuff. The writing's good and it's all stuff that's actually relevant to me on a day-to-day basis. It gets read cover to cover. Other than that, not so much."
38517,"I used to read the paper a lot and even convinced my parents to upgrade from a Sunday to an everyday subscription when I was a kid. Now I'll only occasionally read the paper, usually if one's around and I'm not especially busy.

The internet just makes news far too convenient."
38518,"I read the metro paper 3-4 times a week, mostly just to spend time (as the paper is written by leftist retards). And if I'm eating at a restaurant, I'll often try to get a hold of a serious newspaper if it's available."
38519,"Depending on the included magazines, I'll buy one every sunday."
38520,"I recently started reading a metaphysical newspaper. At least, I think I did."
38521,"i read my local weekly.  not cover to cover, but it's always got something worth reading in there.  mostly just reports of local wildlife and athletes, but still not something i'm going to find online."
38522,I do the crossword at work and sometimes read the rest. But only because my work doesn't allow the internet.
38523,"I read the Sun-Times every day until I moved out of my parents house, just no reason to subscribe to it anymore because of my job.

I work at a newspaper and I don't even read those things."
38524,"I read the newspaper (Dutch newspaper NRCnext, for those interested.) every day of the week, unless it's delivered late. I have to leave the house at 7:00 every day, which means I have 20 minutes to read the newspaper. It is delivered by an old couple, and when the weather is bad they are sometimes late. I curse those mornings.


Then I read a free newspaper (the METRO) every day on my way to university, and a different newspaper on the way back home. In the evening I'll finish my morning newspaper.


In the weekend I read the Saturday issue of the NRC newspaper. When I can (get my hands on it), I try to read The Guardian or the New York Times. I love holding those newspapers."
38525,"The Observer on Sunday, whilst eating buttered toast, with cunty fingers."
38526,"I would be getting the newspaper.

One winter I paid upfront for 6 months worth then wanted it cancelled. I had to do nothing when 6 months was up. 6 months later more or less it stopped being delivered. Maybe a year later I was going to sign up permanently. Wasnt moving or anything. Except they claim I owe them like $20 for them delivering the paper after the 6month period.

I couldnt possibly know if they did or not go beyond. I never asked them to. If the delivery idiot didnt stop. It's his fault. I refuse to pay that $20. Then because of that debt they refuse to deliver the paper.

Opps there loss of business. Considering how they are dying.. you'd think they'd want as many customers as possible."
38527,"I live in a suburb of L.A. and there's a couple local neighborhood newspapers I read, they're published twice a week.  

I also read The Week magazine.  Great stuff."
38528,"I do. The local newspaper for extremely local news, national newspapers for lengthy articles and The Economist if I am visiting friends that are subscribing and have a copy in the bathroom. (I'm planning on subscribing, though. Great magazine)."
38529,I do the crossword puzzle in metro on the subway.  All my news is online.
38530,I read Financial Times and Barron's
38531,"""turn the page, wash ya hands. turn the page, wash ya hands...""

who's gonna catch this quote?"
38532,I like to read The Independent on those long train journeys...
38533,"Yeah, I read the [ADN](http://www.diarioadn.com.co/)."
38534,"unfortunately far too many people still read physical papers, especially on the rush hour trains, and usually the Tory/centre right ones like the Telegraph, or the further right Daily Mail.

I'm usually in an Indie, depending on what i've got to do that day (The Independent)"
38535,"I read the [Austin American-Statesman](http://www.statesman.com/) daily, but that's because I can't do much of anything else at my job to keep me entertained. An elderly former co-worker of mine got me into it. I find it helps me stay conscious of local issues and politics and the sports page can be very informative."
38536,"LA Times. Sports page every day. **KOBE**. Oh and then I check it for the Fry's ad. Usually I find myself looking at the Calendar section for stuff to do, real estate/home sections for w/e reason, and the Business section for baloney.  
  
Sometimes, I read the political worldly news bullspin stories, just to tell my parents that the shit they read is wrong because al-jazeera says so. o_O"
38537,Daily.
38538,"*Every newspaper in the house.* (All 3 of them). Every free newspaper on the street, and my University's newspaper. I'm weird. I even read all the ads. 

Actually, I think I get more like 4-5 newspapers, some are biweekly."
38539,"My school has the NY Times, Wall Street Journal, the city paper, and all the student-run papers available for free to any student. I also work at a coffee shop. So, yes."
38540,"I like to read the news and then wash it off of my hands afterward. Best feeling ever.

(Physical papers read: local metro edition daily, Sunday NYT, and I always buy the paper of record whenever I'm in a major city just for shits and giggles.)"
38541,"This thread is pleasantly surprising. When I was the OPs age, I had a beloved English teacher who gave me what I considered to be very sage advice, and she was adamant about it: ""read a newspaper every day."" I subscribed to the newspaper for the next decade... but when the Internet came around, I looked at it like an anachronism and stopped. I read three, maybe four times as much news from a much wider array of editorial sources than a single newsroom could ever hope to have. It's been that way for me since. I look at newspapers as very wasteful considering the alternatives.

I am, however, heartened that there seem to be so many young people who are interested in newspapers. That can only start a lifetime of good habits, and I say that from my own experience. I still read as much actual news as I do, say, reddit... I'm a news junkie."
38542,"I read the local newspaper, and the college newspaper when I am at school. I actually read the newspaper more often when I am school, and when I finish I try doing the crossword and I also read the comics."
38543,"I still like having a physical copy in my hands, even if it's just out of habit more than anything. Same thing for books. I love e-books but lots of times it's more comfortable to lay in bed with a book rather than stare at a screen. Nostalgiacore."
38544,"I read """"Le monde diplomatique"" (once a month newspaper)
and ""die Zeit"", german weekly newspaper

I would read a daily newspaper if i had more money."
38545,"NYT all the way, every weekday."
38546,I read the Vancouver Sun every morning.  Nothing beats the tangible news paper when you want to relax in the morning with some breakfast.
38547,I love making people read newspapers
38548,"Only when I get it free on my way to university or when entering an airplane. Otherwise I don't.

It's a waste of money and ressources. All the trees that fall for newspapers and all the lasting things I don't buy for the money I save... no thank you, there is more and more detailed information to be found in the internet AND it's much faster available."
38549,"Only when I go out to breakfast.  They also make for good ""brown"" material to put in a compost bin when there's too much ""green"" material in there."
38550,I read it every Sunday morning and occasionally during the week. Mostly to catch up with the political updates of my country.
38551,Thank you from the bottom of a reporter's heart.
38552,Does reading The Onion count as reading a newspaper?
38553,"Small-town Iowan here. While the internet is the main source for national and international news, I think it is important to keep up on local issues and narratives in the community. Without the local newspaper, that would be nigh impossible.

So yes."
38554,"The Globe and Mail and the Toronto Star every day. The former is an excellent all-around national paper, and the latter is somewhere between lousy and mediocre as far as the writing and reporting go, but is very good for general information about local news and happenings.

One of the several advantages of a physical paper is that as you leaf from page to page, you often stumble across random oddball things (including ads about local sales, events, exhibitions, etc.) that you didn't previously know existed and that you might be interested in, and I find the Internet inferior for this type of thing.

On the other hand, I realise that most Americans don't have ready access to a high-quality paper (my few run-ins with USA Today left me with a bad taste in my mouth), so you might not know what you're missing.

And finally, I often enjoy reading the paper while sitting on a rock in the middle of a river during the warmer months, and I'm certainly not taking my laptop out there."
38555,"I do, in the week I make do with the online versions. But missus rockswell has a subscription over the weekend to the paper copy. You can't beat it to be fair."
38556,"Because my work involves sitting in front of the computer fulltime it's refreshing to read a physical copy of the newspaper on Sundays (for me NY Times). Plus coupons are nice. 

I do miss the comics section from the paper (Calvin and Hobbes, Far Side - peace be unto them) though."
38557,"I read my school's newspaper in class, and by ""read"" i mean ""do the crossword"""
38558,My dad has a subscription to the WSJ that I read whenever he hasn't thrown it out. I sometimes pick up my city's paper. I also enjoy a plethora of magazine subscriptions :).
38559,i reserve a special love reading a broadsheet on the train. if just to annoy all my fellow travellers
38560,I only read our local paper in print--because the Web site is horrible. My issue with print papers has nothing to do with technology. I just don't like the really big pages and all the jumps.
38561,"As a newspaperman, I salute everyone here that still picks up the broadsheet."
38562,Only to find jobs really...
38563,My mom.
38564,I read the Red Eye in Chicago (they have them as I go on the subway) and my school's newspaper (to read during lectures)
38565,"My sixth form college supplies each house room with a newspaper everyday that we are there, so when at school I read a newspaper every single weekday. But apart from that I only read one on occasion."
38566,"We just got convinced to subscribe to the best Amsterdam newspaper, 'The Parool'.

The reason is that they have the local reports about what is going on in Amsterdam. Especially good for an Expat like me.

They deliver the paper in the afternoon, so it actually makes sense to come home and read it. I like that."
38567,"I like to read the new york times, this local magazine we have called houston press, and from time to time the houston chronicle. There's something about sitting down with a cup of coffee and getting your fingers dirty reading a newspaper that can't be replaced with reading it online."
38568,"I read the Times, Telegraph and occasionally the Guardian or Independent every other weekend (usually the saturday or sunday edition). More so when the weather's good as I can go into the park with my wife and we can read the paper together in the sun."
38569,"I work in the weekend in a call centre, and I buy a Sunday paper to read in between calls.  I also buy a newspaper every time I'm having something to eat at a mall nearby."
38570,people who are scared of technology. As soon as they die off the paper will die
38571,"South Indian here so obviously, The Hindu. I have a reasonable command of the English language solely because of this newspaper. I grew up reading 'Young World' as a school kid and thoroughly enjoyed it. 

There are accusations that their editorials have a leftist tinge which I don't really mind because I'm a leftist myself. Also, it lacks adequate coverage of news from non-southern states. I  still feel it's miles ahead of TOI."
38572,"I read Mumbai Mirror, almost first thing in the morning, its sort of daily routine. Actually, I feel uneasy in the morning if i don't read it."
38573,"It's like coffee, eh? Many people I know drink coffee first thing in the morning, otherwise their poop refuses to come out."
38574,"exactly, ToIlet paper is good for my bowel movements.

Now that you mention, we did not get ToI today coz of Republic Day..... and needless to say i did not go to toilet today."
38575,"a friend of mine smokes before pooping.









He claims- no poop without smoke."
38576,"I read The Hindu, we have been reading The Hindu since I was a kid. These days I buy paper but I don't actually read them everyday. I scan headlines and speed read the front page to see if anything interests me.

In college days, we used to solve The Hindu crossword :-)

Long time ago when I used to live in Bombay, if you wanted to buy The Hindu, you visit Andheri Station around afternoon. That were you could buy it."
38577,hindu has become anti hindu secular crap. I dont know why people read hindu even now. Many editorials on the net edition have become anti hindu these days.
38578,"Dude, things went too leftist when Siddarth Varadarajan was at the helm and have improved now. They ignored Modi's rallies, yes, but when it comes to reporting they have the best in the country. I rarely agree with their editorial stance but still would prefer it over other rags."
38579,"I may be writing it 100th time here but you should try ""Business Standard"". Pretty neat newspaper without all the rhetoric and the drama. Covers everything and has a good base of sensible journalists."
38580,"BS even covers mainstream stories sometimes with a Business Perspective so its refreshing (& layman friendly) to read.

BS > ET .."
38581,I personally found Mint better than BS.
38582,Thanks...I would give it a try sometime.
38583,"I get Mint delivered at home and read The Hindu online. DNA seems decent, will get it delivered from next month as well.  Have online access to WSJ, NYT & FT, so I have enough news to read for one day. 

Used to read The Hindu from the last page to the first (sports first!) since childhood but no edition in Mumbai where I live now. 

I also get TOI from time to time if I need paper to keep the dust off my grocery shelves :-)"
38584,I live in central India and The Hitvada is a nice option otherwise The Indian Express is the best option.
38585,Nagpurkar? :)
38586,Yes nagpurkar here :D rahan dhantolit
38587,I read The Telegraph which has some of the best columnists.
38588,A Calcuttan?
38589,yeh
38590,"Indian Express, cause its still the best option among the lot. Their supplement for Mumbai is really good for local news. I also get Hindustan Times where the only thing worth reading is Sujata Anandans column on Wednesdays. HT's supplement is good for learning inane Bollywood gossip."
38591,"deccan herald, because i also happen to work for it. hindu, TOI bring up the regulars' list..."
38592,"The Hindu: Other than the news, it has  excellent editorials, book reviews, if there is a game tonight (e.g. the EPL), it will post the channel name along with the timings (saves me a lot of googling). It's what newspapers used to be. I am yet to see an article that talked about where Hrithik Roshan/Salman Khan had dinner last night. 

The Indian Express: For it's pragmatic editorials. Though most of them end up bashing the the Congress party, it's not that irritating and are usually written in a 'matter of fact' manner.

EDIT: I am yet to meet a UPSC candidate who doesn't subscribe to the above newspapers.

Magazines (not related but chipping in): The Outlook - for the regulars namely, pollscape, book reviews, movie reviews, The Secret Diary of (oh, it's so not over the top like the Unreal Times is) and finally, the last page called, Diary is a fun read (Bombay Diary, Delhi Diary, Beijing diary etc)"
38593,I read only sexpert column in Pune /Mumbai mirror .
38594,"I grew up reading The Indian Express and was a loyal reader till I noticed a recent unabashedly pro-Congress tilt in everything they reported. Stopped reading it anymore.

Just yesterday someone here said TOI is too big and rich a media house to be pushed around by political parties. Honestly, I like their Mumbai coverage but I simply skip their Bollywood and cricket stories.

DNA is a good paper. Balanced coverage. Hyperlocal.

I abhor The Hindu for its Leftist stance and tendency to edit out news they feel should not be outed."
38595,"They share the same incestuous needle of crack money(paid news) from the same crackerheads(pols/biz houses) and thus look like meth heads having an orgy on their mother's butt crack.

The lot of them; even whorehouses have a better ethics where 1 hole, 1 customer applies 99% of the time.  They'll turn tricks for you like a dog in heat.

source:  A lifelong The Hindu reader who's had his sensibilities beaten out of him with the relentless whoring of the front and editorial pages from scumbags."
38596,"I used to get Hindu but stopped it last week because I wasn't reading them.

The news websites I follow are:

Hindu, Indian Express, Guradian, Financial Times(only the free arts and leisure section, it's awesome) and Le Parisien. Last one because I am trying to learn French.

Rest whatever links they post on /r/india /r/IndiaInvestments and /r/worldnews"
38597,"The Hindu (Tamil version is crap btw), Guardian, NYT."
38598,The Hindu and the Indian Express + a bit of Economic Times. Also PIB. I am preparing for Civil Services so I have to read them like textbooks. :-(
38599,"Mint for business news, Hindu for regional/national news and TOI for finding out what sales are going on in my city. Also TOI pays for itself in raddi weight, so that's not an issue.

Firstpost , Ibnlive , NDTV and a couple more for online news and for the reader comments.
PS, Of late have started hating The Hindu, TOI has always been hated. Every business newspaper - Namely Mint, ET and Business Standard seem to be fair, but then they cover only limited aspects of politics and governance."
38600,DNA. It is not that good.
38601,"if no one reads TOI, how and why it is world's #1 newspaper! Personally, I have stopped reading newspaper. Google.com/news and FirstPost.com keeps me updated. Business Standard and Mint for business stuff. Sometimes, Telegraph, if I am travelling and stuff."
38602,"This is the order that I read my newspapers every morning (dont know why, but its always in this order).


Mumbai Mirror

Mid-day

DNA

Hindustan Times

Times of India"
38603,"Times of India. I want to switch to The Hindu (because Arvind ji recommended it), but the newspaper guy is to fast too get a hold of."
38605,"Brilliant detective work, comrade."
38606,Times of India - delhi times for looking at babes and education times to fap in..hehe
38607,"I read the Hindu and Businessline daily.  
And for the rest I use [google news](https://news.google.com)"
38608,"ToI, Hindu, Deccan in office I scan them for 10-20 mins when I reach office. Then sometime after lunch I focus on those pages with some masala or interesting news or column that I might have found during first scan. It's mostly Hindu though. ToI is tabloid anyway.

Other than that I subscribe to Outlook  and finish it mostly. Now that Newsweek is restarting print, I will again have its annual sub. Newsweek was the best news magazine I've come across.

> Have returned to India after a gap of 3-4 years and realized that a lot of newspapers are now crap

Can you name some that you didn't find crap 3-4 years ago but you find them crap now? I think Hindu has deteriorated but ToI, IE were already shitty. 

By the way I used to like Telegraph when I was in Jharkhand.

**Edit:** One of my friends in Chennai told me that one can get Hindu print edition for something like 6 months costing only 70-80 INR. Any city (I am from B'lore). He didn't tell me how. Said somewhere online - he is from Civil Engg.

How come? Does anyone know how to get that subscription? Or I was just trolled offline? Any idea?"
38609,"none, is it bad?"
38610,"For all who didn't know,  The Hindu has a Kindle version too."
38611,"The Hindu, since childhood."
38612,"Bombay times FTW ...... the in-depth celebrity news and pictures of random celebrities who I have never heard off going to parties that I couldn't care less about, portray a sense of integrity that one hardly sees in the world of celebrity news."
38613,I just subscribe to /r/India for my India-related news...
38614,Times of India. It is cheap 300Rs for a full year.
38615,Toilet rolls too cost about same
38616,"Any of the broadsheets are worth reading. Of course the Guardian and Indy tend to be more liberal and the Times & Telegraph more conservative but they all feature intelligent editorials, a good range of commenters and a variety of news both national and international.

If I can make one suggestion -- try not to read solely the newspaper whose political views best align with your own. By reading the Telegraph if you're a natural lefty, or the Guardian if you're more right-wing, you're going to get a much more rounded perspective on events than if you purely stick to media you agree with."
38617,"Totally agree.  People who read just one paper that agrees with their point of view are just adding to their own confirmation bias. It can end up being a bit of an intellectual dead end. I prefer to read articles from various sources, both UK and overseas (if an international story).    Do think physical newspapers are a bit old fashioned.  Haven't bought one regularly in years and tend to use online versions."
38618,"I'm fairly left wing and The Times is my paper of choice, would recommend."
38619,"I have to disagree about the Telegraph since the Barclay brothers takeover.  Much more eurosceptic (the polite way of saying ""racist"") and climate change denial."
38620,Private Eye have noted they've employed a lot of ex-Mail hacks in senior positions. Personally I still think it's worth reading now and then.
38622,I think you have your reading mixed up.
38623,The guardian is right wing?
38624,"still mixed up - hes trying to say that you should try, from time to time, to read a paper that doesnt align with your views - thus why telegraph for a leftie, and guardian for a rightie."
38625,The Daily Mail gives me an up to date social commentary and the current condition of UK immigration trends.
38626,It is useful to know what the Daily Mail is telling old people.
38627,"It's a sad day the first time you detect the Daily Mail's views in your mother or father's conversations. They'd always been there, but it's a matter of growing up enough so that you can pick it up. I felt like I lost my childhood, the first time I saw my mum as a 'Daily Mail reader'."
38629,How much of the FT do you actually read? They have much much more material on finance than most people need.
38630,I don't buy it every day but when I do I read it cover-to-cover. Agree with your point that most people don't need to know the ins and outs of everything they cover; however I do find their comment section especially a cut above other newspapers
38631,"financial times is good if you run a business or deal with market forces on a daily basis, but i always thought it was a bit OTT just for a browse of whats going on."
38632,Private Eye
38633,"Seconded.

It may only come out every 2 weeks, but the the information within is usually more accurate than not, doesn't dumb down issues by focussing on what the tabloids might, and offers insights into how things actually work in Britain (spoiler: they don't).

I'd wager 2 weeks worth of the Daily Mail, stripped of all gossip, editorials, and non-news, wouldn't amount to the 34 pages worth of information you get with the Eye."
38634,"just to the uninitiated, the Eye and the i are different, tho I recommend both!"
38635,"Private Eye is indeed a fantastic publication (I've been a subscriber for about 17 years now) but you'd certainly want to have a broader range of material if you were looking for a decent 'overall read'.  I think you'd end up pretty depressed if you relied on the Eye as your sole source of news.  Good things do happen occasionally in the world.  As much as they frequently pillory Rusbridger and the Grauniad, they tend to work with them on a lot of stories as well, so I'd probably suggest the Guardian as the best balance of investigative journalism and general interest material."
38636,">It may only come out every 2 weeks

that's because there isn't a whole papers worth of news every day."
38638,"The in-jokes take quite a while to get used to. Some of the common ones would be -

'Tired and emotional' - Drunk.

'Ugandan discussions' - Having sex

'Refer you to Arkell v Pressdram' - Fuck off."
38639,"Thanks, I would never have got that. Are there any more?

Any tips for reading private eye or any must know knowledge about them?

I've seen plenty of their columns don't have an author put to them, is that because they're tip offs and they're protecting themselves?"
38640,"There are hundreds. You could do a lot worse than skimming the [wikipedia page.](http://en.wikipedia.org/wiki/Private_Eye). It's got them, and a link to even more. 

In general, the front half of the magazine is more investigative journalism and gossip, and the back is more satirical stuff. 

Most of their columns don't have a named author. It's for a number of reasons, from tip-offs to the fact that the real author is a well known journalist elsewhere."
38641,"my personal favourite section is 'Street of Shame': its basicly a collection of stories and rumours concerning the antics of various newpapers and their staff. usually pointing out hypocrisy, bad management etc.

'funny old world' is 3 newpaper stories from around the world which are just totally ridiculous - genuine, but silly as hell.

they do a really good job on reporting on certain issues. every week you will find a small section on pretty much everything - TV&Media, Arts, Agriculture, the NHS, local government, Trains, the City and many many others. its also pretty indepth stuff, sure its sometimes obscure and you might not really care about some of it, but atleast they are reporting it.

theres also a pretty large section in the middle which is essentially a parody of a tabloid that week.

i find it great toilet reading tbh. i would definately recommend it if you fancy a high brow laugh at the past couple of weeks happenings."
38642,Technically it's a magazine. But I agree any way.
38643,"I would recommend not reading any particular newspaper. Read a few, preferably at opposite ends of the spectrum. Do not only read a single newspaper."
38644,">Read a few, preferably at opposite ends of the spectrum. 

Two wrongs don't make a right."
38645,"No, but a left and a right can give you a decent average for the middle."
38646,"True. That's why I believe immigrants are modern day saints that are hellbent on destroying the country, especially the muslim ones who each bring with them love, diversity, and suicide vests.

Combining two biased opposing views has brought me close to the truth."
38647,"Why are you being so obtuse? Although admittedly this did mildly tickle me, despite being at my expense.

I think the gaurdian is shit. I think the DM is shit. The telegraph is shit. They're all shit. Read them all, totally ignore everything they say, and then imagine something slightly in the middle and you get a more reasonable representation of reality than you would by just reading one of them. That's all I'm saying."
38648,"[Well, not necessarily](https://yourlogicalfallacyis.com/middle-ground)."
38649,"Haha, [the fallacy fallacy](https://yourlogicalfallacyis.com/the-fallacy-fallacy)"
38650,":-P  True enough.  But my concern about ""the middle ground"" is more that it's dependant on who sets the agenda of what ""left"" and ""right"" are.  Left for me is anti-capitalist, left for the UK media is the Guardian.  See the problem?"
38651,"Yeah, I agree with you completely, it's a really common fallacy too."
38652,Discount the outlying nonsense. Oh that would be a problem for you right?
38653,"It's funny that anything but capitalism, which has been around for less than a blink of the eye in terms of the whole of human history and which, during its reign, has resulted in more global deaths and destruction than any other political philosophy or ""method of production"", is ""outlying nonsense"" to you...  For sure, it has doubtless brought a hell of a lot of fantastic development and wealth with it too - especially if you allow capitalism to claim the gains wrought by energy and technology, which is dubious at best; and extra especially gains for a very small elite - but then even Marx recognised that!

Edit: tided up and made it read a bit less shittily."
38654,"No, better to just go ""DAE GARDIAN"""
38655,[Read a few newspapers a day?](http://media.tumblr.com/9a38d3e2ad6140232d68005eaa93409f/tumblr_inline_mfmigfah2M1rcsf7e.gif)
38656,I can read through the Metro from cover to cover (ignoring the sports results) in 15 minutes.
38657,It does have a similar level of content to the beano though
38658,The i or the Metro - stalkers corner always good for a laugh!
38659,Metro is owned by the Daily Mail
38660,"[deleted]  
 ^^^^^^^^^^^^^^^^0.6030 
 > [What is this?](https://pastebin.com/64GuVi2F/58059)"
38661,>Metro is a free tabloid newspaper available in parts of the United Kingdom and published by Associated Newspapers Ltd (part of Daily Mail and General Trust)
38662,"But Metro's editorial position is quite different. DMGT don't produce financial breakdowns by title but it's widely believed that Metro is an extremely profitable paper for them. Of course its profits come from advertising which they sell at a high cost due to the fact that Metro's readership tends to be young, urban professionals -- exactly the people who'd generally run a mile from the sort of stuff the Mail puts out. There's no way DMGT want to kill their golden goose so they're not going to use Metro to put forward Mail-type politics.

Of course simple by taking a free copy of Metro each morning you are helping contribute to DMGT's coffers, so if your dislike of that company is strong enough, stop picking up the Metro!"
38663,"The articles, don't shout as much as DM's do, but have a similar swing."
38664,"""The Week"" is a very good news-magazine with local, European, American, and global sections. It provides a cross-spectrum analysis of what the papers are saying, how it effects the common fowk, and what may happen in the future. It covers all the major stories, and has a detailed financial section. I recommend it to everyone.

I am not paid, have never been paid, and am not about to be paid by the Week for advertising their products."
38665,"The Week is alright though it's painfully brief, I usually easily read it front to back in one 45min bus journey. However if you just need the basics of the past weeks news to stay informed it's a pretty good buy."
38666,"Aye, I like to use it as a jumping off point. A story might catch my eye, which I can then go research it more detail."
38667,"I'd recommend the economist.  It gives a decent briefing on the week's news and then launches into a series of in depth articles, largely in a well-sourced editorial style where they argue for a particular point of view.  Well written and well worth your time."
38668,"For serious quality journalism, read the FT. Its news and public policy coverage isn't as extensive as it could be, but the stories that do feature are written far better than in other papers.

Other broadsheets are OK but all highly predictable in their bias and selective reporting. The Telegraph in particular is now a parody of itself."
38669,"I personally am still trying to get the news out there that the 'i' exists.

It's only 20p, but it's a sensible newspaper with actual news in it, it even covers events that didn't happen in the UK or America!

However, it seems people still queue by the millions to pay an extra 10p for some tits in the Sun, or 4 times as much for some racism and classism in the Mail."
38670,"With you on that. ""i"" is the only dead-tree newspaper that I read now. It's also (I believe) the only UK newspaper whose circulation is increasing year-on-year, although admittedly it's got a very low starting point.

And the cryptic crossword in the ""i"" is about the right sort of level for me (equivalent to Telegraph cryptics IMO, so not up there with the impossibility of a lot of the Guardian ones)"
38671,"Not a usual concern with newspapers, but it's worth adding that i is a very nicely designed newspaper."
38672,"The Evening Standard, the ""i"" or The Times IMO"
38673,The Evening Standard is just about London house prices and building a new airport.
38675,The Independant.  Pretty much the only one that doesn't make me want to eat my own face.
38676,http://www.private-eye.co.uk/
38677,"http://www.bbc.co.uk/news is all you need. It's pretty straight down the middle politically, and has a pretty damned comprehensive picture of what is happening. Admittedly, its comment pieces aren't brilliant, but for straight news it's excellent.

That, and The Economist. I'm such a huge fan of its wide coverage, even if I have to take its unblinking support of deregulation and privatisation with a bit of a pinch of salt. Its international coverage is second to none, and I really feel like I've learned so much about the world whilst being a subscriber.

Oh, and I'll hundred-and-second the support for Private Eye. Yes, it is mostly satire and taking the piss, but its news is fantastic, and it actually cares about exposing people in power. The sheer volume of nepotism and circular career moves of various people/departments is frankly terrifying."
38678,"[The Daily Mash](http://www.thedailymash.co.uk/)

On a more serious note, I have stopped reading papers and get my news from reddit instead. One gets the article as well as the polemics and fact-checking in one place."
38679,"Reddit has a bias too, hivemind and all that"
38680,"Perhaps there is a majority opinion here, yes, however, usually one finds at least one well-articulated conservative argument to every five more popular left-leaning ones (right vs. left being just an example)."
38681,"The Guardian, they seem to me to be the only news outlet of the ones i have read which don't make crap up as they go along to bend toward their political ideals.

Seems like i will have to check out the 'i' and Private Eye :)"
38682,"The guardian definitely makes crap up as they go along. It's one of the better ones, but it still isn't great."
38683,"True, but in comparison to the Daily Mail they are infallible"
38684,"Almost anything is infallible compared to the DM, to be honest."
38685,"The Sun, i dont care that it's full of shit, it keeps me interested while i'm at work"
38686,"Indeed, until the 'i' launched, I bought the Sun purely as a distraction for the 10 minutes bus ride to work, you can read the Sun without having to actually believe anything, and the letters page is often hilarious."
38687,Everyone gets a kick out of the political commentary of the Page 3 girls.
38688,"Ditto, only read it while on lunch and to get away from staring at a screen for a bit.

Oh and boobz."
38689,"Sunday Times.

Or just wait and see the exact same stories on the BBC 3 days later."
38690,https://www.youtube.com/watch?v=DGscoaUWW2M
38691,The I is pretty good. I will also read the Private Eye and The Economist...
38692,Could someone tell me what the yearly subscriptions to various newspapers would be?
38693,"Private Eye is £28 iirc, but they normally have an offer on"
38694,"I would say the Guardian, the Independent and the Times. My personal opinion is to steer away from the Daily Mail, Daily Sport and any paper owned by Murdoch."
38695,"Murdoch owns the Times, it is still however my favourite newspaper."
38696,"It seems too well written to be a Murdoch paper, although I have to say I've never read a full Times before."
38697,"Murdoch likes his political influence more than the tits he prints in the Sun, so much so he [operates the Times at a loss](http://www.guardian.co.uk/media/greenslade/2011/jan/15/newsinternational-rupert-murdoch) and I haven't heard that this has changed since 2010. Though I think it's rather unfair to dismiss a paper because of its owner, I've always found the times coverage reasonably sane (at least compared to other newspapers)."
38698,If you want to get karma in r/ukpolitics then you must only read the Guardian and align yourself 100% with it's worldview.....
38699,"The Guardian for comment and The Independent for news, although I tend to just go to BBC news for that."
38700,"Daily Mail is still the best paper regardless of what the liberals here and left wing tv personalities will say. I dont read it because of Littlejohn who is a massive cunt.

I read the i instead.

Guardian is absolute left wing trash."
38701,Why is the DM the best paper?
38702,You mean the glorified tabloid that exaggerates stories and basically does nothing but fear-monger?
38703,yes although your description is biased horse shit. Just like mine about the Guardian was.
38704,A straightforward and mostly accurate analogy to answer your second question: the Daily Mail is to print journalism what Fox News is to broadcast journalism. Except with lots more near-naked teenagers on the Mail's website.
38705,"Thanks, that makes it easy to understand. Uh, I guess I'll check out the website now, you know, for research."
38706,"Bear in mind that when I say ""teenagers"" I mean literally that. They are notorious for displaying  bikini shots of 14-year-old child actors, usually accompanied by some pervy comment about how she's ""all grown up"" with ""womanly curves"".

The rest of their ""sidebar of shame"" is usually dedicated to sneering at female celebrities for being too fat / thin / old / young / clever / stupid or whatever else they can think of. Welcome to misogyny, middle-England style."
38707,"The ""all grown up"" thing in the Daily Mail is really quite disturbing. Why do they think a 14 year old is grown up? And then they have the audacity to get all high and mighty about perverts and the like. The Media Blog writes quite a bit about the Daily Mail http://www.themediablog.co.uk/the-media-blog/2013/01/the-daily-mail-all-grown-up.html"
38708,"They'll post that, and then the next day complain about pedophiles"
38709,"When I worked in the financial sector The FT, Times, Telegraph and Guardian were the most respected, in that order. The other 'legitimate' national broadsheet is The Independent. 

The Mail has a bad rep, with good reason, but does occasionally run good pieces of investigative journalism on its key tub thumping issues like private equity takeovers, so I don't think it's quite in the same league as Fox News yet. Most of what it reports is sensationalist, inaccurate dross though, and it's basically a tabloid nowadays."
38710,"I'm not even an avid newspaper reader, but I can tell you for sure that the Daily Mail has a reputation for being racist and unreliable."
38711,As well as perverted.
38712,"And just erroneous sometimes. Reading that little ""clarifications and corrections"" box inside the front page makes me wonder how they ever got away with printing it in the first place."
38713,And a dubious interest in things that allegedly cause cancer
38714,And with a very sketchy history
38715,"The most highly respected are the Guardian, Independent, Times, Financial Times and Telegraph. I believe the Guardian topped a recent academic study of journalistic transparency in English language publications.

In the digital media the BBC News is up there with the others.

For breaking new scandals, Private Eye (a magazine with no online edition) has a phenomenal track record."
38716,"The Times, the Guardian (though it has a left wing bias that some people take issue with) and the Independent are the more literate papers. Possibly also the Telegraph - though that has a right wing bias that some people take issue with.

The thing to bear in mind is that in the UK newpapers are not politically neutral, they have a clear and stated bias.  For neutrality in news reporting people would go to the BBC.

The Daily Mail is known for being hateful and  mendacious."
38717,"I sometimes read the Telegraph when it's lying around, and recently it seems to have moved from an intelligent and principled (if misguided) right-wing ideology to a rather unpleasant diatribe reminiscent of US right-wing politics.  While it's not really a newspaper, for people interested in news analysis from a right-wing perspective, I would recommend The Economist.

The Guardian is often described as left-wing, but it's really much closer to centrist/liberal.  It projects a curious kind of ""feel-good"" morality for people who like to be outraged about things and believe the way to save humanity is to buy organic food and install solar panels on their houses.  It very rarely takes a controversial opinion on anything, and it refuses to engage with the radical left.  For left-wing news and opinion, I would recommend the [Morning Star](http://www.morningstaronline.co.uk/) (the newspaper of the Communist Party of Britain) or the [New Statesman](http://www.newstatesman.com/), a weekly magazine associated with the Fabian Society.

And everyone, regardless of their political ideology, should read Private Eye, since it tells you which things you just read in the newspapers aren't actually true."
38719,"The Daily Mail is like the crazy racist old uncle of British journalism. You try to deny his existence all you can but it'll still come to family events and embarrass you shouting off how the immigrants are doing this and oxygen causes cancer. There are some members of your family that tolerate and even love him but you end up just trying to avoid him all evening and resisting the urge to punch him in the face.  Even the Times, the Daily Mail's father tries to distance themselves from him. 

Meanwhile you'll have some decent conversation you can understand with your cousins, The Guardian, Independent and Financial Times. Sometimes even your sister The Economist will show up and your estranged brother Private Eye sits in the corner judging everyone. 

Meanwhile your grandmother The Daily Express is still in mourning for Princess Diana and will be sitting with a drink telling you stories of Diana you've heard a thousand times. The Sun, The Daily Mails son is busy looking at dirty pictures in the corner and thinks you can't see."
38720,"The Independent, or The Times, although anything that tries to remain neutral ends up seeming lefty anyway."
38721,http://www.youtube.com/watch?v=DGscoaUWW2M#t=1m - This is still pretty accurate...
38722,Daily Fail.
38723,The Grauniad is infamous for its spellig mistaeks.
38724,"The Daily Mail is very bad. [Heres a song about it](http://www.youtube.com/watch?v=5eBT6OSr1TI), it sums it up pretty well

They also try to scare the population with total bullshit. [Heres another song about that](http://www.youtube.com/watch?v=KZTeSxWdk1g)"
38725,"Daily mail is specifically targeted toward over 50s and the only paper to be angled towards a women demographic. Hence xenophobia and very bitchy articles about other women.   I would say the Independent supposed to be the most neutrally respected paper, surprisingly the free newspaper the Metro is free of any political leanings due to its advertising base. Have to disagree with the Guardian as being free of bias, that newspaper is to the left to what the tabloids are for the right, written for teachers and retired public servants."
38726,Thanks for the input.
38727,"It depends on whom exactly you talk to because print media has political bias, but generally The Guardian, The Financial Times, The Times, The Telegraph and possibly The Independent are considered good sources of news by the political classes. The same classes would tell you that the Daily Mail has a very bad reputation."
38728,"I buy the Economist and read the Telegraph, Guardian and BBC news online, which I take as giving me a decent enough aggregate of current affairs independent of the bias that each paper and the beeb has.

We don't really have a single paper which is 'the best'. All have significant flaws and biases and anyone who tells you that one paper doesnt almost certainly is driven by that bias when considering objectivity."
38729,Most would argue that the Guardian is extremely left?
38730,"The Currant Bun. 

Football and tits. That's what I respect."
38731,Support your local print media newspapers!
38732,"That depends on what you're looking for.  For national news I usually read WaPo and the NYT.  I also read the LA Times, the Atlanta Journal-Consitution, the Tampa Bay Times, and articles in a number of other newspapers."
38734,Digital
38736,Just for time. I don’t have to keep it there.
38737,"For me it's two local papers, the larger paper in the state, a non profit focused on state level policy, NPR, ProPublica, The Economist, NYT, and WaPo, but not all of them everyday. If your goal is to be informed go for the outlets with integrity instead of fox and msnbc."
38738,"MSNBC has the best investigative reporting, hands down."
38739,What's a good example?
38740,nbc to balance foxnews.
38741,"on windows, edge is *bestest* but consider brave, firefox, vivaldi"
38742,*if edge is bestest then let me know how to configure everything like firefox .*
38743,"i wish any other browser also has those capabilities like firefox. 

firefox on windows is just so better than ff on ubuntu. But, firefox sucks on Android. So being a Ubuntu & Android user, i am currently using brave.

if i was only using windows, i would have gone with ff"
38744,"on windows 10 , firefox is better than all browsers .

why I use firefox ?  the reasons are configure how you want , big community to get all solutions . extensions , ublock origin etc.

I did not tried Linux , Ubuntu etc. so I can not comment on that .

I am also android user have samsung galaxy s10+ and tried many browsers like 1DM+ , puffin browser pro , soul browser , firefox , fennec from foxy droid , duckduckgo , kiwi browser , edge , chrome etc. all draining battery so now installed samsung internet .

privacy is a different thing to discuss .

I tried once brave also. but will try again ."
38745,"""Bestest""? lol"
38746,yes lol haha
38747,"""bestest""? Huh?"
38748,"I don't get it, why Microsoft Edge is the best? That's a default browser for Windows 10. For a personal preference, I would prefer a browser that can handle lots of open tabs..."
38749,"saying of tabs, nobody can handle multiple tabs like edge (or vivaldi) as they have Vertical Tabs"
38750,I have 15 tabs open on edge and it lags like crazy when i try to open another one... That didn't happen even on normal Chrome.
38751,bruh your username 🤣
38752,"i cant do anything about it. it is what is, Alas!"
38753,"1. **Edge** : Fast , Less Ram usage , tons of features( vertical tab, good pdf viewer, in built screenshot tool, tracker setting  , all chrome extensions work very well)
2. **Edge** again: Good syncing (just make one outlook account and it is alright),Flawless bookmarking, plus very very nice COLLECTION feature
3. Bookmark managing is as easy as breathing  **EDGE**
4. **Edge** opens very fast especially if u use in Win 10"
38754,You clearly have not used Vivaldi
38755,"Firefox if you're wanting to move away from Chromium. But it's also fast, reliable and customisable."
38756,"""Customizable""
Nani? You can't even change the background image"
38757,Use custom css. You can change your browser's UI.
38759,What? There are many free and ready themes available made by the community.
38760,how about official support instead of community?
38761,"Yeah edge a shitty browser who can't even use their own engine is from 21st century, lmao"
38762,"Edge is based on Chromium which is an open source project, means it ain't anyone’s 'own' engine. It’s usable by all."
38763,Its literally Google's own engine!
38764,You can with tabliss extensions
38765,https://tabliss.io/ Available on Chromium aswell
38766,"Edge is probably what you're looking for, but don't discount the latest version of Vivaldi. Great little browser with tons of features and they've done a fair bit of work on speeding it up."
38767,Any browser being actively developed will tick all these boxes. Also don't ask for information on browsers here. A lot of people are biased.
38768,"yes, do your own research and try different browsers"
38769,"Its brave period, and waterfox, and SR Iron. Chrome and edge - uninstall)"
38770,"Edge is what you need, very easy to use, extremly fast compared to other browser, quite reliable , sync almost everything including setting, bookmarks ,history, tabs, extensions, passwords. Opens very fast. Development is very agile and they are adding useful features like every fortnight. 

one last thing it comes pre-install."
38771,"I would say Brave, based on Chrome so has the extension support but more privacy focused."
38772,Edge or opera both fit all u r needs with extra features so choose and use which ever one u like
38773,"brave browser,

1. its just a tiny bit harder to use but has some useful features built in
2. its faster than chrome and uses less ram,

3, they had a few problems but not privacy wise other than the tor one but normal users probably wouldnt use that feature,

4. im pretty sure you can do that, i dont really use bookmarks but its probably good

5. i dont know how fast chrome opens but on my old pc it took a bit longer for brave to start than firefox, with my current pc it takes less than 2 seconds for it to open and fully load.  


edit: im terrible at grammar"
38774,Firefox and edge are the only one that may suit you!
38775,"Chrome if you want to sync your passwords and bookmarks across devices, Brave if you want ad blocking and privacy."
38776,"You can sync all of those things on Brave to if you enable it, at least between phone and pc, I haven't tried across PC's yet."
38777,Brave sync works across pc too (tried only windows10)
38778,It doesn't matter. They are all fast. People acting like as if it really matters. Unless you have a shitty computer with a HD.
38779,Edge all the way
38780,Take a look at https://www.reddit.com/r/firefox/wiki/switching-to-firefox#wiki_why_switch.3F
38781,I think your rotation should go to firefox or vivaldi
38782,"Vivaldi is my default, but I still use Firefox and Brave. As for Opera, Edge and Chrome, I try to stay away from them (though I use Edge a but often)"
38783,Can you help me how to change simple look/classic look Vivaldi like firefox ?
38784,I think you can choose that from the vivaldi://welcome page itself.. As for the colors and stuff you can change in settings. Btw there are css codes in Vivaldi's community forums.
38785,Brave is good.
38786,"if you like your computer to be highjacked for field trials, yes!  


https://github.com/brave/brave-browser/issues/14640#issuecomment-961790800"
38787,"wow you are quite rude in your bug reports!

in any case that's happening on linux, and I don't care about linux.

on my windows box brave is good."
38788,Imma Potato PC user. recently moved to Edge. because it takes half of the resources that FF or Chrome would take
38789,Safari is by far the best one and iOS 15 has some nice updates
38790,safari is possible for windows 10 ?
38791,Unfortunately no it isn’t.
38792,Opera GX is really underrated on Desktop
38793,Opera gx of course
38794,No u
38795,i see staverdad
38797,"I was using Firefox, switched to Brave, from Brave to Edge, Edge to Opera GX, then after using all of these, Deleted them, came back to Firefox. Why? It is the Browser for me. It's Simple, easily Customizable and User Friendly than ALL the other Browsers. Brave is a good Alternative but for me Firefox is Better than it. Don't use Opera GX, it's known for Selling Browser History. Edge is very Average. Firefox's the Best currently. Try it out."
38798,"the thing is i love FF' UI both on android and windows, but it seems a bit slow on websites i use, i think they are optimized for chrominium

then Edge, windows version is fine, but android version sucks = ("
38799,"This man described my feelings. I hopped through all of the browsers , went back to firefox."
38800,;)
38801,"Vivaldi, hands down"
38802,"I would have said Brave  but only if you like your computer to be highjacked for field trials.  


Bug, because that's just what it is, reported in March  
  
https://github.com/brave/brave-browser/issues/14640#issuecomment-961790800"
39263,"Firefox.  It's open source, works well with most sites, has plenty of addons, and is privacy focused.  Even the Tor browser is literally just a modified Firefox."
39264,"I second Firefox. It works everywhere, has great add ons and support, and it's not Chromium."
39265,"While I use Firefox as my daily driver and whole heartedly endorse it, I wouldn't quite say it works everywhere. 

Every once in a while I find a site that is still very clearly chromium optimized, and I'll need to switch back over. Also, Firefox does not support Progressive Web Apps nearly as well as Chromium. So I'd still recommend using Firefox as your main browser, but when you do need a Chromium backup I'd recommend Brave. It's a privacy focused Chromium skin."
39266,"FYI, you can report non working sites to https://webcompat.com/ -- developers will diagnose the issue and work to fix the Firefox issue or contact the site developers."
39267,"I wish Firefox wasn't such a RAM hog these days. I would definitely switch away from my Chromium browsers if it was.

&#x200B;

EDIT: [Guys, please.](https://imgur.com/a/WwHqJmO)"
39268,Why we got 4 mb of ram or something that memory is still a thing in 2019?
39269,My Firefox never uses any less than 2GB of RAM and pushes my 16 GB total to it's limits.
39270,Bullshit
