idx,text
20732,"Haha same here.

Also Ghost"
20733,"Hush- fired up

&#x200B;"
20734,Ante Up Remix by M.O.P. ft. Busta Rhymes
20735,Busta rymes had lots of great pump up songs.
20736,"Freestyler - Bomfunk MCs

https://m.youtube.com/watch?v=ymNFyxvIdaM"
20737,Can’t go wrong with sicko mode- Travis Scott ft drake
20738,"You Think I Ain't Worth a Dollar, but I Feel Like a Millionaire - Queens of the Stone Age"
20739,Supermassive Black Hole- Muse
20740,Electric Pow Wow by A Tribe Called Red
20741,90210 by Travis Scott
20742,Rats Theme by Jerma985
20743,Stronger- Kanye West
20744,My Body by Young the Giant
20745,Feel it Still by Portugal. The Man
20746,"LOYAL by Odesza

that drop adds 30 pounds to my deadlift"
20747,Five Minutes Alone by Pantera. Angry music always helps me work out
20748,"""Don't stop me now"" - Queen"
20749,Queen’s Don’t Stop Me Now
20750,Transgressions Kodak black
20751,Humble by Kendrick Lamar
20752,sit down
20753,"I have a very fond memory from last summer where I woke up early, went down to my high schools track, and started one of my most kick ass runs with Rasputin by Boney M."
20754,Babywipe by ski mask the slump god
20755,How is you feelin vro?
20756,Lamborghini Mercy
20757,Thunderstruck. Every. Single. Time.
20758,Nervewracker by The Armed or Flourescent Nights by Frontierer.
20759,"[Karma](https://youtu.be/UxPWYpcVI1c) by Kamelot

Just perfect pace for any exercise."
20760,"I payed 3 times to visit one, just because I saw a few bikes in there without any rear wheels. 2, 3, 1 days respectively."
20761,Jet Set Run
20762,Love from the gutter-Drake and Future
20763,Wendigo theme from Altered Beast.
20764,"How about ⭐ ""Flo Rida - Good Feeling"" 🏋️‍♀️?!"
20765,"Lets see... I'm into some rock/metal songs but this is my most played playlist

1)Alter Bridge- White Knuckles
2)For Today- No Truth, No Sacrifice
3)Incendiary- Front towards Enemy
4)Lamb Of God- Ghost Walking 
5)Breaking Benjamin- Evil Angel
6)Three Days Grace- Riot"
20766,Jesus walks by Kanye west
20767,"I've generally moved away from metal since high school but I always end up bringing certain songs up when I'm lifting heavy. My go to, usually on deadlift, is World Without a Sun by Oh, Sleeper."
20768,"Coming Undone - Korn,
all of Led Zeppelin II,
Metallica"
20769,Why So Serious? - James Newton Howard and Hans Zimmer
20770,Anything by Slaughter to Prevail / Infant Annihilator / Cattle Decapitation
20771,"the sounds of the machines, and my inner thoughts."
20772,"Bite It, You Scum - GG Allin"
20773,You're the best by Joe Esposito
20774,Malaguena by Stan Kenton
20775,Anything by denzel curry!!!
20776,"denzel is the shits bruh, not a single bad song of his i can find, he only makes slaps."
20777,Believer by Imagine Dragons makes me feel like I can bench the gym I'm working out at
20778,"I usually just listen through the Doom 2018 soundtrack. Kick things off with Rip & Tear. Once the first couple sets are done and starting to feel good Demigod gives a nice little pep talk.

""Unbreakable, Incorruptible...Unyielding."""
20779,2016* anyway i agree
20780,Outshined by Soundgarden
20781,"Depends on my mood.

Electronic

[Olie Bassweight](https://www.youtube.com/watch?v=A350SA13ONg)

[Harmsworth](https://www.youtube.com/watch?v=pvmgd4Dmvzo)

[Delta 9](https://www.youtube.com/watch?v=PKZ4RpOEfko)

Or metal

[Behemoth](https://www.youtube.com/watch?v=Cx01fOYsc6E)

[Jinjer](https://www.youtube.com/watch?v=U6rv5qi8-8s)

[Machine Head](https://www.youtube.com/watch?v=IQkwhvIVW-U)"
20782,Kanye west - Power
20783,Eye of the tiger- Survivor
20784,Lose Yourself
20785,Eye of the tiger!
20786,"Most of us- Wiz Khalifa


Something something- godsmack"
20787,Rocky soundtrack. Been in my playlist since middle school. https://www.youtube.com/watch?v=1SUzcDUERLo
20788,"Most I Prevail, specifically “Love, Lust, and Liars”, oh and this rad all-female band called conquer divide."
20789,Painkiller- Judas priest or Never gonna get it -Akon
20790,Face the pain-Stemm
20791,Links (234) Rammstien was my arm day song for a long long while
20792,"*Whose Land is This?*

FEEL THE POWER OF THE LION AS HE ROARS LIKE LIKE THUN-DEEEEEEEER!!!

Not a great weight lifting song but a fantastic jogging song."
20793,Dig - Mudvayne
20794,Chop Suey
20795,By myself - Linkin Park
20796,[This version](https://www.youtube.com/watch?v=X2WH8mHJnhM) of My Heart Will Go On.
20797,"I clicked thinking maybe there was some awesome upbeat remake. Boy, was I disappointed."
20798,"Yeah, but it's a surefire way to get people out of my gym."
20799,Ha. Love it. Good thinking.
20800,Indestructible by disturbed and do you really want it by nothing more.
20801,The last stand by Sabaton. Pretty much any Sabaton song will work.
20802,"Animal I have become by three days grace. I think this is bro metal, but it's a great song from my teenage years, also the beat perfectly lines up with my heart rhythm.

Lift me up by five finger death punch is great for the same reason..

Banging on drums by zero nine lifts my mood.

Mahakali by dissection just works because it's an incantation of the Hindu goddess Kali."
20803,"I'm not much of a workout person, [but when I biked, this is what song I used](https://www.youtube.com/watch?v=mGpteIkKy-o)"
20804,Intro and Intro 2 by NF
20805,ma baker boney M
20806,Be humble
20807,A lot of Infected Mushrooms
20808,I have really enjoyed listening to Battles. Especially songs like Tonto and Mirrored. They really keep me going when I'm on the treadmill.
20809,"Cloudkicker - Dysphoria
Meshuggah - Bleed
Converge - Homewrecker
Dillinger Escape Plan - Milk Lizard
Dark Tranquillity - Lost To Apathy
Meshuggah - Clockworks
Darkest Hour - Doomsayer"
20810,Knife in the Safe Room by Darkest Hour is great too. Balls to the wall metal.
20811,WWIII - KMFDM
20812,"https://youtu.be/Y6AuvA-tl3Y

Kuze theme from yakuza."
20813,"Anything 69,ik he’s a piece of shit but that fucking yelling gets you the the mood"
20814,Stratovarius - Dragons has been with me through various phases.
20815,"Mastodon
Akercocke
Nile
Behemoth
Aaaand 80s music (i need a hero, kim wilde, falco, you name it)"
20816,"The songs from rupaul are strangely great workout music. 
I enjoy sissy that walk, call me mother, die tomorrow and charisma uniqueness nerve talent"
20817,Counter attack - Mankind from Attack on titan
20818,Definitely 300 Violin Orchestra for me.
20819,Monster Magnet's *'Powertrip'* album
20820,"When I worked out consistently, it was always HHH's or Brock Lesnar's WWE theme song on repeat."
20821,"Seems really weird but my absolute favorite running song is Will You Be There by Michael Jackson (the Free Willy song)! Something about it makes me run faster and I could just keep going and going with that one on. 
Also love These:
Sinnerman by Nina Simone 
Born2Run by 7Lions
Crazy Bitch by Buckcherry
Weatherman by Dead Sara 
Anything Eminem 
Anything by Mac Miller"
20822,"Arf arf
Yeah, yeah, yeah (Grrrr)
Uh, Yeah don't get it twisted
This rap shit, is mine
Motherfucker, it's not, a fucking, game
Fuck what you heard
It's what you hearin
It's what you hearin (Listen)
It's what you hearin (Listen)
It's what you hearin (Listen)"
20823,Eurobeat
20824,Run This Town by Rihanna feat. Jay-Z and Kanye
20825,"Can’t be touched - Roy Jones Jr.

Beast - Rob Bailley and The Hustle Standard

Any freakin song from the Rocky soundtrack

Till i collapse - Eminem

Dragon Ball Z motivational videos on youtube

Les brown dubstep speeches available on youtube."
20826,This means war - Avenged Sevenfold
20827,"""Evictionaries"" by Trap Them.

Man, put that on and I feel like I can run through a brick wall and bench press a truck.  Unreal motivation!"
20828,SenoritA
20829,Kinda hard not to get pumped up listening to Slipknot
20830,Perfect by princess superstar
20831,"Runnin', from Creed II

Round One- Kray Twinz

Man's not hot- Big Shaq

Punani- Lady Bee

Not sophisticated, but they get your pulses racing."
20832,Seasons in the Abyss. The whole album is just long enough to get me through a morning workout.
20833,In due time- Killswitch Engage
20834,Cowboys from Hell by Pantera. Or 5 minutes alone.
20835,Magnum Bullets by Night Runner.
20836,"See You At The Party Richter -Austrian Death Machine
Its a dumb song but it really gets the blood pumping"
20837,Heavy cover by Fame on Fire
20838,I hope someone compiles this into a Spotify playlist.
20839,Hard in da Paint makes me bench +20 lbs
20840,That whole album is still a classic. There was a whole summer where Flockaveli was the only CD listened to when working out.
20841,"I see I've been sleeping on Waka's music.

Nice guy, I met him once in the Galleria"
20842,Pull up to the gym blasting Ohh Let's Do It
20843,That album helped me beat cancer
20844,Flexin on your exes
20845,"Eminem on medicine man can take you that 30lbs range

https://youtu.be/4LePtP2m_68"
20846,RTJ2
20847,Yeah honestly RTJ2 improves my squat by more than it should lmao
20848,Jeopardy is the most badass song ever made
20849,Ima Boss Meek mill
20850,"I think I saw a comment once that said ""I'm a safe driver, hbut if Ima Boss comes on, I'm probably gonna crash my car somehow"""
20851,Meek Mill's entire catalog tbh.
20852,Yes to this
20853,This is the one
20854,"Bia Bia - Lil Jon & Eastside Boyz 

No problem - lil Scrappy 

The Uppercut - Tupac (favorite) 

I don’t give a ... lil Jon, mystikal, krayzie bone 

No apologies - Eminem 

I’m with whateva - the Notorious B.I.G, Lil Wayne, Juelz Santana 

Hot shit - lil Wayne & juelz 

Hood shit - lil Wayne and juelz 

Krazy - Lil Wayne 

Big bad wolf - lil Wayne 

Give me some feedback y’all . Let me know what you like from this list, don’t like, what songs do these remind you of or make you recall?"
20855,That Lil Wayne & Juelz era was truly something remarkable!
20856,">No apologies - Eminem

I can't really see myself working out to this song tbh"
20857,"I just find the lyrics are pretty personal to him and viewing himself unapologetically as a fighter. 

Coupled with the beat I think it’d be a good walk out song for an underdog in a fight or for me translates to being in the weight room telling myself fuck worrying about people watching me just do your thing"
20858,I’m with whateva was the first time I realized “oh shit lil Wayne can really rap”
20859,One of my all time favorite verses by him
20860,Denzel Curry & IDK - Uh Huh
20861,And the Ferg song Kristi with them on it
20862,Ricky also amps me the fuck up
20863,A man of culture
20864,"I been sleeping on Denzel Curry, he getting a lot of mentions.
Shame on me."
20865,Listen to Threatz and go lift a mountain
20866,Top 1 Denzel song don't @ me.
20867,I completely agree
20868,No wave is also a heavy lifter
20869,you don’t know - jay z
20870,TURN MY MUSIC HIGH HIGH HIGHER
20871,U DONT KNOWWWW
20872,Played it and goosebumps came immediately. Forgot about how good this song is. FOR PLAYING ME Y’ALL SHALL FOREVER REMAIN NAMELESS...
20873,Also the M.O.P. Remix
20874,"Anything by City Morgue, Death Grips, and Suicideboys if you can handle the yelling and shit"
20875,"take the songs you like, leave the ones you dont. kept it to 1 song per artist but a lot of these have multiple songs that can make a playlist

&#x200B;

50 cent - i get money

aesop rock - coffee

asap ferg - shabba

asap rocky - lord pretty flacko joyde 2

atmosphere - trying to find a balance

brockhampton - 1998 truman

d12 - fight music

danny brown - attak

death grips - the fever

denzel curry - gook

designer - outlet

drake - back to back

eminem - rabbit run

freddie gibbs - weight

future - mask off remix

game - el chapo

hopsin - crown me

jay z - numb / encore

joey badass - front & center

jpegmafia - panic emoji

kanye - champions

kendrick - backseat freestyle

kid cudi - up up & away

lil wayne -  6 foot 7 foot

lupe - dopamine lit

rich brian - gospel

run the jewels - lie, cheat, steal

ski mask - nuketown

tech n9ne - straight out the gate (scott stevens remix)

travis scott - dance on the moon

vince staples - bagbak

xxxtentacion - rip roach"
20877,Nah bruh you gotta listen to billy woods in the gym if you wanna post on here
20878,we only listen to bolivian jungle rap in this house
20879,Gregorian Chants
20880,Don't even think of interrupting my Mongolian throat singing 😤
20881,Oh you don’t listen to dusty 90s NY rap while lifting??
20882,"P sure 95 percent of the sub listens to the same music, no one gonna judge man"
20883,As long as it helps you get through your workout I ain't gonna judge.
20884,Goddamn I haven't heard march madness in like 4 years
20885,I literally have almost all of these songs in my playlist too so no shame man
20886,X Gon Give It To Ya is always the right answer
20887,"90% of DS2 by Future

Mahogany- Wayne

Blood on the leaves- Ye

Most of The Black Album- Jay Z

Freddie Gibbs

5am in Toronto (his best song ever), I'm goin in, Underground Kings, Energy - Drake"
20888,Fuck up some commas and trap niggas will never get old
20889,Don't forget Where Ya At and Groupies
20891,Omg groupies I forgot top 5 future song
20892,Eminem- Till I Collapse
20893,"Patiently Waiting with 50 & Em aswell.


And ofc, the legendary ""cant be touched"" by Roy Jones Jr."
20894,Damn I haven’t thought about that “Can’t Be Touched” song for years. That’s a dope ass song both for workout or just a good hype song. Thanks for the memories.
20895,Its an absolute banger :D
20896,Em and 50 ultimate workout song is Don’t Push Me
20897,Honestly they have a few. YOu dont know is a banger too
20898,Cinderella man is also a really good em song for working out
20899,PR anthem
20900,If it's not on your playlist it's treason
20901,The best answer out of em all
20902,When I was a wrestler that song would always pump me up before a match!
20903,This is the answer
20904,Yung bratz by x
20905,Gnarly Bastard
20906,IM OUT OF OPTIONS
20907,RIP Roach used to be my go-to for squat PR's
20908,"Hustler's Ambition - 50 Cent

Many Men (Wish Death) - 50 Cent

Remember the Name - Fort Minor

No Regrets - Pusha T

Forever - Drake ft Kanye West, Lil Wayne, Eminem

Dirt Off Your Shoulder - Jay Z

Fight Music - D12

To name a few"
20909,"Denzel Curry - Equalizer (or most of Denzel's songs tbh lol)

Jay Rock - King's Dead

Nipsey Hussle - Dedication 

Shofu - Nothing To See Here

IDK - Digital

Lil Wayne - John

Baby Keem - Gang Activities 

Kendrick Lamar - Maad City

Denzel Curry - Black Metal Terrorist (this song will get you through anything lol)"
20910,Plus one for John by lil Wayne. Good lord is that song hype personified
20911,It really is. Their energy & chemistry on that is nuts
20912,They both brought their complete A game on that track. Good lord
20913,Dunno bout King's Dead. I couldn't imagine working out with that Future verse
20914,"That's part of the thrill lol. But nah fr, it's mostly for the instrumental that makes King's Dead a good workout song for me"
20915,"Ante Up - MOP

Ante Up Remix - MOP

Hustle Hard - Ace Hood

Ali Bomaye - The Game

Bully Rap - Sean Price

Apeshit - Prof ft. Waka

Maad City - Kendrick (but skip h2)

6 foot 7 foot - Wayne"
20916,kendrick rapping like he just got punched in the nuts doesn't get you going??
20917,plus one for ali bomaye. any other recommendations for that epic-sounding vocal samples? the only other example i can think of is palmolive by freddie gibbs
20918,Yessir came here to comment ante up remix
20919,Bounce Back - Big Sean
20920,This>>
20921,City Morgue - Vol 1: Hell or High Water
20922,Don't sleep on Vol 2 either! I would just put the tape on and go ham for a solid couple of months
20923,I enjoy the energy on toxic boogaloo much better than Vol 2
20924,"I like it but don't love it, unfortunately. However I also haven't tried it too much due to COVID. I just know VOL 1 makes you want to strangle your set."
20925,Headie One - Know Better
20926,"Everyone in this thread is wrong. There's only one song you should be listening to and that's Workout plan - Kanye West. 

🎶1 and 2 and 3 and 4 and get them situps right🎶"
20927,"Most of Pop Smoke’s songs - Invincible, Get Back, Showing Off pt.2, 44 Bulldog"
20928,"The New Workout Plan - Kanye

&#x200B;

Maybe this answer is a little tacky, but damn if it doesn't hype me up lol"
20929,"69 - Billy

A$AP Rocky - LPFJ2

Big Sean - Overtime

Chief Keef - Kay Kay

Denzel Curry - This Life

Earl Sweatshirt - Burgundy (this a weird one ngl lol)

Flatbush Zombies - HELL-O

G Herbo - Sins"
20930,Billy definitely the hardest workout song released in the last few years imo
20931,"Up Up and Away - Lil Wayne

My Boy - Wale (ft. J Cole)

DIET_ - Denzel Curry

OKRA - Tyler the Creator

Perfect - Logic

Backseat Freestyle - Kendrick Lamar

Free Smoke - Drake

Bricks - Carnage (ft. Migos)"
20932,"IDK- 495, mazel tov or cereal 

Dave East- Russia or phone jumpin 

Conway- half of it 

Lil durk- David Ruffin 

Meek mill- outro or milildelphia 

The game- name me king 

Future- lil one or groupies 

Rowdy rebel- computers 

The underachievers- outsiders 

Moneybagg yo- speak 4 em or reckless 

Key glock- on my soul or Russian cream 

Maxo Kream - 8 figures 

Benny the butcher- tom Ford socks, 5 to 50, rubber bands and weight, crowns for kings"
20933,Go to sleep- Eminem and DMX is the only right answer
20934,"Who dat boi - Tyler the Creator

New World Order - Flatbush Zombies

Ride Out - Schoolboy q"
20935,"Glory by Wayne is my go-to deadlift song. Broke 200kg to his second verse on it.

Recently, I've been vibing heavy with Say The Name off the new clipping. album, the bass really fits into each rep."
20936,"JoeJas - Mega Blastoise

Aminè - Reel it in 

Young M.A. - Dripset

Baby Keem - Apologize"
20937,Upvoted for Apologize
20938,"Seconded. I was expecting to see way more Baby Keem under this thread in general lol. There are so many bangers on Die For My Bitch, especially the last three songs (Orange Soda, Not My Bro, Apologize)."
20939,Die for my bitch got to many your not wrong ! What do you think of hooligan?
20940,"I fell in love with hooligans the first time I heard it and it's easily became one of my favorite songs by Keem. He definitely owed us those two singles for dropping out the XXL cypher 😂 Jokes aside, I'm really excited for his next project!"
20941,Sooo fire !
20942,That Mega Blastoise song is cool. The beat sounds like something Vince Staples would rap on
20943,Eminem - Phenomenal
20944,50 Cent - Get Up
20945,"I could go on and on talking about songs but instead I’ll just list off a couple of the main artists I listen to while working out because most of these artists’ music hits best in the gym:

Eminem

Kanye

Drake

Meek Mill

50 Cent

Lil Wayne

Kendrick

Lil Baby"
20946,"Can’t Tell Me Nothing - Kanye West

Stronger - Kanye West

Touch The Sky - Kanye West

On Sight - Kanye West

Power - Kanye West

OTIS - Kanye West & Jay Z

Amazing - Kanye West

Oh I almost forgot

New Workout Plan - Kanye West"
20947,"Rico Nasty - Rage

NLE Choppa - Capo

City Morgue - Thresh

Tkay Maidza - Awake"
20948,Meek Mill - Millidelphia
20949,"I can't believe I'm not seeing ""Can't Be Touched"" by Roy Jones in this thread smh"
20950,I was expecting this at the top tbh
20951,bro the lack of waka in the comments is crazy
20952,Demigodz Is Back - Demigodz
20953,"People sleep on the Demigodz. I havent heard Apathy spit a single verse in his entire career that didnt make me say ""goddamn"" atleast once."
20954,Stick Talk. Michael Phelps knows.
20955,Jeezy’s entire discography
20956,"ScHoolboy Q - Collard Greens
A$AP Ferg - East Coast REMIX, Mattress REMIX
Injury Reserve - Jailbreak the Tesla, Wax On
Travis Scott - HOUSTONFORNICATION
Big K. R. I. T - Big Bank, Subenstein, Ride Wit Me
Pusha T - If You Know, You Know, The Games We Play, What Would Meek Do?

These are just a few that I can pick up at the top of my head. They are frequents in my workout playlist."
20957,No Mercy and Simon Says by Pharoahe Monch
20958,New Level by Ferg is too good
20959,Devil is a lie - Rick Ross ft Jay Z
20960,"Freddie Gibbs - Weight 

&#x200B;

 honestly the whole Freddy Album is sick for the gym"
20961,"No Quitter Go Getta - Lil Wayne

if this song doesnt push you, i dont know if anything else does"
20962,"To mention a few artists I haven't seen listed yet:

Crocodile Tears - Billy Woods

Shutdown - Skepta

30 or Monopoly or Dance in the Water - Danny Brown

Big Beast - Killer Mike

Get Back - Luda

Also for the record Work Bitch by Britney Spears is the ultimate workout song"
20963,FANETO
20964,Lay it down - Freddie gibbs
20965,"Most of the best have already been mentioned, some of my favs : 

Till I Collapse - Eminem

Back Down - 50 cent

Lyrical Excersie - Jay Z 

Dirt off your Shoulder - Jay Z 

Tres Leches - Big Pun ft. Prodigy, Inspectah Deck

Go To Sleep - Eminem, DMX, Obie Trice

Intro (its dark and hell is hot) - DMX

The Cross - Nas

Made you Look - Nas

Straight to the Bank - 50 cent"
20966,anything that Griselda touches
20967,Chief Keef - Faneto
20968,ali bomaye
20969,"BMF-Rick Ross

Watch My Shoes - Lil Wayne

Rollin - Lil Wayne

Tupac Back - Meek Mill Ft Rick Ross

9 Piece - Rick Ross Ft Lil Wayne

John - Lil Wayne Ft Rick Ross

Grove St Party - Waka Flocka Flame

Hallelujah - Chief Keef

3Hunna - Chief Keef

Kobe - Chief Keef

Crack - 2 Chainz

No Lie - 2 Chainz ft Drake

Birthday Song - 2 Chainz ft Kanye West

Im Different - 2 Chainz

Karate Chop Remix - Future ft Lil Wayne

CoCo - OT Genasis

Cut It - Ot Genasis ft Young Dolph"
20970,"Signed to the Streets 1 & 2 by Lil Durk

War with us - youngboy

Get back - pop smoke

Scenario - pop smoke

Shooters - LA & rondo9

Kill shit - lil herb & lil bibby

Step Harder - yungeen ace

Crazy story - king von

Traffic - lil reese"
20971,"Kanye west - power
Denzel curry - vengeance
Kanye west - stronger
Pop smoke - war
Brockhampton - Gold
NBA Youngboy - outside today
Playboi carti - RIP
Travis Scott - through the late night
Travis Scott - oh my dis side"
20972,"https://open.spotify.com/playlist/4CYl08qAbDtQ1YUcYwqDSH?si=RRER0UxjQzuCMp1ppI7wNw

(Here’s my playlist... 90% Hiphop with some rock and house)

:)"
20973,"* Push It - Rick Ross
* Bobby Bitch - Bobby Shmurda
* Dipset (Santana's Town) - Juelz Santana & Cam'ron
* Ultimate - Denzel Curry
* Faneto - Chief Keef
* El Chapo - The Game & Skrillex
* One Blood - The Game
* Hard in Da Paint - Waka Flocka Flame
* Bricks - Carnage & Migos
* Shabba - A$AP Ferg & Rocky
* Old English - Young Thug, A$AP Ferg, Freddie Gibbs
* No Love - Death Grips
* Oh My Darling Don't Cry - Run the Jewels

Anything with a beat that goes hard really. I don't really listen to the lyrics when I work out"
20974,"New Level by Ferg is a great one, I'd also vouch for Westbrook by J.I.D. that Ferg also pops in on."
20975,Heart Attack by Scxrlxrd
20976,Pretty much any DMX song
20977,Can't be touched- Roy Jones Jr
20979,Yo if you have itunes I’m happy to send full playlists of bangers just DM
20980,Comethazine on shuffle
20981,I got the work - Lil Uzi Vert
20982,The New Workout Plan Kanye West
20983,"Eminem - survival 
ASAP Ferg - butt naked 
Trippie redd - the grinch 
Kanye west - champion 
Meek mill - check
Key glock - dough"
20984,Bubbles Buried in this Jungle - Death Grips
20985,Ik I’m late by Dump Dump by ferg is a godly workout song
20986,Chicago drill - the whole genre
20987,Pretty much all of Thug Motivation 101 by Jeezy
20988,"Denzel Curry - PERCZ

Denzel Curry - BIRDZ

Denzel Curry - PERCZ

Denzel Curry - BIRDZ

Denzel Curry - PERCZ

Denzel Curry - BIRDZ"
20989,"* 50 Cent - In Da Club
* Jay Z/Linkin Park - Numb
* Nelly - Ride With Me
* Kanye West - Stronger
* Jay Z - 99 Problems
* Fabolous - Breathe
* Ja Rule - Clap Back
* Lil Wayne - Hustler Muzik/Money On My Mind
* T.I - You Know
* Eminem - Lose Yourself"
20990,50 cent makes the best workout music imo. Makes me feel sick well I bench the bar and then rock the stair climber
20991,"Kanye West - POWER

Kanye West ft. Jay Z & Swizz Beatz - POWER Remix"
20992,Till i collapse by Eminem
20993,"1. Big L - The Big Picture Intro
2. 50 Cent - Heat
3. D12 - Pistol Pistol
4. ODB - Brooklyn Zoo
5. Trick Trick - Who Want It
6. John Cena - Bad, Bad Man
7. Tech N9ne - Worldwide Choppers
8. Statik Selektah - Put Jewels On It
9. Pharaohe Monch - Simon Says
10. Jay Rock - Win
11. The Game - Ali Bomaye"
20994,"LL Cool J - Mama Said Knock You Out
Kendrick Lamar - Backseat Freestyle
Tupac - Ambitionz Az a Ridah"
20995,"Lil Baby

Meek Mill 

Pop Smoke"
20996,Pay for it by Jay Rock and Kendrick is one of my favorites
20997,"Late to the party but two of my favorites are

Throw it Up- Lil Jon & The East Side Boyz

What’s Happnin!- Ying Yang Twins

I always go hard as hell to those two tracks"
20998,Death Grips - I’ve Seen Footage
20999,Outlet-Desiigner
21000,Onyz - any full album
21001,Commenting to save thread
21002,"My favorites of all time:






Lift Me Up, Don't Get Chipped - Vince Staples






Watch, 3500 - Travis Scott





Champions, Flashing Lights, Diamonds From Sierra Leone - Ye






Slow Roll - Boldy James






Takeover - Jay Z







NY State of Mind - Nas







I Don't Like - Chief Keef








Hasta Luego - JID








Shook Ones, pt II - Mobb Deep








Victory - Diddy







Heartbeat - Childish Gambino







FEEL THE LOVE, Kids See Ghosts - KSG









Dreams and Nightmares - Meek Mill







LIFE - Saba








1train - A$AP Rocky







RIP - Playboi Carti







Have Mercy - YBN Cordae









Clout cobain, ULT - Denzel Curry









Talk To Me, All My Life - RTJ"
21003,Til I Collapse - Eminem
21004,"Bonfire - Childish Gambino
Freaks and Geeks - Childish Gambino
A Milli - Lil Wayne
6 foot 7 foot - Lil Wayne
Gone - Kanye West"
21005,"Till I collapse- Eminem

Where da hood at - DMX

Grindin all my life - Nipsey hussle"
21006,I been running to Lupe's whole discography the last week or so. So many songs I forgot about. I get lost in his wordplay and storytelling sometimes that I forget I'm even running. If I'm doing more of an intense workout Run the Jewels does it for me.specifically RTJ2. Shit makes me wanna fight.
21007,Ain't No Click - Lloyd Banks
21008,This album was on a lot during my high school football lifts.
21009,Ay. Didn't think I'd get a reply. This album goes hard.
21010,Andy Mineo - You Can't Stop Me
21011,"My fav Kanye: No church in the wild, Hell of a life, Mercy, Stronger, 

&#x200B;

Multiply - ASAP Rocky

Motorsport - Migos"
21012,"Virtually anything from Run the Jewels. I play RTJ2 and RTJ3 back to back so that I don’t have to worry about skipping songs while I’m working out. 

Legend has it

Call Ticketron

Blockbuster Night Pt 1

Close your Eyes (and count to fuck)

Talk to Me

Oh My Darling Dont Cry

Hey Kids (Bumaye)

All are ridiculously hard and keep that heart rate up."
21013,Snow  - Informer
21014,When in Rome - Mac Miller
21015,"X gon give it to ya
Till I collapse 
Still dre
Niggas in paris
Ultimate
Plain Jane
No limit
Going Bad
Energy 
Berzerk
Lose Yourself
Humble
DNA
Maad city
Wesleys theory
If you know you know
Come back baby
Grindin
Clint Eastwood
No love
Not afraid
CREAM
In da club
PIMP
Hate it or love it
No Vaseline
Forgot about dre
SICKO MODE
Man of the Year
Ric flair drip
Panda
Hot nigga
Black and yellow
Fuckin problems
Santeria
Hard piano
Yikes
Drip too hard
Ballin
The box
Pop out"
21016,"The fuck, why is my comment this way?"
21017,You have to Double Space
21018,Kanye’s work out plan
21019,I don’t like him as a person but the super hype 6ix9ine songs work great
21020,Shyne-Whatcha Gonna Do?
21021,[Stic.Man — «Back On My Regiment»](https://youtu.be/1OlA1xjI0Wk). No doubt!
21022,Ace Hood - Undefeated
21023,Royce Da 5’9” - Savages
21024,"Diddy, BIG and Busta - Victory

https://open.spotify.com/track/2B9aYvlGefTIgKLhM6ia8t?si=x4SxufdKS3-Uzl4rDcaG1A"
21025,Gang Starr's Lights Out
21026,Look alive remix with a handful of rappers on youtube. Gets me really energetic
21027,G Herbo - By Any Means ft. 21 Savage has been my go-to workout song for a while now.
21028,Vic Mensa - Dynasty
21029,[Killing in the Name of](http://youtu.be/QNzIKoAy2pk)
21030,yes but how to you refrain from destroying the entire gym ?
21031,Hard to find other music that gives u so much energy as RATM.
21032,"I usually listen to punk/hardcore bands when lifting. To not distract myself when songs switch I usually put on whole albums. My favorite ones by far are by Rise Against. Here are some examples (bottom is more for heavy squats):

Rise Against - Revolutions per Minute (or RPM 10)

Strung Out - Blackhawks Over Los Angeles

Atlas Losing Grip - State of Unrest

Death by Stereo - Death is my only friend

Hot Water Music - Caution

The Bronx - The Bronx

The Scandals - The Sound of Your Stereo

The Lawrence Arms - Metropole (little slower)

ZSK - Herz für die Sache

Against Me - As the Eternal Cowboy

Maschine Head - Unto The Locust

Converge - All we Love We Leave Behind

Ryker's - A Lesson in Loyalty"
21033,"Some great albums here. I'd add:

* Belvedere - Fast Forward Eats the Tape
* This is a Standoff - Be Excited
* Asado - Asado
* The Flatliners - Cavalcade

Some other good bands in this vein (melodic hardcore and/or upbeat punk-y):

* Hero of Our Time
* A Wilhelm Scream
* Latterman
* A Second Plan
* Nothington
* Bear Vs. Shark
* Anchors for Arms
* Strike Anywhere
* The Fullblast
* Living With Lions
* RX Bandits"
21034,"Thanks, I will definitely listen into those :)"
