idx,text
22918,"Jodie Foster.

Worked on her directorial debut way back in 1990, Little Man Tate, as a lowly unpaid art department intern.  Everyone on the crew was unbelievably cool.  Had the pleasure of sitting next to Jodie at lunch a couple of times.  She seemed absolutely without ego - just funny, warm, brilliant and kind.  Easily the most down-to-Earth celebrity I've had the pleasure of working with."
22919,"I love her, I think she's funnier than people give her credit for, but man if you want to waste some hours and laugh watch some of her interviews from when she was like 17. She was ridiculous, one of those people who probably grew up too fast and has always been an adult which is just funny to see when she was so young. This one in particular http://www.youtube.com/watch?v=FaDzWGHNQbI It's also interesting to see how she fields questions about her love life."
22920,Met Bill Nighy and he was amazingly lovely. Shook my hand and offered to pose for a photo with no complaints at all :)
22921,I met R. Lee Ermy in a gun shop once. He was hilarious and even posed for a [photo](http://i.imgur.com/N9I3r.jpg)
22922,"Ron Jeremy. He's surprisingly very quiet and sweet.

Edit: I was feeling a bit awkward that I had a Ron Jeremy dildo at home in my pleasure chest and didn't know if I should tell him or not.

I also met Bridget the Midget. She stripped at a super bowl party I went to right after she got her fake boobs. She was very nice as well!"
22923,He lets his dick do the talking.
22924,And it does a lot of talking.
22925,"I have met Ron Jeremy twice and the second time he was my beer pong partner even tho he does not drink. I called the couch and Ron, being narcaleptic passed out on it but I was drunk so I pushed him to the end so technically I slept with Ron Jeremy."
22927,That would have been awkward since I have a vagina. Talk about talent!
22929,"I met Wil Wheaton at a book signing here in Seattle, and we shot the shit about homebrewing mead.  Great guy."
22930,"He most likely appreciated you not shouting ""Shut up Wesley"" at him."
22931,"Tony Hawk, late 90's. He came to our local skatepark for a demo but it was a tiny little indoor park and he couldn't do much. After skating for a bit to appease the crowd, he snuck out the back across the parking lot to the bowling alley. Me and two friends followed him, he invited us to bowl with him, bought us chicken tenders and french fries and talked about skateboarding with us for over an hour. Honestly one of the coolest guys I've ever met, fast forward 20 years later and I get to meet him again at our local skatepark unveiling that his foundation helped pay for and man, he was just as cool. We chatted a bit at the water fountain, I mentioned that as a kid he treated us to chicken tenders and french fries at the bowling alley when I was just a kid, and wouldn't you know it he was like oh in Amity Ct? Wasn't the skatepark called B17? I was simply floored. He went on to explain he was having a rough day that day and just hanging with three little kids bowling and talking skateboarding made him realize just how great life was. 

Thank you for everything you have ever done for skateboarding Tony!"
22932,"Dude, I would freak the fuck out if I ever met Tony Hawk. I never really skateboarded but I was fucking obsessed with the sport. Hawk was and still is my favorite professional athlete. Super stoked to hear that he’s the fucking man!"
22933,"Meet him aswell on my birthday in Berlin as he was with his birdhouse team for a demo there. 
Incredible how calm and nice he was for such an impactful person in the skate scene. 
Best birthday ever because I didn’t knew he was in Berlin until I arrived at the park."
22934,Most of the OG's are bros
22935,"Met Viggo Mortensen quite a handful of times as he used to go to the restaurant I managed at the time. 

He was one of the nicest, most down to earth celebrities we had. He would, after we offered, join us for dinner once the restaurant had closed and would bring small gifts every time for everyone."
22936,"I’ve heard he’s genuinely decent, which makes me happy since I love his acting."
22937,He really is. I still have all the books he gave me from his editorial.
22938,My wife grew up with a member of his distant family. Once she went to Upstate New York and he happened to be there. This happened to be after he had filmed Lord of the Rings but before the first movie it come out. Apparently she got rather wasted and he helped her find the bedroom in this big house make sure she was tucked in and brought her a big cup of coffee the next morning. He also told her at the time that the only reason he did Lord of the Rings was because of son was so excited he got the chance to do it. If it wasn't for that he probably never would have done Lord of the Rings.
22939,"I have two.  The first is Jerry Springer.  I met him while traveling when we happened to be staying at the same hotel.  He was super nice, took photos and answered questions.  All smiles and jokes.  

The second is Stephen Spielburg.  I met him at some benefit I got invited to as a teen due to having good grades or some shit and he not only had a super normal convo with me, but when I told him where I really wanted to work (but hadn't been able to get an interview) he took me to the next table where the company's CEO was and introduced me.  Worked there for 5 years after."
22940,"Hot damn, I'd buy a ticket to every Spielberg movie after that, even if I didn't want to see it."
22943,Did he ask you to yell at the moon with him?
22944,"Bruce Campbell. Awesome dude.

He signed my Army of Darkness poster 'Stay groovy - Ash'"
22945,"I’ve posted this in a similar thread a while back:


Andre 3000. This was over 15 years ago. When I was in high school, I worked a local family owned plant nursery. Andre, his wife, and their (then baby) boy used to come in and shop almost every weekend. He was a super nice guy. One time, he bought an entire pallet of sod. He had a brand new Lincoln Blackwood pickup truck, and the pallet wouldn't fit in the bed with the forklift, so I had to load it by hand. He went in, bought a pair of gloves, came back out and helped me load it. Also told me that he was going to go home and lay it out by himself. Kind of shocking considering how much that guy is probably worth. Something that didn't strike me at the time, that I now realize as an adult, was how good of a father he was. His son was just a baby, but man did he love that baby. Every time he would walk up to put a piece of sod in the bed of his truck, he would peek in the window and make a face at his son sitting in the back seat. The kid would cackle like a banshee. After we finished, he gave me a $100 tip, which, to a 15 year old in the early 2000s, was a ton of money. Truly a stand up guy and a very talented artist."
22946,"He had his son with Erykah Badu, so you got to meet her too."
22948,This really makes me happy.
22950,The fact you added the commas to your story only added to the story. Now I'm thinking that you may be Christopher Walken.
22951,I can't stop reading comments in Cristopher Walken's voice now.  Fuck.
22952,"Tip: If you are trying to impress the cashier, demonstrate your value by buying a box of magnum condoms, thus demonstrating that you have a monster dong"
22953,"Met Mr Rogers years ago in a drug store. He was SUPER nice to the several people that had been quietly following him around the store. His wife on the other hand, seemed annoyed with it."
22954,We never deserved him.
22955,Well when your husband is the *friendliest* man in the neighborhood...
22956,Stone Cold Steve Austin found my dog that ran away and picked him up off of the highway. He ended up cleaning up our dog and gave him tons of toys before we got him back.
22957,"""If you want your dog back, give me a 'hell yeah!'"""
22958,Austin 3:16 says I just saved your dog
22959,"*Steve*:  Here's your dog back.

*You*: Wow!  Steve Austin?  Holy shit, thank you!  *reaches for hand shake*

*Steve*: *Proceeds to apply Stone Cold Stunner*  I... I'm sorry.  I'm still working on the hand shake thing.  Enjoy your dog.  Bye."
22960,"Rob Lowe - met him at a kids party. He's related to a kid that was at my kids daycare. Awesome guy. Very friendly. 

Jay Leno - I've met and observed him at the Rock Store many times. Always a nice guy. Friendly. Love the guy."
22961,"This is, **literally**, the most uplifting news in the history of mankind"
22962,"Chris Hemsworth and Scarlett Johansson regularly frequented the restaurant I work at for a bit, and they are both genuinely awesome people.  Ashton Kutcher and Mila Kunis were way too preoccupied when they came in to even acknowledge my presence of trying to wait on them."
22963,"My friend’s partner’s best friend is the Hemsworth brothers’ mum’s godson and they have hung out with the fam a couple of times. 

Through that very reliable link and via the one conversation we’ve had about it, I can report I have heard nothing but good things about the Hemsworths!"
22964,"I've posted this before, but I once spilled a very large, very colorful, drink on Kate Hudson.

My girlfriend and I ended up in a VIP area at a music festival totally by accident. We weren't supposed to be there but walked right in not knowing it was restricted and since we were there we decided to stay.

We ended up in a corner as to not draw attention to ourselves and I would walk over to the bar occasionally to get us drinks and bring them back. A few hours and more than a few rounds later, my girlfriend decided she had to have one of the plastic yard glasses of Margaritas that they were selling, so I attempted to bring back one and a few beers on my next trip. I made it within ten feet of where we where stationed, when I sidestepped a dancing girl, tripped, and spilled the entire yard glass on a women. When she turned around, I realized that the women that I had just soaked was Kate Hudson. She was incredibly awesome about it, and luckily my girlfriend had an extra shirt with her that she could change into."
22965,"A coworker noticed Robin Williams flipping through a book quietly at a bookstore I worked at. It was during the filming of Good Will Hunting so he had a beard and wasn’t so recognizable- she said “I think that’s Robin Williams!”, he looked up from his book smiled and then put a finger to his mouth “Shhhh, I know”"
22967,"He bought a double espresso from me and used his real name, which I wasn't expecting. Quiet, unassuming man, very patient with our long line, tipped his change, and then chatted amiably with the barista while he waited for his drink. I had a great experience with him; I wish he'd had a great experience with us so he would have come back."
22968,"My mom met Richard Simmons in an elevator. My twin brother and I were babies, and my older brother was 2 or 3? He picked my brother up and I think did some goochey goo shit to my twin brother and me."
22969,Show me on the doll where Mr. Simmons goochey goo’d you
22970,"Easy to imagine that Robin Williams would be one of the nicest celebrities out there. Always seemed to be such a great guy. Him, and Tom Hanks."
22972,"Made me smile. Easy to imagine as it would have happened.

R.I.P. Robin Williams"
22974,"Rory McCann (The Hound from Game of Thrones). He was in Sydney, and I figured I never get this opportunity any other time, so I went up to him. He was very nice and shook my hand. He didn't want a photo, but not a big deal, was just cool to meet him! 

And this was like a few days right after his chicken episode where he was like ""I understand that if any more words come pouring out your cunt mouth, I'm gonna have to eat every fucking chicken in this room"""
22975,"He did an interview where he said fans ask him to tell them to fuck off, and they both leave happy"
22976,Diane Keaton. I was with my husband and kids at the beach where she owns a home. She complimented our “beautiful” children and was very friendly. My husband didn’t realize who it was until she was gone and I told him.
22977,"Shared an elevator with Beyoncé back in the early 2000s when she was doing the Destiny’s Child farewell tour. It was my dad, me, Beyoncé, and a hulking bodyguard. My dad being my dad didn’t know who she was and assumed they were a married couple and gave the man crap about carrying all the bags himself. She laughed, he kinda giggled a bit and they looked at each other awkwardly. Then they hopped off the elevator and walked straight onto a tour bus with her face plastered on the side at which point my dad asked “wait who is that”. 5/7 would share an elevator again."
22978,"As long as you're not sharing an elevator with Solange, you'll be safe."
22979,"Jaden Smith wouldn't leave my store thirty minutes after we closed. Neither would his security guard, the girl he was with, or the eight or nine other girls that were clearly asked to stay at least thirty feet away from him. 
 
He kept saying ""Bro, it's cool. Don't worry, bro, it's cool. It's cool""  
 
Fuck you Jaden, there are about twenty people in this store that can't go home until you get your stupid entitled ass out of here.  
 
**EDIT:**  The next day he accused a hotel down the street of trying to poison him with ~~cheese in his pancakes~~ ricotta in his crepes? 
 
**EDIT 2:** Just to clear a couple of things up: 
He did eventually leave about ten minutes after I asked, but not before finishing his shopping and holdup up our staff. And unfortunately our store leadership will bend over backwards (the won't call security or back me up in the removing of late shoppers) for pretty much anyone, so unless I could convince Jaden to leave, they'd have let him keep shopping."
22980,Finally a bad one
22981,How can your store be real if money is not real
22982,This does not surprise me at all
22984,I went through an airport security line with Keanu Reeves. He was super cool and open for about a 5 minutes conversation (they had closed the line behind him so it was really just the two of us for a bit). He was even good natured when I asked if I could take a selfie with him. Good dude. Once we got through the line a crowd gathered quickly and security whisked him away.
22985,"HE didn't open his coat revealing his metal objects, and then palm strike the TSA?"
22986,"I’m sure this will come as no surprise, but John Cena is one of the nicest and naturally awesome people in existence. He came to visit the new enlisted rec center they built for us back in the mid 00’s to do a meet and greet. While he was only booked to be there from 1400 to 1600, when we told him that most of the SUBSCOL students didn’t get out class until then he said he’d be more than willing to stay later. He hung out with all the guys who came to see him shooting pool, playing darts and Xbox, and pretty much signing everything and taking a ton of pictures. The dude is just a straight up class act."
22987,"You can tell he is so genuine too, he does so much for people and is always nice. I don't think I have ever seen any bad press from him. I'll alwasy remember the video  of the time TMZ tried to get him to say something bad about a wrestler that had just come out as gay and it completely backfired and just showed how nice he was."
22988,TMZ is shit. No one cares about what they have to say about anything.
22989,"Yeah, but that was also TMZ not knowing that pro wrestling is really, really, really progressive with gay issues- there's usually at least one gay worker in each locker room, and virtually no one has a problem with that (and if they do, they usually get weeded out quickly.)"
22990,"""He hung out with all the guys who came to see him"" But did they see him?"
22991,Unfortunately they couldn't. But he's still a good guy.
22992,I have heard this about him.  Glad to hear it's always confirmed when people talk about their interactions with him.
22993,"Bruce Willis.

I was a NYC taxi driver and i pick him up at a restaurant very late at night. He starts asking me all these questions about the long hours, how much a good cabbie makes a night, etc.

He asks me if I am married, I say yes, asks about my wife. I tell him marriage is great but we aren't together much due to the long hours i drive the cab.

We get to his place, hands me $1,000 and says, ""Now go take a week off and spend it with your wife.""

True story."
22994,"Man, what a guy. 

I hope you took the cash and had a week with your wife dude."
22995,"David Beckham.

I didnt know who he was at the time.   I was staying at the grand Hyatt in hong kong and galaxy was there for an exhibition game.

There were a lot of fan girls outside with posters and shit in the roped off area near the front entrance.

I'm in the elevator and DB walks in.  I give him a nod and he gives me one back.  Then I ask him if he knows what all the commotion outside is.  He just shrugs and says it must be someone famous staying there.    We get to his floor and he gives me a wave goodbye and exits.


My work colleague later tells me that Beckham is staying there based on the pics he saw the fans waiving.   I look up his pic online and realize its the dude I was chatting with in the elevator.

nice guy."
22996,"Amy Lee of Evanescence was absolutely wonderful. Some friends and I waited after a concert for autographs, and prior to Amy emerging,  the bouncer-type-guy laid out in no uncertain terms that we weren't to try to touch her.

Well, one friend had had depression and Evanescence was one of the things that got her through her teen years. So she broke down in tears when Amy got to her in the autograph line, and Amy just went in and gave her this giant, comforting hug (hard to do since Amy is SO tiny). She was fabulous."
22997,"I saw her a few years ago and we weren't allowed to touch or have pictures with her, but I asked for an autograph to be made out to my dead brother who introduced me to them and she just gave me the biggest hug. Can confirm, very tiny woman."
22998,Honestly it seems like a good idea to have a blanket policy of no touching if you're gonna be interacting with strangers who may or may not have an appropriate sense of personal boundaries.
22999,Amy honestly seems so precious. I feel like she’d be a joy to hang out with.
23000,"I was waiting for an order in a bakery about 10 years ago, Pauly Shore walked in, looked around in awe at the pies, then looked at me and said ""look at all these treeeeeats"".  My life was complete."
23001,"Many years ago, I was in a gallery with my girlfriend at the time, and she said, ""Isn't that Lou Reed?""

I'd seen that guy at a lot of openings and in fact I'd mentally categorized him as ""that guy who looks like Lou Reed"" but I realized, yes it was!  So I told her this.

He'd been walking to the door when we said this and had heard us - and he stopped by the door, turned around, crossed his arms and looked right at us.  The message was clear: ""I'm leaving, so if you wanted to say something, now is the time.""

My girlfriend walked over to him and said, ""I just want to shake your hand.""  He said, ""Put it there,"" and they shook hands and he left.

It was really civilized and I always had a soft spot for him after that.  RIP, Lou."
23002,"I used to work in a cafe in a very small town in New Zealand around 10 years ago. Billy Connolly was doing a tour of New Zealand - his wife is a Kiwi and he's well documented as loving the place - and was around the town I was working in.

He strolls into my cafe ten minutes before closing, asking if we're still open. I stand there dumbfounded, and just about swore in his face, thinking ""Holy shit, you're Billy Connolly, of course we're open"".

He was an absolute delight; beyond polite, sat and chatted with a table of local ladies, and roared with laughter when they said he should've had his coffee for free (""I could buy the place if I wanted to, why wouldn't I pay for my coffee""). He is everything I aspire to be as a human - kind, jovial, hilarious, and clever."
23003,"Saw Matt Damon at the Guinness storehouse in Dublin.  He seemed like he was doing his absolute best to keep a low profile, so we didn't go talk to him, but he certainly didn't seem rude.

Bonus: one of my teammates from college met Ryan Lochte after a meet.  Teammate was in his hotel room, just hanging out, and Lochte knocks on the door and asks to borrow their ironing board.  They let him have it, and a few minutes later housekeeping comes by and asks to see their ironing board.  Apparently Lochte had thrown his out the window and tried to take my friend's to cover it up.  They thought the whole thing was hilarious."
23004,So the perception that he's an immature moron is right on then.
23005,My friends sorority at UF has a long standing superstition that if you sleep with him you'll fail your finals because your IQ automatically drops twenty points.
23006,"I once walked outside of my house to run and grab a coffee. As I was waiting at a cross walk I begun to recognize the fellow waiting in front of me. I said, “excuse me, I don’t know if you know this but you’re John Malkovich.” Then John extended his hand and said, “indeed I am” and shook my hand. A kind gentlemen he was."
23007,I once got a haircut next to Adam Sandler. I was like 11. I said hi and he sort of just glanced at me.
23008,"I was at a knicks game and Adam Sandler, Chris Farley, Lorne Michaels and Jeff Daniels were there. I was 11 or so and I walked up and asked for an autograph and they said no. Then my 23 year old smoking hot sister in law walked up and asked them for an autograph and they obliged. She then told them that they were assholes and they should be ashamed of themselves and she gave me the autograph in front of them. 

It was the week of Jan 8 1995, Jeff Daniels hosted SNL that Saturday 

Edit: it was Tuesday Jan 10 and the Knicks beat the Pacers"
23009,"I mean to be fair, you’re not as smoking hot as your sister in law"
23010,I should have tried Kevin Spacey
23011,"I had the same reaction to just say ""hi"" when I recognized a celebrity.  Well, it wasn't really a celebrity, it was Mitch McConnell at a little corner store where I lived in DC.  He didn't say hi back. He also looks like he's made of wax in person."
23012,"> He also looks like he's made of wax

Turtle Wax."
23013,He probably eats little pieces of shits like you for breakfast.
23014,He eats pieces of shit for breakfast?
23015,"What's the basis? 
We ain't goin' nowhere, but got suits and cases…"
23016,"I met Rob Dyrdek at an outdoor mall in his hometown back in 2011. At the time I was a huge fan and was even wearing a Dyrdek DC hat. He was there for a family members birthday so the whole family was with him. We casually went up to talk to him and he was very kind and respectful. He could see that my friends and I were skateboarders so he stood and talked to us for a minute while the Dad's talked about boats and other dad things. People ran up for quick pictures but he made us feel appreciated for supporting him. He left with telling me, ""I like the hat, God bless"" and they went on with their night. 14 year old me couldn't be happier he was as cool as he seemed."
23018,"I've encountered a few celebrities from my days working at a popular casino. 

Gordon Ramsay was very polite and very nice to talk to. I left that interaction thinking, what a cool guy. Quite the gentleman. 

Ricki Lake is adorable! I didn't even realize it was her at first, but once we caught on she sat down with us to discuss her weight loss journey and stayed for a good half hour. She was witty and charming. Such a delight. 

Charles Barkley was very down to earth. No entourage. No security. Just came in to our store to shop and very willing to chat and take pictures if you wanted. 

Brad Garrett from Everybody Loves Raymond... what a miserable guy. Would not acknowledge anybody with eye contact. Specifically asked us not to talk to him. And if you approached him to see if he needed any help you got this death stare like you were the foulest piece of garbage. 

Oh and as a bonus, the first celebrity I ever met was Liza Minnelli when I was a young boy. I remember she had a big furry coat and this little dog. The dog came over to play with me. She then came over and patted my head telling my dad ""You have such a cute little boy"". Very nice lady!"
23019,"My first celebrity experience when I first moved to LA was meeting Weird Al Yankovich.  He came in to eat at the restaurant I was hosting at and while his date was in the bathroom before they left he was was sitting in this lounging area we had.  Being all of 18 and thinking I was playing it cool I asked ""So, you working on anything new?"" like I knew him personally or something.

He just kind of shrugged and said not really and was followed by another 40 seconds or so of awkward silence.  He wasn't rude or nice; it was obvious he wasn't in the mood though.  Which I totally get now nearly two decades later."
23020,"I met him at a meet and greet and he was very sweet and kind, but not the ""wild and crazy guy"" you expect him to be. I feel like if I had just met him and he wasn't famous, I would peg him for someone who was kind of shy and introverted.

He probably wasn't being rude - he may have been genuinely uncomfortable."
23021,"I've met Al numerous times. There are 2 Als you get, Weird Al and genuine Al. If someone goes up to him and is all goofy, they are gonna get Weird Al. The next person could go up and just be appreciative of him and they will get genuine Al. You can see it in interviews too. If the interviewer is asking questions that are just stupid and they're only asking him because he calls himself Weird, then he is gonna put on a show. But if they ask him questions like any other celebrity out comes genuine Al."
23022,"Bill Murray almost hit me with his car. He did that ""I'm sorry"" face people always make when they almost kill you with a car.

Do I get a reward for having the most boring Bill Murray story?"
23024,Amazing how well that fits into my idea of him I already had.
23025,"> misunderstood who I was and what my job was at an event

I still don't know who you are and what your job was."
23026,My sister used to work in a shop which Nicolas Cage sometimes visited. She says he was lovely.
23027,Norman Reedus was a pretty chill dude - shared a drink and a story and parted company at the hotel bar we were both staying at.
23028,"I am a journalist. I interviewed Norman Reedus a few years back on the phone. He was hilarious and very charming. His assistant emailed me a couple of hours later asking me to include specific photos of him with his crossbow from TWD because, and I quote ""these make him look more badass."""
23029,Did you see any creepy babies in his mouth giving you a thumbs up?
23030,"When  I met Prince Harry at a bar, he was like an excited labrador in human form."
23031,TIL Prince Harry is really Mr. Peanutbutter.
23032,"I used to work for a company that had celebs, most musicians, come through our office on a regular basis. Most were just regular people, but a couple stick out.

George Clinton (yes my name is pfunk so this one was special to me) was amazing. He was playing at our yearly company conference and if you volunteered to set up you got to meet him. I volunteered every year and out of everyone he was the best. Most did the regular meet and greet thing, smiles, pictures, autograph, not GC. He showed up early and spend almost 4 hours with the 20 or so of us. Just awesome.

Garth Brooks - came into the office for a meeting with our CEO one morning, then spent the rest of the day shooting the shit in the breakroom. His manager asked him a few times to get going but he wasn't leaving till he had answered every question and signed every autograph. I wasn't a big fan, but he was a legit great guy.

Will.I.Am - dude was really nice and crazy smart.

Fergie - told me I was cute in front of my then girlfriend, now wife. She hates when I make her confirm that to people."
23033,"I used to deliver food from a catering service to the airport for private flights. My favorite encounter was Johnny Depp. Handed him his food and he handed me a wadded up bill, I thought I just got stiffed on my tip.

Turned out it was a freaking $100 bill wadded up into a little ball. Legend."
23034,He’s still waiting for his change.
23035,"I'm a helicopter pilot and had the displeasure of flying Justin Bieber, his father and a couple of his douchey friends. He lives up to his reputation and was incredibly rude."
23037,"I was personal assistant and driver for John Stamos for a week. He and his girlfriend (the one he’s getting married to, forgive me, I’ve forgotten her name) were the nicest, most normal people. He preferred to handle his luggage himself instead of having me do it, he was very modest and friendly, and had a great sense of humor. 

His sisters, however, (who were also people I had to take care of that week) were absolute nightmares. Constantly asking him for money and acting like they’re the important, vain, famous ones, when they weren’t."
23038,"Gordon Ramsay - genuine bloke, very friendly, true family man, great with kids"
23039,"I worked the Sundance film festival in the 90's as a projectionist.  Samuel L Jackson came up to me outside & asked for a light for his smoke.  We chatted while we smoked.  VERY nice guy and asked me about my job.  Best smoke break I ever took.

Another encounter was Lawrence Fishburn....I saw him poking a steamer tray full of salad with a big serving spoon then not take any.  Say ""Lawrence Fishburn"" to me and I don't think of Morpheus or any other of his great characters...I think of a guy poking a steamer tray of sketchy pasta salad and not taking any."
23040,"Worked at a pretty big nightclub in Hollywood for a while, we would get celebrities in our place and would see them around. 

Miley Cyrus--had the premier for the Hannah Montana movie, her and her entourage took over the back room. As expected a bunch of little kids waiting to see her and wanting autographs at the cordon. Associate/aide/whatever comes up and asks if we can clear the kids away because they are bothering Ms. Cyrus. She didn't say this herself, but she was looking over and didn't do or say anything to counteract it. 

Mandy Moore--nicest person, all smiles and giggles. I almost professed my undying love for her, but her man at the time was with her. Wasn't phased in the least by having to wait for an extra 15 minutes outside for her car to gather her. 

Masi Oka--brought an underage girl in and when stopped at the door for her not having ID (we had vice on our asses all the time so we were supposed to be ""strict"" about ages) he complained that since everyone knew him it should be ok. Managers eventually let him him. 

Marilyn Manson--came for a big Halloween celebration, spent the whole time in a closed off VIP area and drank all the free stuff. Ended up not performing and just bounced out. 

Sean Combs--came for a event by someone else, ended up taking the stage and doing an impromptu set for over an hour. No fanfare before hand, he just asked for a mic. 

Queen Latifa--one of the most beautiful women I have ever met, not only looks wise but in graciousness. Very approachable and pleasant to talk to. 

Terry Crews--love this guy. Ran a BET event, VIP was upstairs. No one without a wristband goes up. Of course everyone says they are someone or with someone, and me being a simple white guy telling them no, it starts getting ugly. Terry Crews comes out of the crowd, parts the sea like fucking Moses, and stands there with me for a few minutes telling people to back the hell off and listen. Pats me on the shoulder and goes upstairs. Best guy and not a shred of primadonna about him. Great guy! If you see this Mr. Crews, you made a lifelong fan that night. 

I have more if there's interest. I guess the takeaway is that celebs are people like you and I, they just have more people telling them how great they are and how much they are wanted around. And like most people, that can easily go to their heads. Human nature and all that."
23041,Terry Crews just wanted to earn your trust before he snuck in without a wristband
23042,"Muhammed Ali - Very nice, gracious.

Justin Long - Funny, down to earth and all around bro.

Lance Armstrong - Dickhole."
23043,"I met Harrison Ford at Disneyland when I was 6 years old. I have only vague memories of that day, but according to my parents, he was standing behind us in line with his wife waiting to buy popcorn.
  
My dad hadn't notice him and was faced away with me resting on his shoulder. I guess we made eye contact and I reached out with my bag of M&Ms to offer him some.
  
According to my parents he said, ""thanks, kid. I'm good,"" at which point my mom and dad turned around, realized who it was and proceeded to lose their minds. When they calmed down they asked me, ""do you know who that is?"" and I didn't answer, so they said, ""that's Han Solo,"" and I guess I just stared at him with my mouth open for several seconds. He chuckled and shook my parents hands and went on with his day.
  
Later that year, we went to see Indiana Jones and the Last Crusade, and I spent the entire movie freaking out at the fact that I had met Indiana Jones. And once in a while, I'll be watching Star Wars or Temple of Doom, and he'll call someone ""kid,"" and I'll get a big smile on my face.
  
TL;DR: When I was a little kid, I offered Harrison Ford some M&M's and he spoke some words at me."
23044,I worked at a gas station near a music venue and spotted Jimmy Buffett standing outside talking to a ticket scalper. I went out to say hello and he said that he was curious to see how much his tickets were going for. He was an incredibly nice guy and offered to buy one of the scalpers tickets for me!
23045,"Jimmy Buffet pisses me off NOBODY should have that much success at something they love doing and having such a good time doing it! BTW if you haven't read his book ""A Pirate Looks at 40"" you should."
23047,"My ex-boyfriend's mother met Stephen King in the gym. They were the only two people there. When he finished his workout and got up to leave, he couldn't find the exit. 

Ex's mother says: ""Looking for a way out?"" 

King responds: ""Aren't we all?"" and smiles.



Oh! I forgot--I met Native American character actor Wes Studi in a bar. He was kind of self-aggradizing. Wes, my next-door neighbors, and I went to a cigar bar after the first bar. He was flashing money around. He also ran his hand up my shin and commented ""Someone got waxed today."" Wow, dude."
23048,"I've met Dave Chappelle a few times. Nice guy, but he often looked really sad to me. This was shortly before he went to South Africa for his mental health, so I'm guessing my observation that he looked sad was accurate. 

Most of Reddit is probably too young to know this one, but I also met Zsa Zsa Gabor when I was a kid. She was an absolute sweetheart, and was very nice to me during a time when I really needed a few kind words. I was sad when she passed a few years back. 

I have laid eyes on a few other celebrities, but rarely had enough interaction to form much of an opinion on them."
23050,"Can confirm - live it Dayton, met Dave twice.  Exceedingly nice guy.

My favorite Dave story:

I'm in the local cell phone store to upgrade, transfer my contacts, etc.  I'm pretty focused on working with the customer rep to get through the process quickly so I'm kinda aimed forward, but I'm hearing bits of the conversation with the service rep next to me...

I hear ...Do do you want this random expensive service?....yes.  Okay.....Do you want this other random expensive feature....yes....

I'm like ""this guy is loading up - its gonna be a small fortune when he walks outta here"".  So there is a slight pause in the conversation, and then I hear (in a very tongue-in-cheek, self-deprecating voice)  ""You know, I'm rich....give me all that shit..."".  I turn to look...and yep....Dave Chappelle with a big shit-eating grin on his face.

I finished up my business and left - during that time, everyone did their best to act normal, and just be.  I think this is why Dave stays around - everyone genuinely wants him to have as normal a day-to-day experience as someone of his fame can have."
23051,"Yep, the wife and I take our daughters to YS quite often, and it's not unusual to see him walking around town. Most people leave him alone or just yell out, ""Hey Dave!"""
23052,"I worked at a bar in a restaurant while in college and one night Kevin Hart came in to eat. He wasn't  really that famous at the time. I didn't know who he was, but I was curious as I had to go to the stock room to get a $1000+ bottle of champagne that he ordered in addition to pouring a bunch of really expensive top top shelf shots. His bill ended being well over $2000. The girl who had his table (who also didnt know who he was) said he was by far the most demanding and rude person she had encountered while working there and that he was extremely demeaning.

He ended up leaving a $4 tip, all in crumpled up singles.

Fuck Kevin Hart."
23053,"Part of filming for Central Intelligence was in Boston in my friend's neighborhood/around the corner of it. Apparently, Dwayne Johnson was just so courteous and very fan friendly, loved giving interactions (smiles hugs conversations, the works) and autographs and just making people smile when he had the time. Kevin Hart was a total jackass that didn't want to be bothered, went out of his way to make sure nobody talked to him or got near him and just had the worst holier-than-thou attitude."
23054,"If you meet Stephen Merchant on street, he will speak in a generic foreign accent and pretend he doesn't speak English."
23055,"Katie Holmes was really nice 

Though I met her in 2000, she could have changed.

I was turning in my “your tables ready” buzzer at a restaurant called Dockside, in Wrightsville Beach, NC. She was picking hers up. I was 10 and the buzzer technology was new to me and I thought it was really cool. So, being the outgoing chatty 10 year old I was, I just started talking to her “wow! These things are really neat! You can walk around and it just lets you know when your table is ready!”

And we just chatted for a bit. I told her she looked familiar. She said she was filming a TV show called Dawson’s Creek. I told her that I’d check it out sometime. And she said great, and if I ran into her again, to let her know if I liked it. And winked and said not to be afraid to be honest. 

Then I skiddadled off with my family to have lunch. 

I had no idea who she was, but I did realize something was up when I got swarmed by wife eyed teenage girls who had been watching me casually talk with a tv star."
23056,"My really hot friend (and me, because of her) got pulled up on stage to meet Snoop Dogg at a really random, small after hours type show that he was spinning at. Got to say hi and take a pic. I knew I’d never get the chance again so I asked if I could hit his blunt. And he passed it happily! Even let me hold onto it while he changed songs or whatever which caused me to get super stoned because I’m a one hitter quitter. Anyway, nice guy."
23057,"jokes on you, you're probably a hot friend too"
23058,"I met Murr from Impractical Jokers just as they were about to start filming a challenge in Union Square. I just shouted out ""Yo Murr!"" And waved. One of the producers tried to shush me and get me to walk away so I didn't ruin anything but Murr waved me over and let me take a quick picture with him before they started. He was super nice and happy to meet a fan"
23059,I love how innocent Murr is... like he loses so much because he can't be mean or rude at times.
23060,They do some absolutely brutal stuff to that man.
23061,"Charles Barkley. Nice guy, got a picture with him... I even unprovoked touched his bicep (for some apparent reason) and he just laughed at me. (I was also 11)
 
Al Gore when he was Vice-president. Not so much his secret service.... He was out jogging. He actually stopped to talk to us in our car and took our address. He sent us an autographed picture to me and my sister.
 
George W. Bush. I just got to shake his hand, but it was a firm handshake and he seemed to be a solid guy."
23062,Was that a King of the Hill reference?
23063,"Probably will get buried, but I met Gordon Ramsay in Cape Town about 5 years ago. He was at a bar, and not a super fancy bar either. I went up and said hello, half hoping he would call me a 'donut' or something, but he was really nice and asked me how I was. I told him I loved his shows, and recipes, and he offered to buy me a drink. Overall really nice man, and his demeanor is very calming. I felt at ease. I hope he is doing well."
23064,"A lot of people, from outside the UK especially, have this misconception that Gordon is rude or hateful but he's just strict and expects quality service from everyone in a professional environment. Watch how he interacts with the servers in Kitchen Nightmares and you will see he is a sweet, pleasant guy."
23065,"Ditto. He gets angry, he gets annoyed and he yells and curses because he's passionate. He wants these places to be sucessful because at his core he loves being a chef, he loves food, it's a huge part of culture and a good dinner can make a shitty week feel less shitty even for a moment. 

If you're going to talk back to him, ignore him or insult his intelligence or experience as a chef of course he's going to get pissed off. He's straight-forward and blunt so these moments happen a lot when chefs are stubborn. Which is hilarious, sure, he's got a colourful assortment of insults to throw at you. But don't doubt the man's intentions, he's a kind hearted soul."
23066,"Some second hand stories:

Chad Michael Murray & Lee Norris

My brother went out for drinks with them cause he was friends with a friend of Lee’s (minkus from boy meets world). Said Chad was a douche that held them up changing his jeans 5 times. Lee was sweet and surprisingly charming

Terri Hatcher

Got a hair cut from a guy who was a stylist at the Sundance Film Festival (had a binder of pics for proof) and he said that Terri was a heinous bitch

Bush Twins

Brother’s friend went to their birthday party at the White House, brought black dildos as gag gifts. Security couldn’t stifle their giggles. He says that the Bush twins are “boss” and really genuine and with a raunchy sense of humor

Justin Timberlake

Know a girl that went to New York to visit friend who does interior design for celebrities. They all went to a very exclusive club. Girl got dared to go up to Justin and pinch him on the butt. She did it and ran away. Later, when he was leaving, he came up behind her, pinched her on the butt and whispered “nice move” and walked away"
23067,"Fred Rogers (""Mr. Rogers Neighborhood"") was exactly like you'd expect him to be. He remembered my name meeting him again a few days later and also asked about my brother by name, who he'd also met. He had a minute or two for anyone who wanted to talk to him."
23068,"Used to be a waiter in Times Square, served a few celebrities. 
Super nice: Danny Trejo, Spielberg, Aaron Sorkin, Jennifer Love Hewitt, Donnie Whalburg was really cool. 
Caught Jackie Mason stealing SweetNLows, he paid me $5 not to tell anyone. 
 
Not nice: Heather Mills! She was so mean!"
23069,"Brian May from Queen was wonderful to meet.  Kind, chatty, enthusiastic about what the band was up to, even teased me about my accent in a gentle way.  Roger Taylor was with him, and while I didn't chat with him as much, he was equally kind and friendly.  

Also ran into Chris Evans at Walt Disney World, and while I didn't approach him (he was clearly trying to fly under the radar), he was very polite to the few people who did."
23070,Anna Kendrick said hi to me at a coffee place and I almost shit my pants. Wanted to propose right then and there.
23071,Did she say hi first or did she say hi back?
23072,OP better clear this up
23073,"Met Keegan Michael Key backstage before a show once. I complemented him on his (at the time) new series. He took my one hand with both of his hands, asked my name, and gave the sincerest thank you. Such a nice guy.

On the rude side, Mariah Carey is a bitch. Talked about how much she loved her dog so much and ended up leaving it backstage after the show."
23074,"I met Aaron Paul (Jesse from Breaking bad) at a concert in NYC. One of the nicest people I've ever met, didn't hesitate when I asked him for a picture and he even called me a bitch when I asked him too!"
23075,"I met Stephen Colbert when he came in to pick up a pizza from a pizza place I was eating at in Montclair, NJ. He was super friendly and chatted with us while he waited. My little brother has Down Syndrome; Stephen shook his hand and took the time to listen to him talk. All-around a really nice guy.

Edit: Spelling and a little more detail, this was back a few years ago when Stephen was still doing the Colbert Report; my girlfriend (now wife) and I wanted to bring my little brother out for pizza and we ran into Stephen. The guys at the pizza place obviously knew who he was, but they spoke to him more like he was just a regular at the place."
23076,"I was flying from California to Haiti to do relief work. I was really broke and had a really shitty flight schedule with lots of long layovers. I was absoloutly exhausted, had't slept properly in 2 days. It was around 4 in the morning when my flight landed in Miami. I was waiting at the terminal for my last flight from Miami to Port Au Prince. All of the seats were taken so I was sitting against a wall. 
This gentleman got up from his seat and walked over to me. I was thinking in my dilirium 'this guy looks like a homeless version of Sean Pennn'. 
Hobo Sean Penn asked me if I would like to have his party's seats so I could lay on something comfortable and get some sleep. I told him 'no thank you, im alright' and he said something along the lines of 'you look exhausted, you really should get some sleep, especially if you are headed to Haiti to do relief work, you will need the rest'. I took him up on the offer, although I felt really selfish about it. I got about 45 minutes worth of sleep that i desperately  needed. 
It turns out it wasn't a hobo that looked like Sean Penn it really was Sean Penn. I had no idea that he had been doing work in Haiti for years. His kindness was really moving, and upon landing and seeing the ravaged landscape of such an impoverished country, I realized that I really needed that sleep."
23079,"I was neighbors at a beach near Wilmington with Robert Downey Jr. for a week while he was filming Iron Man 3. I only met him on the beach once, but he was a really nice guy. My friend and I were flying a kiteboarding kite on the beach when he approached us from behind and initiated a conversation with “hey guys, cool kite!”

He’s much shorter in person, too."
23081,"Lady Gaga's mom (Cynthia Germanotta) is the real deal. Worked with a youth homeless shelter and she stopped by for a meet and greet with the young people. I've seen plenty of celebrities at youth events (homeless or otherwise) show up, smile for the cameras, and ignore (or even be downright rude!) to the kids. 

Not her.

She made sure to have a ""moment"" with every kid -- and there were about 25 or so -- where she talked to them, looked them in the eye, and validated them. It made them feel so profoundly special -- not that they got to meet her but that she made it clear they mattered. Her foundation organized a big donation for the kids, too."
23082,"Met John Krasinski, Jason Segel, and Emily Blunt years ago. They were really great about taking a picture with me!"
23083,"My mom met tons of celebrities working as a nurse at the Children’s Hospital of Los Angeles in the 80s and 90s. The nicest she met was David Prowse who played Darth Vader. He showed up in the one of the actual Vader suits used in the original trilogy complete with lights and breathing sounds to surprise the kids. He was flanked by two stormtroopers and an Imperial officer. Some of the younger kids were frightened so he came back later with out the suit on to sign autographs and take pictures. Dustin Hoffman was the one that she said was the rudest. He visited while around the time of filming Hook and came off as not wanting to be there at all. Rude to the staff, didn’t want to sign anything, etc."
23084,"I met David Hasslehoff. He was dressed up kind of like his nightrider outfits, he lifted me up and gave me a giant hug and set me back down. .

I was like 2 years old though."
23085,"Peter Dinklage was in town for our comic expo in Calgary and i was playing blackjack at the casino by the expo center with my bestie.  

Pit boss kept coming to all the dealers and whispering in their ear.  Girl then looks at us and says: you two watch game of thrones?

I say yes.  She says: oh apparantly some famous guy from the show is over there playing blackjack...

Sure enough he's there playing blackjack.  We cash out and head to his table and sit down.

He asked if we were on a date to which my bestie replied she was gay and i am definitely not a woman haha.  Dinklage actually goes: well my foot tasted great haha.  Ended up playing blackjack with him for over an hour and drinking on his tab.  Super down to earth and polite.  

Everything id hope a celebrity encounter would be like."
23086,"Jean-Claude Van Damme was on the same flight as me. He was super friendly.

Emma Watson (during her Harry Potter years) used to frequent a 
restaurant I worked at, she was always very nice.

I met Sir Ian Mckellen this year, he unfortunately was not at all nice. Which was sad as I imagined him to always be really nice."
23087,"I've heard Ian can be nice or not nice. I have witnessed, in person, him go from very nice to impatient when people are mucking about or delaying him.

It's worth remembering he is an elderly man, so his reserves of patience may be a little thin. Also he is not at all like his public persona - he is not proper and gentlemanly, he is like either an excitable teenage boy or a grumpy old man.

Side story: he has quite the conveyer belt of young males companions while filming LOTR here in NZ (not dodgy young). His favourite he ended up flying all over the world for a few years.

Also, Elijah pissed in a fountain and Orlando walked down the street, drunk, yelling ""I'm about to be famous, who wants to suck my dick!"""
23088,Anna Kendrick is one of the funniest and nicest people I have ever met.
23089,"Antoine Griezmann was my neighbor when I studied abroad in San Sebastián. He was not yet the huge star he is now, met him a few times in passing was always friendly."
23090,"I met Danny Trejo at a bar one time. He was hilarious and cracked jokes with us. He also made fun of Johnny Depp. Rick Flair ""wooed!"" while he was at the urinal next to me. I bumped into RJ Mitte, and I'm glad I didn't knock him over.  I once almost ran over Antonio Daniels and what I assume was his family. Oops. Tim Duncan was brief, but very polite. All the guys from Dredg are super nice."
23091,Bill Clinton...all that stuff you hear about his personal charisma is true.
23092,My dad worked in local politics and I met Bill Clinton once.  You know how you can feel someone’s presence when they walk into a room?  That’s exactly how it was with him.  Dude is the most charismatic man in the planet and charisma just radiates off him.  He can talk to anyone and make them feel like they’ve been friends forever.  He also has a great way of talking “at your level” if that makes sense.  Like a neighbor and not like a big shot or politician.
23093,"I worked around politics for a while and the charisma that comes off of some politicians is incredible. It could be a politician that you despise, but then after a two minute conversation you think that they are the greatest person ever. It's unreal. A lot of them are dicks, but the ones that really have the charisma factor are incredible."
23094,Did you end up in bed with him without knowing why?
23095,I'm gonna say it once. He did not have sexual relations with him.
23096,Hey can i walk ya home?
23098,Because Bill Clinton never forgets a bitch!
23099,Gwen Stefani was seriously one of the sweetest people I’ve ever met. She talked with me for as long as I wanted and when the first picture I took with her didn’t turn out she offered to take another.
23100,"About twenty years ago, when ""I'm Just a Girl"" first started getting radio play, I did something I had never bothered to do: I went to go see the band, of which I knew nothing. Having just gotten off of work, and looking like absolute crap-- glasses, blazer over wrinkled pants, unkempt hair-- I arrived early at the venue and realized I had no idea where to find the actual ticket office. I stood outside the place; there was no one around, and no sign of the coming show except for the band's tour bus. I pondered this for a bit, then a pretty platinum blonde happened by. I stopped her and asked if she had any idea where the ticket office was. She blinked, tilted her head, and then said, ""I don't know either. Let's go find out!""

She led me into the venue, through a small group of puzzled-looking dudes tuning their instruments, then had me stand around for a moment while she ducked into some deeper chamber to go ask various people about the when and where of ticket-purchase for this particular show.

She returned shortly with the required information, then smoothly led me out.

I still had no idea who she was until I came back for the show a few hours later, and Gwen Stefani was, of course, leading the band."
23101,"I used to work at Disney World and encountered many celebrities. I won't bore you with the whole list, but the notable ones:

Snoop Dogg: Really nice to the guys, completely ignored the women. We were all gathered at the exit of the ride in between seating new people, and he went down the line and shook hands with/chatted to all of my male coworkers and didn't even spare any of us girls as a glance.

Mariah Carey: Total divamonster. Firstly, she demanded that we not just hold the line out of sight while she and her party had a private go on the ride, she demanded that we completely cycle out both ride machines and the line, which took over an hour since I worked at a very busy attraction. Then when the kids in the party couldn't ride because they were too short, she threw a tantrum (""Do you know who I am??!!"") as if it was a judgement call we were making, not literally a safety standard set by OSHA.

Justin Bieber: Surprisingly not that bad, given that he was at the height of his public assholery. He was with a group of like 20 people around his age, and they were no worse than the usual frat groups/bachelor parties we handled.

Paul McCartney: Super low-key guy. He didn't even ask to go on the ride privately, just asked to be brought on the ride after the other passengers were already in their seats and had a row just for his group.

Steven Tyler: By far my favorite celebrity encounter. I happened to be in the break room and he came in to use our bathroom- there was an audible gasp from all of us on break and we just openly gawked at him, and he just smiled and said ""what's up"". Like ten seconds later, one of my coworkers came out of the bathroom looking totally shellshocked and said ""um... I just peed next to Steven Tyler.""

And then I was off break when Steven Tyler actually went on the ride, so I got to assist with that. His party was really friendly and jokey, and they were good-naturedly teasing us for getting starstruck. One of my coworkers was nervously starting every sentence to anyone in his earshot with ""I'm sorry, I'm sorry"", and Steven Tyler started yelling over at her ""Hey, Sorry! Hey, have you ever played the board game SORRY? I think you'd really like it!"""
23102,Once bumped into Tony Blair hanging around outside where I worked. Hands like shovels.
23103,TIL everyone else on reddit has a way more interesting life than me
23104,"My mother used to work for a major network and had to babysit John Travolta for a couple of hours back in the early 90s. She said that he was the perfect gentleman, and he mailed her a handwritting thank-you letter, as well as an autographed photo (she still has both). To this day, she won't hear a bad word about him."
23105,"Neil Gaiman once told me that he was proud of me and asked for a hug. Of course I said yes, and it's one of my fondest memories to this day. He smells like a wizard.

Edit: spelling"
23106,"I worked in music retail for a good number of years, and as such, I have met a fair number of famous/semifamous musicians.  I'll just make a list:

Cool:

Malcolm Young (AC/DC)

David Cassidy (Partridge Family)

Billy Bragg

Weird Al Yankovic 

Kim Necroman (Nekromantix)

Joan Jett

- - -

Not Cool:

Don Henley (Eagles)

Tom Petty's guitar tech

Kid Rock

Gene Simmons (KISS)

Van Morrison"
23107,"""Hey man, we're all out of Dr. Peppers, but I have someone running out to get som-""


""ARE YOU FUCKING SERIOUS???  I'M TOM FUCKING PETTY'S GUITAR TECH!  HOW DARE YOU!""



""So, yeah, it'll be like 5-10 minutes on those Dr. Peppers."""
23108,"I used to work at a Duane Reade store in downtown Manhattan. One night, Jonah Hill looking all skinny came over to the counter to buy cigarettes. He asked me to give him some matches but Store policy is that we don't give the customers matches so they usually have to buy a lighter. He wasn't really rude, although, he seemed irritated about something. I called him by his name and he replied without looking back. I believe celebrities are just tired of dealing with shit all day."
23109,"Stephen King had an actual AOL account he used regularly, I knew through someone who worked with him. Funny thing is, it said his name and stuff right there on his profile. Anyone could have messaged him.

I told him I admired his work and he was nice and chatted and said thanks. Wasn't rude. Didn't block me. We exchanged a few dick pics and that was it."
23110,"I live near Stephen King, and everyone who’s met him says he’s super chill. Someone in his house put a red balloon in a window when It came out."
23111,"Kind of related, Amy Winehouse was the mod of an old Yahoo group before she got famous. It was kind of interesting to read."
23112,"Robin Williams, I was deployed in the military and following his comedy USO show he came to the chow hall for dinner and sat right across from me at the table.  Super friendly, to the point that I felt sorry for him because people constantly wanted pictures and stuff.  He really got no peace at all.  But his mannerisms in person were very similar to when he is on stage."
23113,"* Rick Harrison - Actually a pretty nice guy, held a conversation, didn't have that annoying laugh.

* Chumlee - Seemed more arrogant than Rick, definitely smarter than his character on the TV show.

* David Faustino - Amazing nice and kind, just a real good guy!

* Tom Savini - Absolute tool and piece of garbage human being. Backed out of a charity event for battered women without a word or apology."
23114,"I worked the VIP security for Super Bowl 49 doing the male pat downs. Pretty much saw/touched everyone for pregame, halftime, or had any special roles. Almost everybody was pretty cool, the only person that was a clear asshole was Kevin Hart. He had the second biggest group of people with him behind Katty Perry (who was performing halftime) and they were all at least 6 foot, while he was down at 5 foot 4. His whole group was weirded out by the pat down, and Kevin just ran straight past me before I could do anything. He got stopped by the rest of our crew, yelled at them and just kept going. Pretty sad stuff."
23115,"Not a major celebrity or anything but I met Jeff Kinney (author of a Diary of a Wimpy Kid) as he was giving a talk that my school attended. He signed books later and he was really nice and polite. I was slightly embarassed because I had a habit at the time of writing/drawing in my books (basically filled with random scribbles) and he just smiled at me and complimented my poor attempt at sketches. 


 One of my friends admitted to being confused when he knew her name before she remembered that she had written it in her book, thought that was pretty funny as well."
23116,"I work as a film and TV extra for extra money while in grad school. By and large most actors/actresses are nice enough but in my experience there were two that stood out.

Keegan Michael-Key is ridiculously nice. Usually as an extra it’s understood that you NEVER approach an actor while on set for any reason or you will be asked to leave. It seems harsh but it’s important to remember that an extra is supposed to be a piece of scenery and causing the talent to lose their focus may cause the production to lose hours of time and a lot of money. In spite of this in between shooting he made an effort to joke around with us and act like a regular guy. Afterwards he personally took the time to thank everyone in the crew and the extras something that I have never seen any actor do before or since.

Conversely Rami Malek was probably the biggest asshole I have ever had the displeasure of working next to. The first shot of the day was supposed to be of his character walking down the stairs into a hacking competition. Upon reaching the bottom of the stairs however he took it upon himself the stop and yell at the PAs that “there’s too many fucking people here” and demand that they re stage. He would also talk to the creator of the show about the PAs right in front of them and lament that “they don’t even know what they’re doing”. Apparently it’s well known that he’s a bit of a jerk though because we were told upon starting to “just stay out of his way”. It’s also worth noting that for this shoot many of the extras were fans of the show who had no previous experience extraing and didn’t know you weren’t supposed to approach the talent. After seeing what a baby he is most of them didn’t bother him but two guys in between filming went over to him and Carly (a costar whose last name I can’t remember) and said what big fans of the show they were. Carly seemed nice enough and thanked them but told them that it wasn’t totally appropriate to approach her while working but Malek just turned around and stared at the wall behind him as soon as the two guys started to try and speak to him.

Overall most actors/actresses are ok and just like anybody else just want to get their work done but as in all professions there are some jerks."
23117,thrilled to hear Keegan Michael-Key is a great person.  Absolutely shocked at Rami Malek.  yikes.
23118,"Henry Rollins, totally awesome, totally down to Earth. Can say the same for Iggy Pop. 

Most other musicians I've met have been total dicks."
23120,"Steve Irwin was a client and exactly like you'd imagine him to be

We used to surf the same break and he would be wearing khaki shorts"
23121,"I encountered two HoF basketballers in airports.  

Kareem Abdul Jabaar was cranky, crusty and tall as a mf.  Didn't want anything to do with anybody.

Grant Hill was surrounded by an entourage and family, and he owned the concourse.  Was all smiles, carrying a kid on his shoulders, looked like he was loving life."
23122,"I'm sorry, but you must have confused Kareem with someone else. His name was Roger Murdock. He was a co-pilot. Even if it was him, he’d been hearing that crap ever since UCLA! He’d been busting his buns every night! Tell your old man to drag Walton and Lanier up and down the court for 48 minutes!"
23123,"I think he's the greatest, but my dad says he doesn't try, except during the playoffs."
23124,"> Kareem Abdul Jabaar was cranky, crusty and tall as a mf.  Didn't want anything to do with anybody.

Do you know how hard it is to drag Walton and Lanier up and down a court for 48 minutes?"
23125,"I used to work event security so I've met quite a few. Played nerf football with n'sync and had JT play a bit of a prank on me. The beastie boys brought out all the food from thier dressing room post show and hand delivered it to the folks working backstage. Robert paige was not to be spoken to. 

Probably the nicest though was Jr Seau. I worked the payers parking lot, he was always the first player in. Brought us doughnuts and coffee from his favorite spot (depending on the game we were there at 5:30am sometimes) always chatted as long as it wasn't about the game. He also owned a sports bar in town. years later after I stopped working security me and some friends were there and he happens to be there as well. Loaded my table comped multiple apps, sent over a few entrees, and then on his way out stopped by had a good chat with me gave me a few cigars he still had in the back. Crazy that he remembered me like 6 years after I stopped working games."
23126,"I was working at a gas station when Shia LaBeouf was shooting the movie lawless. He came inside and bought a pack of cigarettes and i asked for his ID. He looked at me was super pissed. ""You don't know who I am?"" 

In my defense the last time I saw him he was in highschool."
23127,"Met Gaten Matarazzo (Dustin) from Stranger Things while we took a senior trip to Universal Studios!

He was in Orlando for Comicon (i think, i know he was speaking on a panel with Caleb) and he stopped by and said he had to visit the Wizarding World of Harry Potter. As soon as he walked by, my mom, dad, and older brother immediately recognized him. We talked with him about the show and how he was finishing scenes up the week after! He was an incredible little kid, and that made the whole trip.

Sadly, we didn’t get a picture, since the bodyguard told us he didn’t want to attract attention because he was with his family. We respected that, and honestly I’m glad we chatted for ~10 minutes rather than take a pic and go. 

My first and only celeb experience!! It was wicked."
23128,"Rupert Grint (Ron Weasley) about three years ago I was in New York and saw him in the broadway play ""It's only a play""

Afterwards I saw a heap of people walking around the exit and the cast were going to their cars, I saw him and shouted out ""G'day Rupert!"" he stopped and saw me, came over and asked if that was an Australian accent, I replied yes and we had a chat about how much he loves Australia and Kangaroos. 

Also got a selfie with him but he's still got some makeup on so he looks a bit like a zombie in it."
23129,"Social media can work to your advantage because, among other things, it can help extend your personal and professional network.

Twitter is generally pretty popular among the dev community as a broadcast and interaction medium.

I'd also suggest creating a github account. Having code samples easily available is generally quite helpful.

Linked in is also a good idea.

Facebook really depends on how you use it. I'd honestly suggest keeping it friends only for most of your content if you use it."
23130,"I just wanted to add another thought (it's 1am, so brain is starting to shut down).

Another good reason to create a github account is to become familiar with version control software. A lot of, if not most, companies want you to be familiar with at least one VCS. Lately it's generally either git or TFS (though some places will ask for subversion experience. I've almost never seen anywhere asking for mercurial and CVS is, thankfully, rarely asked for as well)

TFS now has free cloud based accounts for up to 5 users and TFS2013 and cloud support git repositories in addition to the old style TFS repos. If you do dev in the Microsoft ecosystem, it's not a bad idea to get both, honestly.

Keep your public stuff on github and your private stuff in TFS. As an added bonus, TFS also has a lot of ALM stuff baked in. It's not exactly intuitive, but it's not that hard to learn the basics of either (and is another selling point for you since you'd be familiar with bug tracking and agile tools as well)"
23131,"I guess if you applied to a social networking company, it might be a little bit weird, but for most other companies it wouldn't matter."
23132,"Creating accounts and leaving them empty let you control your online presence.

Linkedin is good if you want recruiters to send you emails."
23133,"I don't really like social networking, for various reasons BUT.

Individuals in the industry use facebook as their storefront basically and can give you alot of information or updates on important topics.

Twitter is a must though. Devs on twitter are always linking useful things, new projects, you can interact directly with developers instead of through an e-mail wall or random facebook comment. The interaction and people you could meet on there is quite incredible. 

You do not need an online precense, you don't need to post your personal info on facebook or twitter or anywhere else. You could be a2 on twitter and never tweet once. But you can follow and read all of these developers. You are doing yourself a disservice by not having twitter IMO. It is ALOT to get going and maintain to begin with but pays off in the end IMO."
23134,"I got my current job through LinkedIn. I was skeptical of it for *ages* because it seemed like a boring, self-aggrandizing Facebook that spammed your contacts, but it really is great for connecting with people, and for being visible to people who are looking.

I found the job listing on LinkedIn, applied using my LinkedIn profile, and then I noticed the internal recruiter who had posted the listing was connected to a former colleague of mine—I emailed him and he said he'd gone to college with the recruiter, then shot her an email to recommend me. Boom, hired. I'm not saying it's the only way I could have gotten it, but it definitely helped."
23135,"You don't need to LIKE social networking, but you most certainly should learn to utilize it.  How do you plan on networking, or finding professional connections without using social media?  Linked in is hugely important, you can find friends who know people at companies to kind of give you a leg up at an interview.  Facebook is good to have if friends know about jobs that aren't publicly available.  Twitter can be useful, but I never use it and haven't had any problems from not using it.

I guess my point is that you don't need to like social media to learn how to utilize it to your benefit, and in my opinion you would be missing out greatly by not using it to your advantage."
23136,"I commit stuff to github and put it on my resume. I don't know if anyone has actually poked around or not, but when I mention it, it seems to have a positive effect."
23137,"I'm not a manager or hiring person. However, in the circumstance above where I googled an employee or looked them up on facebook and I couldn't find anything on them... I'd think they were either really good at keeping themselves personal... Or they were a shut in. It wouldn't effect whether or not I interviewed the person, but I'd keep an eye out for anti-social tendencies. Regardless of your position, you're most likely going to have to work with other people. And if you're a front-facing position you'll have to do it often and with people you won't like. Being social and friendly is always a positive to an employer."
23138,"I don't think it matters, but Linkedin is very useful for professional networking. Github is useful for learning about git. 

If you're worried about seeming anti-social, just create a Facebook account and add some of your friends. You don't have to like it, post anything, or make anything public. You can do the same on Twitter. Just follow people who might tweet about things that interest you. You don't have to tweet anything yourself, and you might get something out of it."
23140,"Got a job via Reddit once, but... that was more serendipity."
23141,"Agreed, but some people consider github to be a social network. Having a github profile with some work examples is a good idea."
23142,"Yeah of course you should have a GitHub, but I don't think it's a social network at all. You can't have any social interaction beside following a person, it has nothing social about it."
23143,"Yeah, I totally got where you were coming from. I just didn't want OP to be confused 😁"
23144,I would say you don't need it at all. The LinkedIn + Personal Website +Github combo is really all you need.
23145,This is the best way to go.
23146,"Just keep LinkedIn and Github. That's really all you need for jobs. It's nice if you have a well-done personal site, but not really required."
23147,"> ***most*** social media

Yes. Practically everyone in my graduating class does all their ""online"" professional networking via LinkedIn.

The only people I know that deal with Facebook/Instagram/Twitter from a purely professional development perspective are all involved with marketing or sales in some fashion."
23148,"I see no reason you need any social media besides LinkedIn.

Unless you're applying to a social media company, it's unnecessary to have them, and it'd be a red flag to me personally if a company demanded I have one. If you're applying to Twitter, obviously they probably expect you to use Twitter.

The only social media I use regularly is Snapchat and LinkedIn, and I've never had trouble finding jobs. In fact, I've never read any sort of posting (besides the social media platforms obviously) even mentioning needing to join anything, so I'm surprised to see this post."
23149,"Even this is probably overboard. In all honesty, companies don't expect that you use their products. It's more about being able to maintain their code and implement solutions.

The only reason twitter would care if you use their media platform is if you're going to be working on design or something, and even then, it's likely you could make a strong case for bringing a fresh set of eyes to the table."
23150,"Maybe things have changed, I haven't applied to a social media company since early college... but I do distinctly remember a requirement on the software internships at Twitter being you should be a strong user of Twitter.

That's when they were still a pretty young company though. No clue what the market's like now, but yeah, I agree with you at the end of the day."
23151,"The point of joining a bunch of social media platforms is to maximize your reach. If your end goal is to become famous in the industry, getting your blog posts linked on Hacker News and such, you can't afford to give up free marketing opportunities.

If you just want to get good jobs, you can definitely afford to skip all those other social media platforms. Lots of successful developers don't have a Facebook, or don't use it for any professional purposes."
23152,"Github and LinkedIn are sufficient. Recruitment doesn't really happen on the other platforms. You only need Facebook or Twitter to market yourself if you have something to market, like a blog or project you want to promote. Most people don't."
23153,"LinkedIn is good enough, and Github is very practical if only for sharing your projects. The only big advantage I see from Twitter is if you want to get personally in touch and connected with what other developers are doing in your particular scene or industry. A lot of the more significant contributors in tech are using Twitter."
23154,"I've only ever used Linkedin and Twitter, yet at a minimum, I would suggest Linkedin. 

Otherwise, you should have a spreadsheet or rolodex and email folks every now and again to check in and update them on your life."
23155,"I don't really consider LinkedIn to be social media, even though it seems to want to try to be. To me it's an employment resource for making it easier to apply to jobs, contact recruiters, and search.

Indeed isn't social media at all, and just flipping the ol' privacy switch to ""Public"" seems to start the calls and emails flowing in."
23157,"K, well, then, it's gonna be a bit tricky to market yourself if you don't want to market anything about yourself."
23158,LinkedIn is likely enough for the industry right now. Personally I would imagine a social media presence is more likely to hurt than help.
23159,"strongly disagree with most people here.

You can use all social media outlets to funnel towards your github/li, which are the main important ones.

You don't need to, but it's a masssssive benefit you're missing out on"
23160,Github and LinkedIn completely suffice. Don't skip LinkedIn.
23161,"An active social network can be a boon, but a bad social presence is much worse than no presence at all.

Assume they will Google you. Assume they will Google any relevant usernames and emails that they can find. You might be wrong, but for the effort it takes to sanitize your life, it's worth it.

Common Pitfalls:

1. Using the same username across many services. When someone google's my username, my reddit profile shows up first, but the rest of the top two pages have nothing to do with my real identity. Now imagine if you had the same username on your LiveJournal from your angsty years and your GitHub account from 2013.
2. Leaving your real life wide open. Keep your LinkedIn, Facebook, Google+ and MySpace accounts fairly shut down either by using them very little, or by locking down privacy options. You do not want Joe Average to be able to see you being drunk and disorderly. Or judging you based on your friends.
3. Being unprofessional. You can be doing everything ""right"" -- being active on GitHub, tweeting with the local startup community, asking and answering on Stack Overflow, blogging your little heart out -- but if your tone is unprofessional or your communication skills are lacking, you're doing more harm than good.

In the long run, I'd rather hire an employee with no social record than an employee with a bad one.

If you LIKE being a little eccentric, you can mitigate a lot of these risks by having a second persona tied to a username. For a perfect example, look at [_why](http://en.wikipedia.org/wiki/Why_the_lucky_stiff), who chose to be larger than life and it allowed him to maintain a stable job as a professional and go be a cartoon character with the masses. 

However, a good social presence can help a lot in certain situations. Especially with start-ups."
23162,"My biggest concern with social media presence would be Twitter. Facebook had some default privacy settings, as do G+and other sites. Twitter is really all or nothing, and it's very tempting to leave it open to the public, with a bunch of drunk tweets visible. I find myself deleting questionable tweets more than I care to admit."
23163,"For me the answer (for twitter,facebook,etc use) is fairly simple ""if my boss shouldn't see it it must be not published anywhere""

For now it seems to work..."
23164,"I share a name with a fairly famous athlete, so you have to add some fairly specific terms to the search before anything about me pops up. It's pretty nice."
23165,I share a name with a high profile pedophile :(
23166,It would help if you're on developer focused social networks like stackexchange.  Running a blog focused on your projects help too.  I can't imagine someone being penalized for not having a facebook or twitter unless maybe you worked for a trendy social media startup. They probaby would want to know that you're familiar with products in their category.
23167,"Having an online presence as an interesting person that holds cachet in the community is, of course, valuable. Otherwise it's totally irrelevant. I, myself, have a wildly inappropriate twitter that has never gotten me in any trouble."
23169,"Or if you do have valuable skills, some amazon company might find you with a lot more ease and trust that you actually do have said valuable skills. It can be a strong and positive signal if done right."
23170,"LinkedIn got me my second job, but I've never had an employer care about a lack of Facebook, Twitter or Instagram."
23171,"Is it ever too early to start a LinkedIn or is there an age suggestion, maybe Junior or Senior in college when you qualify for internships?"
23172,Nope. Start making your LinkedIn now so that you can refine it as you gain more experience.
23173,"I'm guessing there's an age limit of 13 or something =)

But otherwise, the sooner the better, and the more people 'in' your network now, the more data you'll see down the line when you're thinking of applying to company and it turns out that your old college classmate works there now."
23174,I love me some humor in the wee hours :p
23175,"The only ""social media"" accounts I have is LinkedIn and Reddit.   LinkedIn I've only ever treated it like a resume site.  My reddit account cannot be easily traced by to my real-world identity, and I'd lie my ass off before ever revealing my account name to employers.

Coincidentally, I've also worked for a company whose primary business is social media, and my lack of social media activity made no difference.

edit:  If anything, my lack of Social media activity is probably a good thing for most employers, as I'm not spending time on Facebook, when I should be working."
23176,It's not important.
23177,Twitter can be surprisingly useful for getting job leads if you have a decent following of engineers. But I never include my twitter handle on my resume when applying for jobs and I don't think it'd be an issue to not have one.
23178,I like my social media to be personal and separate from work
23179,"LinkedIn is great to have. I regularly check that when I see it on an application. I also am likely to check your Github if you link it. Other than that, I rarely look up people's social profiles. That being said, if you have some really unseemly things on your social media profiles, it's a good idea to remove that."
23180,I'd never acknowledge any social media bullshit for any company
23181,"Not important.

Linkedin is kinda useful for collecting recruiter contacts. I did once get a contracting job through a facebook conversation, but that was more because I’d helped my friend run a hackathon in uni and he happened to need help with his startup."
23182,"LinkedIn is basically a resume site.  

I set my social media profiles to only show my posts to ""friends"" after there were a few cases of hr getting someone in trouble for something they posted on social media. (I think it's absurd that this would happen but why take the risk when I can just turn it off?)."
23183,"As others have said, LinkedIn is the only one that seems to matter. I do have a Facebook profile, but it's set to private. I haven't *once* had employers/co-workers ask me about any social media besides LinkedIn."
23184,Frankly for a professional in a white collar job it's weird not to have a LinkedIn. In general companies you apply to will google you and if nothing turns up it's just weird in this day and age.
23185,"I don't it matters at all. If they check, they check to make sure your not a racist/homicidal maniac. 

For reference: a friend of mine just got an offer from Facebook and had never used Facebook before. He created an account only because you need one to send in an application."
23186,"if you're not averaging triple digit likes at IG don't even fucking bother, we actually value soft skills."
23187,"I'd say LinkedIn is a minimum requirement but even then not necessary. 

I like Twitter for networking with developers of projects I'm interested in. Any way you can get your name out there, the better."
23188,"When I refer friends to internal recruiters, the recruiters ask for a link to LinkedIn or a resume + phone number. They’ve never asked for any other social media.

I have been recruited directly off of Twitter, GitHub, and StackOverflow profiles by smaller companies."
23189,"I am 43. I dont use social media. Been a dba for 20 years. Noone asked. I. Dont want my business on the internet. 

The big thing with social media is dont be a dick. That stuff never comes cown."
23190,"Sounds like you don't have much back end experience. This is _not_ a beginners project. I'd try to find a pre-made solution of some sort, it's probably not feasible to code something like this from scratch with your experience level.

I think there's some social media-esque wordpress plugins and other crm extensions around, does anyone know more?"
23191,"I think it would be worth it to at least evaluate Drupal Commons.  It is a pretty complete social networking framework.  To use it for the final product probably involved little custom code, but mainly turning off a lot of features you don't need or want.  (Simpler is better).

If you at least install it and play around, I think it will give you some context in figuring out the path forward.  If this were my project I would install and check out a few different pre-rolled applications, Drupal Commons, BuddyPress, reddit, maybe slashcode, and take notes on each.  In the conference presentation I would include a short comparison slide, and explain what pushed you to whatever route you end up taking.

One factor that would push me towards Drupal Commons is the future maintenance and longevity of the project.  If it succeeds as a social networking site, there will be a lot of people who will be upset if it falls out of maintenance and dies.  Passing off your own custom code to a future owner has challenges.  Of course passing off Drupal to them might have challenges too.  An analysis of the options would be good as a small part of your presentation."
23192,"I'll try my best to come up with alternate solutions for a while, but this sounds like a good 'plan B' if I end up running out of time.

What I present at the conference is up to me, there is no pressure. I just thought I'd do my best with the time I have.

What path would you suggest I take if there was no time constraint?"
23193,"With no time constraint you can choose any path you please. Web dev is massive nowadays and it's pretty much whatever your preference is you can build a website on it. Based on your experience, I would suggest looking into Django. It's a python framework for web development that does a lot of the heave lifting for you."
23194,"Stay well away from Dreamweaver. I used it WAY back, some 20 years ago or so, and it was a hindrance to the learning process even then. I've taken another look at it form time to time, but to be honest it hasn't improved, just got prettier buttons.

If you're serious about code and want a good editor that doesn't get in your way, try Sublime Text. I don't thing you're ready for the likes of Vim.

But honestly, from your post I take it you know just enough of each language to identify it when it's being used but not much else. I can honestly say you wont be able to deliver this project without some professional help.

So rather than go out and hire someone, why don't you find a quality local developer that you can get to assess your project. Pay them for a few hours of their time and get an honest informed opinion on where you stand, and what's needed to get your project off the ground."
23195,"Okay, I'll stay away from Dreamweaver and get Sublime Text. Definitely not ready for Vim.

I'll try and get someone from my university's computer science course interested in my project. Maybe we can find a way to get something out of it mutually. If that doesn't work, hopefully a professional would be willing to guide me instead."
23196,"sublime is love, sublime is life"
23197,"Use Laravel, I made the same kind of site in about 4 weeks."
23198,"I agree. Laravel is your best bet. Visit laracasts, they have some good tutorials."
23199,"Well first thing you should know is that 80 days is almost certainly not long enough to learn enough to make a secure website and that any live product hosting real data has a moral obligation to keep its users' data as secure as possible. It looks like you already understand that it's going to be a huge task, but I don't think you really understand the scale. For reference, I consider myself a fairly experienced web developer, I've built dozens of sites from scratch, many being quite complex (tens of thousands of lines of PHP going into the back-end). Realistically, I don't think I could get a full-fledged social media site that is secure, fast, mostly bug-free, and looks good all in 80 days. Sure, I could do it if I put in 8-hours a day, but it would still be tough and I don't need to go through the trouble of learning how to do it as I go. I am not going to say you can't accomplish this (I don't know you, for all I know you could be a webdev prodigy), but I will say that I will be surprised if you succeed. Why is it that you need to not hire a freelancer? If it's a matter of pride, I understand but this is a tough job and you might have to bite the bullet if you have made serious promises.

That being said, if you already have some Javascript experience, I recommend using that through-and-through. Look into the MEAN stack (good introduction video here: https://www.youtube.com/watch?v=AEE7DY2AYvI). Try to use as much third-party code as you can (don't forget to check licenses) to minimize the workload on yourself."
23200,"Understood. I didn't want to use a freelancer because I want to keep the budget as low as possible and in turn it will help me gain the most knowledge also.

However, I now understand that it won't be easy for me to deliver this service in time. Maybe I will present a few key features of the website as proof of concept at the conference and take my time to develop the website in its entirety, maybe until the end of this year?

In regards to the other bit of your advice, you are suggesting I use JavaScript for both front end and back end development, right? And that MEAN stack is the way to go about it?

What do you think about u/aramboyajyan's advice that I use Django because I know a bit of Python already? Do you have any experience with that?

Thanks for taking the time to help me!"
23201,"No experience with Django personally, but as for /u/aramboyajyan's advice on MEAN, I agree that I'm not sure what his main complaint is. Mongo is perfectly suitable for what it seems like you're looking to do, plus it's more intuitive (in my opinion) than SQL. However, I will also admit that I personally have more experience with LAMP than MEAN. I am merely passing on the suggestions that I've heard from colleagues."
23202,"I don't think MEAN is a good fit for what you describe at all.

To make an informed decision yourself, understand what does each letter stand for, especially the NoSQL (Mongo) part. Also, check out the third party libraries/modules/whatever you will need and compare the maturity of the ones created for Node (MEAN) and Django/Python. This is really important.

It's exciting to work with new technology but it isn't necessarily the best choice. If you have little time, go with the safest option even if it's boring."
23203,I'd suggest looking at [buddypress](https://buddypress.org/)
23204,I second this suggestion.
23205,"You may be biting off more than you can chew.

Since it's something that will have quite a few real people using it right away, I'd budget at least twice that amount of time if I could.

Especially since you have no back end experience, it's going to be really difficult. Do you have any experience with DB schema design?

If I were you, I'd make some sort of attempt to crowdsource it. If you made the project public on github, I'd be interested in helping out."
23206,"I realised that I'll need more time. But I'll try and do the best possible given the constraint. Then I'll just present as much as we can build.

I'm getting up to speed on backend Web dev. A friend suggested a book by Robin Nixon (Learning php, mySQL, javascript, css and html5). 

Crowdsourcing is a brilliant idea I never considered, and I'd be delighted to have you on board! Give me a week or two to plan everything and set it up.
May I message you when it's ready?"
23207,Sure thing man. You could just put a post out here on /r/webdev and see who turns up as well.
23208,"Considering you have such a tight deadline, I strongly recommend [Meteor](https://www.meteor.com/)"
23209,This looks interesting! Thanks. :)
23210,"Honestly, Django might be your best shot. It will also be good for your career later on as you already know Python.

Here are two alternative ideas:

* See [Plone](https://plone.org/) which is a Python CMS. I played with it several times, but I'm not sure if it would be suitable for a social network. Especially if you want to choose a good platform and not rebuild the whole thing later.

* See [Drupal](https://www.drupal.org/). It's a PHP CMS. It's not a silver bullet and it's not easy. However if the way it does things resonates with you, it can be a viable solution. You would need version 7. Modules are free in 99% of the cases, and there are some amazing ones that let you really work with your data/users without coding.

Like other commenters mentioned, use something other than Dreamweaver. Sublime, Atom, Vim or an IDE. They are better than DW on any level, including HTML/CSS.

Hope this helps."
23211,"Perhaps it's a better idea to find something that has already built (open source) and customise it. It's going to be a little harder in the beginning to understand what's going on in the codebase but it'll be cheaper in the long term as you won't have to write it all from the scratch.

There are plenty of resources online.
Check out for example [Diaspora*](https://joindiaspora.com/) and [GNU Social](https://gnu.io/) for instance."
23212,"Since you know python i suggest to start with Django, search it in lynda, and make a barebones login/logout with text. Then connect the users and display that connection. Then make your quest account. 

Generally worry about css/js last, first do the backend

Also don't use Dreamweaver, use Atom / Visual Studio Code / Sublime

I suggest to use PyCharm (for python) & WebStorm (for html/css/js) JetBrains provide free software to students."
23213,"try this wordpress template. 
http://themeforest.net/item/kleo-next-level-wordpress-theme/6776630?s_rank=1"
23214,"I have a lot of experience rushing big projects, so heed my advice! :)

You know Python, that's good, leverage that. Do not listen to comments telling you to learn a new language/framework, you don't have time for that. Also don't waste your time writing beautiful and neatly structured code, one include with database connect, common functions, login handling and header/footer will be enough. Copy paste a lot if necessary. Once your project is successful, you will have a ton of time to refactor everything it in the most elegant way possible. Don't be too sloppy though - always test the edge cases and don't forget about the security. Sanitize all your input AND output from the very beginning.

First, create a plan for your website. Determine a scope, think about what functions do you want it to have, create sketches of pages and a navigation map. If Lynda has courses about UX, complete the best of them. I myself really liked Joe Natoli's course on Udemy.

As for development itself, start by creating a database based registration and login system. Knowing in advance that your website will be multilingual, don't hard code any text, use includes or database for this purpose.

Once you have a prototype where you can register and log in, start adding a functionality, introduce account types with different access levels and create pages one by one. You should have a crude but fully functional prototype in 2-3 weeks. Use the rest of the time to style, debug, polish and optimize it. At the later stages of this, I would invite an unbiased QA, who will critique your work and provide a sanity check.

If you work hard and really concentrate, in 80 days you will have an awesome website that will provide all services that you intend to provide, will be intuitively easy to use and look great.

Good luck!"
23215,"Thank you! I'm going to follow your instructions to the dot.

I have no experience with backend coding so I'll need to decipher a couple of phrases you used. 

I'm going to give my 100% to this project! Maybe I can provide you with updates every week or so and you can correct me if I'm headed down the wrong road?"
23216,"Sure, feel free to send me updates."
23217,Some of the Ruby / Ruby on Rails tutorials on Treehouse teach you Ruby by building a simple social networking platform. You might be able to build on top of this?
23218,Install buddypress
23219,"Not working on social media, but I guess I have both impacted them good or bad.

I started my career working on healthcare systems where our goal was to automate as much as possible, allowing for more people to get treatment.

At the same time I've also been working with banking, more specifically credit cards, which is less ethical. Not sure I'd call it unethical work, but plenty of people has gone into credit card debt which isn't really a positive impact. 

Personally I don't feel super guilty. I'm writing thr code which deals with how much is spent on the account, but it's the banks that sets up the terms, issues cards, sends the bills and ultimately put people in debt. Where is the line drawn between ""someone else's responsibility"" and ""my responsibility""? I'm not sure.

Not seen the docu though."
23220,"Super interesting answer, I guess it’s pretty hard to seperate other people’s ideas/policies from your implementation of it in code"
23221,"I haven't seen it yet, but it's always been important to me to work for a company that I believe is ethical, and to work on projects that I feel are doing good in the world.

Software engineers are in high demand and they have a lot of leverage. You're not likely to find yourself in a situation where somebody is forcing you to implement an ""evil"" feature or be fired. If you think it's evil, you can push back. If the company isn't a good fit you shouldn't have a hard time finding another job.

Just about every controversial piece of software is quite nuanced and usually the people working on it really do believe in it."
23222,"I couldn't watch it after they made ""growth hackers"" sound like some evil phenomenon. In reality it's sad fucks who are trying to do content marketing and don't get taken seriously. The ones who do that and get taken seriously don't call themselves growth hackers.

It's yet another example of traditional media being angry about their revenues and control being eaten up by Facebook and Google ads and trying to lash back. 

As for social media use etc, in my personal experience, I used to be addicted to social media because my life sucked and I couldn't relate to anyone IRL. In another generation I might have killed myself, but I was happy finding kindred spirits online. If young people are using social media a lot, figure out what you're not providing for them in real life. You don't allow you people to go out to places, they spend all their evenings at classes or homework, and they have little to no control over their own lives or places to socialize. So of course they are going to be online a lot because that's where their socializing is happening. They don't go on Facebook no matter how addicting it is, because their friends aren't there. They go to the network their friends are on. They just want to be around their friends. 

As for the rest of us, we can get addicted to anything. I don't see documentaries with bartenders talking about quitting their jobs because of the ethics, and alcohol use has much worse effects than social media. 

As for ads, I've worked on targeted ads. I didn't enjoy it and I quit to work on e-commerce because it's so much more tangible as an area of specialization. The information collected for targeted ads seems like a lot but each person's data is useless in isolation without network effects. Also all that data doesn't really help you make accurate predictions on people because you only collect data that's a small snapshot of their lives, and also people aren't as predictable as we'd like them to be. 

My bigger worry is really government agencies getting access to data collected by tech companies through extremely unregulated means. For that, I silo every social network on a separate browser on my phone. 

I don't believe in deleting social media. I have accounts on several sites. I just restrict how often I go on them. Will I spent five hours a  day at Starbucks? If not, why will I spend that long on Twitter? I check my email once a month for unimportant emails, and Facebook once a week. I check Twitter daily but that's because I'm promoting my side gig on there. If anything, I'm glad for social media because I don't have to spend tons of money trying to place ads or do publicity stunts. Five tweets a day is all I need, and I can schedule them all ahead of time. 

This documentary is a bunch of fearmongering that'll get taken seriously by a lot of people. I don't have anything more to say."
23223,"Interesting take, nice to see the other view"
23224,"I haven't seen it yet, but I see a lot of fear mongering about social media which I feel is unjustified. Social media like other forms of media before it, like print, radio, TV, etc. is a platform to share information. Before social media became mainstream, you could still share information on the internet through other forums (I used to hang out on IRC). People can still distribute misinformation by making their own website and others can find it through search engines. Just as with social media, there is tons of misinformation and manipulation on other platforms and types of media. You'll get it with whenever people are involved. Yet there aren't any calls to clean up misinformation on the radio, there aren't calls to ban TV networks for spreading lies. They aren't talking about banning websites with fake news from DNS or hold their hosting providers responsible for it. So why is social media being held to a higher standard?

What social media has achieved is to lower the barrier to entry, so instead of a few big moneyed interests anyone can have their voice heard. Instead of having to spend a ton of money on a TV ad, anyone can create a simple ad on these platforms and reach customers. Instead of having to hire someone to create a website for you use social media to advocate for your cause.

News websites feeds on bad news. They focus on the negative aspects of pretty much everything. If you hear enough negative things about something you'll feel it's bad. Go out and look for success stories. How social media has helped a small business grow, how social media has helped crowdfund people in need, how social media has given voice to causes that warrant attention. They're out there. People use social media because there is value in the service.

Could social media platforms do more to police themselves? Sure but think about the volume of data going through those platforms. Even if those systems catches 99.9% of bad actors, there will be still millions of pieces of bad information. Think about how you can respect people's privacy while ensuring their security. It's actually a conflicting requirement. 

So personally, I don't feel bad about my work. I also get to see much more positive feedback (through you know -all- the feedback instead of just the cherry-picked stuff the news shows you). It's not like the people here aren't aware of the problems, they are just very hard to solve and mistakes will be made. As with most programming jobs you'll find that people fuck shit up all the time and you can either go complain about it or work on fixing it."
23225,"Social media is different. You can’t A/B test a printed newspaper in real time, and you can’t immediately blast something at the scale social media allows for on any other medium. Speed and quantity is the issue here, and it’s resulting in an eroding concept of truth.


The problem most people have, and what you’re guilty of, is the complete ignorance of inclusion and equality as a foundational necessity. If it’s not pursued from the jump, equality comes at the expense of someone else’s privilege. In this case, that privilege is using your money as a megaphone.


Say you have a landlord. It’s illegal to discriminate who he rents to. Yet, for years, he could go online and target ads for his vacancy to white, upper income families with kids, exploiting a lack of regulations. Now multiply these edge cases by millions and billions. Now take them all away... except you’re struggling to do that because it’s now your business model, propping up your valuation and pleasing shareholders. Your company is lobbying to prevent regulations, slowing down the velocity of change away from the circumstances that are more profitable for them.


Social media has beneficial elements, but if you have to crawl over dead bodies to enjoy them, it’s probably not as great as you think. You’re justifying something whose benefits you enjoy, not actually making a reasonable case for why social media gets a raw deal."
23226,"Your example is contrived. It's not possible to target based on race among other things. It's explicitly against the ads targeting policy and if you had ever created a targeted ad you'd know that. Maybe do some research first? Could enforcement of policy be better? Sure, there are people working on it. So, no it's not in the business model and it's going to be fine without it.
Lobbying to prevent regulation? Did you research this too? What regulation are you talking about? What regulations would you like to see? Why do you think those regulations would make sense and/or are feasible? The only thing I've seen from regulation is that nowadays I have to click on accepting cookies for every website.
In your argument about equality, you are only looking at one side of the coin: the people being advertised to. What about opportunities for the advertisers? Why are you forcing advertisers to waste money? Increase their marketing budgets and putting up a barrier to entry for smaller operations while not hurting the big players?"
23227,">	It’s not possible to target based on race among other things. It’s explicitly against the ads targeting policy and if you had ever created a targeted ad you’d know that. Maybe do some research first?

Maybe you should [STFU](https://www.nytimes.com/2019/03/28/us/politics/facebook-housing-discrimination.html)


>	Lobbying to prevent regulation? Did you research this too? What regulation are you talking about? What regulations would you like to see? Why do you think those regulations would make sense and/or are feasible? The only thing I’ve seen from regulation is that nowadays I have to click on accepting cookies for every website.

That’s the point. There hasn’t been regulation because politicians are using the platforms for self-gain in their pursuit of reelection. Europe started GDPR around 3-4 years ago, but the US hasn’t even gone that far. We have COPPA, but when the largest fines being issued to the likes of Disney and TikTok (musical.ly at the time) are under 10 million for spying on our kids, it’s a cost of doing business.


>	In your argument about equality, you are only looking at one side of the coin: the people being advertised to. What about opportunities for the advertisers? Why are you forcing advertisers to waste money? Increase their marketing budgets and putting up a barrier to entry for smaller operations while not hurting the big players?

I am not looking at one side. I just don’t care about protecting unfair practices. Advertisers pay for effectiveness. Bidding for competitive keywords and such drives the price up. If these targeting engines become less effective and net a lower ROI, the price will come down to allow advertisers to cast a wider net to achieve similar conversion. Your basic grasp of how this works is lacking.


No one is entitled to track anyone and use their PII for profit. It’s fucking bullshit. Defending that is bullshit. You want more competition? Gimp the power players from having an insurmountable data advantage.


You know a big reason why people lack empathy in their business ethics? It’s because they break things down into segments of data that require zero human interaction. They create look-a-like audiences from audiences they’ve never spoken to or interacted with. If people had to spend time learning about their customers by doing qualitative research, this world would probably be a much better place because we’d understand nuance. Instead we’re optimizing ourselves into oblivion in the sole pursuit of profit.


Btw, next time don’t challenge someone’s understanding unless you’re really sure you know what you’re talking about. I’ve made a pretty good living off the intersection of technology and business. You sound like a smooth brain college kid with dunning kruger after watching some YouTube videos."
23229,"Ah, yes, the infallible developer! It’s really funny. We have entire departments (QA) dedicated to all the things developers get wrong, yet, you’d have us believe the burden of proof is on everyone else to prove developers actually get anything wrong. That’s rich, lol


We both know the law, regulations, etc don’t hold tech accountable. It’s the Wild Wild West of data collection and privacy abuse. Why? Because it’s insanely profitable, there’s virtually no risk, and everyone is doing it to compete.


If you can sit there with a straight face and say any of these companies act in the consumer interest..."
23230,Sounds to me you need better devs lmao.
23231,"Sounds to me like someone can’t admit developers are willingly supporting the creation of tools used for nefarious purposes. How many whistleblowers do you need, how many elections have to be interfered with by foreign money, and how many bad faith arguments do tech CEO’s need to peddle on Capitol Hill before you realize how destructive social media is without people actively policing it?


You’re supporting the idea of developers being Adolf Eichmann’s. “I was just doing my job.” Think about how pathetic that abdication of responsibility is."
23232,Sounds to me like someone has spent too much time reading reddit headlines and comments lol.
23233,How many candles do you light when praying to the CEO tech gods whose blessings upon society you worship above all else?
23234,"Github is the most relevant. Twitter is a common one, just follow the tools you use and retweet + comment on updates they release.  Keep your LinkedIn up to date, as well."
23235,"As a software developer, who is your intended audience?

Do you run a consultancy, selling your engineering services?

Are you more interested in being followed by other engineers?

----

If you're interested in **selling your software development services**... your audience would not necessarily be devs...

It's just logical that they're not engineers. 

What do they want to hear from you?

- Benefits from great engineering
- Why they should update their website
- Why building an app would be useful to their business
- How to hire the best software developer

----

If you're interested in being an **engineering thought leader**, that's very different.

You might just be establishing your authority or looking to attract other engineers to hire. 

In which case, your topics would be along the lines of:

- How the latest WWDC announcements affect your work
- How to manage your stakeholders as an engineer
- The latest & greatest frameworks

----

It all boils down to your audience.

It happens that your two choices (buyers or fellow developers) speak very different languages."
23236,"Twitter is great for many developers, at least in the InfoSec community. Try out MeetSibyl.com for some cool sorting and filtering mechanisms."
23237,"why would you spend time on social media or make effort for it? anybody who will pay attention to you / look for you will look at your profile and say ""I FOUND A DEVELOPPER!"", wants to know what you can do (=website, linkedin profile with your information on it) and then look at your github profile and activity.

For networking however, twitter, reddit and co are your best options, maybe specialized linked groups - however most people rather use facebook groups nowadays. 

you are selling yourself, so fully go with your own profile / name."
23238,Assetto Corsa
23239,I prefer Assetto Corsa as well
23240,Nah. I much prefer Assetto Corsa.
23241,What are you talking about? Assetto Corsa is clearly my preference
