idx,text
31303,MUUUUUUUUUUUUUUUUUUUURRICAAAAAAAAAAA!!!  jk i hate that place
31304,"It really depends on what you want. For me it's America in predominantly Republican states, Czechia or my home country - Russia. Between the three Czechia is probably the best overall."
31305,Oh boy you’re either trolling or new to Reddit.
49481,What do you mean?
31308,it's explained – but perhaps not completely satisfactory - in the methodology appendix: http://webapi.prosperity.com/download/pdf/PI2012_MethodologyV4.pdf
31309,"If you explore individual countries, you can see a list of data on different metrics they use, including results.  It doesn't have the calculations, but at least it lets you know what kind of information they used to base their rankings on."
31310,USA second in health and first the last two years. How do the work that out?
31311,"I recently listened to an Econtalk podcast talking about this issue - [Scott Atlas on American Health Care](http://www.econtalk.org/archives/2012/07/scott_atlas_on.html). 

The guest's thesis was that the US has very high health outcomes and the reason has lower rankings in some surveys is because it is more diligent about its reporting. For example, any newborn that dies within the first week (IIRC) is always reported as child mortality, where many other countries will not report a child mortality if the child dies within the first 48 hours.

Another example had to do with automobile fatalities. If someone gets in a car crash and is basically dead from the accident they are still taken to the hospital, attempted to be saved, but if they die it impacts the hospital's mortality rate. Even though they were DOA and the hospital had no chance to save them they still get counted as a patient that died at the hospital. The guest was saying that if you subtract automobile fatalities that our hospital mortality rate goes from like 15th to 3rd, or something. (I don't recall the precise details, listen to the podcast, it's interesting.)"
31312,"From http://webapi.prosperity.com/download/pdf/PI2012_MethodologyV4.pdf

>A strong health infrastructure which enables citizens to enjoy good physical and mental health leads to higher levels of income and wellbeing. The Health sub-index measures countries’ performance in three areas: basic health outcomes, health infrastructure and preventative care, and physical and mental health satisfaction. as illustrated in the chart on the right, the variables in the sub-index are categorised according to these areas.
>
>The Health sub-index evaluates countries on the basis of indicators that reflect strong health infrastructure, such as rates of immunisation and public expenditure. Countries are also assessed on average life expectancy, rates of infant mortality, and undernourishment. The sub-index further includes measures of individual satisfaction with health, and the effects on health from environmental factors such as water, air quality, and environmental beauty. 
>
>Researchers have found that self-reported wellbeing and self-reported health are strongly and significantly correlated to a society’s overall health, further fostering human capital creation, which is favourable to higher economic growth. Mentally and physically healthy citizens are the bedrock of a productive workforce, which in turn increases levels of income per capita."
31313,"Looking at overall life expectancy as well, we find that the USA is [number 37](https://en.wikipedia.org/wiki/List_of_countries_by_life_expectancy).

You can be healthy, but if you live in a dangerous place, death may get you anyway."
31314,Are you sick?  Dying? Have access to health care?
31315,Plenty of access. Live in Australia. Have just heard horrible things about the health are system in America so I was surprised to see it so high.
31316,"The horrors of American health care are about *paying for it*, not about the quality of the care itself."
31317,"It is a little misleading the news reports.  For the most part, a large group wants universal health care.  We don't have that.

They show tales of people going bankrupt and people dying in the streets.  Blah, blah.

That doesn't happen for the most part.  A lot of people do have health insurance.  Either through their employer or paid on their own.  Those that don't have health insurance do go to various health care providers, hospitals, emergency care centers.  Depending on the environment those providers will work out a deal with the patient if they can't pay.  If they can't pay then they hand it over to collection agencies to collect.

A lot of people get sick and can't pay or don't want to pay for their health care bill, so they go into bankruptcy.  These are rare cases.

For the most part, people have access to health care and only pay several hundred or a thousand annually. 

End of term of care (care for older people), usually you can get through your employer or medicare.


And then on top of that, the health care in America is pretty advanced.  We have access to top robotics and top doctors and everything else.

Healthcare in the US is expensive, for pretty much everyone.  The health care insurance takes a big chunk of the cost if you are really sick.  If you are really sick and don't have health insurance, see above.

And then on top of that, I don't know if those reports take into account, water safety, food safety.  But America  tries to protect people through basic regulations.  You can't poison the water system and have regulators that try to watch out for that."
31318,"I agree it is a little strange.  I think America is generally a good, maybe the best, place to go if you have something like a rare condition or need for a very specific specialist, who may be more likely to practice in America because they can be paid more.  Looking at things like life expectancies, efficiency of the system, or access to services, though, it seems that other countries are doing better."
31319,"Well, yeah. If you can afford it."
31320,"You were right. If you ever are in the United States in June, do your best not go to the medical industry. [Wikipedia](https://en.wikipedia.org/wiki/Health_care_reform_debate_in_the_United_States) says:

>investigation concluded that up to 200,000 people per year die from medical errors and infections in the United States.

That is 548 **per day**."
31321,"It's interesting that many of the highest ranked countries have a cold climate - Canada, Switzerland, Norway, Iceland, etc. Coincidence or something else?"
31322,"Siberia, Northern Mongolia and North Korea are cold places that are also miserable to live in. Even Switzerland has neo-Nazis. Bumped into few skinheads a couple of months back when I was there. Being well traveled, I find happiness to be a function of how well you fit in with the locals and vice versa. At the end of the day, I find people and their values more important for livability to me than climate and material infrastructure."
31323,"My guess: colder tends to mean lower populations, and lower populations tend to make for healthier happier countries. More to go around."
31324,"There are other factors that are important like: climate, cost of living, ease of integrating into the culture, shopping/conveniences"
31325,"For me there is also ""ease of having a medium sized energetic dog"" and ""can you get a job offer without already living in the country or having a visa""."
31326,So that basically means you will never leave your own country then... Nice to make up such criteria it can not be satisfied by any other place than where you currently live.
31327,"I've lived across the planet in around 10 different countries, and currently live ""abroad"".

Don't be so sure."
31328,"So, you have violated both your criteria several times then? Or maybe you are just in the military?  
  
Personally, I have lived and worked in 6 different countries and have never had any criteria such as yours for a new job."
31329,"You either are deliberately obtuse, or don't understand my initial point.

I have been able to find jobs without living in the country and already having a visa many times. That is how I moved to Japan, China, Germany, etc. Sometimes it was through international job searches where they then provided me with a visa, and other times with school or working holiday visas that did not require company sponsorship. There are some countries, however, that make it very complicated to find work from abroad without having an extremely specific set of skills. My current search for work in Switzerland is turning out that way, as well as a few others in the past. A lot of places make it very hard to get a visa without a job, and nearly impossible to get a job without a visa."
31330,"I think you guys were just talking past each other. The other poster probably didn't understand that you meant getting an offer without a visa, as opposed to working without a visa.

Reading comprehension for the win."
31331,"> climate  
  
People from the US northern states would like southern Norway, much milder than the US north.  
  
> cost of living  
  
Must be seen relative to your income in the new place.  
  
> ease of integrating into the culture  
  
Easy in countries with the same or very similar language but countries such as Norway offer you a free 1500 hour language training class as an immigrant to ease the process.  
  
> shopping/conveniences   
 
I have no idea what this means!  
Edit: In Norway you can get up to 400Mbit bi-directional Internet connections and have better cell phone coverage than the US. You can shop until you drop. Other than this, I am not sure what you are on to."
31332,"It's not that easy. I'm an American living in Scandinavia, and things are not that simple. Wish I could elaborate, but on my phone right now.

To give you some examples of missing conveniences, Amazon same-day, beer growlers, Uber, ubiquitous corner stores, cheap and tasty restaurants and food carts on every block, places that are open late so you can go after work. Things a lot of people in Sweden and Norway aren't even aware exist.

In terms of integrating, being able to use English is nice but doesn't bridge the culture gap completely.

Don't gut me wrong, it's a nice place to live and I'm glad I moved, but it's not that simple."
31333,"I'm an American living in Copenhagen, and we have at least some of those here! Is the rest of Scandinavia that different?

> Amazon same-day

This one I'll grant, though what I miss more is the cheap used items on Amazon Marketplace (the stuff on Amazon UK has less selection and higher prices / shipping costs).

> beer growlers

Microbreweries here will do those. I've gotten some from Mikkeller.

> Uber

Never heard of this. Googling, it looks like some kind of taxi service? I guess everyone here just bikes or takes the metro, which is way better than American transit.

> ubiquitous corner stores, cheap and tasty restaurants and food carts on every block, places that are open late so you can go after work

We've got all that, except that it isn't cheap. Although, I've never lived anywhere in the USA that had any of that. Did you live in NYC? There weren't really any corner stores or food carts when I lived in either Houston or Atlanta."
31334,"Washington, DC has a lot of that. Food carts might not be ""on every block,"" but they are around (and well-known and loved by locals), and you can definitely find excellent cheap food from immigrant cultures.

Corner stores, not so much, though, certainly not in the way, say, Paris does. American cities tend to be much more forcefully divided between residential and commercial than European cities."
31335,"Being from Germany and currently living in the far, far North of the USA (you have no idea how much I hate it here),  I might actually include Norway and Sweden in my list of countries to consider for immigration."
31336,Why did you leave Germany?
31337,"Long story short: I came to Fargo for a regular high school exchange program because the spots in Canada were already filled up, and (for a number of reasons) I ended up sticking around for a college degree afterwards. I'm graduating next month, and after one year of OPT (effectively a work visa), I'll finally be free again. [Free, free at last.](http://www.youtube.com/watch?v=Cb0-Opnx4Kk)"
31338,"> must be seen relative to your income in the new place.

Not true if you are someone with any savings. How would you like to be middle aged and move somewhere where your life savings is sucked up by just one months living expenses. Unless you have significant opportunity for rapid wealth growth, that us a HUGE deal."
31339,"Have no idea what you are talking about. When I have moved jobs and to different countries, the companies have always given me relocation benefits. When I moved to the US in 98, I got $10,000 in relocation. Why do you need so much money?"
31340,"Most important category to me is reverse alphabetical. BRB, moving to Zimbabwe."
31341,looking for countries ranked on how similar they are to new zealand.
31342,"So Norway is behind the US in education, health and governance?! Take that, Reddit, where is your utopia now?!"
31343,"I still have yet to find an ""ideal"" country.

My main factors are good climate, quality of public transportation, and system of government. Ideally, that country would have expansive public transportation that makes cars almost redundant, a climate that's between Mediterranean and Maritime, and a transparent government that places high importance on personal freedom and peoples' welfare, and strict regulations on the economy. Any suggestions?

New Zealand might be pretty close, but it's too far away from... everything?"
31344,"I try to focus on cities rather than countries because some of those factors differ so much from city to city. For example, compare Seattle to where you live now. Same federal government, but completely different story."
31345,"Aye, you're absolutely correct. I don't see Fargo as representative of the entire country, of course. But some of the things that bother me often apply to a country in its entirety, such as the (federal) political environment and laws in the US, the climate in Iceland, or the relative lack (or high cost) of craft beer in Australia.

I know I'm just nitpicking here, though. I'm sure I could be extremely happy in any of these countries, as long as (as you mentioned) the city is the right one."
31346,"Yeah, with the States it seems to me that it's almost a matter of finding at enclave like New York or Austin or SF or the Pacific Northwest where you can try to ignore the machinations of the rest of the country.

Craft is really the deal killer though. I'm working on my East Coast palette, but I'm mostly a West Coast person when it comes to ales and my knowledge of Belgians is pretty much nonexistent. So hard to get good stuff in most places.

That said, I could see myself living part of the time in Brussels and part of the time somewhere further south. And also part of the time somewhere chill like Boulder or the Bay or PNW.

Haha, guess I forgot we're not in /r/beer or /r/Europe."
31347,"Aus/NZ bot pretty much fit the bill but yeah they're far away. Having said that, as an Australian who's lived in the us and now in Canada, I could afford to travel a *lot* more making Aussie wages than I could in the US or can now in Canada. 

Retail was a lot cheaper in the us, but not enough to make up for the shitty healthcare (#1 my ass!), horrific infrastructure and crappy pay. Everything's expensive in Canada, much like Australia, but the pay is crappy here. 

Australia does have a backward, parochial racism to it that's the opposite of charming, and I find that refreshingly absent in Canada.

New Zealand is incredibly pretty, full of awesome people, socially progressive on a whole other level, and mind-numbingly boring."
31348,The personal freedom statistic boggles me.
31349,"I'm a bit concerned with their methodology for the ""personal freedom"" category. But this is still an interesting application."
31350,"Same here but then for the ""education"" category. Particularly the combination of the US being 5, South Korea being 7 and The Netherlands, Sweden and Germany being 11, 12 and 15."
31351,"I think it might be due to the fact that the US has so many great higher education schools. Our education system might not be the greatest and it might not have ""smarter"" students compared to that of Korea or Germany. However, with schools from the Ivy League and such, their ranking will definitely get inflated.

Health might also be related to this too since US has probably the best hospitals in the world. Access to these hospitals? Probably not the best and super expensive. But if you have access, you're probably in the best hands. 

It might not be the best methodology but that's probably where they're coming from."
31352,"Actually, I meant I thought Korea was too high (together with the US) compared to the others I named."
31353,"South Korea always scores highest in international science and math education rankings, so im not too surprised."
31354,"I find those rankings to be too simple as well. You can't just rank ""education"" by ""how good are the students at math and other science subjects""."
31355,"Well its not like theres much else to compare education. Its not like you can compare countries for english comprehension when they dont speak english or compare them for knowledge of italian history when they arent italy. 

Science and math are universal, so are probably the best measure for comparing education."
31356,"I agree with that, but then I'd rather have no measurement than a dodgy measurement. I think that if you can't measure it well you shouldn't include it at all."
31357,"So we should disregard the solar system, chemistry, MRI's, clocks, gravity, cooking recipes, currency exchanges,...,?"
31358,Nice straw man that you're attacking there.
31359,This can be proven by sticking a fan in their room at night.
31361,"Firstly, it's ""too"".

Secondly, that's exactly what I'm talking about."
31362,"Yeah, doesn't Finland consistently have the best public school system in the world, yet ranked 8 in education?"
31363,"Ok, what is your concern? And is your definition of ""personal freedom"" one that is generally accepted world wide?"
31364,"how is the US 14th in personal freedom, I would think we would be way better"
31365,"take the patriot act, throw in a million or two prisoners incarcerated for minor weed possession, add a dose of the national guard shutting down protests, ad stir."
31366,Some Americans proclaiming loudly of their freedom does not make a country free.
31367,"Right, but I would expect the US to be above the UK. We have more firearms freedoms, stronger free speech protection, and we don't have cameras on every corner monitoring people."
31368,"Things like the patriot act holding us back.. a lot of freedom given up in the name of ""security"", etc"
31369,[Methodology](http://webapi.prosperity.com/download/pdf/PI2012_MethodologyV4.pdf)
31370,"When grouping countries by Political -> Euro, only 14 countries get listed and Austria, Finland, and Ireland do not show as part of the eurozone. Am I missing something, or is there something gone awry?"
31371,Yeah personal freedom ftw.
31372,It needs a weather column and I am completely serious. Weather affects a lot of people's decision to live in a particular place or not.
31373,"As someone who has plans to move to New Zealand to continue his education, awesome. :)

Great, easy-to-read table, by the way. Some of it is slightly subjective, but overall it's a neat tool and a good starting point for people that may want some change in their life."
31374,"US is 2nd in health and far ahead of the UK and it's NHS...?

Spelling edit."
31375,"I assume its based on quality, not accessibility."
31376,Does anyone know what do the yellow squares represent?
31377,They're #31-71. The squares go green -> yellow -> orange -> red as you move down the list in any given category.
31378,"I like how the country with legalised abortion, euthanasia, same-sex marriage, soft-drug use and prostitution is ranked not only below 8 countries that barely have half of those, but actually below *Ireland* in Personal Freedom.

Not to mention seeing the US as #2 in health, while they barely make it in the top *40* countries ranked by life expectancy."
31379,America because we da best
31380,Hell yeah!
31381,arguable
31382,Canada.. cause they have moose and free healthcare and weed
31384,No out of pocket costs
31385,"huuhuhuhh.. In the US they pay taxes AND healthcare, that's what I meant with free and we both know it ;)"
31387,Well.. both are not like that in mine at least!!
31388,Unless you are low income! You can apply for removal of certain fees like msp taxes and stuff.
31389,"Bro as one of those low income people go and fuck upon thineself. Seriously. That EIC doesn't do shit except make sure we get enough money back to stay poor. 

You sir, need to start to be more concerned with the condition of your fellow Americans."
31391,"Bro but you wouldn't be paying my bills for me. The fact you look at it that way is fucked. You'd be paying a thing like social security. 

This isn't MY bills that would be getting paid. My cellphone wouldn't be paid by you, my car insurance is still mine, my rent is my responsibility. 

What you would do by agreeing to the Christian virtue of helping your neighbor is make my life easier. You wouldn't solve all my problems, you'd just make it so when my kid gets sick I can afford to see a doctor and not fall behind on my bills. You'd make it so I wouldn't have to worry about my kids education so I could pay my bills and they would still have a future by being guarenteed a college education. 

By deciding to help pay for others, you wouldn't be alleviating my poverty. I'd still be making the same amount of money, and, again, you wouldn't be paying my bills. That's on me. What you would be doing is making poverty less bad. You'd make being poor here better than being poor elsewhere. 

You would be paying to make America as a whole stronger and better. That's not paying my bills for me. That's caring about the state of your country and fellow countrymen, WHICH IS AN INTRINSIC DUTY OF EVERY AMERICAN CITIZEN.

That's how a democracy works. It's everyone's responsibility to uphold society, and yes that means making sure others can access basic needs like healthcare and education. 

If you can't see that, then you have absolutely ZERO understanding of what it means to be American, you have absolutely no idea of your civic responsibilities as an American, and you are part of the reason we are no longer United. 

You should be ashamed of yourself. You give all Americans a bad name you selfish prick. 

This is coming from a United States Marine: Fuck yourself"
31392,"Don't worry about it. I used to feel this way when I was younger. I just didn't have the life experience to understand how things really are because I had been lucky enough to have a secure upbringing and made plenty of money for myself at that time. I attributed poverty to being lazy and hard work means being secure and not having to receive financial aid. Until, life decided to teach me a lesson and I became one of those people I used to judge, even though I still worked hard, had a degree, etc. There went that old viewpoint, along with a lot of pride and dignity. It was hard, but I learned a valuable lesson about never judging people if I haven't walked in their shoes. People like to think it would never happen to them because they work *hard*, they put in effort to better themselves, they went to school, they didn't have kids they couldn't support but what happens when you realize that someone just like that can, by no fault of their own, end up down and out? It could be them in a week and they don't even realize it."
31393,"I do worry about it because while we wait for them to realize all this, the rest of the country suffers. It's not good."
31394,"What I meant was, I wouldn't worry about responding. There is no way you can get through to someone like this by arguing the point on the internet. They have to be personally affected by it to change their views."
31396,"Wow. 

We're done. You don't want to talk you just want to fight. 

You know what? That's okay with me. If and when this whole mess comes to a head, I'll see you on the battlefield. 

I tell you now, I am looking forward to that moment like you don't even know."
31397,Our taxes are also 13%...what are yours? 6%?
31398,"Progressive taxes, depending on income up to 52%. Obligatory healthcare insurance etc.. NL is a shitshow nowadays"
31399,I meant on purchases alone..not too sure about the annual tax part
31400,"Aaah, sorry. 21% on luxury goods, 9-11% on basic needs"
31401,I've only ever lived in Australia. It's ok.
31402,"Somalia

no government means no taxes"
31403,All the government-hating Americans should move there
31404,"The happiest people are from Denmark. 
But, I would say any of the nordic countries.."
31405,"Yes, but Denmark usually ranks pretty high in antidepressants usage lists too"
31406,"Maybe that's because we can actually afford it? And have doctors, we can see for free, that tell us what would help?"
31407,"Hey, I'm from a country that ranks quite low in every category you can think of  that  is relevant to  life quality with the exception of health care. 
Definitely worse than Denmark at everything"
31408,Ok....?
31409,The good ol' US of A.
31410,"Finland, because it ranks at the top of every quality of life study."
31411,but its cold :(
31412,And no sun
31413,https://www.usnews.com/news/best-countries/quality-of-life-rankings
31414,All the best countries are cold.
31415,"It's because life is already miserable in the cold, why make it worse by being miserable to each other?"
31416,Yeah but it doesn't matter because nobody has to sleep in the streets.
31417,but its still cld when i wanna go out
31418,damn im in the top 15. thanks btw!
31419,Changed the link because the other one was about cities not countries. I'm in the top 5 and I can confirm that life is good.
31420,still top 10 :P lemme guess.. your from norway
31422,"I was secretly hoping that, damit ich eine ausrede hab mal deutsch zu schreiben :D"
31423,Dann kommst du wohl vom grossen Kanton im Norden 😂
31424,musste erstmal google was das heisst aber ja ist richtig :D
31425,"New Zealand

Warm like Australia, scenic like Canada

Now with 100% more Hobbits"
31426,"Ditto, American here, I know, I did it for a year. I recommend a working holiday visa to everyone. In a span of a few days I was hiking up glaciers, surfing in Mount Maunganui, and clubbing until 5am in Wellington. I would have stayed if I could have tricked a Kiwi into marrying me for citizenship."
31427,Glad you enjoyed it !
31428,"I don't think a lot of people realize this, but Mexico. Specifically, in or near the Puerto Vallarta area. Everyone speaks English, everyone is incredibly nice and courteous, and nobody cares about your past. People are very generous, and whenever I'm down there, almost every night at least five or six different people will invite me to have dinner with them, even when I know for a fact they are fucking poor. You can make good money doing construction, and its near the beach. In that area, Mexico is legitmately a paradise."
31429,"NEPAL! They have a saying ""tourist is God"" basically because most of their income as a nation comes from tourists, they are super nice and accommodating. And it's sooooo cheap. Eat local meals which are great and are like less than 2$."
31430,Canada.  Then New Zealand and then Australia.  My opinion only.
31431,Canada. There's nothing more peaceful than waking up in the mist of fall and looking over the great lakes with a glass of jack in your hand
31432,You drink whiskey right after you wake up?
31433,You don't?
31434,"No, I can't say that I do."
31435,Depends on what your requirements are. I would say The Netherlands because that's where I started a new life and it worked out well for me. Am in the US now though. Kinda regret leaving but oh well.
31436,"Funny. My experience of the Netherlands is that it's VERY expensive, the locals are rude, they will NEVER give a good job to a foreigner (or at least never pay equally), the women are mostly ballbreakers, and there is racism coming out the yazoo. Oh, and my biggest peeve of all, fucking scooters in the bike paths... Avoid."
31437,"That country welcomed me with open arms and I would be nothing without it today. Completely different experience for me.

Also,

> there is racism coming out the yazoo

This is true for just about every country out there."
31438,"Guess I got unlucky, or you got lucky... We may never know! :) 

Good shout on the racism thing. I never meant to imply it was better or worse than elsewhere, it was just... unexpected I guess. Worth pointing out I was in Amsterdam too. May have been different elsewhere, but I stand by that place being unfriendly if you come in with anything other than a whopper of a salary."
31439,"I'm curious, spreek je nederlands? Also, what kinds of jobs were you trying to get? Because I was in Amsterdam (and later Hilversum) and I had no issues getting a job at all. Might have been because I was young and the kind of work I did back then (web development) was in high demand, though."
31440,"I did not speak Dutch, but this was not for lack of trying. I just got so sick of people automatically answering in English every time I tried, and I eventually gave up. People would just not try unless you already had at least a B level of Dutch under your belt. For context, I moved to Germany after and learned more German in a month than I did Dutch in Holland in five years, and where I was in Germany had a generally excellent standard of English. As for work, I was blue collar all the way. Background was in TV and eventually I got something in a similar field, but I did everything possible in between, in slightly decreasing stages of crappiness to get by. Started non skilled black labouring, cleaning toilets, dosh washing etc. up to varying levels of service job, and finally got a ""real"" job in my field after 3 years of toil. What made it worse was that once i started getting jobs where Dutch people were also hired, they were always paid more and treated better, even those of similar rank and seniority. For added salt in the wound, their access to social housing also meant they paid far less rent, and many would cover this entirely by illegally renting their spare room to a foreigner. 

I feel you on the web development thing, and fully acknowledge that I came over now with an in demand skill set, it would most likely be a less stressful ride."
31441,"I just took Dutch lessons immediately upon arriving. That's probably one of the reasons I did so well. Can't say I experienced the whole ""getting paid less than Dutch people"" thing, but again, it might have been just because my job was in high demand at the time.

It's interesting how completely different our experiences were. I miss Holland so much I cry sometimes, and I hated Germany. Different strokes for different folks I guess. :)"
31442,Germany. Education is super crazy cheap and the beer here is cheaper than water!
31443,So... When can I come over...? -US citizen who can't afford college
31444,It depends how old are you? ;D
31445,28! I make beer in my spare time!
31446,Can I go with you?? So relate
31447,"Spain. Cheap as fuck wine, great tropical weather, great fresh food of all type, and cheap generally compared to other European countries."
31450,Debatable mate :P
31452,"He said Australian, not British. 

you fuckin' cunt"
31454,"Well that's great. Because I've had a terrible, horrible, no good, very bad day."
31455,How come? :(
31456,"Depends on where in Australia, lots of jobs in Sydney and Melbourne but prices on everything are going up."
31457,India. Get lost in infinity.
31458,"China.

China is the future."
31460,There may be a disgusting amount of money to be made in North korea in the next decade or so.
31462,HAHAHAH!!!! Funny^
31463,Why are you even in a month old thread?
31464,"I was perusing interesting topics, and found that. I thought it was an hilarious comment. 
Sorry for rehashing it!"
31465,Looking for places to test your edginess?
31466,Not sure.... what do you mean?
31467,Flying Pig Hostel in Amsterdam was pretty great. St. Christopher's Inn in London was a good time. And we always have fun at Ocean Island Backpackers in Victoria BC.
31468,The Maxwell in Seattle.  They put out a tray of delicious pineapple cupcakes in the lobby.  Normally I would never shill for any business but these cupcakes are good enough to make a corporate whore out of me!
31469,"Best hotel...Hotel Mariot in Taba Heights, Egypt Red sea resort. I'v stayed in many shitty hotels."
31470,"Cosmopolitan in Vegas. Three words: Japanese Soaking Tub.

It overlooks the Bellagio fountain. Wife and I had champagne in there and barely left the room the whole trip. Plus customer service is bonkers there, and the best burger I've ever had was at the Henry in the lobby."
31471,"[7 Springs Inn & Suites in Palm Springs, CA](http://www.palm-springs-hotels.cc/)  
Partially because I *LOVE* Palms Springs, but also the room was clean, updated, and had a kitchenette which we didn't expect. It is a little farther out of the way from downtown area, but I liked that it was quieter because of the location.

10/10 will stay there again."
31472,I've stayed there too.  Great little place.
31473,"Probably the Virgin River Hotel and Casino in Mesquite Nevada.   It got fairly bad reviews from what I see online (had to look up to find the name of the town/hotel, luckily Mesquite is a pretty tiny town so it was easy.), at 3 stars, but it's the best I've personally stayed in.    According to the blurb:  ""Budget hotel with pet-friendly rooms plus 2 outdoor pools, arcade, free breakfast & a 24-hour bar.""


There are probably a lot nicer ones, but it doesn't really matter to me what inn/hotel I stay at as long as the heating/cooling works, the beds are clean and comfortable.   At the end of the day, all hotels are for me is simply a place to sleep."
31474,I want to say it was a marriott in downtown denver. it was normally like 175 a night but thanks to kyak i think it was only 95. I was on like the 12th floor and was facing the mountains. it everything was so clean and modern I have never felt like it was worth full price in a hotel except at this one. they deserved the 175 a night they asked for
31475,The Oriental Hotel in Bangkok
31476,"Marina Copan, in Copan Honduras, not too far from the Mayan ruins. It is like a colonial government house turned into a beautiful hotel. We got a room with 2 king beds and hot tub and a couch and high wood beamed ceilings, for about $80 per night. Amazing service too. We went during the ""rainy"" season, which really meant it rained once each afternoon from 3 to 5 pm. Great place,  and great time."
31477,"The Waldorf Astoria in NYC.  The service is impeccable, the food is extremely good and the price really isn't that bad for NYC."
31478,"The company was awesome, and the bathtub was big enough for a bed.  My husband was snoring his ass off."
31479,"St Regis, Rome Italy."
31480,"I'm going to go for value, not quality. I've only stayed in one luxury hotel in my life, as a kid, and while playing racquetball was fun and all... it was more meaningful for me as an adult paying my own way when I was driving on I-70 west of St. Louis late at night and started feeling exhausted, and I saw a billboard for a $29 motel promising tons of standard amenities. I was actually leaving St. Louis early to escape a ghetto motel from hell, and was pleasantly surprised that I got one of the most comfortable rooms I've ever stayed in for my $29.

Colonial Inn in High Hill, MO. Not fancy, and in the middle of nowhere, but in a pinch, I recommend it."
31481,"In the Gion district in Kyoto, Japan, there is a Ryokan called Shiraume.  By far, the greatest hospitality I have ever experienced in a hotel, and I *work* in the hotel industry.  I went there for my honeymoon.  While expensive, it was worth it.  Easily the nicest people I've met.

http://shiraume-kyoto.jp/en/about/index.html"
31482,"J.W.Marriot in Cairo, Egypt. expensive but you never get bored. you can order room service while taking a shit"
31483,"Don't remember the name of it since it was a long time ago but it was in the heart of Washington D.C. and I payed $80 dollars a night for a week. Spent most of my time around the city and not in the room but for a price like that in the middle of D.C. all you can ask for is a functioning bed, instead I got a stupid comfy bed, cable, wifi, and maybe 3 blocks from the Smithsonian."
31484,"The Traders Hotel in Kuala Lumpur, amazing view of the Petronas Towers, best Breakfast  Buffet I've ever seen, plus a rooftop pool/bar on the 34th floor.
View from our room ( we were on the 16th floor I think)
http://imgur.com/rHzEoRa"
31485,"STORY TIME
went on a cruise with my dad when I was 16 (divorced family, so full family vacations are a no). One of the stops was Georgetown, Grand Cayman. Dad didn't reserve a rental car because ""there would be plenty left"" there were none left. But what they did have was a scooter.
fast forward 3 hours
dad and I are definitely over max weight on this stupid scooter riding around trying to find a public beach. I decided I had to use the restroom and the closest one was the Ritz-Carlton Hotel. I walk into the restroom and it was all marble. No joke. and I saw a stack of pool towels that were totally for guests and I had the most devious idea (I am my dad's daughter afterall). I grabbed two towels and met my dad outside, when he saw the towels he got the same exact idea. Next thing I know we are lounging by the pool that is literally 20 feet away from the Caribbean Sea and I was sipping a wonderful strawberry daiquiri when an employee offered me a chilled moist towelette. By far the nicest hotel I've ever not stayed at."
31486,"For value and friendliness, the Holiday Inn Express in Lexington KY, off of Sharkey way. There's a young guy who works there who memorizes all of the guests names. No matter how long it's been since you've been there, he always greets you by name. Such a nice touch when you're a road warrior."
31487,"The Hyatt in Seoul, S. Korea next to the airport. I'd just spent a semester in a shitty part of China though, so to me it was the greatest place on earth at the time. Plus, it was free due to an unexpectedly long lay over, and came with meal vouchers."
31488,"The Porches Inn in North Adams, MA. It's like if a really nice bed and breakfast decided to spread out and get comfortable.

Next to that, the Fairmont Copley Plaza in Boston."
31489,"Skycity in Auckland New Zealand. I went to New Zealand two years back with my ex. We traveled both islands in a month. On the last three days we had plenty of money left, and hotels in New Zealand are really cheap so we stayed at SkyCity for two nights. Could never afford such nice hotel in Sweden."
31490,"I spent 5 years living in hotels around the world due to work. All five stars, unlimited budget. 

By far the best hotel I have ever experienced in the world was the Oberoi in Gurgaon, India. This is the tech city near Mumbai, where most fortune500 companies have an office, so this hotel is made for executives to enjoy a remarkable experience.

Next after this is a Hotel in Tenerife, Spain, Bahia del Duque. 

Next would probably be the Dorchester in London."
31491,Gurgaon is in north India and near Delhi. Not Mumbai.
31492,My guess is he just means the Oberoi in Navi Mumbai....I would second the opinion that it was the best hotel I ever stayed in if we are talking about the same one... Truly amazing
31493,Definitely in the running for best hotel. It’s got my vote. Also the Taj by the Gateway of India
31494,"Haven't stayed in Navi Mumbai but my vote would go to the Oberoi in Mumbai itself (Nariman Point). Stayed here for work a dozen times and their service is just second to none.

I think the Oberoi in Udaipur often makes it onto Best Hotels in the World lists."
31495,Hi how do I get your job
31496,Lol I used to be an internal auditor for a global company. It’s not a difficult job to get into
31497,Do you need a cisa certification? What do you think about this certification
31498,"Cisa is pretty much the standard, yes. It’s very straightforward, buy the book, take the exam, and pay annually to keep the certification plus some continued education points you need to keep. It has been many years since I renewed mine, as I’m no longer in that line of work, but it gives you a strong foot when it comes to understanding risks, controls and what ‘good’ looks like"
31499,"I work as a consultant, business system analyst, took the cisa course but didn't take the exam. I'm in Quebec, Canada, what are the standart billing rates for a Cisa in the US ? Do you have any idea about Canada ? Thanks"
31500,"I couldn’t tell, but there is a Forum in ISACA’s website where you could ask perhaps? I took my Cisa while working as an internal auditor (iT) for a large global business, so it was free. I have applied some of the things I learned througout the rest of my career. Now I run a consultancy business, and it helps having a solid foundation on controls, as most businesses don’t really think about risk management regularly"
31501,"Yes, great choice! The Oberoi is probably my top one as well."
31502,Tell me more about these hotels!
31504,How did you find travelling there? My partner's been bugging me to go to the Maldives and I've heard getting there is big hassle with the water planes and multiple lay overs
31505,"It’s a PITA getting there. We’re in Australia, so we flew directly to Sri Lanka, had an airport sleepover (slept there for 8 hours) which I HIGHLY recommend. We flew to Male. Took a three hour sea plane AND a 45 minute boat transfer. So yes, it’s an absolute hike. You could of course pick a resort closer to Male and reduce that a bit. For that reason it’s not worth it unless you’re there for at least 5 nights so you can relax properly, we went for 7."
31506,"Stayed there for a week on our honeymoon and would have to agree! Getting there was a different story. Direct flight to Dubai where we stayed a few days. Definitely don’t recommend spending any time there. Then a flight to male, followed by a puddle jumper and finally a boat to get there. On the way there it’s all very exciting. On the way home, it was the day that would never end. But that hotel is definitely in my top places I’ve ever stayed. Others that I can think of that we really enjoyed were Qualia on Hamilton island where we got engaged and the rosewood in Los Cabos with a swim up patio."
31507,It’s honestly cheaper than i would expect
31508,"Yeah, there’s a few travel agencies you can book through too, I think the one we used was Purely Maldives. You get a much better deal (full board vs half board for the same price) using an agency vs Booking.com or booking direct. It’s a pretty amazing experience."
31509,"Nice thanks for the link, my moms dream is to go here with me and maybe my sister and she grew up dirt poor in a 3rd world country so she deserves something nice but I had no money and time cause of work. By next year should have more time especially once things reopen..."
31510,Thank you for adding a link to actually look at the place!
31511,"Post Ranch Inn- Big Sur, CA. Service to rooms to property. All around pretty amazing"
31512,"This. The location and property is absolutely stunning! Would go back there in a heartbeat. 

It’s worth visiting even just to have lunch on a coastal drive day trip."
31513,"For anyone wondering, i just picked a random date in july. it costs $1800 per night for their ocean accommodation."
31514,"Yeah, definitely a FatFIRE recommendation. The highways were closed on the road to get to the Inn a few years ago, so they were helicoptering people in from neighboring cities"
31515,"I think this is a legitimate fatFIRE topic and I was interested to read some of the other answers. I do believe one's view of the ""nicest hotel"" is set by how much time you've spent travelling high-end in Asia (ie be prepared to be forever disappointed on return to the US!)

For me, the Asian Amans really set the benchmark. I've stayed at Amanoi in Vietnam, Amankila and Amandari in Indonesia, and Amanbagh in Rajasthan, India. It's hard to summarise really how good they are, but the best summary I've heard is that it's much more like staying at a billionaire friend's house than a hotel.

The effort that Aman have gone to build and operate properties in incredibly, stunning remote places is quite amazing. Amanoi is a project that it is hard to imagine many other companies even attempting, much less executing in such style.

For city and destination hotels in India the Oberois are consistently good. Likewise elsewhere in Asia you can't really go too wrong with the Asian luxury brands ie Mandarin Oriental, Peninsula or Rosewood - but in most cities there's one or two standout properties that if you are really into hotels you'd want to check out, ie the Oriental in Bangkok, Upper House in HK, Park Hyatt in Tokyo.

PS There is a fatFIRE-ish [Luxury Hotels forum on Flyertalk](https://www.flyertalk.com/forum/luxury-hotels-travel-220/) which gets into all of this in much more detail with great expertise in such things"
31516,"Completely agree on the Amans. 

Was in Amanfayun (Hangzhou) several years back and it was a very unique experience, especially contrasted against a crowded and noisy city. The experience of being in an oasis outside of time and space was so unique, and made all of the typical hotel amenities seem pedestrian."
31517,Yes! I would love to visit the China Amans. The only problem is that all other hotels will seem rather pedestrian after an Amanstay :)
31518,"I don’t much like hotels. Remind me of business trips. I prefer to stay at friends’ places or with family when I have the option. Even on business, back when we traveled...

Shangri La in Sydney was okay. Hotel Chelsea and Sir Francis Drake interesting...

Actually, my favourite hotel experience was probably the tiny ‘SportHotel’ in St Moritz-Bad when I escaped studying in Milan for a weekend snowboarding at the start of the season... wood panelling on all the walls, and old kitsch posters; well-heated rooms, a continental breakfast of local cheeses from the Engadine and salumi and stolid Swiss sourdough. €54 per night. 

Or a random B&B in Hobart with free port and chocolates. Supplemented with local whisky, it was the basis of a very comfortable stay..."
31519,"When we were looking at hotels in Sydney, we passed up the Shangri-La and the Four Seasons for the Langham. It was the best choice. Their breakfast and afternoon tea were top notch, and the service was fantastic. The beds were excellent, and helped us get over jet lag pretty quickly."
31520,I second the Langham. Wife and I stayed at the one in Melbourne and had a fantastic time.
31521,"Sorry I don’t have much input for Asia or India. I really enjoyed The Breakers in Palm Beach Florida, and I’ve heard great things about Hotel Del Coronado in San Diego, but I thought it relied more in its history than actually investing more in the property. 

You may want to go check out /r/FATtravel"
31522,"Oh, no. Having stayed there, I definitely would not put the Hotel Del Coronado in San Diego anywhere near the top of my list of nicest hotels. The area is beautiful, and you can tell there's a lot of history there, but it definitely shows it's age.

There are some things like the floors being wavy in the hallways, the stairs in some places being weird heights or the old cage elevator that have a bit of charm to them, but there's plenty of other things that were just old. Creaky doors, outdated fixtures in the bathrooms, average linens, etc. After the first night, we actually got moved from the main building to one of the other buildings over by the parking lot, which felt about as fancy as an airport Hyatt.

It wasn't an awful experience by any means, but it felt like you were paying extra for the name. I will admit, the property was amazing, but once you were inside, it was pretty meh. I don't want to sound like I'm shitting on it or anything, it was perfectly fine to stay at, but unless you're really into the history aspect, I doubt the hotel is something people on here would be impressed by.

That being said, we started our trip in Santa Barbra where we stayed at the Hotel Californian (https://www.hotelcalifornian.com/) and that is definitely near the top of my list. It was gorgeously decorated, the service was fantastic, and there was tons of bars and restaurants within walking distance."
31523,How could you mention Hotel Californian but not Belmond el Encanto or The Four Seasons Biltmore? Even the Bacara is substantially nicer albeit a bit removed.
31524,"I've not been to either of those first two so I can't really say anything about them, haha. 

Bacara is fantastic, but a big selling point for me is being walking distance to restaurants and nightlife. So it being so removed from everything was a downside for me."
31525,">check out /r/FATtravel

Disappointing click"
31526,I was going to post the Breakers.  Good choice!
31527,"We go to the Breakers with some regularity, love it there. Always look forward to the trip."
31528,"Sofitel in Hanoi was great.

The Brando in French Polynesia is hard to beat."
31529,Fiji Sofitel is nice too
31530,"> Sofitel in Hanoi

Always where we stay.  Metropole is unbeatable."
31531,"Grand Wailea in Maui is unbelievable

Edit: changed from Kauai to Maui bc I mixed up which island it was on."
31532,"Grand Wailea on Maui? We had a trip planned there for next month, but they just announced that visitor quarantine has been extended through July, so we're going to have to cancel :(

We used to live about a mile away from the Grand, so we've been excited to take the kids there (and maybe make it a bit of a tradition)."
31533,"Yes, meant Maui! Corona is def messing up everybody’s travel plans :-(

Def recommend making it a tradition....it’s amazing for kids! Best pools of any resort I’ve been to except maybe Atlantis."
31534,Wife and I are headed here for New Years! Hoping to make the best of it. Any tips? Thanks!
31535,Expect lots of kids but the pools and grounds are amazing. Just a really beautiful place.
31536,We don’t have any kids nor are we massive fans. Will it be overwhelming with children?
31537,Hualalai.
31540,I have to second this. And best sushi ever.
31542,"> Belmond Governor's Resident, Myanmar

It had seen better days when we were there, though obviously the range of choices in Myanmar as a whole isn't great."
31543,Intercontinental Da Nang is splendid for sure. One of my best friends chose it as a location to ask for his girlfriend to marry him.
31544,"Taj lake palace at udaipur, India. You have high expectations and they beat them every time. They treat you like royalty."
31545,They have rude staff -  [https://www.youtube.com/watch?v=4NOgpnyPJZI](https://www.youtube.com/watch?v=4NOgpnyPJZI)
31546,Looks like some stunt
31547,Hands down the suites in MBS Singapore
31548,Singapore's hotel aren't that great from an Asia perspective. I'd say Capella if in Singapore. Downside (or upside if you're fine with beach) is that it's in Sentosa.
31549,Yeah they're pretty average but the MBS suites are well above the suites at other 5/6 star hotels imo.
31550,Look at all the Amans for Asia. Stay at a Singita in Africa. The LVMH hotels - Cheval Blancs. Pick a specific country and I’ll tell you where I’d stay.
31551,Switzerland. Go.
31552,"Bürgenstock Alpine Spa if you’re into wellness.
If it’s ski season, Alpina Gstaad. Rumor has it they helicoptered in a Christmas tree to a suite since the tree a guest wanted was so large it didn’t fit through the hallways. If that’s not ultimate luxury, don’t know what is :) 

Where next?"
31553,"Bürgenstock looks amazing, will give that a try. What would you recommend in Portugal?"
31554,"Six Senses. And if you like food and wine, it’s a little more rustic but amazing family owned with great service - Sao Laurenco do Barrocal."
31556,"Morocco - Royal Mansour. Algeria/Tunisia - not many OTT lux hotels since tourism isn’t as developed, I guess there’s a four seasons in Tunisia but I’m not going there just for the hotel."
31557,haha nice life.
31558,My job literally is to stay at nice hotels. Can’t complain :)
31559,"Nice,  I live across from it.  We have a few other beautiful places around lake luzern too like vitznau or villa honegg .  Good spots to go for brunch.  Sometimes it's fun to even just go on a bicycle ride,  taking the ferry"
31560,Costa Rica
31561,"Villa Manzu - but if you don’t have a lot of friends or family to share it with, Nayara Springs has some nice stuff. Pair it w the Four Seasons. Or give it another year or two and there are some cool resorts in the pipeline here."
31562,Japan - any amazing ryokan recs?
31563,"Great thread for ideas! 

In no particular order and plenty of options in Asia for the OP...

1.) Four seasons Ubud (3500 square foot room with private pool on the river)


2.) Four seasons Hong Kong (service in club level was the best I’ve ever received)


3.) ritz Carlton Nusa Dua (5000 square foot room with a private lap pool on balcony)


4.) JA Manafaru Maldives


5.) Ritz Carlton Central Park (10000 square foot room overlooking park, they knocked down walls to create this room for a prince to live in for a year... negotiated this upgrade for free based on status)


6.) mandarin oriental Bangkok (original one, new wing of rooms... the best service ever, they drive you around in brand new 7 series, I left my safe open with a Rolex/Patek and they secured it/wrote a note, and excellent service from everybody I encountered)"
31565,"Yes I would definitely go back. The furthest north of the resorts so highly private, great excursions/activities, and the food is solid. I’m a highly picky eater and enjoyed the food. 

Great fishing, private island to excursion to, excellent scuba/snorkeling, and nice gym etc."
31566,"Found this thread a bit late. Four seasons HK has amazing service, but it's getting slightly tired. St. Regis in a slightly worse location, but it's a beautiful modern hotel. I've switched."
31567,"vina vik.  

amangiri was overrated. 

Royal Mansour was a little too sterile. Although the spa was world class. 

Saloman bay (but that was like 8 years ago before the algae blooms)

When we’re ready to travel safely, it’ll probably be mentawais or Africa. Until then, my travels are limited to my garden, the farmers markets and the mailbox. Lol."
31568,Why would you say that Amangiri was overrated? I haven't stayed there but was planning to in the future.
31569,"The food and beverage service were awful. I hope they fire/replace whoever the F&B Director is. 

Grocery store wine list. Oily pizza. Unimaginative menu. (I admit I am a harsh critic).  We went into town to eat bbq it sucked so bad. 

The pool is super cool though and the overall vibe is awesome. 

Antelope canyon lives up to its expectations and you can hire a private guide from amangiri that lets you cut through al those crazy lines."
31570,Look at the new Sarika tents. I think people like to say it’s overrated because the original rooms are small for the price. But you’re really paying for having luxury in the middle of nowhere.
31571,Ritz Carlton in Singapore for the service. The hotel staff overhead I liked music and bought me a cute guitar lesson set and hand made a toy ukelele with my name glued onto it.
31572,My fav too. Much more refined that MBS across the way.
31573,Peninsula Tokyo
31574,Try the Aman in Tokyo.
31575,"I like The Ocean House in Watch Hill, Rhode Island."
31576,"Couer des Alpes in Zermatt, Switzerland. Excellent hotel and the view from the pool is nothing short of amazing. I'll let this picture do the talking -  [https://media-cdn.tripadvisor.com/media/photo-s/08/89/f0/11/terrasse.jpg](https://media-cdn.tripadvisor.com/media/photo-s/08/89/f0/11/terrasse.jpg)"
31577,Four Seasons Bora Bora
31578,"Grand Hotel Villa Serbelloni

If you like Italian culture, this is the place to stay on a fat budget."
31579,Belmond Grand Hotel Timeo in Sicily is on par with this.
31580,"Hard call.  In my 20s I worked at a non profit trade association, that put on one of the worlds largest trade shows.  The association would be comp’ed rooms, which they could give to employees to stay in during the show (since we pulled crazy hours).

Long story, since I was young, hard working and had no political agenda, I got along with everyone.  And as such started to get nicer & nicer rooms.  My last year there I had a two story suite at the Swissotel in Chicago.   It was twice the size of the apartment I shared with two roommates.  It was probably the fanciest/most expensive.  

But my favorite was the overwater bungalow I had on my honeymoon at the Hilton Moorea, in French Polynesia.  Still one of my favorite life experiences."
31581,"Beresheet hotel in the Negev in Israel.  If you get a villa with a view it’s almost safari-esque.  Pool in your suite, but over free roam the grounds, and then the view is straight off a 450 meter cliff into the desert below."
31582,"[The Villas at AYANA](https://www.ayana.com/bali/the-villas-ayana) in Bali

~3000 sq ft private decked out Villas, with private infinity pools and ocean views. Your own butler, and extra perks throughout the resort (best table at the bars/restaurant/etc). 

Beautiful resort with multiple pools, incredible ocean views, great food, great service (especially for Villas guests), easy access to rest of island.

~$1000/night"
31583,"Yep perfect. That is an incredible hotel defiantly. And the resort is huge.

The pools are incredible.

Have you checked out UNIQUE Rooftop in that resort? In my opinion it does have one of the best views."
31585,Sofitel in Bangkok. Service is top notch.
31586,"The Taj in Udaipur, India. Can't beat a solitary historic island in the middle of a dreamy lake."
31587,"Como shambala in Bali. 
Mulia, Jakarta. 
Mandarin oriental Bangkok. 

The service quality in Asia is just a different league."
31588,"The Dara Dhevi in Chiang Mai, Thailand. You can stay in a stand-alone two story villa set amidst 60 acres of rice patties with a private plunge pool. The property is so big they pick you up in a golf cart when you want to go to the main resort."
31589,"Liku Liku resort in Fiji. I've been to plenty of places like North Island Seychelles, but Liku Liku is hands down the best. Or at least it was 7 years ago ;)"
31590,"Leela Palace, Bangalore. Make sure to get Club Level for better drinking and dining options."
31591,Ritz Kyoto and Conrad Osaka are both pretty amazing.
31592,"Leela Palace New Delhi stands out for me. Spectacular room, excellent shower, and attentive service. Breakfast was great. Management were extremely accommodating and seemed more interested in creating a long term relationship over nickel and diming. The gym facilities and pool were also great. This hotel was built as a trophy property without full consideration to maximizing profit as seen by room size and amount. I have tried to adopt some of these customer service philosophies in my own business."
31593,"Best one in recent memory for wife and I was The Andaz, Hyatt: 1 King Bed with City View. 

beautiful stay there while we were in Singapore, excellent service, great rooms and just made us very comfortable the whole time :)"
31594,"I am a fan of old world charm, so I would consider E&O as one of the finest hotels I have stayed in Southeast Asia. Has the right mixture of old world heritage plus modern amenities. It helps as well as the hotel is situated in a place that has good food."
31595,"The mandarin in Hong Kong.

The taj in Mumbai.

I also once got comped a suite at the borgata in AC and it was pretty impressive."
31596,I enjoyed the mandarin Hong Kong but it was a notch below four seasons. The value for the price? Mandarin hands down and it’s not close.
31597,The four seasons we went to for lunch. It was an Asian place. One of the best meals I’ve ever had!
31598,"Lung King Heen... the first 3 michelin star Cantonese restaurant in the world I believe... Amazing peking duck, shrimp, and suckling pig"
31599,"Worth every star, and the prices were quite reasonable for lunch!"
31600,Overall the food in HK is cheap as fuck considering the pedigree. We had 5 meals at 3 star restaurants and a few at two.
31601,Look into the neemrana range of hotels. They are all these hundreds of year old. Properties converted into luxury hotels and are super amazing.
31602,Love the rosewood collection- rosewood mayakoba especially. Little Dix Bay would be next.
31603,Mayakoba was excellent. Can’t beat the fruit butler
31604,"Tambo del Inka in Urubamba Peru in the Sacred Valley between Cusco and Machu Picchu. Historically has had awesome award night redemption options (not sure about present date). Pro tip: if crowds aren’t your thing, skip Machu Picchu and spend more time here and in the areas in/around the Sacred Valley."
31605,"Caesar Augustus Hotel in Capri, Italy"
31606,"St. Regis in Lhasa, Tibet"
31607,"Singita operates the best safari lodges in Africa if that counts. They even flew a bottle wine from another property for us (without our asking) because they knew it was a serious favorite from a prior stay. The service level at their properties is stunning. We recently stayed with them in Rwanda and booked for 7 nights.....where people usually only stay 3-4. We just needed a break and knew they’d treat us well. The chef even made us turkey for thanksgiving.  



I love the Berkeley in London as well as the Dorchester mentioned by others. 



The Peninsula in Hong Kong is amazing, hopefully for another few years, and the super high floors at The Ritz there are something to behold."
31608,The Body Resort in St Lucia and renting a private village in Gili Air Indonesia.
31609,"Are we talking the nicest suite in a property, or the nicest property itself?

The Park Hyatt in Sanya would be near the top of any list. People were constantly sneaking onto the property to take photos for social media.

The Andaz in Shanghai is really really nice, and their suites are incredible."
31610,movenpick hotels in Europe and middle east.  As a bonus you get free movenpick ice cream.
31611,For us it would have to be The RuMa in Kuala Lumpur.
31612,"For my favorite yet that I’ve been to my vote would go to Mövenpick Resort Kuredhivaru Maldives.

For Asia (I haven’t been to many cities yet) I would vote for Anvaya Bali hotel. I’ve been to different places in Bali and this one ranks as my favorite."
31613,"I enjoyed Marina Bay Sands, Singapore a lot."
31614,"Park Hyatt in Paris. 

I’m still poor so I stayed there with points. They had a $250k watch for sale on display randomly in the hallway"
31615,"My favorite hotel is probably the Conrad in Tokyo, impeccable service."
31616,Phum baitang in Cambodia.
31617,"Hotel Emma in San Antonio, nothing will ever top that."
31618,"I’ve stayed at a bunch of these mentioned above, but far and away the nicest has been The Brando on the island of Tetiaroa in French Polynesia."
31619,"I’ve stayed at some pretty nice hotels through work trips. I liked Baur au Lac in Zurich the best. Didn’t necessarily have super impressive amenities, but it has exceptional service and has been part of some significant moments in history (I had lunch in the same room where FIFA officials got arrested in 2016 on corruption charges lol)"
31620,Hotel Nizuc in Cancun and Akelare in San Sebastián. But apparently after reading this thread I have to get to Asia
31621,"The Carlyle in New York; they even have a Netflix documentary on it called Always at the Carlyle; and have a Private Equity firm named after the hotel (the Carlyle group) because the founders used to stay here and met there for the first time. 

Rooms start at around $1499 a night I believe. Though seeing some of the hotels you guys are posting; well, they are truly gorgeous."
31622,I absolutely love Bemelman's Bar!
