idx,text
64380,"I download infuse from nmac.to

Its by HCiSO and should have pro unlocked but cant seem to get pro."
64381,"Yes, they are good to go."
64382,"I once downloaded from the site you mentioned, but in my experience, it was filled with ads, and it was hell downloading from them. I recommend the sites:

https://macdrop.net

https://www.macbed.com

They also post TNT team cracks, and out of the two, I recommend macdrop."
64383,"Strange, I haven't gotten a single ad at all. I have my DNS set to the AdGuard DNS which blocks all ads globally. I also set Safari up with the AdGuard extension as well and cranked up every privacy setting in Safari. I will take note of these sites later though, thanks!"
64384,"[Ninite](https://ninite.com/)\- install all the must need apps in one customizable installer. Standard for any new machine or fresh install.

&#x200B;

Also: [https://macapps.link/en](https://macapps.link/en) for Mac OS.

&#x200B;"
64385,"Thanks, this is very useful."
64386,"The download for chrome ist on the website of Google Chrome. The Download for VLC ist on the Webseite of videolan.org. And so on...

You should download Software always directly from the developers website  or thru the link on the developers website."
64387,I agreed - going via a third party is pretty much asking for adware / malware.
64388,MacUpdate.com is a good app tracker
64389,"Never download apps directly from a 3rd party site - download from the official developer site or the Mac App Store.

Mac Update bundles malware (since 2015):
https://www.makeuseof.com/tag/shouldnt-download-mac-apps-macupdate/

Mac Update also got hacked and distributed someone elses malware (2018-02):
https://blog.malwarebytes.com/threat-analysis/2018/02/new-mac-cryptominer-distributed-via-a-macupdate-hack/

You should also be somewhat vary of apps that require an installer and that asks for your **password**. This is a common tactic used by malware to get access to OS ""plugin"" (filesystem) locations and system settings. **Most** legitimate apps have no need for this."
64390,"Good point. I use it to notify me of updates, or search for apps I can use. But I go direct to the official developer site to download."
64391,The most secure way of downloading apps is from the developer's website directly. Once installed most apps will search for updates when launched and notify you when an update is available for download and install. Trusting 3rd party services to do this for you carries a certain amount of risk or complexity on its own and can't really be recommended for a novice.
64392,"yes but I've noticed that many apps are absent form app store. I couldn't find Chrome, VLC player, mi torrent, etc....

I need something more comprehensive. I've found many mac torrent sites, but I'm hesitant to use them."
64393,"If it's not on the App Store then it's probably scattered all over the internet, though the App Store should always be your first port of call.

One thing though - rather than VLC, give IINA a try."
64394,Chrome and VLC can be found by going to Google and searching for their websites.
64395,...the app store
64396,"The best site to find working full apps for mac is: [nmac.to](https://nmac.to) . Disclaimer: I am not related to the site, just a suggestion."
64397,"https://macserialjunkie.com/forum/ been around for ages, still has a lot and also new stuff."
64398,Macdrop . Net
64399,"macdrop.net

macbed.com"
64400,allmacworld
64401,"> Is there still something out which is good and is not PB or some mirror of KAT?

See the **Common Post Topics** list in the sidebar, e.g. /r/torrents/comments/5ok0yd/torrent_sites/

---

With public torrents you'll find the same type of Mac content that you can already find at [TPB] (https://thepiratebay.org/), [ExtraTorrent] (https://extratorrent.cc/), [l337x] (http://1337x.to/), [TorrentDownloads] (https://www.torrentdownloads.me/), [LimeTorrents] (https://www.limetorrents.cc/), [KickAssTorrents] (https://katcr.co/new/), [WorldWide Torrents] (https://worldwidetorrents.eu/), [Demonoid] (https://dnoid.me), [ruTracker] (https://rutracker.org/), etc. (also see /r/Demonoid, /r/kickasstorrents, /r/thepiratebay, & /r/TPB)

For public torrent sites specialized towards that content try [Mac Torrent Download](https://www.mac-torrent-download.net/).

---

There are also private torrent trackers specialized in Mac content, you'll want to search through /r/trackers for more info on those.

Or if you're asking about general non-torrent download sources for that content then you'll want to search/ask in /r/filesharing, /r/DigitalPiracy, or /r/Piracy."
64402,"First question: [Transmission](https://transmissionbt.com/)
Second question: What brickfrog2 said."
64403,"Is that malware scare over?, is it safe to use again?"
64404,"Don't know, never had any problems with that. Even if hackers are building virussen for mac, it's much more interresting for them to build malware for phones these day's. Hope you're not on Android. Then you've A 99% chance there something on. It's just A matter of protecting yourself. Don't go to risky shady websites and use ad and tracker blockers. If that isn't enough, cut the cord and go offline. Only then you're safe. (But then they'll find it strange you're not connected and the man in black will track you down.)"
64405,This is comical as wikileaks just posted information about the CIA targeting IOS and OSX with 0day exploits. If your running android you can run multiple antivirus apps that have a constantly updated registry so I don't see where you are getting at. I'm on a macbook pro retina so I'm not one sided but your comment is extremely misleading.
64406,Even so I'd say getting a malicious virus on android is probably far more common than CIA exploits on ios or osx.
64407,"You think the CIA is going to run malware on your iPhone? What would they want from you, your family photos? The probability that a Russian or Chinese based hacker is targeting your phone for passwords, credit card info, a way into your home network to gain access to other machines and install ransomware etc FAR outweighs the chances of the CIA using a zer0day on you to do nefarious shit. I'm not saying that they aren't doing it. I'm just saying for the average user, the most clear and present danger is on Android just simply based on the architecture. It's not even that I have a preference over either platform (I'm typing this comment on my Mac mini which is right next to my custom built PC)... This is well documented cybersecurity information. A vast majority of all malware in the world is written for PC or Android. If we are talking strictly viruses etc. That said, we are ALL vulnerable today with the prevalence of web attacks... Phishing, for example. In that instance it's all about being a smart user, but in the case of just downloading files, attachments, or apps that can hijack your machine, Windows / Android are the clear losers.

edit: typgraphical"
64408,i know how CIA runs this ± their work is 111% useless - achieves no results worth mentioning or typing ± codemonkeys ±black magic mafia discovered that terms for CIA ± certigied idiots of america ± enjoy your secret
64409,Qbittorrent search function
64410,I 2nd this!!!!!
64411,"Public torrent sites specialized in that content:

* [Mac Torrent Download](https://www.mac-torrent-download.net/)
* [Torrentmac](https://www.torrentmac.net/)

---

There are also general public torrent indexers you can check out. See the Common Post Topics in the sidebar, e.g.

https://www.reddit.com/r/torrents/comments/clctmd/updated_best_torrent_sites_list/

https://www.reddit.com/r/torrents/comments/i8rc5n/looking_for_a_search_aggregator/

---

There are also private torrent trackers specialized in that content. You'll want to search through /r/Trackers for more info on those.

---

Or if you're asking about general non-torrent download sources for that content then you'll want to search/ask in /r/DigitalPiracy, or /r/Piracy.

---

Related: 

https://www.reddit.com/r/torrents/comments/b8qyjx/mac_torrent_site/

https://www.reddit.com/r/torrents/comments/90oqvp/mac_torents/

https://www.reddit.com/r/torrents/comments/7g7hpq/is_mactorrents_site_dying/

https://www.reddit.com/r/torrents/comments/78ad17/what_are_alts_for_1337_and_tpb/

https://www.reddit.com/r/torrents/comments/71m8ct/status_of_torrent_sites_btdig_dead/"
64412,Thank yoy
64413,All of these files only have shady .dmg files now. Any one have experience running those?
64414,use chrome or microsoft edge with uBlock Origin
64415,using latest firefox with ublock and a strong vpn that rids of malware trackers and ads :)
64416,BrokenStones. Nothing comes close IMHO.
64418,Are they operating on an invite-only basis?
64419,"Yes, it is a private torrent tracker. See /r/Trackers for private tracker topics (also the info in their sidebar)."
64422,for mac software?
64423,I have found nothing more confusing than the Nike line of shoes.  This was VERY helpful.  Thanks!
64424,I think New Balance and Adidas are worse.... it's going to be fun to try and do this for their shoes now :)
64425,"> I think New Balance and Adidas are worse.... it's going to be fun to try and do this for their shoes now :)

PLEASE do this for New Balance, they are the only shoe that really fits me well (I have wide feet) and all the numbers and what not are confusing as hell"
64426,"They finally started attaching names to the numbers on some models, which makes it less confusing, like ""Zante,"" and ""Vazee.""  Unfortunately, they didn't do it with all models."
64427,"As someone who works in run specialty, I really miss the numbers. If you know the system you can guess pretty well what a shoe is going to be like just from the name."
64428,"I wonder why shoe companies don't do something obvious like put a ""-C"" or a ""-S"" after their shoe names?  For instance, Vazee-C.  Now you immediately know it's a cushion shoe.  

Maybe that's too obvious or something.  I don't work in marketing."
64429,"The number allows for a bit of nuance. For example it can tell you the relative amount of stability. The 860 is slightly more stable than the 870, indicated by the last two digits."
64430,"Ah, that makes sense!  Finally!  I grew up with NB in the 1980s, and the numbers did not make any sense whatsoever then.  There was a 420, a cushioned, neutral trainer.  Then there was a 620, another cushioned neutral trainer.  Then there was the 730, another cushioned, neutral trainer.  When they went to 990 and 1000+, the numbers only indicated price.  Then I had numerous pairs while running in college, and the numbers were all over the place.  500 something?  600 something?  I get racing flats, and all of a sudden it's the 200.  Then I get track spikes, and those are also the 200.  But now there's a new track spike, and it's the Comp 400?  Most recently, I had the Comp 205 and the Comp 330 racing flats, but now I see that racing flats are now 1300s.  Wait, that used to be the incredibly heavy trainer for chubby old men number!  What's going on here?"
64431,"Wow, yeah. That is really confusing.

Generally, the way it works now is that the last two digits indicate a shoe category (stability[x40,x60,x70), neutral [x80, some x90 ], racing [xx00], etc) and the first digit (or two) is how technical the shoe is. Under 6xx is gonna be your budget shoes, 8xx is mid range technical, 10xx and 12xx are cushioned, 14xx and 15xx are your racers.

The way it was first explained to me is to think of the last two digits as a speedometer. As you get closer to ""100"", you get more neutral and performance oriented.

Of course there are weird exceptions and shoes that don't cleanly fit into categories. (I'm looking at you 990 and 840)"
64432,"and the 1080 is a more expensive shoe than the 880

but this is all gone"
64433,"Yep, just bought 1080v5s (1080 Fresh Foam) the other day, no other name for them. But I do love them nonetheless."
64434,"I started making this last week. You're welcome to use it as a launching point. 

https://docs.google.com/spreadsheets/d/1ctJecQS6mBLu8Y4knzmhpnxzGUMqP1S4nTTFCR7idXU/edit?usp=sharing"
64435,Ultra Boosts thoooo cmon OP!
64436,Personally I prefer the Bostons
64437,I second the vote for New Balance. I buy them pretty much exclusively and would like to know the difference between X and Y shoe.
64438,"As a fat footer my Nike guide is one line: All too skinny. 

Now New Balance; that's my jam. Any number ending in an 80 (8, 10, 12) in a 4E width."
64439,"Hi. A couple of weeks ago I wrote a [guide to Asics running shoes](http://www.runningshoesguru.com/content/understanding-the-asics-running-shoes-lineup/) that took me forever to write, but was well received.

I spent even more time - a good 2 days - to write the Nike one. Hope it helps!"
64440,"> guide to Asics running shoes

I was hoping you had one for them. Thanks!"
64441,"Hey, just a slight heads up on your Asics review. The gt 2000 still has the fluid ride midsole. The difference between that and the 3000 is the length of the dynamic duo max support. The 2000 is just really where the arch is, however the 3000 carries on down to near where the big toe is, designed for the very late pronator!"
64442,"I might just be that dude, but maybe do just a little guide on how to determine what kind of foot you have ? 

So how to determine if your flat footed, what kind of arch etc."
64443,"The best way really is to head to your local running shop. You can try things like the wet test to help figure out your arch, but it's difficult to get a complete picture without looking at both the arch and gait in motion."
64444,"That's fair, but that doesn't really teach me to maybe find budget shoes because I at least know what I'm looking for."
64445,"I'd say still go in and get fitted. Be honest that you don't want to spend much, they usually have sale models. If they don't have anything in your budget at least you'll know what to look for when shopping later."
64446,"Saved, that is super helpful. Thank you!"
64447,"Just had a glance, amazing review which seems to be very much in line with their key brand stand points. Obviously you have missed some race shoes for good reason, but not sure if you meant to miss the free rn commuter?

Either way, great review, thanks"
64448,"So I have been running with the Flyknit Lunar 1,2, and 3 for several years now, it appears that it's a dead shoe.  Would you be able to offer me some guidance on a similar shoe?  

I tried to speak to someone at nike for help, but they aren't much help at all unfortunately."
64449,"It's dead? I loved that shoe, they make me feel fast."
64450,LunarEpic
64451,"I think the LunarEpic is the spiritual successor, but probably the lunartempo is the most similar shoe right now"
64452,"Lunar tempo, not lunar epic. Lunar epic is its own new line and concept."
64454,"Boost is so much better than lunarlon it's incredible. But not all boost shoes have the same type of boost as others (weird, I know). The ultra boost is the best and most comfortable boost shoe I've tried on. My friend has a pair of Boston boost that he loves though and they seem like they would be more suitable for running!"
64455,"Actually, it's the same boost material, just in different amount. The Ultra is 100% boost cushioning and 0% EVA foam. I don't remember the exact % differences for the other shoes but I think the Boston is ~60% boost with an EVA ""heel bumper"" and forefoot."
64456,"I just meant it doesn't feel the same not that it's actually different type, I misspoke haha."
64458,"It's not the boost that gets me but the uppers. Have tried several and they are all so tight they give me blisters and foot cramps. Shame cause I love the feel of the boost, just can't wear them."
64460,"In my personal opinion they do racing spikes and racing flats very well. As far as trainers, I feel that other brands have outdistanced them."
64461,"I had a pair of Nike Zoomfly 2s that I absolutely loved, but I started training in them and they wore out incredibly quickly and caused some minor injuries because they were racing flats not proper training shoes (I was much newer to running/footwear at the time). Ultimately the people at my local running store and I reached the same conclusion you did. Nike makes some solid racing shoes, but in many instances they tend to lack when it comes to trainers. Now I just wear the Zoomflys because I like the way they look."
64462,"They make some really good running shoes. However, it is a matter of trying the *right* shoe. It's also worth noting that not every brand works for every foot"
64463,"I log over 100 miles a month and swear by lunar glides... i've never had any structural injuries or issues, and never got a bad pair. maybe i'm lucky?"
64465,"I've used them for both long and short distances. I've run many half marathons and a full marathon. I usually only run on pavement, mainly in the city (Boston and NY). Recently, I've been only running 4-6 miles at a time. Previously, my minimum mileage was at least 7 miles, upwards of 10-12 miles at a time... this was in my former life before having a child."
64467,Entirely possible
64468,"Me, too. This is my shoe. I love them so much that I also buy boys and girls models for walking and short runs. Prior to that, I'd worn Lunarlon exclusively for five years, but I vastly prefer the Lunarglides."
64469,"Any time they go on sale for like $60, I stock up - I currently have 2 pairs in my closet for when my current pair die."
64470,100 miles a month isn't enough to really feel the extent of the issues in shoes imo
64471,"I've run over 17,000 miles in Nike shoes (mostly Pegasus) in the past 10 years. They seem legit to me."
64472,same here
64473,"Pegasus is nike's only legit running shoe. Great shoe, though"
64477,"I've tried many shoes in my local running store, from most of the major brands and every time I go, the Nike vomero always end up on top in terms of support for my foot. They may be not the most durable shoe, but I did 1100km on my vomero 8's (even ran a marathon on them) and they held up well!"
64478,"I have the very same experience with vomero, except I run in the 9 instead of 8"
64479,"I recently needed some higher-drop shoes and after trying on half the store I settled on a pair of Nikes (the lunar tempo 2). They've been great, I'm very happy with them."
64480,"Same here. Love my Nikes (just picked up the Flex 2016 RN), but can't rely on them for actual running. New Balance has always just agreed with me better."
64481,Yup.  Awful shoes.  I'm a Brooks man myself.
64482,I was amazed to see an apparently serious article referring to Nike shoes as running shoes. Nike is style. That's it.
64483,This is awesome work! Much appreciated. Shared on FB as well to spread the word. Look forward to the New Balance review. They have so many types of shoes! I am quite overwhelmed there!
64484,"Yes, I'm excited for NB too! :D"
64485,"Awesome job on this - answered many questions I had about Nike's lineup.    

I've never run in the Flyknit shoes, I wonder if they allow stretch/splay like the stretch fabric that Newton/NB uses on some of their shoes, that LunarRacer looks really appealing for the cushion/weight ratio."
64486,"Itbreally depends on the shoe. Flyknit allowas them to have different pressure in different part of the shoe.

In my experience, it Is quite tight in the beginning and loosens after some break in"
64487,Wow the autocorrecr on my phone really sucks
64488,"> autocorrecr 

Autocorrect failed to autocorrect autocorrect!"
64489,"Seriously, what keyboard are you using? I couldn't write that bad if I tried on SwiftKey :D"
64490,Samsung edge s6
64491,"Thank you for the excellent guide. Well done! 

Try SwiftKey."
64492,"Default samsung? Ditch that shit man, that's what Android is for :D"
64493,I'd change keyboard... but it seems each app uses their own keyboard? IE the whatsapp keyboard seems different than the baconreader keyboard and different from the standard messaging keyboard? Or am i just not doing it correctly ?
64494,Not sure if I can answer your question on stretchiness but I can tell you that the fly knit material is extremely durable. I have a pair that I've had for 18 months that the fabric still looks almost as good as new with no tears anywhere.
64495,Great work OP! Do you have any plans to do something similar with any other shoe brands?
64496,"I did asics a couple of weeks agi you can find the link at the end of thr nike one.

I do plan to do more, but it takes so much time"
64497,"That is a great guide and I have enjoyed your articles in the past.  

I do not think I will ever buy nike running products again due to their treatment of track and field athletes, exemplified by the current legal action taken on Boris Berian.  I was a big nike running fan, but I have a hard time with how they conduct themselves."
64498,I dont know anything about this. Hows the story?
64499,[Colorado Springs track star Boris Berian can compete — but must wear Nike gear](http://www.denverpost.com/2016/06/05/boris-berian-nike-lawsuit/) (Denver Post)
64500,"Great article and shitty of Nike no doubt. That said, I find it pretty funny that this article makes a comparison, even slightly, to Nike possibly losing out on this upcoming running star to them losing Steph Curry. Apples and oranges x1000000."
64501,"[This](http://www.denverpost.com/2016/06/05/boris-berian-nike-lawsuit/) article has quite a bit on the story. 

I love Nike shoes but I'm starting to lean towards looking for something else because of this kind of thing."
64502,Nothing on the regular Zoom Streak 5/6? They're the best shoes they make.
64503,"Yes, I love the fit and ride of the Zoom Streak 5. Will be interesting to see how the Zoom Streak 6 feels with the Pebax plate."
64504,This is great!
64505,"I will say that the flynit racer really didnt reappear in 2016, it never went away really"
64506,That was very informative. Do you know what Hyperfuse is? I have it on my Nike Hypergamer basketball shoes.
64507,"It's how the upper is held together, in your case it's fused instead of glued or stitched"
64509,"The Flex is a take-down version of the Free concept.
It shares design elements and general feel, with some less expensive materials.

The new Free RN (flyknit or not) could be a nice transition for you. 

The flex fury is a great value shoe at $80"
64511,sorry - i wouldn't really know :(
64512,"Here's what I wanna know though...I liked the Pegasus up til #30 mostly because it had great cushioning. After that they got more solid I feel like. And my knees felt it too. I still havent found a good shoe to replace them with, but I have to admit I havent really looked that hard... Mostly cause I keep hoping with every new Pegasus release that they'll go back to amazing cushioning. But alas.. Any tips?"
64513,"The new Pegasus 33 is supposed to have more cushioning, but I haven't tried them on yet."
64514,"Not OP, but the new Pegasus 33 that just released feels a LOT more cushy and similar to the older ones.  They switched to zoom air through the forefoot, and re distributed the cushioning in general, and it does feel a lot better.  Worth stopping in someplace to try on IMO."
64515,Oh this is good news...! Will have to try those then! Hated the 31's and 32's. Hopefully the 33's will be my kind of shoe again.
64516,I almost tl;dr before even clicking through! You need to change 'extremely long' to 'extremely thorough'  in your post title. It doesn't sound too appealing otherwise.
64517,This was great. I debated getting the structure the last time I went to the store... this has me regretting not trying them!
64518,"I currently have the Structure and I'm not a fan. Anything longer than 5 miles gives me sore knees, though that might just be because I'm a heavier runner, and am flat footed. I usually run in Brooks Adrenaline 15. I'm curious about the lunarglide and Vormero; might be better for me."
64519,"""Flyknit is a special woven fabric""

A knit is a woven? I don't think this is correct."
64520,"This was INCREDIBLE, thank you so much!"
64521,Does nike really make no zero drop shoes?
64522,What's that shoes that you don't have to replace ever cause cushion never wears out
64523,Their naming 'system' is so obtuse that I could never be bothered to try and figure it out. Thanks for doing the legwork.
64524,"Nice guide, thanks! Looks like I'll probably just go with a fresh pair of zoom structures as mine are battered now. I had the lunar eclipse previously which were insanely comfortable, but they weren't as durable as the structures."
64525,"Havent looked at all the comments but one error you made is the spelling of ""distribution."" 

Otherwise, great info across Nike's 2016 line up."
64526,"I got a pair of Nike Free RN Flyknits when it started Endomondo's C25K plan a couple of weeks ago. I've loved them so far and have not had any problems, but some people have said I shouldn't use them as my first real shoe. What do you hunk, am j good to keep using them?"
64527,So I'm base building for cross country on 30-40 mpw. Would the Nike Free RN Distance be my best bet?
64528,">Once that is clear, there will be shoes able to accommodate all kind of over-pronation issues in each of the categories.

So you didn't really talk about which specific shoe does what within each category. How do you figure out that part of it?"
64529,"Ayy I just bought pegasus 33 yesterday, so happy it was rated good"
64530,What about NIKE Kukinis? Why were they discontinued?
64531,"There's a difference between ""everything Nike has is awesome, check out these new Nike products and all their neat features"" and a guide to picking through Nike's lineup.

The former is called an advertisement.

Is this sponsored content?"
64532,Have you figured out how they produce shoes with such inconsistent quality? I had to stop buying Nikes when I couldn't handle that anymore.
64533,Nice work. I never bought Nikes until they came out with flyknit. I'm a huge fan cause then I don't tear holes in the uppers of my shoes every damn day.
64534,"I'm a huge fan of the Wildhorse 3, it's a great trail shoe for more technical trails where you're going to be needing the rock plate and aggressive traction. The cushioning makes 4-5 hour days on the trail comfortable and you go slower on the trail anyways so I don't mind the extra weight."
64535,"Great article. I'm a huge Nike fan and primarily run in all Nike shoes. I've spent a few hours in total talking to the Nike Experts via chat when choosing my next pair of shoes and trying to compare models. When you start running in their different models, you really can tell the difference between the Lunar series, the Zoom series, and the Free's. I have Peg 33's arriving at my door today, and I'm looking forward to getting into them. I had a hard time deciding between them and the Elite 8's which on paper are extremely similar, I may pickup the Elite's just to compare them and return the one I like best. 

As someone else mentioned you missed the Zoom Streak 5's! I thought that was the elite marathon shoe of choice and not the Flyknit Lunar, but you probably know better than I. Looking to pick those up soon for my fall marathon. 

Lastly, can't say enough good things about the versatility of the Lunar Tempo 2. You can use it for temo runs, long runs, recovery runs, and they are so cheap too! Highly recommended for someone looking for a lightweight trainer and general mileage runner."
64536,"A little more on the Zoom Streaks:
1. As of a couple months ago, I would say they were tied (with Adidas Adios Boost) for the most popular competitive marathon shoe. These 2 shoes are almost always seen in the front of marathons. I'm not sure if there was any shift when the Boost 3 and Streak 6 came out. 
2. I have worn 2 pair of Streak 5s. I love running in them, they are my favorite shoe I've ever worn. They were very light and supportive enough to train full-time in. The first pair lasted ~550 miles before some of the flywire started to break. The second pair lasted ~150 before some of the sole fell off. I switched to Streak LT3s and I don't like them nearly as much. I'm planning on getting the 6s soon, not sure if I'll wait for the LT3s to wear out or switch early."
64537,"Thanks for the info. Yeah I meant Nike's most popular marathon shoe, I think you are right that the Boost was the actual most popular overall. Same as you, I'm racing in LT3's right now, I like them, but from what I read and hear the Streaks might be more up my alley with just a little more support and durability. I just did some Googlnig and the Streak 6's were supposed to be launched June 1? Can't find them at all on the Nike site."
64538,"The Streaks feel a lot more like actual shoes, they're a lot stiffer. When I first switched to the LT3s I felt like I was running in socks, they have a ton more ground feel. 

You can find the 6s [here](http://www.footlocker.com/product/model:260718/sku:31413601/nike-zoom-streak-6-mens/pink/black/?cm=) if you're ok with looking like you stole your girlfriends shoes. I had the bright pink 5s and didn't feel weird about it but I'm not sure about these. I found them on a different site a few days ago but now I can't."
64539,"Ground feel is a good description for the LT3's. I saw those same shoes on FootLocker's site, I wonder how they even have them available. I just chatted with Nike's support and they officially ""have no release date for the Streak 6's"" so there is our answer."
64540,":( That makes me sad. I wonder if I would get them if I ordered off FootLocker or if there was some sort of mistake and they aren't supposed to have them on there and I would end up getting refunded. Running Warehouse said they were supposed to come out on the 1st but they aren't on their site. 

Amazon is the other site with them but they're $145"
64541,"I picked up a pair of the lunar tempo 2s recently and I've been very impressed! They feel almost as nice to run in as my Zantes and Kinvaras, and I really love the feel of the upper."
64542,Thanks for this.  Hoping to buy some running shoes this weekend and start C25K and I know Nikes are on sale nearby.
64543,I love the Nike Lunaracer+ 3.  Too bad most stores in my area just pretends it doesn't exist.
64544,"I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:

- [/r/hailcorporate] [""I wrote an extremely long guide\* to Nike running shoes."" \/r\/running \*advert](https://np.reddit.com/r/HailCorporate/comments/4nhc9q/i_wrote_an_extremely_long_guide_to_nike_running/)

[](#footer)*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*

[](#bot)"
64545,"Far be it from me to attempt to slow the relentless march of capitalism, but I hope y'all are aware that there is [no evidence whatsoever](http://www.ncbi.nlm.nih.gov/pubmed/18424485) that these shoes benefit your running.

Happy retail therapy!"
64546,"There's plenty of research on shoes and the benefits of different types. 

There's just no research on the way shoes are sold (which is what your link discusses) . 

But then no one is saying that running shoe store salesman are equivalent to a GP either."
64547,"> There's plenty of research on shoes and the benefits of different types.

???

Did you click on the link I posted?"
64548,"I did. Which is why I agree the actual fitting is not prescription based. 

But there's plenty of research like this http://www.ncbi.nlm.nih.gov/pubmed/1624189 which means it could be done."
64549,>I wrote an extremely long ~~guide to~~ advert for Nike running shoes.
64550,"Yea I had something similar.

Don't buy Nike you normie"
64551,"Best thing about Nike is the returns process. You can safely buy a pair, try them outside and return them if they are not for you.

One of React Infinity, Pegasus, and the new ZoomX Infinity would be my choice for a standard shoe from Nike."
64552,"Good to know, after making this thread figured I should head to the mall on the weekend since there's a Nike store to at least try a few of them on. But yea was eyeing the React Infinity and the Zoom X Invincible if they come out soon."
64553,Note that if the store is an outlet it won't have 37s
64554,Yep get the infinity run or the invincible
64555,"You may want to try on Nikes before you buy. They REALLY dont work for some people, and it's not a small minority. The pegs KILLED my feet."
64556,Did you get the heel pain and pain on the right edge of the right foot/
64557,"I’d look for a stability model from Nike.

The Adrenalines are hard to beat, and I’ve never been able to find a Nike that’s come close."
64558,Zoom Pegasus 37 is my recovery shoe where I run 4 miles. They help me focus on glute propulsion and are very cushioning. They are also wider than most nikes I've ordered. I had to go a size up for my big toe and do a runners knit for the heel lift. I'm also a 115 lb woman so the fit for you may be different but based on your post it is what I recommend
64559,Do you want something to replace the adrenaline or complement them for an up tempo shoes?
64560,"Replacement. I usually just have one running shoe for cardio and replace them every couple of years. 

Adrenalines were suggested in the past and they felt good so I ended up just using them. Generally I don't need an up tempo shoe since I'm not really racing/running for best times, but I don't want something super bulky either. Feel like Adrenaline was a pretty good compromise that offered good stability and decent tempo but I dunno a ton about running shoes?"
64561,Wait you're wearing a stability shoe. Why not go to a running store first and see if you actually require a stability shoe or a neutral shoe? This is a life changing step friend.
64562,"I guess I've never really been that big into running and if something felt comfortable I'd end up just using it :o I play hockey and volleyball so most of my exercise just comes from playing and I'll throw in short runs at lunch time or something if I feel like my cardio is failing (it's been nice to get away while WFH during covid also).

I think the only place around me is Roadrunner but I usually buy my shoes on clearance (i.e. I'll buy last year's model when they're like 30% off or something when new versions come out) or in this case I'm just going to buy them online from Nike. I always felt kind of weird having someone watch me run then feeling obligated to buy a shoe when I don't really want to buy one from there..."
64563,Ah yes same here. Recently I got vongos on sale and was running 4 miles in them and felt a hip pain after some runs. I came Here and saw lots of suggestions made a list and went into a running store privately owned by my house. The guy looked at me walk no silly running or feeling and just showed me the neutral selection and gave me space to look and helped others. I hope you are open to the experience and don't feel pressure as I've worked in retail and understanding we all have budgets and responsibilities. Most little shops know you are curious and can alway come back when you're ready. But just finding out it you are neutral or need support is valuable. Best wishes
64564,"Brooks Adrenaline is a stability shoe, so if works and you like it:

I think the Nike Structure or React Infinity Run is where you want to look. You may want to go Infinity Run 1 on sale, because a lot of people have been reporting issues with the tongue ripping on the new model."
64565,Both of those are good shoes. The Zoom x Invincible coming out soon are supposed to be pretty good as well and pretty similar.
64566,Yea I saw those on the website with coming soon. I have to submit my order to the exec assistant by march 1st though so not sure if they're going to come out in time... but they looked pretty nice.
64567,"What kills me about your company:

This would make sense if they were giving you a gift card, but if they are making you send them a damn cart, why not just buy you a pair of Brooks!?!?"
64568,"Think it's just so the exec assistant doesn't have to deal with people submitting a bunch of random stuff and her having to put in orders on multiple websites and then expense them on the corporate card with different invoices. It's for like 14 people so she basically curated a short list of Amazon links for like Switch Lite, Kindle, Ring, etc. and gave Nike.com as an option; that way she can just combine orders on a couple websites instead of going to 14 different websites and makes it easier to submit a expense reports with only a couple of invoices."
64569,"If you can get your hands on the new Structure, that would easily be the most comparable thing to the Adrenaline. The Nike React Miler is IMO a criminally underrated (if somewhat boring) shoe that does a really good job blurring the line between neutral and stability. If you have the chance, visit some kind of brick and mortar retailer and try things on before pulling the trigger. Good luck!"
64570,Which one actually fits the shape of your foot? I'd probably start there.
64571,I’ve tried on all three in store. I basically tried on the entire store lol and these three were my favorite. But haven’t had the chance to take any of them on a run
64572,"The best site anyone has ever shown me for running shoes - https://runrepeat.com

Read the reviews on there."
64573,"Pegasus for sure! It’s a great workhorse shoe, I’ve used these for both high volume training and racing, comfortable, supportive, cushy but not too cushy, great in the rain. I normally don’t like Nike because they seem to be too minimal with exception to the Pegasus."
64574,Love the Pegasus. It's a no-nonsense shoe.
64575,"I have run extensively in all three. I hope I can shed some light.

- if you like light and bouncy, Epic React Flyknit is a great shoe. Make sure it has enough volume in the toes and forefoot. If you have a higher instep or a wider foot it might be too shallow or narrow. Even though the flyknit fits pretty tight it does flex quite a bit to accommodate foot shape. The React foam is proprietary cushioning tech that feels unlike any other foam I have used in a running shoe.

- I retired my LunarEpic Low Flyknit last year after about 100 Miles. Fit too narrow and was just a little too “mushy” feeling for me. I also can’t stand the outsole. It picks up small pebbles way too much. This shoe is discontinued going forward and replaced by the Epic React, even though it’s a very different shoe.

- Pegasus 35 just launched, so I have limited experience with this one. Loved the feel underfoot. This is good if you want a little more support in your shoe. It’s still light and fast. I feel like the tongue comes up a little high though. It bothered a bit on my last few runs.

Do you normally run on a neutral support shoe? Make sure these options have enough support for your foot and gait. Also, shape matters. Nike tends to run narrow in these styles so keep that in mind.

If you can visit your LRS (local running store) I’d recommend it. They can give you advice and offer solutions outside these three styles."
64576,"Epic Reacts have been absolutely fantastic for my every-other-day 5 mile runs and during my long runs. Personally, I love how light they are and the responsive cushioning (firmer than UB). However, I understand that they are kinda expensive and might be a lot to invest in.

I haven't tried the other two shoes unfortunately."
64577,"They're all great from my experience, but you should test them out and see which works best for you.

The LunarEpic 2, though, having been replaced by that Epic React, is normally pretty cheap these days. You could probably buy two or three pairs from the Nike Factory store (or elsewhere) for the price of either of the other two, so if you like that more, that's what I would do."
64578,"Can’t recommend the epic react flyknits enough. Super light and very comfortable. Just ran my first half-marathon in them today! 

The one thing I would say is they run a little big, so maybe go a half-size smaller than your usual, or just double up on socks. But I would try them on first. Good luck!"
64580,"Not the OP, but for me it's the matter of price. I'm can't afford to get shoes from specialty running store, but with Nike I can get decent pair of running shoes for half the price, maybe even less. I go almost exclusively to Nike factory store, and my last shoes Downshifter 6  and Winflo 3 cost me $30 and $65 respectively. 

Once I'm more financially stable I'd like to try different shoes like the Asics gel series or some New balance or others. For now though, my Nike's are treating me well, and are affordable."
64582,"It definitely takes some looking, but you can get lucky (like I did). Last time I was there, which was couple months ago, they had the last model Pegasus for $75 which is a good deal in my opinion. Unfortunately my feet don't like Pegasus very much, lol.

Edit: I have Nike factory store really close, do sometimes I go there just for the fun of it to look what they have."
64584,"Never tried them, but will get a pair of I see them for a good price. Thank you for the recommendation!"
64585,"Because they look good. If I’m paying $120 Plus for running shoes I want them to be stylish enough I can wear them casually once they’ve run their course. I’ll pick up other brands if they’re discounted, but I’m not paying that much for shoes that look like shit. Granted I’m lucky in that almost all running shoes feel good on my feet, so I have many options. I know that’s not the case for everyone."
64586,"I love my Pegasus', they have been the most comfortable running shoes that I have owned. Run a lot of miles in them this year. 
However, just choose the shoe that feels best. Try running on a treadmill in the store, if you feel any niggle or discomfort then they are not for you"
64587,"I have the Men's version of the LunarEpic Low's and the Pegs...I use the LunarEpics for my short distance runs / casual day to day \- and I use the Pegs for all my longer runs and all my races...love them both...i'd just make sure you're comfortable with how ""spongy"" the LE's feel over a longer period of time...they feel like clouds on your feet when you're just walking around and for shorter runs...but I can't speak for how they feel over longer distances \(over 10K//6.2M\)...also, my one gripe with them is that their sole collects little pebbles and debris like crazy...it's mildly annoying when you're running and you can hear/feel the scraping of them!

Was just at the Nike Outlet the other day and they had the LunarEpic's for 100 CAD. I think they had the Pegs 33's on for around the same, as well."
64588,"The Pegasus Turbo 2 is generally thought to be their higher end durable trainer option when paired with the Vaporfly for racing. Where the Vaporfly has the carbon plate to stabilize the ZoomX foam and less durability, the Turbo 2 has a layer of firmer React foam for that."
64589,"Thank you for your advice, will definitely have a look at them! :)"
64590,"x2

Really love my Turbo 2's (when my heel isn't bothering me)"
64591,"The Turbo is a good recommendation, but I’d just do the OG Pegasus. Not much different than the Turbo. It’s a touch less technical, but equally good as a mileage beater. It’s also $60 cheaper last time I checked."
64592,I Love my peg 36s
64593,I wear Nike Epic React Flyknit 2 and like them. But I’m no shoe expert
64594,"Honestly turbo 2's are my favourite trainers out there. They often go on sale so it's worth keeping an eye out

I did get regular pegs recently as they were on offer at a bargain price (the 36 not the 37). Honestly they're great too. A little heavier and a little firmer. There's been no news from Nike about a new turbo coming and it does feel like the changes to the Pegasus means that they're for people who normally wear pegs and turbo's. Reviews have been pretty good on it"
64595,I posted on the Sunday question forum about the Pegasus turbos- I just got them for some speed work sessions and was nervous cause after my first little 30min interval my legs felt like they took the brunt. Lovely poster responded maybe I tied them off ? So gonna adjust that but now I’m weary about them - getting injured. My legs felt “shock” little pain in left toes. I usually wear cushioning brooks do you feel like it’s just a case of getting used to a different shoe? I was a little faster as a side note so they’re like a tease right now and I don’t know what to do! Just don’t want any injuries you know especially from wearing the wrong shoe ?
64596,"I’ve been using the turbo since November and I am actually retiring them now, since they got to the point where my calves get  pretty sore when I wear them, they lasted me around 600 km. Anyways, what I wanted to tell you is that my experience with the Turbo 2 is that you need some time to get used to them and  find the best way to lace them up. The upper on the heel is minimal and there is no support.  All in all, I loved how responsive the Turbo is and I even hit some PR’s on them. The turbo is great but it has a learning curve for sure."
64597,So helpful thank you.
64598,"I use the Nike Pegasus 35 Zooms and they're excellent and a good choice if you're on a tighter budget and can't quite stretch to the Turbos. I know the 35's have been superceded now though so 36's or 37's. 

I have used them for almost 100 runs this year and can't fault them, I normally alternate between 10km and half marathon runs. They feel fast and supportive and I got them for a great price."
64599,"I got a pair the other day and got a new 5k pr on the first run out, they're pretty solid. I adore that colourway!"
64600,I took them on a 10k shakeout yesterday felt smooth the whole time!
64601,Oh that's awesome! I'm planning to take them out for either a 10k or 7 miles tomorrow
64602,"Counterpoint: These are okay shoes with the Nike gloss that makes them come across as better than they are.

5% of Nike’s output is made up of high-performance sports cars. The other 95% are budget sedans with the same paint jobs as their faster, though very distant, cousins."
64603,"I agree. Nike is good at making racing shoes, I usually run in Brooks Ghost for daily trainers. But man they did a great job with these Pegasus I recommend trying them."
64604,"I tried them on and didn't find them particularly comfortable either. The Asics gel-lite, Saucony high end and Brooks high end all felt better on my feet than the Pegasus."
64605,and all retail for more?
64606,You could compare it to the Skechers line if you're looking for something cheaper - and they're much more comfortable too fwiw
64607,"What other shoes that are a jack of all trades, master of none, like the Pegasus is actually better all the way around? 

I think that the Vapor/Alphafly, Pegasus, and Zoom Fly are all great shoes, I also run in Hokas, New Balance, and some Brooks(I have a running shoe problem) and the Pegasus is the best all arounder that I have worn. Not amazing in any on area, but not bad at any specific."
64608,Thats a very interesting comparison. I think i’d agree with this.
64609,Love the colorway but I am still a 36 purist.  Just didn’t feel like a smooth transition between the foam and forefoot airbag IMO.
64610,Have both 36s and 37s. Definitely feel like the 37s push you to be up front more and get you going faster.
64611,Interesting. I’ll probably have to switch at some point but I really want to try the endorphins
64612,"I originally bought those adidas supernovas (bright pink). Yea they sucked so I returned them, got the peg 37’s and lemme tell you these are the daily trainers you need."
64613,Do you have a link? I can’t seem to find that color! They look so freaking beautiful!
64614,https://www.eastbay.com/product/nike-air-zoom-pegasus-37-mens/J0677100.html
64616,IMMA HAVE TO SECOND THIS MAN. THE PEG 37 NEEDS TO BE TALKED ABOUT DAILY.
64617,Agree. These are my favorite shoes to run in.
64618,Jack in the Box has THE tacos.
64619,"Great upgrade from the 36s IMO, not to knock the 36s at all - just to support how great the 37s are. Love the yellow fade. Congrats"
64620,I have a pair of peg 37s in rotation and I have to disagree. They fit nice but the foam is not the one for me. It’s not soft enough to feel like a cushioning shoe and it barely has any bounce. They just feel kinda clunky generally.
64621,"Nice shoe, I have a pair, but feel the React is a little over-rated. Nice pop from the air unit though. I only use them at the track these days so I don't have to change shoes and they handle the transition from effort to float well. Chalk and cheese when I put my VF4s on for TTs though."
64622,They look very nice and and I like how they handle both fast and easy runs. I experience slight heel slippage and discomfort om my heels. I hope this will pass with more breaking in of the shoes. Otherwise I will have to exchange them for some Asics
64623,"I have the same exact thing, does it fade away as you run more? Maybe will exchange them as well."
64624,"I had to exchange them within the 1 month window. Got a pair of Asics Nimbus 22 instead. They are a bit boring and heavy, but comfort is fine."
64625,just returned mine as well. Looking for the asics novablast or the latest kayanos
64626,"I agree, I have 350 miles on mine and they still look almost like new. Not the fastest shoe ever, but a great jack of all trades, master of none."
64627,350 miles is 563.27 km
64628,"Does nobody else have an issue with the heel being too short? Or your big toe hitting up against the toe box (not a sizing issue, I mean the there’s not enough vertical room for toes) I find these so uncomfortable."
64629,"Heel feels too short for me as well, otherwise a good shoe. Don't think i can get over it so i think i'll have to take them back. Just feels off."
64630,"I'm only on 40km with this, but I can't help to notice that I need to push harder to get faster? Even when I'm running slow for easy run it just didn't gave me the response I needed. Too soft perhaps.."
64631,Epic react. Additional 20% off currently on Nike.com
64632,"Never cheap out on running shoes, is fine for casual shoes but running is a high impact activity, trust me the wrong shoes would cripple you, your knees, shins and back will thank you for it"
64633,How many chins do you have? lol
64634,"Meant to write shins 

https://www.runnersworld.com/shin-splints/"
64635,It was a joke. I've had shin splints before.
64636,How much do you think the appropriate amount I should spend is ?
64637,"You can find affordable running shoes on sale, but my point is when looking for the pair that fits your needs don't focus on butget, I get that not everyone has the capabilities of getting ""Zoom Vaporfly's"" but look for what you need. Examples are: are you looking for cushioning or minimalist, are they're going to be for long 12k+ runs or just jogging 1 or two miles here and there, asphalt, track or dirt trail, etc. good luck finding what fits you. There's many reviews websites that can help you choose what fits your needs"
64638,"Nike Pegasus are also 20% off at Nike, they last long and have great comfort and protection."
64639,"I used to run around 10 miles a day and running shoes are so subjective by the wearer. But I found this online, maybe itll help with some of the extra data on there.

https://www.mensjournal.com/gear/the-best-running-shoes-under-100-for-men-2019/"
64640,Also look at Asics for amazing running value
64641,"I love my Boston's and use them often, but I think they may be a little unforgiving for a new runner's feet...

Brooks Ghosts are the standard first real running shoes recommendation for a reason! Could be a good starting point. New Balance 1080 V10s are nice shoes and forgiving for a new runner...

Personally I love my Nike infinity Reacts."
64642,Nike Infinity Reacts are awesome!
64643,Pegasus 36 can be found for about $70 on eastbay and Vomero 14 for $76 on nike.
64644,Epic React if you can find it.
64645,I went to Running Room and got a great pair of Saucony for around $125 I think (they were on sale)
64646,Get a virtual fitting through Blacktoe or Vancouver Running Company.
64647,"Hm depends on your foot strike, do you happen to know if you have a neutral, pronating, or supinating foot strike?"
64648,"ASICS, saucony, brooks, or hoka"
64649,Is there a model you would recommend?
64650,Asics gel orthotec 5
64651,"Seeing as you are a beginner thesell really help they have a nice support but arent too heavy, they are decent when running under 30km per week. I dont reccomend running any more than 20km in one go in them because then they start to hurt"
64652,Or gt 2000
64653,"I work for Nike in the running section and all of this information is completely spot-on.  Each employee was taken on a very thorough walkthrough of each shoe's technologies and the information presented here is all very accurate.  The article didn't make mention of some features like Flywire, or the difference in cushioning between the very similar Pegasus and Vomero lines, but I found this to be a good read even though I work with the products each day."
64654,retail or corporate? nike affiliate employee saying hi!
64655,"Retail at the moment, but working my way towards corporate.  Currently in Minnesota, you?"
64656,Keep it up! I'm at Converse HQ (Boston area).
64657,Nike Santa Monica checking in!
64658,"Yo, hook me up with a job in like... 6 months. Deal?"
64659,suuuuuuuuuuuuure bro. i gotchu
64660,So solid.
64662,"I don't like Nike. I'm not saying they are bad shoes, I just haven't found any that work for me. I have really wide feet and Nike's seem to run narrow.

I'll stick with New Balance and Asics."
64663,I always liked Asics for their nice wide toe box until I tried the Nike Free. I was an instant convert.
64664,"Cheers to having Fred Flinstone feet, brother!"
64665,"Haven't been able to wear Nikes since high school and when I did, it was due to wanting a brand name shoe and not what was best for my athletic needs.  They are terribly narrow."
64666,"So, depending on the maker, I wear a double or triple E in dress shoes. I really like the feel of Nike Frees and the Saucony equivalent when I first put them on, but my feet start to hurt after a while. Any suggestions on a shoe? Mostly running for fitness. Don't see myself going for longer than 45 minutes anytime in the next six months or so."
64667,"Asics have really wide toe boxes and come in EE widths. New Balance also has shoes that come in widths but they feel just a touch narrower than Asics.

I currently alternate between NB Minimus and NB 1080v2; both in EE width."
64668,"I wear 1080v2 in a 4e width (maybe this is to wide, I've been considering that lately). I have wanted to try the Minimus but was avoiding them because I thought they would be far too narrow..."
64669,"Triple e feet here. I loved my nikes for the first few months but I injured myself more in them than any other shoe. The best shoes I've had are Brooks. New Balance was also pretty good, just don't like the style. I'm trying out some Asics right now. They feel okay"
64670,Which is crazy. Asics is murder on my knees. Literally gives me so much knee pain I am limping the remainder of the day. Just about any pair of Nike running shoes prevents any and all knee pain.
64671,I tried on a pair on Gel Nimbus because they were almost twice the price of a normal pair.  They were way more cushiony than the other pair of Asics that I tried.  My girlfriend ender up getting the same pair. She says she feels much better after work now.
64672,I am blessed with a neutral gait and natural midfoot strike. I actually tend to prefer less cushioning.
64673,I love Nike but I will never be able to run in them because of my wide feet. Sure I will wear my Flyknit Trainers as casual shoes but could never run in them. I will also stick with my Asics.
64674,"Funny, I have tried to love the Vomero and Pegasus but my feet are way too narrow. I'm not sure if you've tried on the latest versions of the Pegaus but I've comfortably fit people who are normally a 2E into the Pegasus. 

While they've gotten wider, I've noticed Asics getting narrower in the toe box. I can finally throw on a pair of Cumulus without feeling like my forefoot is rolling all around the inside."
64675,"I also love Asics but they discontinued the Gel-1160 I was using for flat feet. I bought them 3 times in a row, and ran the last pair until the toes split open :("
64676,That series is now the 1000
64677,2.0/1.0 frees with the mesh please! Wish I could have vibram feel with nike styling.
64678,"on the 5th of Sept Nike will release the Hyperfeels, a flyknit upper with I believe a 2.0 like bottom. http://nikeinc.com/news/new-nike-free-hyperfeel-functions-as-an-extension-of-the-foot"
64679,[Hyperfeels?!](http://i2.kym-cdn.com/photos/images/original/000/407/945/93c.jpg)
64680,">The Nike Free Hyperfeel is structured on a waffle outsole that is reengineered with strategically placed pistons, reflecting key pressure points

As much as things change, they stay the same."
64681,"oh hells yeah. I'm there!

Edit: Hmmm doesn't mention the x.0 drop value though.  Just says Lunarlon drop in."
64682,I'll keep you posted when I see the shoes Thursday.
64683,Cool thanks!  From what I'm reading they are 5.0 equivalent.  I came from Vibrams so I'm hoping for a 3.0 or less in the near future.  Currently rocking some 3.0 Free's (black on black soft cloth) and these have as close to minimalist feel without the fashion crime of my Vibrams. lol
64684,"I've gotten to try on the hyperfeel, and it's pretty cushy. The insole of the shoe is all lunarlon, but the actual shoe has none, which is a little abnormal. The insole also resembles the sole of a free, because it has cuts and hatches on the bottom, making it pretty flexible. I'm not sure I'd compare them to vibrams, but if you like your free's then you'll probably like these as well."
64685,"I went by the store today and tried them on. They are pretty sweet. I have this years 5.0 free runs and the free flyknits. They did feel less cushioned/thinner compared to either 5.0's. They do have a lower drop. I liked how they felt. The insole is lunarlon, but cut up in a way that it resembles a free run. What I really liked was the feel of this flyknit compared to the free fly's. The free fly's, as comfy as they were, got really constricting after a long day of wearing them. I got used to how snug they were initially wearing them. But with the hyper feels, it isn't as constricting. They used fly wire alllll over the flyknit upper. It def didn't feel loose but wasn't constricting, compared to the free fly's which felt a tad bit stiffer. 

There is also a trail version of the hyperfeel's which I didn't know till I saw we had them in stock haha.  

If you get the chance try them out! Just look away at the price tag :("
64686,Sick thanks for heads up!
64687,and its 3mm drop
64688,"Aw shiet. Went to 3 shoe stores in Seattle area and none had them. Guess I""ll have to try Nike Town in Seattle to try some on."
64689,call the stores before you head out. Save yourself the trip.
64690,The 3.0 looks like its the closest you can get to the vibram feel (with Nike's) I've heard the new model is pretty darn light.
64691,"I run with the 3.0 v5 and it is definitely light and amazingly flexible. While it has a great ground feel vs any traditional shoe, it's still quite different from a Vibram, though mostly they are different in the direction of remaining amazingly comfortable with light cusioning while still seeming like there is no shoe there. You'll still really need to run with a forefoot strike in these shoes though as the light cushioning is the same throughout the foot and not really enough to heel strike with."
64692,"Yeah I have the 3.0's and love them!  Plus I can just wash them when they start to stink no problem.  Gentle cold and hang dry (over my hepa filter blowing cool air into them).  Fit no snug I don't even tie them on tight since they are like aqua socks.

I thought it was shoes giving me issues every attempt at learning to like running and always had pain under my arch on the inside of the foot.  Felt like a cracking bone or something.  Then I did the bone fracture tests I found online and they said it's the tendon right there (planar fascitlisilshs or something like that) and recommended the tennis ball.  Everything has been gravy since I found out about the tennis ball.   One at my desk, one in the bathroom for when I'm pooping, and one next to the couch.  

Up to 6 miles a week now (4th week of running ever, first week could barely do a mile)."
64694,5.0 lunarlon foam =(
64695,"""The Pegasus is a GREAT running shoe.""

Aww yiss."
64696,"I had the 27s, two 28s, and am on the 29s now. Love them."
64697,"My god I love my Lunarlons! They aren't extremely light, but are durable and comfortable."
64698,No Nike Flex?  I love mine.
