idx,text
21962,"Wanya Morris one of the members of Boys 2 Men sat down on a mall bench next to me. He didnt know I recognized him. We talked about Basketball. Michael Jordan and the Bulls were 1 game away from a three-peat championship.  When my mom finally came out of the Lingerie store I said to him, Well this is ""The End of the Road"" and I walked away. I wonder if he remembers that."
21963,"That is the cutest story ever. I am laughing in embarrassment for you but I also think it’s the raddest thing you could have said to him. Well done, for real."
21964,"Jason Momoa. He’s an absolute treasure to be around. He’s genuine and loves his job. He wants his fans to have as much fun as he’s having. He can size up a fan and know how far to push/tease them to make them comfortable while not going too far. His personality is infectious, and I had a blast with him."
21965,I see him being crazy energetic in person.
21966,"He is, but I saw him reign it in really quickly around super shy fans. He could really vibe with how each fan felt so he could be whacky or more chill depending on who he was engaging. With me, he wasn’t too crazy at all. After a few drinks, he was still just cool until I started teasing him, and even so, I was never uncomfortable, and I never got the impression I was too in his bubble either. He can really feel people."
21967,"Can confirm, met him twice.
First time was a photo op at a convention, I guess I looked scared cause he asked if I was nervous. I stuttered out yes, and he put his arm around my waist for the photo and laughed cause I tensed up. Later when I got him to sign my bag he said ""moon of my life"" in Dothraki to me and I responded back with ""my sun and stars"". He said my Dothraki was good.

Second time was at the Aquaman premiere, he was thanking Australia for having him there and said we have a beautiful country. My best friend piped up, ""Ummm but I'm Canadian?"" And he gave her shit for being Canadian. All in good fun."
21968,Jeff Goldblum. Met his wife and children as well. They were all kind and sweet .His real life persona matches the on-screen one exactly.
21969,"My buddy is a flight attendant and met him a few months ago. Basically gave the same review. Very kind, but definitely eccentric. Took the time for autographs and pictures"
21970,"I didn't actually meet him, but Tracy Morgan bought my younger sister an iphone many years ago.  Hers broke, and his gf, now wife, at the time lost her phone at the Superbowl or something so that's why he was at the same Verizon store.  

The Verizon employee said my sister's damage wasn't covered under insurance and my mom couldn't afford to buy her a new phone, and my sister I guess clearly got emotional because Tracy Morgan, who had been talking to my mom for a bit before while they were waiting (my mom and sister had NO idea who he was until my dad came in and recognized him) bought the phone for her.  

My mom tried to say no but he said to just pay it forward."
21971,What a dude.
21972,I would love to do shit like this if I had more money.
21973,John Barrowman (Captain Jack in Doctor Who and Torchwood and also Malcom Merlin in Arrow) is so cool and gives amazing hugs.
21975,"Yes, nothing makes me happier than to know John Barrowman is an actual nice guy. I desperately want to be that guy’s friend."
21976,Tom Hanks.  I worked at Disneyland in the late 90’s and I saw him giving a tour to a group of about 25 kids.  He was leading the tour and the Disney tour guide was just tagging along so I could tell he’d done this many times before.
21977,"List of celebrities nobody hates: Keanu Reeves, Tom Hanks, Terry Crews, Robin Williams."
21978,DANNY FUCKING DEVITO
21981,Robin Williams😢 so engaging and generous with his time.
21982,"He’s one of the celebs I was here to post. Super normal, easygoing and smart. I was working the Cody’s Books booth at ComputerWorld in SF, 1981 I think, and he was hanging with Timothy Leary so I got to meet them both."
21983,"Anne Hathaway.  

We were backstage waiting for her cue to go on started chatting.  She told me how she was such a klutz and we joked around a bit.  Then, when she was called on stage she tripped hard going up the stairs and face planted, then turned around to me and we both started laughing.  

She’s a sweetheart and a genuinely nice person.  I’m glad I got to meet her."
21984,"I had a good experience with her too. 

I was in LA on a holiday (I’m not from the states) and saw a commotion on the walk of fame. I went to have a look at it turned out Hugh Jackman was getting his star. The whole cast of Les Mis was there.

Most of the people watching were professional autograph hawkers/sellers. They got given autographs but zero interaction. 

Anne noticed I was clearly just an average joe and actually spoke to me, made some jokes, shook my hand. She came across as genuine and kind. 

I also happened to meet literally ten celebrities on my US trip and she was probably the only one who was as good looking in person."
21985,"Lenny Kravitz was one of the most humble people I've met.  Incredibly down to earth, laid back and friendly.  

Prince Charles was also pretty friendly.  Would look you directly in the eye during conversation and make you feel like there was no one else in the world but the two of you - despite being constantly surrounded by others."
21986,"If you’re a woman, Charles[ has been quoted](https://youtu.be/9GKDBCFOJ90) as saying he has a policy of making sure he *only* looks into the eyes of women, for fear a paparazzo will capture him ogling some boobies."
21987,"and then there's Phillip lol, who I'm pretty sure doesn't know most women *have* faces"
21988,Danny Devito. I ended up at a hotel bar in Philly with this girl I was hanging out with and her friend. Turns out the cast of Always Sunny was filming the 10th(ish?) season and staying at the hotel and hanging out downstairs. So girl’s friend flags down Danny as he’s walking by and he ends up sitting with us for a solid 2 hours. Buys us a couple rounds. And tries to invite the girl up to his hotel room. A weird turn but he also introduced us to Charlie Day so I’m calling it a win.
21989,">tries to invite the girl up to his hotel room

Shooters shoot"
21990,Perhaps she thought she couldn't handle his monster dong.
21991,With his magnum condom.
21992,Perhaps he thought she wouldn't refuse... Because of the implication
21993,"So anyway, he started blasting."
21994,Hey the guy's single now so no harm in going for it.
21996,"Daniel Radcliffe. 

I'm not a big HP fan, but one of my friends is, so we went to see his show Endgame in London a few months ago, and waited in the lobby after the show ended (which was the equivalent of waiting by the stage door). He came out and spoke to every single person who wanted to talk to him, which was an honestly enormous number of people, for *hours*. Instead of quickly taking a photo and signing a playbill for each person, he showed genuine curiosity about the people he met, asked questions, made conversation, and made everyone feel like they mattered. This was at night after the show had ended, and I'm sure he was tired, yet he was still such a charming and genuinely caring guy to each person. I was a bit blown away. I wasn't much of a Daniel Radcliffe fan before this, but am now."
21997,"I rode in an elevator with Ric Flair in a hotel located in Atlanta. I was in sixth grade and really into WWE at the time. He struck up a conversation with me and complimented my sweatshirt, I think I got a picture somewhere."
21998,Wooooooo!
21999,"Stan Lee. He was my neighbor for a while, and he directly wrote me letters which I now have framed on my wall. Tom Brady wasn't great, Steven Tyler was really cool/chill, but Stan Lee was the best by far."
22001,This is the cutest thing I've read about in a while.  I imagine it was really nice for Steven Tyler to have just a normal conversation with another musician.
22002,This story is my favorite.
22003,Also came here to say that Steven Tyler is super nice. I met him on the street in New York as a kid and he talked to me for a long while about Aerosmith and then asked me to take his picture and did a bunch of goofy poses.
22004,"Also met Steven (and Liv). Both were super nice and down-to-earth. Extremely polite and friendly. Plus, Steven was wearing some of the best cologne I've ever smelled in my life. I'd love to know what it was but it felt weird I was even talking to Steven Tyler, I couldn't imagine the awkwardness of asking why he smelled so yummy."
22005,"I met Steven Tyler when I was 14 back stage at the Nine Lives tour, we were back stage to meet up with Jonny Lang who opened, his sister was dating my friends dad. 

Steven came over on his own and started to talk us up, and he said were are you guys sitting, we told him. Then during the show, he gave us a shout out and said this song is for the young guys in the forth row and sang “falling in love is hard.”"
22006,I need details about Brady.
22007,"Any pats fan knows it wouldn't be fun to hang out with Tom Brady. He's too weird, be like hanging out with an alien except less cheek clapping"
22008,"I knew Shaquille O'Neal in college occasionally. I wasn't associated with the athletic program at LSU but had friends who were, so I ran into him often enough to kinda-sorta get to know him.

He was a huge goofball back then too."
22009,Met him at the papa johns HQ. A worker there said that apparently every time he comes he’ll bring a bunch of little caesars or Pizza Hut pizza just to get a laugh out of everyone... great guy
22010,"Bruce Campbell of Evil Dead fame.

Tall as fuck, and really cheerful. I was working the front desk for Newbury Comics' corporate office and he and his assistant came in. I didn't even process the name when his assistant said it, just called back to the buyer whom Bruce was meeting. Then it hit me: ""Wait. **The** Bruce Campbell""?

Bruce is standing to my right, looming like death. He smiles, extends a hand, laughs, and asks me my name. I made the requisite boomstick joke, and he also laughed at that.

Much better behaved than Juliette Lewis, who showed up so drunk she couldn't walk down the ramp in front of me."
22011,Adam Sandler. He is super nice we met him at my aunts lake house. Such a sweet guy he brought his family over and we hung out with him for like 3 hours and we just chilled. He is an amazing dude.
22012,"I kind of got that impression from his Brooklyn-99 cameo, which is a little ironic because he acts like a rude, stuck-up celebrity in the cameo. But it showed that he was willing to make fun of himself. Pretty funny scene too."
22013,When Andy fires back at him asking who Kevin James plays lol
22014,"""haw haw. It's a serious movie ... Trotsky."""
22015,"Even though his newer movies are poorly received, I find them good because it's very pro family. You can tell Sandler is having a good time making it, so who cares? He seems like a cool guy"
22016,"I really believe he is making his new movies because he just wants to hang out with his friends and have studios pay them to hangout.  And why not, most of his movies turn a pretty good profit for the studios"
22017,"He's openly come out and said something to the effect of nobody seems to come out and see his movies when once in awhile, he takes on a serious role.  Then everyone does and he gets paid when its him and his friends in sillier movies

And like.  Who can disagree with him.  May as well milk it as long as there's a demand"
22018,"Scarlett Johansson back in 2011 at a Starbucks. 

Super sweet and really bubbly. Thought she would come across as a bitch or standoffish, partly because it was early in the morning, like 5:30-6:00 am. Not at all, she was so nice. Made her laugh after I told her I was a huge fan of one of her earliest films, Home Alone 3 (which really is one of my favorite childhood movies). 

She just had this charming aura about her."
22019,I cooked for her when she was filming the avengers in Cleveland. I didn't get to talk to her but based on the creeping we did from the kitchen she was bubbly and insisted on paying the check. My at the time chef also told me I was cooking her dinner which resulted in extra creeping on our part as the plates left the kitchen. If she looked over she would have seen 8 Cooks in an open kitchen watching her take her first bite.
22020,This is like Ratatouille...Scarlatatouille?
22021,"I met her in 2008. 

She is also super short."
22022,Totally. She’s like a good 5’2 - 5’3.
22023,What.? She's super tall in all her movies..
22024,"Nah, that’s just movie magic. She’s really quite short. I’m 5’10 and I was fairly taller than her."
22025,"Sean Astin. Met him in the summer of 2003, so after The Two Towers and before Return of the King.

He seemed to be a genuinely humble, kind man who appreciates the success he's had, his fans, and just life in general.

Also nice (in a quiet, scholarly kind of way) : Brad Dourif, who has played Grima Wyrmtongue, Chucky, and a lot of mad scientists and creepy villains. He also once guest starred in Babylon Five, and gave an incredible performance."
22026,"Robin Williams.  Met him when he came out to Iraq for a USO tour, 2007.  Was willing to sign anything and talk to everyone.

I worked nights, so I couldn't make it to the USO show, but he stayed in the VIP rooms directly next to my work building.  So in the morning he stayed to say whats up, show his appreciation and even gave us a quick piece of the set he did for the night prior.

Also met Kid Rock who was cool AF!  Lance Armstrong was a douche."
22027,"Kelly Clarkson. The southern charm thing isn't an act. Coincidentally I also met the meanest celebrity the same night, Avril Lavigne. 

Shout out to Blink-182 as well, in my short time working with celebrities, they were the only ones I was actually a huge fan of and they were super cool as well, Mark Hoppus especially.

EDIT: Also now that I think about it, Gym Class Heroes were super cool as well.  Their singer was an especially nice guy."
22028,Was Avril pre or post being replaced?
22029,You just awoke a memory I forgot I had
22030,Tell us more about Avril.
22031,"Well again, it was this big concert in 2012 (got that corrected).  There were a bunch of big name acts that all performed for like 20 minutes a piece on a big rotating stage.  Crew would be prepping one side of the stage while one act is performing and then the stage would rotate around for the next act so that there was only like 3 minutes of turn around.  Each artist also came to our press area to run a gauntlet of quick interviews and then do a meet and greet with a few fans who won radio station contests.

So obviously the schedule was extremely tight and precise.  Again, there were quite a few very popular acts including Justin Beiber, and everyone was on point, right on schedule, except for Avril who apparently thought she was a big enough star that she refused to come out of her bus, fucked up the performance schedule and cancelled her meet and greet.  She only did the interviews that she had to and everyone was basically told don't talk to her, don't look at her, anyone not essential leaves.  As opposed to Kelly who came early to individually say hi to all of our interns before doing her thing."
22032,"Avril and what I assume were the people that worked with/for her came into the restaurant I work at one time and were complete assholes as well. They walked right by our host, tried to seat themselves, got upset when told they couldn’t just sit wherever. Ended up going to the bar to sit, were rude the whole time and left 10%. I’ve met quite a few celebrities at my job and she was by far the worst."
22033,*Average Latrine*
22034,I feel like Avril Lavigne was already not that popular anymore by 2012 tbh
22035,"Yeah that's why it was kinda funny, she was definitely bottom of the bill, I didn't even know she was still making music."
22036,I met Santa at the mall. A very nice old man
22037,He even let me sit on his lap
22038,And he was very interested in whether I’d been naughty.
22039,"Dolly Parton, a really great hugger and genuinely sweet person. She walked into Tower Records SF while I was there putting up promotional stuff for Columbia Records, probably 1977. She grabbed me for a hug and was stoked we were exactly the same height (even though she was in heels!). She asked me some questions and it felt like it was authentic. I’ve met hundreds of celebrities, but she and Robin Williams were far and above the nicest."
22041,"Met Matthew McConaughey at a subway in Ohio when he was staying in my hometowns fancy treehouse hotel, walked up to him and was like are you Matthew mcconaughey and he’s like yeah, and I said cool, so he said you want an autograph and I said I guess, so he signed a subway napkin for me."
22043,"In a meet and great type interaction, it would be Jonathan Frakes.

In a professional interaction (I worked a related industry). The Dali Lama, All the monks I dealt with on that day would have to be the most polite people on the planet.

In a hey I've just meet a celebrity type way Steve Irwin."
22044,"Hayley Atwell (Peggy Carter in the MCU).

Very pleasant to talk to and may I say even more beautiful in person."
22045,She makes me swoon.
22046,"I saw Brock Lesnar in the hospital cafeteria while his wife was having a baby. He noticed me kinda staring, so he called me over and said hello. I told him my son was a big fan of his, and he replied ""tell your son I'm a big fan of his!"" We shook hands and I let him finish eating. 

(It looked like the chair he was sitting in would crumble at any moment)"
22047,"My sister had a minor part in a movie with Brie Larson and Rooney Mara ages ago (I was an extra). This was right before they both got big, maybe ten years ago. They still keep in touch with her every so often and even remember my name. Very talented but also nice."
22048,"Nick Offerman. He came into my cafe and I tried to play it really cool and not bother him lol. When he was getting up to leave I awkwardly said how much I enjoyed his book on woodworking and he looked so genuinely surprised. Introduced himself to me, shook my hand, asked my name. He gave me some woodworking tips and went on his way. I ended up seeing him again at an event and he remembered me and my name. He's a genuinely kind and humble person who is very knowledgeable and enthusiastic about what he does. 10/10 would like him to adopt me."
22049,"I spent a day with **Adam Sandler** on the set of Mr. Deeds back in 2001 as part of my brother's make a wish. Guy was really down to earth and his entire crew were all very accommodating and sensible. As I get older, I continue to read good things about him from other fans."
22050,"The only celebrity I've ever met is Bill Murray

He made a joke I didn't get at the time and gave me wrong directions to the Asia exhibit inside the Dallas Museum of Art

10/10 would ask Bill Murray for directions again"
22051,I had the opportunity to volunteer ballboy for Rafael Nadal when I was 15. After the match we were all lined up in the tunnel and the players walked past. Rafa took the time to introduce himself and thank us for volunteering. I was 2nd in line so I had the privilege of actually shaking his hand!
22052,"Adam Savage from Mythbusters. I met him at a White House science fair a few years back and got to talk to him for a bit. He was really nice and easy to talk to (and does actually wear the hat out and about). I told him that watching his show with my dad as a kid was part of what made me want to be an engineer and he actually got really excited about that. Just a super cool guy overall. 

Obama and Bill Nye are also very nice"
22053,"George Takei. Bumped into a little Asian guy in a white suit on my way out of a theater, he turns around and goes ""Oh myyy, I'm so sorry.""

Realized why the laughter from the front row had caught my attention."
22055,"Steve Irwin hands down, I've met a few musicians and athletes who have been nice but none were as nice as Steve. I met him in an elevator at a hotel and I walked in soaking wet after swimming in the pool. I was only 11 and I was in awe that I was in an elevator with Steve Irwin. Straight away he starts a conversation with me, asks me what my name is, where I'm from and if there were any crocs in the pool and if I see any at the hotel to come find him. He then starts talking to the hotel worker who was in the elevator with us and staring at Steve the whole time. That interaction with him still makes me ridiculously happy whenever I think about it."
22056,"I met Steve and his family a fair few times as I spent a lot of time at Australia Zoo as a kid. He always was relaxed, approachable and up for a chat. His wife too, and she occasionally manned the ticket booths."
22057,Went to his zoo on holiday a couple years ago. Bindie was filming a show (or setting up to start) as our  tour cart thing drove past. She stopped what she was doing to smile and wave at everyone. Also saw her chatting with fans later and seemed genuinely lovely and happy to do so. Made everyone's day! Must run in the family
22058,"When I was homeless in Venice Beach, California. I met Tobey McGuire while I was asking for spare change, he was kind enough to give me some money, and I asked him if he was spiderman. His friends that were with him started walking off when I said that, but he smiled and told me to have a nice day. So, Tobey McGuire is nice to homeless, generous and he was very polite to his fans."
22060,I saw Will Ferrell a few months ago walk quickly into a hotel with two other dudes (pretty sure one of them was David Gordon Green). He looked very much like he didn’t want to be noticed. He looked over and met eyes with me and sort of had s disheartened look like he’d been found. I just nodded and he smiled back and gave a thumbs up. It was tight.
22061,Plz tell me you worked at SNL?
22062,"Bam Margera. Back when Jackass was a thing and I was in middle school in about 2003 he had a signing at the local mall and my mom and I waited in line for about four hours so I could meet him. I had him sign a pair of skate shoes that I was wearing to school with the fat shoe laces that I put into a checkerboard pattern. He took about ten minutes to talk to me and compliment me on how cool that was and ask how I did it. 

Meanwhile at school, all of the skateboarders made fun of me for wearing skate shoes and constantly gave me grief. Having a celebrity who I really looked up to give me such high praise saved my self esteem for the rest of middle school. Being nice is easy, but Bam Margera went above and beyond."
22063,"Tough choice.  I'm gonna go with the ones I didn't just meet, but got to spend some time with.

Peter Yarrow (of Peter, Paul, and Mary fame) is one of the nicest *people* I've ever met.  Plus, he gave us ""Puff, the Magic Dragon.""  He told me ""hey man, I really think we're brothers of the spirit.""  So I got that going for me.

Next up, Kenny Rogers.  RIP.  Got to spend an hour with him a little over 20 years ago.  Gracious, funny, and self-deprecating.

Finally, I got to spend an hour with Bob Uecker (the ""just a bit outside"" guy from the Major League movies) a couple times.  An encyclopedia of baseball knowledge, a fountain of old Hollywood stories (he told me about how he got on the Tonight Show with Carson and what it was like to do the old Friar's Roasts with Sinatra, Dean, and Sammy) and just all around a cool person."
22064,"I walked by Anderson Cooper once in the west village and went ""oh shit Anderson Cooper!' as I walked passed, he turned his head back towards me and smiled and winked. I'm now gay."
22065,"I have told this story on here a couple of times, but here it is again!

I used to work in an upscale hotel in West Hollywood. I was in one day when a beautiful brunette about my age, another pretty blonde woman, and an older lady who I assumed was the mother of one or both of them came in. She looked vaguely familiar, and it dawned on me that I was serving Annie from Community (Alison Brie) whose wikipedia article I had recently looked up. I glanced at their reservation. Schumerhorn. That's her real last name.

Before I even realized who she was, I noticed she must literally have a magical aura around her that makes everyone within 10 feet feel special. I got to wait on her, and she bullshitted with me like I was an old friend. By the end of the afternoon we were talking to each other in stupid accents and laughing like hyenas, and to top it all off she left a great tip and her friend told my boss what a great job I'd done. Nice to meet someone you love from a show and it turns out they're cool as fuck."
22066,"Nick Jonas is extremely soft spoken and really kind. He called ahead to the restaurant I worked in at the time to book a table for his family— him, his parents, both grandmothers, younger brother, and one of his grandfathers. His younger brother was moving in to college and Nick was in town for a show, so he took them to brunch. He was incredibly kind to the staff, tipped really well, and was adorably teasing Frankie about being the kid their parents would be most proud of— Frankie is the only one of the four Jonas brothers to go to college."
22067,"DeForest Kelly.  We had a twentieth anniversary Star Trek convention in town.  A friend called me and told me to go to the liquor store and buy a bottle of (forgotten brand) bourbon, and take it to room XXX at the hotel.  I thought it was weird, but it was a good friend, so I did it.  

When I went to the room, DeForest Kelly opened the door.  I am a huge trekkist, so I was over the moon.  He handed me a fifty , would not accept the cahnge I owed him, then growled ""You're not going to make a man drink alone, are you?""

That's how I got to spend about a half hour shooting the breeze with Dr. McCoy."
22068,Not too big of a celebrity but I got to meet Gus Johnson at one of his live shows and he's an awesome guy!
22069,You could even tell he's a nice person by looking at his face.
22070,"I met Chris Hemsworth last year at the restaurant I worked at. I often joked that I moved to Australia to find him and then one day, all of the sudden, he’s in my restaurant walking up to the host stand. I was so horrified by my own normalcy that I could barely look up at him (he’s so tall). I tried to seat him and his wife at a table in my section but he politely asked to be moved to a quieter area. While I was slightly disappointed that he wouldn’t be sitting in my section, I awkwardly smiled on and directed them to a more secluded section. He and his wife couldn’t decide which table so I made some lame joke about sitting at two separate tables and throwing the food at each other (this was a 6 star resort restaurant, boss did not like hearing that comment).
They sat, I put a napkin on his lap, almost shit myself, and their dinner went smoothly. The end."
22071,"Nathan Fillion when I was working at a movie theater. 

Guy bought 6 large popcorns and a bunch of smart waters when I thought, “man this guy is loaded”. He was wearing a hoodie and glasses so I couldn’t quite tell at first. I eventually said, “Hey you kinda look like this guy Nathan Fillion”

He took off his glasses and said, “I sure hope so.”
I stood at attention and said, “Captain”

He replied, “As you were, Browncoat”. Coolest moment ever."
22072,That’s fucking awesome!
22073,"I was doing volunteer work at a con some years back, working with the photo studio where people got their photos with the celebrities. This random guy was in studio B getting a photo with a couple of the original power rangers, while Nathan was doing his shoots in studio A right next door. 

Right at the moment this guy is getting his power rangers photo, Nathan runs across into studio B and jumps in behind them effectively photo bombing this guys photo, so it's the guy, the power rangers and Nathan fillion half flying through the air with a ridiculous look on his face. I was doing the prints afterwards and the dude was just ecstatic, kept asking if he was allowed to keep as technically he didn't pay for a photo with Nathan. Studio photographers were like ""It was his choice to do it, so all yours."" guarantee that dude had that photo framed.

I was lucky enough to get a photo with him also, nice guy, very friendly."
22074,"Pretty much the *only* celebrity I've met.

Lindsey Stirling. Was very polite at the autograph table"
22075,"Hugh Jackman, the man is Australia's answer to Keanu

Edit: nearly 4k up doots, holy crap, even his name does good things for people, thanks everyone."
22077,What a fucking legend.
22078,"Neo vs wolverine

Who wins?"
22080,"Red Green. What a wholesome guy, very down to earth."
22081,"Pierce Brosnan. Literally bumped into me at a coffee shop in Hawaii. Could not have been more gracious. 

I didn't recognize him until he sat down, and when I called my wife she begged me to go over and put him on the phone. 

Of course I didn't."
22082,"Courteney Cox, hands down. So sweet"
22083,"Mike Dirnt, the basset for Green Day is a chill dude. I met him at after a concert a couple years ago in Auburn Washington

Edit: he’s friends with my uncle"
22084,"Peter Mayhew!  We went to a con in Florida he was at, I was so excited because seriously, Chewbacca was one of my favorite characters. I had an old Chewbacca t-shirt I'd gotten when Empire Strikes Back came out (so, 1985 or thereabouts? and it was 2005 or 2006 at the time) and he was doing autographs. I asked the person handling that if I could buy a pic but have him sign the shirt instead, and the guy was all ""No, no way, has to be the picture!""  Mr. Mayhew overheard this, waved me over (he wasn't very busy at all, sadly), said ""I haven't seen one of these shirts in YEARS!"" signed the shirt, signed my photo as well, and then sat and talked to me and my husband for a few minutes, during which time he ate half a brownie and then OFFERED ME THE OTHER HALF OF IT, saying his wife had baked it but ""I'm trying to cut down and it's too much"".  We talked about pantomime and old silent films, because I had started out with how much I loved the character he played even tho Chewbacca obviously didn't speak common, he was still incredibly expressive and completely understandable. And he said that he had been inspired by knowing a Deaf person and by early silent movies in that.
I had stars in my eyes that day and for a long time after, he was just such a super sweet, nice guy."
22085,"Nicolas Cage, he would come into a pet store I used to work at. He always wanted to get in and get out but never asked for discounts or free things like another celebrity I had to deal with."
22086,Zac Efron. When I met him I was a teenager and I hated him for no reason. Mostly jealousy. I was a total dick to him expecting him to also be a dick but actually he was the coolest dude ever. He was a total gentleman. He fucking called me sir and I was younger than him. He made me feel like a total asshole and I was. Ever since then I feel like I was moved by that. I try to think twice about how celebrities are. I didn't know how to be after our interaction. But ever since then Ive just been happy to hear about his success.
22087,Henry Winkler is the best!
22088,"Lady Gaga. She gave me a huge hug, listened to me, genuinely thanked me for my support, and had someone from her team come over to look at my homemade outfit that was based on one of her outfits."
22089,"Andy Richter. Used to come in to the plant store I worked at. Bonded over the fact we were both from the midwest, always nice, and even tipped me when he wasn’t supposed to."
22090,"I work at a studio lot in LA and I have my fair share of celebrity run ins but I dont get star struck (I work in the facilities side of the studio) the two nicest celebrities I've met are :

Clint Eastwood, super nice guy and literally looks like any old geezer on the streets. He talk to me for a bit, shared a few laughs and I shit you not he pulls a peanut out of his pocket and lowers his hand close to his foot and a squirrel came out of a bush to eat it out of his hand. This was right outside his office building and this is probably the favorite memory work on the lot.

Vanessa Hudgens, I was walking in a breezeway and a girl introduce herself as Vanessa and started to talk to me about my job on the lot. She was very nice but I didnt catch on who she was until I remember what production was going on in the sound stage nearby. I said Vanessa Hudgens and she confirmed laughing. I apologized and told her I'm not really the type to get caught in with celebrities but she was cool with it. She appreciated that I treated her like a normal person and I'm not a crazy fan. 


Met other celebrities but those two stood out the most to me."
22091,"Ed O'Neill. Al Bundy himself. They were filming the Modern Family Disneyland episode. He was in one of the stores looking for a gift or something and I was looking for a expensive sweater. He came up next to me and I asked how it felt throwing 4 TDs in a game. He said, ""Fantastic."" Chatted with me for like 10 minutes. Been watching Modern Family since..."
22092,Norman Reedus - incredibly sweet guy!
22093,Tina Fey. So lovely and genuine.
22094,"Troy Aikman.    
    
He hangs around a grocery shop and gym where i used to live/work in Dallas and he will chat *you* up so long as he isn't with his kid. Maybe kids? i'm not really sure.     
    
But he was asking me about myself when I was a barista at Starbucks and fixing his drink, and I was thinking ""why would you care about me?? You're Troy Aikman!!""    
    
I said ""thanks for the 90's"" to him when I handed him his drink and he signed the back of his receipt and gave it to me. Total boss.    
      
Grande vanilla latte, for anyone that was curious."
22095,Alex Trebek from Jeopardy. He was so sweet
22096,Neil gaiman. During a signing event I had a darker book. He held up the line and looked for a silver pen so he could sign the book and just chatted to me while he hunted through this kids pencil case he had.
22097,"Carlos Santana. Met him one on one when he was touring for the Supernatural album. Extremely nice man. Signed one of my guitars, even played it a little afterward and complimented me on it. I retired the guitar for fear of wearing off the signature."
22098,"Bryan Cranston.

He visited the small base in Germany I was at. Talked with a lot of folks and hopped in a simulator. Awesome guy, very down to earth and friendly."
22099,"I waited on James Taylor once in New Preston, CT, he's nicer than his songs. I didn't ask for an autograph, but I did tell him my dad was a big fan. Before he left, he came into the kitchen and handed me a note; ""Dear dad, carry on, love, James Taylor"""
22100,"Tom Holland! The most famous and the nicest celeb I’ve met so far. 

I’ve never seen someone say a bad word about the guy, he’s just genuinely sweet. Which is awesome considering his long history of acting and he’s only in his early 20s. 

Some lesser known celebs, the guys from the band Her’s. I met them at a show they played a few weeks before their accident that caused their deaths. They were the sweetest 2 guys I’ve ever met. My heart aches thinking of them <3"
22101,When he came on the scene because of Spider-Man and he was just so fresh and innocent in his interviews I remember being glad that he said people like RDJ and Bumblebee Cabbage Patch were taking him under their wings because I just didn’t want him to be ruined by whatever it is in Hollywood that just messes people up.
22103,About 12 years ago I met Gary Sinese at a screening of a documentary he produced about a family in my area who had three sons who deployed to Iraq. He's as nice and genuine has everyone says and him caring about disabled veterans is definitely not an act or for PR purposes. The guy just cares.
22104,"Robert Englund the original freddy Kruger. Met him at a horror con a few years back and he was so nice, gave him a little origami frog but sadly couldnt afford a picture"
22105,"I met Gary Cole at a fundraiser.    Very cool guy.  


At the autograph signing/photo part of the event, I whipped out an Initech mug.  He laughed so hard.  A lot of guests at the event were confused about it, as they had no idea the reference.   

His reply was the best:   “Sometimes you take a part, not because it’s interesting, but that you have to make a living.   I never thought that role would have such a deep cultural impact!”"
22106,"Kevin Hart

I worked retail in early 2011, and there was this guy who needed some clothes shipped to Atlanta, and I hooked him up with a surprise discount, and he was grateful. He then asked what I was doing that night, I said  nothing, and the guy introduced himself ""I'm Nate, I'm Kevin Hart's manager, he's performing tonight, here's my card, I'll get you in for free.""

So I go that night, thinking I'm just going to go watch the show, but Nate sees me, bring to the VIP Lounge where Kevin and 2 other opening comics are drinking Ciroc & Pineapple Juice, and Kevin was the chillest dude, really nice, talked about Philly, comedy, etc., and the show was basically his 'Let Me Explain' material. 

Mind you, this was early 2011, so it was right before he took off, but it was still cool. 

Nice dude though!"
22107,That’s amazing! I saw him on tour and he was hilarious.  He seems like he would be energetic in person
22108,"1. Larry Fitzgerald - Hands down. I've waited on him at multiple venues and he's a total class act. He was genuinely interested in the people around him, and was just generally friendly and well spoken. 

2. Jaleel White is as charming as Urkel was annoying. I made a mistake with his table and he was super cool about it. 

3. Neil deGrasse Tyson was nice enough. He declined and thanked me when I offered to buy him a drink. 

4. Orlando Bloom was polite but I didn't interact with him much apart from asking if it was ok to pet his dog before realizing who it was."
22109,Brian Baumgartner
22110,Johnny Depp likes to dress up as Captain Jack Sparrow and go to hospitals. One time he just strolled onto the pirates of the Caribbean ride at Disney Land and just stood there chilling and chatted to the guests while in character. People lost their shit.
22111,"I think if I had a famous movie character I played, this would be my favourite thing to do."
22112,"Harrison Ford, met him on the streets of Budapest, he is a super cool guy"
22113,George Foreman in a rite aid in NYC many years ago. Was very nice and patient to the fans asking for photos and genuinely pleasant to everyone he talked to in there.
22114,"Taylor Swift - met her after the 1989 show in my city. Super nice and easy to talk to, felt like we were old friends. But what was crazy was she knew the guy standing next to me just from Tumblr (this was back when she used it a lot and he ran a TSwift fan tumblr). She knew his name, knew all these personal details about him and was really excited to meet him! It was very sweet."
22115,"I've met quite a few celebrities. I think the coolest one was Sammy Hagar. I was working across the street from his house (well, his driveway) digging out a fire hydrant that had been covered by a small rock slide. I had been working for a few hours and he walks up behind me. ""Hey, I noticed you've been out here working for a long time - how about a beer?"" He holds out two beers. I tell him I can't because I'm on duty (firefighter). He asks if I'm sure. I tell him that I appreciate the offer but, I can't. He asks if I need water. I tell him that I've got some in my truck. We talk for a little bit, I tell him I like his music. He thanks me for helping to keep the community safe. He takes off after a bit. About an hour later, I finish up. I climb into my truck and find two beers sitting on the front seat."
22116,"Lucy Lawless. I met her at a con a couple years ago, I'd had a whole speech planned out but when I was in front of her I totally forgot how to form words and she was so nice about it, gave me a huge hug. 

Also Rebecca Mader, she's not as well known but oh my god she was so lovely and pleasant to talk to, I was like the 100th person in line to get her autograph and she was still happy to chat and didn't make me feel rushed, very very nice woman."
22117,Joe from Impractical Jokers
22118,"A scoopsie, patata"
22119,Up your ass and to the left.
22120,"Toss up between Bill Murray and Robin Williams. Robin Williams came to base for our early release of Happy Feet 2. He sat with the enlisted and hung around to meet and greet people for a good while. 

Bill Murray was spotted outside a restaurant and was really cool about taking pics and even helped a few fans loading stuff into their cars."
22121,"Nelly pulled up to me and my girl (at the time) in hollywood. He just pulled up in a car next to us on the street, sitting in the passenger seat and simply said ""Hey"". We look over 

Me: ""uhh... Hey... Nelly.""

He replies with ""How's your day going?""

Me:""um, good, it's going good"" 

Nelly: ""Cool, well have a nice night you two""

and drives off.

Weirdest shit ever."
22122,haha Wow. That's so random. Once the lead singer of UnderOath jogged past my car and waved to my little sister. Strange how things happen.
22123,Those UnderOath guys are all pretty nice. Way back when I was in high school I went to Warped Tour with my dad. We went to the signing booth after they played and my dad ended up talking with the keyboardist about old school metal for a good ten minutes.
22124,"I'm pretty sure if Nelly wasn't a celebrity, everybody would be convinced the guy was nuts - a St. Lunatic, if you will."
22125,What is that red stuff next to your username? ..
22126,I think it has to do with reddit gold.
22127,"The Rock. At thirteen, my youngest daughter was gravely ill and while in hospital she wanted to watch only two things on television (she pretty much slept the remaining portion of her six month stay) - Emeril Lagasse and WWF. During her recovery, the WWF came to town and I secured back stage passes. Most of the wrestlers we met were very nice, Chris Jericho in particular. But the Rock was the big name of the day and when we met him, I wasn't sure what to expect. He was kind and gracious, speaking to my daughter for as long as she liked, and he posed for as many pictures as we wished. He struck me as being a very sincere and genuine kind of guy."
22128,I can believe that. He has kids of his own. That's why he's been doing so many family comedies lately. I'm happy he was sweet to your daughter.
22129,There's that redditor that is somehow related to him and has good stories. Someone who isn't lazy wrestle up a link stat!
22130,"http://www.reddit.com/r/AskReddit/comments/bsdft/reddit_do_you_have_any_photos_of_yourself_with/c0obrsn

I've posted it before, so I just looked in my comment history d;"
22131,"Yeah, from what I've seen in interviews and stuff, he seems like a pretty down-to-earth type guy.  Great story!"
22132,"I have heard many, many The Rock stories and I have not heard of one bad experience."
22133,"A++++, very down-to-earth, would meet again"
22134,"Man, oh man, I have got to start rearranging my perceptions of these stars. Perhaps there are loads of them who get stuck in these roles/images which are not at all reflective of their actual nature, simply due to the fact that they are forced to make a viable career out of what they have chosen to do."
22135,">Perhaps there are loads of them who get stuck in these roles/images which are not at all reflective of their actual nature, simply due to the fact that they are forced to make a viable career out of what they have chosen to do.

Well, that's wrestling, isn't it? Obviously, not all these guys are really arrogant douches in real life (although I am sure that some may be) - and even the ones that keep up their appearances off-screen probably do so for the sake of professionalism."
22136,"He was interviewed by Men's Journal a few years back ([best link I could find](http://saguzfantasy.blogspot.com/2008/05/dwayne-johnson-in-mens-journal-june.html)) and it completely changed my [unfounded] negative perception of him.  He's a regular guy with a profound success story.  He cares more about his family than the artistry of cinema, thus the cheesy Disney movies.  I think we can all relate."
22137,Chris Jericho is well-known for his gentleness towards children.
22138,So is Chris Benoit
22139,He's always seemed like a pretty nice guy
22140,"Once, I saw Method Man perform with Wu-Tang, and he was the only member that came out after the show to sign autographs and talk to fans. He hung out for about 15-20 minutes.

I got to meet him at Rock the Bells last year, and I told him that I thought it was really cool that he stayed talking to fans when he didn't have to.

He looked at me and said, ""I like to treat everybody like they're somebody.""

Good on you, Meth."
22141,I'm a big Wu-Tang fan. Much respect to Method Man. I'm stoked that he cares about his fans.
22142,"As far as I could tell from interviews, Mef is the nicest man in the world. Nice to see that it's actually true."
22143,"I'm probably going to get downvoted to hell for this but...Justin Timberlake. He stayed in the hotel I was working at and came into the lounge after hours while I was having a drink with my chef. He barely talked about himself at all, except to mention offhand that he loves chicken fingers."
22144,"Why would we downvote you? I'm really surprised/happy to know that he's not stuck up due to his fame. And that he likes chicken fingers, like an average guy."
22145,Agreed. It actually gives him more respect in my opinion.
22146,What's with that red thing next to your name?
22147,Down to earth and fucking Jessica Biel. Looks like it's back to the $5 liquor for me.
22148,i down voted you because you ASSUME the worst
22149,"To be honest, yeah, I kind of do. We had a lot of celebrities come through the hotel and many of them were incredibly self-absorbed. Some were pretty cool, but JT was the only one that ever tried to hang out with the ""little people"".
EDIT: I took you totally out of context. Sorry."
22150,people who downvote chicken fingers make me *sick*
22151,I like chicken fingers.
22152,Dude Justin Timberlake is awesome.
22153,My brain is programmed to auto-upvote people who say they will get downvoted.
22154,Emma Watson hit me in the head with a hockey stick and thoroughly apologized.
22155,Wait!  I need more details!
22156,The cast of It's Always Sunny in Philadelphia.
22157,SO JEALOUS! I love them. One of my favorite shows.
22159,thirded :[
22160,quaternaried
22161,Story?
22162,The photo bomb in your picture makes it all that more awesome.
22163,haha. I know. That kid will forever haunt my memories. But I secretly love it.
22164,"[Lee Pace](http://en.wikipedia.org/wiki/Lee_Pace), definitely.

I was at San Diego Comic Con a few years ago, and they had a signing for a show he was on, Pushing Daises. Warner Brothers handled the signings at their booths terribly, though.

 Basically, there were signings for all sorts of shows going on throughout the day in one half of the booth space, while the other half was filled with typical con stuff (swag, girls in bikinis, replicas of stuff). For a few minutes between signings, the celebrities would leave and the next group of celebrities would shuffle into their places and sit down, ready to sign. 

These few minutes were the *only* time that WB allowed us to line up for the next panel, as any other line would quickly be forced to disperse by security. This basically resulted in the entire group of people simply hovering around the booth, looking for exactly where the line would start, which WB was hesitant to tell us. 

Eventually, I saw a bunch of hustle and bustle and assumed the line was starting. I asked the nearest WB employee where to go, and he said, ""Oh, go through [the booth] this way, it's much quicker."" 

The way he pointed us was a dead-end, so I and a whole bunch of other people (30+) made a quick U-turn and circled the booth looking for the line, which had by then been cut off, no longer allowing anyone to get into the signing. 

We left, dejected and circling the booth, catching glimpses at the cast and crew of Pushing Daisies. As the last few lucky people got their autographs, the celebrities stood up and began trickling out. My friend asked Lee to pose for a picture quickly. Somehow realizing how we'd been screwed over, he happily obliged, which resulted in an enormous crowd of people mobbing him for pictures and autographs. 

After a few minutes, some PR lady (or something) said, ""Okay, Mr. Pace doesn't really--""

Lee pushed her out of the way, grabbed the nearest poster to sign and continued socializing with his fans for 10-15 minutes."
22165,I miss Pushing Daisies :'(
22166,Pushing Daisies is one show I'm surprised Reddit doesn't show more love for.  Or maybe Reddit does and I miss it every time...
22167,"Awww, that's a great story.  I loved Pushing Daisies, btw.  They got screwed by the writer's strike."
22168,It did OK.  It got 2 seasons and an ending that wrapped things up nicely.  That's more than some other great shows got.
22169,my mom will be so happy to hear this
22170,Kristin Bell was really sweet.
22171,This makes me happy.
22172,"Jennifer Aniston, I knew I recognized her but couldn’t figure from where so she leans over and whispered office space."
22173,I am incredibly jealous.
22174,Gene Simmons was the nicest dude ever. He welcomed us into his birthday party.  the same party we were supposed to be working
22175,In my experience he’s a douche.  He’s cool to his fans but shitty to waitresses.
22176,I've bumped into him several times and though he was a douche. However a friend ended up on a flight with him recently and said that he was an extremely nice guy.
22177,"Is Tycho from Penny Arcade a celebrity? Fuck it, he is in my circles. So yeah. Him and his wife. Met them when they were in Munich a few years back and showed them around town a bit.

If you looked up awesome in the dictionary, do you know what you'd find? The definition of the word awesome. Which is what Tycho is."
22178,Upvoted for kiss kiss bang bang reference.
22179,"I met Henry Winkler (Fonzie) at a horror/sci-fi convention one year. I told him I loved Happy Days and he immediately went into Fonz mode  and kissed my hand!!                       
He laughed about how he wasn't as popular as the Star Trek celebrities, and told me he was glad he got to see a ""pretty girl"" like me. (Oh gosh~~ :D )           
My boyfriend was paying for the autograph and Henry said that he ""seems like an amazing gentleman who loves you very much."" So even my boyfriend was gushing.. lol."
22180,Pay for the autograph?
22181,[Conan O'Brien!!!!!](http://imgur.com/RlRGZ.jpg)
22182,"i sent conan a drink from across a restaurant once, with the message ""thanks for everything""--i didn't identify myself as the sender.  after he was done eating, he asked the waiter who sent him the drink, walked across the entire restaurant, came over to my table, and thanked me profusely.  he stayed and talked to us until his car was out front--a solid 3-5 minutes.  VERY nice."
22183,"Great story. How does that work, anyway? The whole sending someone a drink thing. Did you choose a drink for him or tell the waiter to serve him another of what he already had? What color neck tie was he wearing? Did you shake or kiss his hand?"
22184,He really does seem like the nicest guy.  I don't think he had any clue how many people would rally for him after the whole NBC ordeal!
22186,"If you are the girl freaking out next to him, you are really cute. If you are the guy in the red shirt no chalantly taking phone photos, you are either a badass or a huge creep. Props to you in all cases."
22187,Weird Al Yankovic
22188,"I totally forgot about this encounter, but I've got to share now, since we're on the topic...

On my 17th birthday, coincidentally, one of my favorite bands All Time Low was playing an acoustic set at the little record store next to the mall. The show was completely free, and I spent my birthday skipping school and waiting outside the store to get a spot right up front. They played an amazing set, and afterwards, did a signing. During the signing, after I was reveling in the excitement of my signed ATL poster and awesome birthday, my friend told Alex Gaskarth (lead singer) that it was my birthday. Immediately, the whole band stood up, walked over to me, and sang me happy birthday. It was the happiest I had been in my entire life. Then, after they packed up their equipment, they took me to Tropical Smoothie. BEST BIRTHDAY EVER."
22189,"Will Smith.
I did some computer work for him at his house. I ended up sitting in his library with him for a couple of hours , joking around and having a good time. He is a lot like he is in the movies actually , he's pretty funny , joking around and making me feel very comfortable. Half the time I was expecting a giant robot or alien or some shit to come bursting through the wall or something.  I was actually there for so long that he insisted that he have his chef make me some dinner. It was a pretty cool day. His wife is nice too."
22190,So he couldn't get Jeff Goldblum to do the computer work for him?
22191,I guess he was unavailable at the time.
22192,Jeff Goldblum is always available
22193,Fat Mike of NOFX was really nice and funny.  He bullshitted with my and my friends before a show one time.
22194,Really? I've heard he was a dick. But I'll take your word for it. I bet he is funny.
22195,I'm sure anyone who drinks as much as he does gets called a dick from time to time but he went out of his way to be nice to us.
22196,"I was lucky enough to meet Bruce Campbell about 15 years ago at a showing of Army of Darkness. He stayed after the movie for 3-4 hours just hanging out and talking with people. He's really a funny, cool, and modest guy."
22197,"For about 10 years straight he would always make a stop in Tucson, AZ. I always missed it due to work, but all my friends met him and said he was badass."
22198,"Kevin Spacey. 

I went to the cast and crew (really just the crew) premiere of the movie Kpax (my father was a rigging grip). Kevin Spacey ran into the crew theater before the red carpet premiere and gave us all an awesome speech about how he wanted to thank the people that ""do the real fucking work"" (his exact words). He was way cool about it all and after his speech he said he was late for the red carpet premiere and pretty much ran out of the theater to make it in time.

My dad was pretty surprised because he had never seen a star actor do something like that for the crew premiere of a film.

Awesome movie, too."
22199,"Met Wil Wheaton back in the day. He was really a nice, laid-back kind of guy."
22200,"Wil Wheaton 

Wil Wheaton

Wil Wheaton

Patience... he will ring in."
22201,*Sits next to newsun\*
22202,"Probably a toss up between two guys I met at Dragoncon.

Jerry Doyle (Michael Garibaldi - Babylon 5) and I chatted for a few minutes while smoking.  Extremely down to earth guy that was cool talking with anyone.  He didn't seem like a 'star'; more like just some nice guy.

Tom Felton (Draco Malfoy - Harry Potter) was jammed in an elevator with us.  At Dragoncon, the elevators take forever.  He was actually making a beer run for some party and he seemed super nice to everyone."
22203,"As a kid of the 90's and a complete dork, I'm really excited to know that Tom Felton is a good guy. Yay!"
22204,"I've heard he's a nice guy, he's so good at playing Malfoy that you'd almost expect him to be a dickhead in real life."
22205,"Kevin Bacon, in Jackson Hole, WY.  at the Mangy Moose Saloon.  He and his brother where playing in the their band (the Bacon Brothers) there.  I met him before their show.  He had a behemoth bodyguard and I had a behemoth beer.  

You're welcome Reddit, you are now 1 degree."
22206,Dale Earnhardt Jr donated money to my new website and gave me some good ideas and feedback.
22208,Is your website related to racing or was it just random?
22209,it was a porn site
22210,"Dolly Parton (on a plane) was great. Genuinely beautiful. Believe it or not, Billy Ray Cyrus was the nicest, politest guy in the world when I did a closing he was involved in in the 90s. I did some work for contemporary Christian artists (Stephen Curtis Chapman and Michael W. Smith) and they were as nice as you would expect. Steve Earle was the shit. Pretty much if you meet a country artist you will think they are great. You may have guessed I lived in Nashville for a while.

My all time favorite though was Sir Charles Barkley. I was on an elevator at the SEC basketball tournament where he was doing color. He got on and saw my Ole Miss hat. He said ""Ole Miss, huh? I remember they used to wave pizza boxes at me when I shot free throws. I thought that shit was funny."""
22211,I'M SICK AND TIRED OF THESE MOTHA' FUCKIN' DOLLY PARTONS ON THIS MOTHA' FUCKIN' PLANE!
22212,"Ron Jeremy.

http://imgur.com/Whd3X.jpg

We asked him to smoosh his man boobs together."
22213,RAD! That's a great pic!
22215,"If this is true, you must do an AMA.  Or you can just tell me now."
22216,"I've posted a similar topic a few times today but I never see it appear in the list of new questions...I'm probably just being a noob.

Anyways, here's my encounter (Chuck Palahniuk): http://www.reddit.com/r/AskReddit/comments/d3ler/has_anyone_had_a_good_celebrity_encounter/"
22217,This is incredible. I'm so happy to know that he's a good-hearted person. Makes me love his books ever more (which I already did a lot).
22218,"I once met Ryan Braun, a baseball player from the Brewers.  He happened to walk into a Qdoba after a game (that I had attended) one night.  The place was empty except for my girlfriend and myself.  He saw us looking at him and he came right up to us and offered to take a picture with us and sign autographs.  On TV, he definitely comes across as a rather cocky guy, but in person he was cool as hell."
22219,You have to be pretty cocky to go up to someone and ask if they want your autograph.
22220,I'd be pretty cocky too if I hit 30 home runs in three straight years.
22221,"Heh, well it wasn't quite like that.  He came up to me and said 'hi.' I asked for his autograph."
22222,"norm mcdonald.

he performed stand up at my college and i was in charge of helping out backstage, making sure he was taken care of and had everything he needed. he was such a goofy, funny guy. at the same time, super low maintenance and really nice. i think his only request was some tape so he could tape his set list to the floor."
22223,"Desmond Tutu, I actually got to shake his hand!"
22224,"Read through all of these, you're the first to make me green with envy.  I'd love to meet that guy one day, he's one of the few progressive religious leaders out there (go read his comments on homosexuality for an example)."
22225,"I've met Richard Dean Anderson, he was pretty funny."
22226,Sean Connery.
22227,David Cross. He was surprisingly friendly. I didn't expect that for some reason.
22228,"Again, my jealousy flares. Where did you meet him? He's so fucking hilarious."
22229,"At Bumbershoot in Seattle in 2000. I geeked out. Stammering. He was very gracious, considering he was confronted by a spastic mess. We were front row for his set later that night. A great day, obviously."
22230,Great day is an understatement.
22231,"I've actually met Bill Murray. I asked him if the stories are true, does he really say ""no one will ever believe you"".

Three guesses as to how he responded."
22232,Why guess? We'll never be able to believe you.
22233,I met [Adam Savage](http://i.imgur.com/3OKNE.jpg) on Christmas day in Hawaii. He was sitting at the bar in the background watching the sunset with his wife. He was getting up to leave and I approached him asking if he was who I thought he was. We ended up talking for a few minutes he was extremely friendly and so was his wife. He asked me a lot of questions about what I was up to and was very gracious. His wife took that photo of us.
22234,"I once saw a guy who looked like Dee Synder.  When I asked if he was Dee Synder he acted offended and was a dick to me.

So until I meet the real one, Dee Synder is a dick."
22235,"[This schmuck](http://i.imgur.com/XWMMf.jpg).  I think he's best known for his role in ""Rat Race"" or something.  (I apologize for the goatee.)"
22236,"Not me, sorry BUT my best friend's co-worker was on a plane when Samuel L. Jackson got on the plane. Everyone started freaking out over it and were trying to talk to him. But this guy decided he was going to play it cool and give the guy his space. The plane took off and they went where ever. As this guy was getting off the plane he was going to be passing by Mr. Jackson as he was grabbing his bag from the overhead compartment. My friend's coworker knew that he couldn't just walk by so he had to say something but his mind was blank. As he's walking by him he just blurts out, ""You are the fucking shit."" The guy just continues walking and he gets nervous because Mr. Jackson doesn't even look at him. He continues walking and is almost off the plane when Mr. Jackson yells out, ""Hey! No... You are the fucking shit."" I can't even imagine how good this guy now feels about himself."
22237,"Mclovin, at Bonnaroo."
22238,Upvote for your bomb-ass username.
22239,"Rick Falkvinge, Head of the Swedish Pirate Party. Spent quite a while talking to him - pretty cool guy.

Simon Singh is also very down to Earth."
22240,Jennifer Tilly was really nice when I talked to her at the Vancouver airport.
22241,"Erlend Øye

I went to his gig in Oaktown one night, and the next night went to SF for some dance music.  He happened to be there, just for fun, not to perform.  I recognized him from the night before, pointed at him, and gave him my ""OMG it's you"" face.  He stopped where he was, pointed at me, and gave me my ""OMG it's you"" face.  Being made fun of was never more hilarious."
22242,"He's barely a celebrity, but Bryan Poole (guitarist for of Montreal) is about the coolest guy in indie rock.  And the guys in Surfer Blood also stand out in my mind for being especially awesome."
22243,(Sir) Patrick Stewart. So eloquent. So bald. So... sexy.
22244,Louis CK
22245,Isn't there some sort of law against not providing a story with posts like this? Please?
22246,"I want to make sweet, sweet love to his new show."
22248,"Believe it or not Rush Limbaugh is one hell of a guy.  He’s the most successful troll I can think of, is incredible witty and tips in hundred dollar bills."
22249,Crispin Glover was polite and quiet and weird as hell.
22250,"A friend of mine once got ahold of his home phone number and paged me with it, after about 3 calls I recognized his voice. Completely mellow and nice after 3 ""wrong numbers"" in a row."
22251,"It'd probably be Casey Neistat from HBO's series [The Neistat Brothers](http://www.hbo.com/#/the-neistat-brothers)

Well... I'm biased because he's actually a friend of mine.  Here he is [icing me](http://i.imgur.com/ZEQJK.jpg) after I had gotten him with a good set up earlier. 

All around nice guy, great stories, full of great advice / wisdom.  A good guy.

I forgot to mention how nice of a guy Van is too.  He stays in NYC for the most part, though... I don't get to see him much.  Genuine, nice fellow."
22252,"Mika.  I don't have a glamorous life.  

Oh, also Richard Dawkins, whom I thought to be a bit of a cock-end.  And was once almost run over by Joseph Fiennes, who called me a ""fucking imbecile""."
22253,Charles Barkley.  He was the grand opening of the casino hotel in which I work. He was very friendly and funny.
22254,"I had the pleasure of meeting both Paramore and Steps (if anyone still remembers them, I was like 12 at the time). 2 best days of my life (so far) probably.

Most friendly man among those, Taylor York. 
He showed alot of interest in the conversation, and probably asked us more questions about our lives, than we did about his."
22255,"Anthony Rapp. About a year ago a tour of Rent featuring him and Adam Pascal came through Houston and I got the chance to meet him after the show. He just talked for thirty minutes or so to a small group of people outside the theater, really down to earth guy. Also, he was so short in person..."
22256,Dude came to my high school back in 2000 or so and hijacked our acting class.  Imagine performing in from of him!  But he was super nice and gave some great advice to those of us who wanted to make a living as an actor.
22257,"DJ Lance from Yo Gabba Gabba.  AKA Lance Robertson.

He is one cool motherfucker.  I worked an event in Akron Ohio, basically a glorified celebrity babysitting gig, and this guy was the most simultaneously badass and easygoing person I've ever met.  He was great with the kids too.  I could tell he really loved his job."
22258,Peter Mensah. He's on Sparticus: Blood and Sand. But probably more well known as the guy who gets kicked into the well in 300. He put up with so much of our drunken *this is SPARTA!!!!* comments and kept laughing.
22259,Probably Amy Sedaris. Or maybe Iman.
22260,I love Amy Sedaris!
22261,I love Dave Sedaris!
22262,"Ran into two local sports stars. Chris Anderson (Birdman) from the Denver Nuggets. He shook my little boys hands and was just an awesome dude.    
Ed Macaffrey from the Broncos held the door for my pregnant wife at a book store. Shook my hand and, very genuinely, said ""Congratulations!""."
22263,Goddamnit. McCaffrey is my favorite athlete ever.
22264,"As a woman, I really don't expect much from athletes. I admit, I'm judgmental and I assume they're meat-heads (I know it's wrong, but at least I fess up to it). But this makes me happy. It's good to know that some of them are stand-up gentlemen."
22265,"This reminds me of a time when I was a freshman in college. I was eating in the cafeteria by the men's basketball team (basically 12 giants from 6'3"" to 6'10"") when this girl dropped her tray. One of the freshmen on the team started clapping and some of the upperclassmen told him to shut up and got up to help her. Pretty cool, especially when you consider that our team was really good and several of the guys went on to play professionally in Europe."
22266,"The Birdman looks like he'd be a [huge douche](http://splog.nationallampoon.com/files/2009/05/chris-andersen.jpg) but from everything I've heard about him he's one of the nicest, most respectful players in the NBA.  They did some NBA Insider thing on him once and I was blown away.  I've been a big fan of him ever since, even though I hate the Nuggets."
22267,Upvoted for the Birdman.
22268,"As a side note, he has an awesome truck."
22269,The cast of Corner gas. Saw a few of them at o'hanolan's in Regina and also saw Brent Butt at south BPs. Good times.
22270,Joey Ramone was super sweet and polite. He seemed like such a nice boy.
22272,"Wolfgang Puck. We went to one of his new restaurants, he was there checking the kitchen and going around to all the tables and asking how everyone's meal was going. It was my mom's birthday so he ordered her a free dessert (some sort of delicious austrian pastry). Cool guy."
22273,"Richard Hatch (original Captain Apollo) and the cast of the Guild. Hatch talked and talked and was super cool taking pictures and autographing stuff. The Guild cast was awesome and nice I didn't talk much cause I froze up around Felicia Day, Nerd dream girl and all. I forget his name but the guy that plays Bladez is pretty cool."
22274,"I met [Garth Brooks](http://imgur.com/Ao8Y1.png) along with 20 other people backstage... in the 90's. I was the first person and mentioned Stillwater, OK; he played in bars there when he first started. He chatted with everyone for about an hour. Before we were ushered out, he called out my name and gave me another hug.

I met [Tori Amos](http://i.imgur.com/kWk8S.png) three or four times. She only met a few people after each show, but would talk 15-20 minutes to each one. Very funny and very hot in person.

A guy I knew worked at a record store in Orlando and we received backstage passes all the time. I met other musicians, but Garth and Tori are my favorites."
22275,"Andrew W.K.
He was such a nice guy. My friends and I ran into him after a concert out by his tour bus. He chatted with us for a few minutes, signed some autographs, and offered me a bottle of water.

Earlier during the show, there was a young boy in the crowd who couldn't see over the rest of the crowd. Andrew W.K. summoned him up to the stage and then proceeded to pick the kid up and straddled him on his shoulders in mid song. The two of them sang the rest of the song together, all the while the crowd was going bananas. The kid had this smile on his face as if it was the best day of his life.

PARTY HARD!!!!"
22276,Keith Richards
22277,"Wayne Coyne. Talks to you like a human-being and really, gives all his attention to whoever he's speaking to at the moment. I was talking to him with a line waiting behind me but there was no rush; we must've talked for about 10 minutes, with his eyes locked in conversation the entire time and showing genuine appreciation for compliments and interest for what you have to say. 
Met him a second time backstage, really energetic. He goes right from his performance to chatting with the dancers. It's like he's always ready to do the next thing, nothing seems to bother him, just a really optimistic, cheerful guy."
22278,"Robin Williams, we were out with my wife's Grandmother at Universal Studios.  She's a huge fan and was practically giddy with excitement when she found out he was there.

Just so happened he walked past us and she called out a hello, and wished him a good day.  He tipped his hat and said ""Thank you kindly, Ma'am"".  Classy guy, and made her day. :)"
22279,"I waited on Keanu Reeves at a coffee shop a bunch of times and he was super cool and a whale of a tipper.

I've also seen Terry O'quinn (John Locke from Lost) all over Baltimore. He is super nice to fans and even let me jump in front of him in line at borders once."
