idx,text
58487,"Coolwater, Davidoff?  Got more compliments from this one comapred to acqua d gio"
58488,Curve. mmm;)
58489,"Polo Black by Ralph Lauren is very much worth it, it's just a bit costly but I just can't stress enough how good it is. Forget everything else mentioned, get Polo Black, thank me later."
58490,My boyfriend really likes Armani Code.
58491,"How did ""sweaty balls"" get more upvotes than Armani Code?"
58492,Lever 3000
58493,I will be buying the winner. I need a new scent.
58494,"http://www.fragrantica.com/perfume/Houbigant/Monsieur-Musk-5354.html
this was always recognizable and most welcomed 
literally an oldie but a goodie"
58495,"[This one works wonders](http://www.google.com/products/catalog?q=azzaro+lavender&um=1&ie=UTF-8&tbm=shop&cid=6228622079095618979&sa=X&ei=lMjkTuSHNcTitQati5mgCQ&ved=0CCMQ8wIwAA)  
Azzaro Pure Lavender"
58496,I've had compliments on Varvatos Star USA and Varvatos Vintage. Vintage smells more woody and musky. USA smells more clean and crisp.
58497,"there was this body spray i found at some store called ""Howl"" it was an off brand but GODS did it smell divine."
58498,Canel Bleu. It's amazing
58499,"Also, Nautica Voyage is EXTREMELY distinctive."
58500,"Hey, that's what I have! :D or D:?"
58501,It's a great fragrance. It's very distinctive. Unfortunately I had an ex who wore it so it's ruined for me but it has the desired effect. Whenever I smell  it I think of him.
58502,Bvlgari Blue... Mmmm
58503,"my husband uses matterhorn from old spice, both the deodorant and the body wash. its my favorite."
58504,"None. Just smell clean. Most women I know don't like cologne on men...most men who wear it, wear too much."
58533,Musk.
58506,"Paul Smith, Happy, Joop."
58507,"I can make suggestions of many fragrences, but they are a personal thing and you have to find yours.  Scents can smell differently from person to person due to body chemistry.  

There are so many to try, I suggest that you try a sample pack at [The Perfumed Court](http://theperfumedcourt.com/Categories/Samplers--Sample-Packs.aspx). That way you can try a range of unique scents and see what works for you, while not spending a lot."
58508,Salvatore Ferragamo
58509,"Ive gotten complements on Dunhill Red and Escada Magnetism. Escada Magnetism starts to smell like the lingering smell of smoked tobacco and alcohol after about 30 minutes.

Also, fruity flavoured bubblegum."
58510,V
58511,"Male here, but I would like to ask the female redditors, what about Antonio Banderas - The Secret?"
58512,"Perry Ellis 360 Black - I've received more compliments from women when wearing this than any other cologne I have owned.  But, just like another redditor mentioned, it does come down to whether it works with YOUR body's natural smell. 

And always remeber, guys... ONE SPRAY/SPRITZ IS ALL YOU NEED. Anymore than that and you're defeating the purpose of why you wear it."
58513,"Pacha psicodelic is the best fragrance for a guy, it's absolutely gorgeous."
58514,"it depends on your chemistry. i really like armani diamonds, it makes me want to jump on a guy if he wears it (though on my ex it didn't smell so good). i also like old standards such as drakkar noir."
58515,"I like Whitechapel on my husband.  It might strike you as unfortunately named, but that's sort of the Black Phoenix thing.

http://blackphoenixalchemylab.com/wanderlust.html Near the bottom.  It's a musky smell with a bit of citrus."
58516,"Buy one that is the best match for you!  If I were a man, I would buy this set ($50): http://www.sephora.com/browse/product.jhtml?id=P299442&categoryId=C19973&shouldPaginate=true

It's a great deal, and you can figure out which one you like best.  Some good scent advice is to use the one that sort of blends in after 15 minutes.  If you can't smell it on yourself, it is a good match to your natural scent.  Do it up right!

It comes with a voucher to get a fullsized bottle, and it does include Acqua Di Gio, so you would probably be saving money if that was your final choice."
58517,"Cool! I'm buying this right now! :)

Anything comparable for soaps? Samplers may be harder, but a collection like that is pretty nice.

The voucher isn't redeemable in Canada. Would you like it? Appreciation for providing the link, very helpful."
58518,"There's no way for you to get down to the States to visit?  I live in Vancouver and drive down to Washington to do shopping occasionally.  Honestly, I don't think you can get things shipped from Sephora US to Canada.  If somehow you end up with a voucher you can't use, sure I'd love to get one!  Thanks for the generous offer.  Hope you can figure out a way that works for you, though.  Let me know how it works out :)"
58519,"Oh actually... yes! I'll visit my parents in Florida in a few weeks. I didn't think of that!

Now I'm embarrassed what to do. I mean, your username is munchybutt after all, pretty reward-worthy on its own :)"
58520,"I'm a girl, so I don't really have a use for men's cologne.  Enjoy!"
58521,That's like asking what your favorite ice cream flavor is...
58522,Hei by Alfred Sung
58523,"I will speak for my twin sister on this one, as she tends to want to be in charge of my fashion choices. D&G The One cologne, Old Spice deodorant, and Irish Spring soap is one hell of a triumvirate.  

But apparently I'll have to buy Acqua Di Gio."
58524,polo big pony for sure. It comes in a spray can and smells amazing.
58525,Ronnie Mund says that Mambo is the best...  Loved by strippers and regular girls.
58526,"I wear old spice Denali, and ladies LOVE it."
58527,"Old Spice.
I'm a girl with simple tastes."
58528,My boyfriend wears Black by Kenneth Cole. It's sexy.
58529,Not a dude and I wear this. Smells so nice.
58530,"""Hummer"" brand scent

Honestly, I thought it was a joke at first, but that shit smells fantastic."
58531,Chanel Allure Homme Sport
58532,Jean Paul Gaultier Le Male.  It makes me think bad things.  Nice bad things.
58534,Giorgio Armani Code. The ultimate panty dropper. No matter who wears this it smells amazing!
58535,"Burberry London

Or if you want to be more exclusive, check out www.galimard.com. They are based in grasse, they have greatly made perfumes at a reasonable price. My favorite is 1747."
58536,Lacoste Essential and Armani Code. I also use Fierce and Burberry.
58537,"I used to have Homme by Gucci and everyone loved it, sadly they don't make it anymore. I think they make Homme II instead, which sadly isn't as good."
58538,Burberry Brit is by far my favorite on my guy. Also Very Sexy for Men from Victorias Secret.
58539,[Eau De Playdoh](http://www.amazon.com/dp/B00154W1UW/)
58540,"Linen & Sky

by Febreeze

I shit you not.

Have had many, many girls compliment me on my smell, despite the fact that i'm a smoker. Did have one girl say I smelled like laundry, but there was definitely a hint of horny in her tone of voice"
58541,Joop Homme. Mmmmm yes.
58542,"Though not a cologne, Old Spice deodorant in 
Game Day or Pure Sport."
58543,Old Spice. Become the man my man could smell like.
58544,"If you have a LUSH in your area, my favourite scent is Breath of God. It's unisex, and the notes I particularly love are quite masculine. It starts off smelling really weird/bad, but when it warms to your skin maybe half an hour later it smells like sexy magic sexytimes. I use it myself, as I tend to prefer most masculine scents over feminine ones. But if I smelled it on a guy I'd definitely think it was sexy, and also points for going to LUSH."
58545,"i went to lush a few days ago for my Christmas present for my mum. two soap bars, she'd be proud"
58546,No fragrances.  Almost all of them give me headaches.
58547,"Man by Calvin Klein. Honestly. I bought it for my boyfriend last Christmas, he approves and so do I :) www.cheapsmells.co.uk"
58548,I love Ultraviolet by Paco Rabanne on a guy.
58549,"I like the color blue and aquatic fragrances, so I use Ralph Lauren's Polo Blue.  I used to use their Silver Romance, but they don't make that anymore.  That was my favorite."
58550,Old Spice and Polo Sport
58551,Oldspice
58552,"I am a man (boy) that always wore Acqua Di Gio, I recently switched to Bvlgari pour Homme and I liked it, didn't love it. I was visiting a professor at Manchester Uni and he was wearing Acqua Di Gio, I realised how much I missed it and I will return to Acqua Di Gio asap!"
58553,"Hugo Boss... Mmmmm

But if you're tryin to stay cheap, Axe Chocolate and Touch."
58554,"Honestly, soap. I like a guy who's clean, and that's pretty much it.

Yes, old spice is alright. But most importantly, hygiene."
58555,Just out of the shower. Mmmm ^_^
58556,"Why is it that when you walk into a house where a great meal has been cooking, that wonderful smell of food... smells so *awful* on a human, outside of the context of food -- e.g. sitting next to someone who smells like bacon in a theater?"
58557,">Why is it that when you walk into a house where a great meal has been cooking, that wonderful smell of food... smells so awful on a human, outside of the context of food -- e.g. sitting next to someone who smells like bacon in a theater?

It's just your opinion that food smells bad.  This time of year I like my women to smell like candy canes.  I don't use deodorant because my pits smell like fried chicken.  I was blessed with ""chicken pits"".

This Razzbar fellow lies to try and demonize his opponents.  [I caught him in a lie right here](http://www.reddit.com/r/todayilearned/comments/n2ub4/til_t_boone_pickens_purchased_8_miles_of_bare/c36rlvx).  Just watch your back, [if you point out the stupidity of one his statements](http://www.reddit.com/r/todayilearned/comments/n2ub4/til_t_boone_pickens_purchased_8_miles_of_bare/c36fwky), he [deflects like crazy](http://www.reddit.com/r/todayilearned/comments/n2ub4/til_t_boone_pickens_purchased_8_miles_of_bare/c36mkl2)."
58558,Soap!
58559,"Old Spice, Hugo Boss, Swiss Army"
58560,Polo black! I once went out with a guy just because of the way he smelt. Oh my god the smell...
58561,The smell of money.
58562,Aqua Velva.
58564,"Some good answers in there too, including mine :-)"
58565,Man here. I find a little dab of chloroform on a rag makes the ladies week in the knees.
58567,"My mother works at a retail store and they give away ""testers."" So, I have tons and tons of cologne."
58568,DRAKKAR.
58569,Irish Spring bodywash.
58570,"Honestly, you're going to be very limited in the sub-$20 range. Like others have mentioned [Nautica Voyage](http://www.fragrantica.com/perfume/Nautica/Nautica-Voyage-913.html) is a fantastic hot weather fragrance along with [Perry Ellis 360 Red](http://www.fragrantica.com/perfume/Perry-Ellis/360-Red-for-Men-1906.html) which smells extremely similar to the much more expensive Acqua Di Gio. I'm not going to delve much into the darker and heavier scents as summer is coming quick, but for other quality colognes, you gotta be willing to spend a bit more than a twenty. 

[Versace Pour Homme](http://www.fragrantica.com/perfume/Versace/Versace-Pour-Homme-2318.html) is a fantastic fresh and citrus scent with a smooth and sweet background of neroli and tonka bean that gets plenty of compliments. Not to mention, it's on the cheaper side at $25 for a 1.7 oz or $33 for a 3.4 oz [here.](http://www.fragrancenet.com/cologne/gianni-versace/versace-signature/edt#159889) 

[Mugler Cologne](http://www.fragrantica.com/perfume/Thierry-Mugler/Mugler-Cologne-708.html) is another summer favorite of mine, with a simple, pure and soapy scent that makes you smell like a majestic beast straight out of the shower. $68 for a 10 oz bottle which is absolutely goddamn ridiculous considering how much juice you're getting out of it. $35 for a 3.4 oz otherwise [here.](http://www.fragrancenet.com/fragrances/thierry-mugler/thierry-mugler-cologne/edt#150371) 

Hopefully this helped somewhat, colognes take some time to get familiar with, and if you ever need a more experienced or varied set of opinions, check out Basenotes or Fragrantica. If you're buying, I love FragranceNet (Which I have linked to a bunch) due to their constant 30% sale, free shipping with ShopRunner, and excellent variety.

Cheers!

EDIT: Formatting.

EDIT 2: More Suggestions (<$20)

[Set Sail St. Barts](http://www.fragrantica.com/perfume/Tommy-Bahama/Set-Sail-St-Barts-for-Men-1860.html) smells like a coconut piña colada, great for summer beach vibes, and is ridiculously cheap. $20 for 3.4 oz [here.](http://www.fragrancenet.com/cologne/tommy-bahama/tommy-bahama-set-sail-st-barts/cologne#154053)

[CK One Summer 2013](http://www.fragrantica.com/perfume/Calvin-Klein/CK-One-Summer-2013-17561.html) smells similar to the legendary 2008 CK One Summer Edition. An aquatic, melony, and fresh scent that does better the hotter it gets. Get it on eBay for $19 a 3.4 oz [here](http://www.ebay.com/sch/Fragrances-/180345/i.html?_nkw=Calvin+Klein+CK+One+Summer+2013&rmvSB=true) before the years pass by and the prices inflate. (the 2008 edition is like $60-$80 now)"
58572,This was a great read.
58573,"I like how informative it is, but I hate how often they do certain things to gain attraction from girls."
58574,"You can also go for clones of more expensive fragrances
-cuba gold is the clone of le male by john paul gaultier which is a pretty popular clubbing fragrance and lasts pretty long. I cant really discern the differences between them. runs around $10 dollars on amazon for a 3.4oz.

- cuba prestige is a nice clone of the original A*Men, around $12 dollars for 3.4oz and I got mine from Ross.

-Perry Ellis 360 Red is pretty popular and kinda resembles Acqua di gio, one of the top selling fragrances of the past. It is more of a spicy sporty smell to it. Around 17 bucks for a 1.7oz bottle from Ross.

-Curve and Curve Black (a darker woodsier scent than the sweet original curve) runs between $15-20 dollars at TJ Maxx or Ross for 4oz bottle. I find that a lot of girls like this scent a lot and it lasts pretty well for around 6 hrs on me. Its more of an everyday scent that I use.

-Can't go wrong with Nautica Voyage, as it is hugely popular with the fragrance community for its clean aquatic scent. It runs around $15 dollars online or on fragrancenet.com (i highly recommend shopping here for legitimate bottles to avoid scams or fakes on ebay). I would stay away from nautica blue, it doesn't last longer than 2-3 hours. Don't bother with the other nautica scents, I have a few and I can say they aren't worth the few dollars they cost.
http://www.fragrancenet.com/cologne/nautica/nautica-voyage/edt#146363

-For a more mature and good manly evening date scent, or even for cold winter days, you can try F Black by Ferragamo. It is a peppery dark scent, and lasts VERY long. One or two sprays is enough for a whole night. I wouldn't recommend this as a day scent since its kinds strong. You can get a tester bottle from Fragrancenet.com for around 18-22 bucks for a 3.4oz. Don't worry about tester bottles, they are the real deal and are brand new, they just come in a cardboard box and without the fancy cap that doesn't do anything. 
http://www.fragrancenet.com/cologne/salvatore-ferragamo/f-by-ferragamo-pour-homme-black/edt#167033

Another everyday cheap scent I like is a celebrity cologne by Adam Levine. It doesn't smell great on everyone but it happens to do well on my skin. It is also fairly cheap. http://www.fragrancenet.com/cologne/adam-levine/adam-levine/edt#238320"
58575,"I have worn the same cologne for probably 5 years now, it's called Curve. Target and Ross actually both sell it, and every girl I've ever dated has told me she really likes it."
58576,"Curve, the number one cologne of people in my 2004 junior high."
58577,"aaaayyy! I got that too, smells good, clean and fresh but not overpowering. I'll go to like a Ross or Marshalls and pick them up for a few bucks."
58578,"I wore curve ""Crush"" for years. The regular stuff just makes me feel like I'm back in a high school locker room. It doesn't smell bad, I just think the entire football team bathed in the stuff. It's not a very sophisticated scent but for lower price cologne it would be my first recommendation."
58579,curve is legit af
58580,"yes i agree, altho i get more positive results with curve crush, its a woodsier less sweet smell

edit: wrote black instead of crush"
58581,That's sort of tough! My recommendation would be going to a store with samples and trying different scents. I wouldn't be able to name anything in particular without knowing what you like! What I like and you like could be completely different.
58582,what scent do you like?
58583,"Cologne is great value - It seems incredibly expensive per mL, but you'll go through it quite slowly. Find a brand you like and pay for it, but don't simply go for the discount shelf.

If you decide to put aside your $20 limit, which I suggest you do, L'Homme by Yves Saint Laurent is a popular and well-loved sent"
58584,L'Homme Libre works so well on me. You get absolutely showered by compliments.
58585,Or La Nuit De L'homme as well.
58586,Nautica Voyage. Fantastic smelling.
58587,"Geoffrey Beene - Greg Flannel.

Cheap, last long, smells good."
58588,"Nautica Voyage
I buy it on amazon."
58589,Don't you think everyone wears it at this point?
58590,"I don't recommend blind buying, but Perry Ellis 360 Red is probably one of the safest blind buys in that price range. If you like Acqua di Gio, you'll like it. Even if you don't, you still might like 360 Red."
58591,Lucky You has been my go to lately.
58592,"Try Lanvin Sport, its a good summer fresh scent"
58593,"check out eBay you can get a lot for under $30 and some even under $20 if you don't want to stretch it to $30. 
Nautica voyage is a great option and has good longevity. I got mine on eBay for $13"
58595,"You can check out r/fragsplits and get like 10ml of something high end, if you don't need it to last you like 2 years"
58596,"Grab some samples of various brands on eBay cheap, they'll last a while. Then once you get one you like, look out for sales then take the plunge"
58598,"**Cool Water By Davidoff For Men. Eau De Toilette Spray 4.2 Ounces** 

||||
--:|:--|:--
Current|$25.32|Amazon (New)
High|$31.69|Amazon (New)
Low|$21.00|Amazon (New)
|Average|$25.64|30 Day

[Price History Chart and Sales Rank](http://i.imgur.com/IztgkkX.png) | [FAQ](http://www.reddit.com/r/PriceZombie/wiki/index)"
58599,Drakkar Noir is around that range and always smells terrific.
58600,"nautica blue, only 9 bucks on amazon, but you get what you pay for, good smell, but does not last the day"
58601,"Bleu De Chanel EDP  
Spice Bomb Extreme  
PDM Layton  
PDM Herod   
TF Plum Japonais"
58602,What your experience with Herod? I’ve heard since it has been reformulated it doesn’t last long and only projects good for a really short time. Has your experience been the same?
58603,"Hi Nothing,

&#x200B;

You're absolutely right it doesn't project WELL for a long time, only for the first hour. It's sad because it's very solid minus the longevity issue!"
58604,"-	Bleu De Chanel (EDP)
-	PDM Layton
-	YSL Tuxedo
-	Dolce & Gabbana The One EDP
-	Prada L’Homme"
58605,You have extremely good taste lol
58606,Thank you! I’m sure some would think otherwise but I’m glad you appreciate it lmao
58607,"Tobacco Vanille

Aventus

Renaissance 1861

Bergamote 22

Jazz Club"
58608,"* La vie est belle Legere
* Lancome Idôle
* Flowerbomb Midnight
* Chanel Chance eau Tendre
* Brittany Spears Midnight Fantasy"
58609,"1 Tom Ford Noir de Noir
-	Been really enjoying this a lot lately and will be wearing this more often heading into the new year.

2 Dior Oud Rosewood/Oud Ispahan 
-	The latter adds a rosy/floral touch to the former which is a bit more dry and pronounced in the rosewood. I enjoy the Rosewood more as I find the combination with the oud to be more pleasant and they both balance and complement each other so well. These two woody notes remind me of jasmine and ylang ylang in the floral world where they both complement each other beautifully. Side note, Tom Ford Oud Wood walk so Dior Oud Rosewood can fly haha. 

3 Dior Homme Series - Parfum, intense, EDT (OG)
-	These three have been quite versatile in my rotation! I mostly choose them by the weather, respectively from coldest to warmest. I love all three of them though, so regardless I’m going to enjoy wearing them. 

4 TF Plum Japonais & Amber Absolute as layering. 
-	I find these two to be closely related with some differences that can really amplify and compliment the other.  

5 Amouge Interlude 53 & Black Iris
-	These are recent additions and my introduction to the house of Amouge. I can’t see myself wearing these in warmer weather as they are very resin and incense heavy compositions. So, these will be something to explore in this colder weather. Both very beautiful, but can easily be quite overwhelming if I’m not in the mood."
58610,I just acquired Black Iris as well and am glad to know I am not the only one who feels this way. Beautiful fragrance but can be a bit overbearing at times.
58611,"Yeah, that tends to be a common them among heavy and complex composition. I personally love it as well, but the olfactory fatigue is real with these."
58612,"I share it with my father because we both love and use fragrances daily but so far:

dior sauvage edt

jpg ultramale

adg profumo

mb explorer

versace eros edt

prada l'homme edt

bvlgari man in black"
58613,"Ultramale or Eros? I want a sweet fragrance.

Eros seems too bright to me, and the performance is lower than Ultramale. Maybe Eros edp will fix both my issues, but I have yet to try it"
58614,I'm no expert by any means but I'd say I prefer ultramale. It's sexier and more adult than eros. It has a more mature smell to it. Although I think that eros edp is better than edt and a really good fragrance. I regret not buying the edp version. It has a more fresh vibe than the edt
58615,"Id literally go the opposite route. All JPG ""male"" line fragrances are sickeningly over sweet to me, and thats saying something if you're telling somebody Eros is less sweet than another fragrance."
58616,"I think ultramale is sweeter than eros. In the sweet part of fragrances I think ultramale is one of the best, imo"
58617,"A lot of people would agree with you, I however do not. It's too much. I'd say its more suited for females than a guy any day of the week, which is evident when they tell you they honestly would love to wear it themselves. More bottles of it for you, though."
58618,"Swedoft Rasputin
Dior Ambre Nuit
Dior Homme Intense
Initio OFG
Kilian Black Phantom"
58619,"Acqua di Gio Profumo
Aventus
Xerjoff Naxos
MFK BR540 extrait
Tauer L’Air du Desert Marocain"
58620,Okay rich boy 😂
58621,"I prefer au coeur du desert over LADM, but pretty decent scents overall. Xerjoff Naxos is really good"
58622,"In no particular order, but by purpose:  


* For everyday (warm): John Varvatos EDT
* For everyday (fresh): John Varvatos Artisian EDT
* For active use: Prada Luna Rossa Sport EDT
* For formal business: Tom Ford Grey Vetiver EDP
* For nights out: Dolce & Gabbana The One EDP
* For intimate times w/SO: Issey Miyake L'Eau de Issey Pour Homme EDT (I've literally been wearing it since I met her, and it's my signature scent for her)
* For intimate time by myself/emotional self-care: Givenchy Xeryus EDT (vintage)

I have plenty of other things (either full bottles or samples) that I wear on the regular, but I picked the first five based on availability/ease of replacement. The Issey will probably always be there for personal reasons. The last entry could be any number of things that make me happy and smile, but most of them tend to be '90's oriental/spicy scents."
58623,"Commes des Garçons Floriental
Mont Blanc Individuel
YSL La Nuit de L'homme
Versace Man Eau Fraiche
Kenneth Cole Black"
58624,"Versace Eros Flame, Acqua di Gio Profumo, Hugo Boss bottled intense, JPG Le Male, Blue de Chanel EDT."
58625,"Bleu de chanel, Tom Ford noir extreme, versace dylan blue, ck one,"
58626,Noir extreme is excellent
58627,"- Initio Absolute Aphrodisiac 
- IA Memoirs of a Trespasser
- Kilian Intoxicated
- PDM Carlisle
- Galleria Parfums Dusk to Dawn"
58628,"* YSL La Nuit de l'homme - netflix&chill
* Valention Uomo Intense - going out
* Dior Sauvage EDP - gym
* TF Soleil Blanc EDP - alone by myself
* Creed Aventus - professional bouts"
58629,Please don't wear sauvage to the gym
58630,Is there a fragrance you would suggest for the gym?
58631,no fragrance at the gym
58632,Nothing wrong with a single spray or two in the gym. You would prefer people smelling like BO?
58633,I also don't prefer people smelling of BO at the gym. Good hygiene and deodorant is all you need at the gym
58634,But what's wrong with fragrance?
58635,IMO fragrances don't have a place at a gym. Clean fresh air is what I want to breath in when working out. Outdoor gyms are great but  even the typical rubber smell of an indoor gym is a bit off putting to me (although you get used to it)
58636,"I personally don't recommend any. The best thing to use imo is just deodorant. You're fairly close to people and most fragrances can get too offensive and bothersome when you're working out. 

To give ideas of something gym appropriate though I'd say just anything clean, fresh, generic and weak performing. A few that come to mind are Cool Water, Diesel Only The Brave, K EDT or YSL Y EDT"
58637,"I use ck one.
Fresh and inoffensive. Also mixes well with sweat gives a body lotion vibe"
58638,Deodorant lol
58639,great situational breakdown - thanks
58640,"Great lists here! For me -

Bleu de Chanel EDP

Spicebomb Extreme

Dylan Blue

Azzaro Wanted By Night

Stronger With You 

Armani Code Profumo 


I think these will do me well until it starts getting warmer mid year"
58641,How does the Azzaro perform?
58642,Performance is above average
58643,I get great performance. Really strong projection and it lasts a full working day (haven't tested it for longer than this )
58644,"Happy holidays to you as well!

1. Zoologist Squid
2. PDM Godolphin
3. Zoologist Tyrannosaurus Rex
4. Akro Awake
5. Tauer Au Coeur du Desert"
58645,"Not really my type of scents, but still nice lineup. And coeur du desert is great, imo better than l‘air du desert"
58646,"Thanks! I didn't try l'air, went straight for ACDD and love it."
58647,"Right choice. I love it, buying as early as I put some money behind. It’s so dry and warm, but kinda aetheric and cold at the same time. Like a desert at sunset, when it gets cold, but the sand has still the heat of the day conserved"
58648,"Yeah smell is great,one of my favorite dry downs ever. Be careful with the bottle!!! I got mine leaked and some people too. Contacted Tauer, they said they are not gonna help me because I bought it from retailer lol. One of the shittiest bottle designs. At this point I think I'm not going to buy something from Tauer unless they are going to change bottle design."
58649,"Can you describe the difference?  I like LDDM, but have never tried Couer."
58650,"LADDM is more warm, spicy, dry, sweet. It feels like walking around a souk in midday sun.

ACDD is warm and cold at the same time. I feel like this one is more ethereal than spicy, feeling like a desert in the night. It’s still warm and comforting at the same time. It gets to me on a very fundamental, „primordial“ level, hugging me and being around me. I feel like this one is more of a feeling and less of a perfume in comparison to LADDM. I think LADDM is really good as well, but for me I prefer the pure and lonely heart of the desert."
58651,"Platinum Egoiste, Le Male, Versace pour Homme, YSL Y EDP, Aventus"
58652,"Possibly thinking about getting ysl y edp, what’s it like? Is it a good everyday scent?"
58653,"I would definitely recommend trying it first. I think it’s really versatile, though."
58654,"I find it way too synthetic-sweet. I don’t mind, and sometimes even like, that stuff on others. But personally I can’t endure it the whole day on my own skin. Same with BdC"
58655,"TF Noir Extreme

Zoologist Panda

Givenchy Gentlemen

Polo Red Extreme

PDM Oajan"
58656,How do you like oajan?
58657,"* Hugo Boss The Scent Private Accord
* Prada Luna Rossa Carbon
* Dior Homme
* Chanel Allure Homme Sport Eau Extrême
* Guerlain L'Homme Ideal EdP

Bonus: Prada L'Homme for work"
58658,"Winter List

TF Oud Wood
TF Beau De Jour
MFK Oud Cashmere Mood
Zara Cedarwood"
58659,"Dior Spice Blend

Dior Balade Sauvage

Hermès Un Jardin Après La Mousson

Jo Malone Vetiver & Golden Vanillla

TF Fucking Fabulous"
58660,"Bleu de Chanel Parfum 

TF Noir Extreme 

Dior Homme Intense

Amouage Enclave 

S.T Dupont Perfect Tobacco 

Bonus: Versace Eros Flame"
58661,"Dior Sauvage Parfum(surprisingly)

Spicebomb Extreme(absolute winter beast)

Invictus(honestly never get sick of this stuff)

Versace Dylan blue(can never go wrong with this in school)

L'eau d'issey pour homme(a classic)"
58662,"Since it is cool right now


Pekji Ruh

Dior Feve Deliceuse

By Kilian Intoxicated"
58663,"Musc Ravageur, Five o'clock au Gigembre, Floris 1962, Masculin Pluriel, Scandal Parfum Cologne, 6MAN: HTTP"
58664,Bought 1962 today.  It's on a big discount from their site.  Need to stock up for when my Italian Cypress runs out.  Hope I like it.
58665,"Encre noir sport
Bdc edt
Baie 19
Tuscan leather
Spice bazaar"
58666,"FM Geranium, FM Monsieur, Chanel Egoiste, Dior Eau Sauvage, Chanel Antaeus"
58667,"PDM Carlisle

PDM Herod

PDM Layton

Guerlain L'Homme Ideal

Gucci Guilty Pour Homme"
58720,What your experience with Herod. I’ve heard since it has been reformulated it doesn’t last long and only projects good for a really short time. Has your experience been the same?
58669,"I've been blown out by the smell. I have an older version, not sure about the newest. It lasts around 8 hours, projecting maybe 3 to 4 hours then it's subtle. So yeah, projection is not great."
58670,"Tom Ford Noir Extreme
PDM Herod
Azzaro Wanted By Night 
Tom Ford Ombre Leather
Mugler Pure Malt"
58671,"Prada L'Homme Water Splash - for work 

Armani ADG Profundo - also work 

Dior Sauvage EDT - everyday wear

YSL Y EDP - for a night out 

JPG Le Male Le Parfum - for a date"
58672,"OP, I'm very interested in your opinion since I'm staring my collection and I've some similar fragrances are you

My favorite is Spicebomb Extreme, by far. I have Dior Sauvage because I wanted a long lasting, not so expensive, freshie. I was torn between Sauvage and BdC but I went on Dior for price/performance.

Does BdC have space in the collection, when Sauvage is there? I'm not a lover of freshies in general, especially in lockdown, I find myself wearing them even less.

I've tried Eros (Edt) and I didn't like the opening, even though I just sprayed fast at the mall.

I liked the dry down better, with a good amount of sweetness and bright mint. But I'm not sure if Eros or Ultra Male, that I like because it's very dark. But Eros Edp could fix that, but I still have to try it.

I also have Black Orchid, Fucking Fabolous and I like TF Noir but it falls in the same ballpark, and I can't bring myself on spending for more TF atm"
58673,"I personally prefer Sauvage, so my advice will be biased. That said, you have a great start to your collection. I have been considering adding F Fabolous this year, however I don't have enough trusted reviews to convince me to do it."
58674,"Spicebomb extreme

Tauer LDDM

TF Noir de Noir

Rogue Derviche

Aventus"
58675,"PdM Layton

PdM Herod

Creed Aventus

YSL La Nuit De L'Homme

TF Oud Wood"
58677,It's good for me. Lasts around 6 hours with good projection for around 3
58722,Do you think you could solve the problem with the moderate projection by simply spraying more or would that make it be unpleasant for the people around you?
58679,"I wouldn't overspray when you first put it on, just respray after a few hours when the projection starts to fade"
58680,"PdM Oajan, PdM Layton, Aventus, Spice and Wood and Oud Wood."
58681,"Creed Millesime Imperial

Tom Ford Ombré Leather

Van Cleef and Arpels Midnight in Paris

Creed Aventus Cologne

Hermes Terre d’Hermes Parfum"
58682,"For me right now it’s got to be
- Parle Moi Milky Musk—a deliciously subtle, creamy, sandalwood heavy musk
- Moschino Toy Boy—a dark peppery rose 
- TF Plum Japonais—my special occasion winter scent, florals and spiced plum
- Creed VIW—my staple clean scent, coconut and sugary rum on the drydown
- Armani Eau Du Nuit—been wearing this a little less lately but still my best winter staple, Iris powdery peppered Tonka"
58683,"Louis Vuitton Ombre Nomade

Roja Enigma

Creed Aventus

Roja Elysium

Hermes Rhubarb Eclarte"
58684,"*Creed Aventus- got my first bottle for Christmas. If I was a wealthy man, I'd never wear anything else again.

*Mont Blanc Individuel- I get a lot of positive comments from ladies on this one.

*Armaf Club De Nuit Intense Man- closeish to Aventus, stronger smell that people can smell through their face masks.

*Versace Dylan Blue/Eros- Just fragrances you can successfully wear anywhere.

*Dior Sauvage- Honestly, I want to like this scent, but there's something in there that turns me off. Others like it on me, though."
58685,Eros or Dylan Blue  - preference?
58686,"Eros, personally. I love the smell all around. With Dylan Blue, I do really like it, but...just like Sauvage, the top of the fragrance is really nice, but then there's just this weird undertone smell that turns me off. Id say Eros would be an every day, every situation fragrance. Dylan Blue can do the same thing, but I'd rather use it for more formal occasions."
58687,"CAHSEE
Aventus
Elysium P-C
The One EDP
YSL LNDL"
58688,"MDCI Fetes Persanes

MDCI Cuir Garamente

Jacques Fath Bel Ambre

D&G The One EdT

Costume National Soul

&#x200B;

Fighting the urge to grab a bottle of Soul; already waiting on a bottle of Bel Ambre and my collection leans Oriental heavy as is. Lovely stuff though."
58689,"Bleu de Chanel EDP
Tiziana Terenzi Luna Orion
Tom Ford Jasmine Rouge
Roja Elysium Cologne (festival staple)
Elie Saab No.8"
58690,"1-CAHSEE

2-the one edp

3-Prufomo 

4-boss botteled 

5-idk
That's it"
58691,"PDM Herod

Bleu de Chanel EDP

YSL Y EDP

THE ONE EDP

Prada L'Homme"
58693,I like it a lot. It has the same vibe as tobacco vanille and spicebomb extreme to me.  It feels more round to those though. I feel like it lasts for quite a long time in the radius that I want it to be in. I actually prefer that it doesn't project like crazy. Same reason I like pretty much everything else in my list other than maybe Y EDP.
58695,It's not a problem to me I'm usually 1 maybe 2 sprays. I have sprayed more and it is more. It's certainly a pleasant scent and I don't think it would choke people out.
58696,"1. PDM Layton 
2. YSL Tuxedo
3. MFK Grand soir 
4. Nasomatto Pardon 
5. Xerjoff More than words 
6. Amouage Reflection man 
7. Chanel allure homme sport EE 
8. Cartier declaration d’un soir
9. Le labo rose 31 
10. Mont Blanc Explorer"
58697,"For this winter time until it gets to the spring here in the UK:

* Tom Ford, Tobacco Oud Intense.
* Initio, Oud for Greatness. 
* Parfums de Marly, Herod. 
* Amouage Overture Man.
* Rouge Bunny Rouge, Embers. 

Bonus: Bentley for Men Intense.

In Spring it'll move to:

* Creed, Green Irish Tweed.
* Amouage, Reflection Man.
* Frederick Malle, Noir Epices. 
* UNUM, Opus 1144 (pre-reformulation). 
* Comme des Garçons, Avignon. 

Bonus: UNUM, Lavs (post-reformulation)."
58698,"MFK Baccarat Rouge 540, Mancera Red Tobacco,
Memo Winter Palace, MFK Grand Soir & Tom Ford Tobacco Vanille"
58699,"•Sauvage Dior
• Creed Aventus 
• Creed Viking
• Creed GIT
• Cool Water Davidoff 

Soon I want to get into Tom Ford. I tried Wood Oud today at Nordstrom and I fell in love!"
58700,"- Ombré Leather
- l'homme ideal extreme
- Allure Homme
- Le Male Le parfum
- Allure Edition Blanche"
58701,"Tough to pick...

- **Versace The Dreamer:** This one's for me and me alone, I know it's divisive :)
- **Prada Luna Rossa Carbon:** When I don't want to think about what to wear
- **Hermes Eau de Rhubarbe Écarlate:** When I want to feel relaxed, indoors or outdoors
- **MFK Aqua Celestia Forte:** S/S all-rounder
- **Nishane Ani:** F/W all-rounder

Especially tough picking Aqua Celestia Forte for S/S, I like Nishane Wulong Cha and Silver Mountain Water too."
58702,"Tobacco Vanille
Tuscan Leather 
Happyland Signature 
BdC EDP
ELDO Fat Electrician"
58703,"Tom Ford Oud Wood

Tom Ford Fucking Fabulous

Mugler Cologne

Mont Blanc Individuel

PDM Herod
 
Creed Aventus

MFK Baccarat Rouge 540 EDP"
58704,"-Platinum Egoiste
-Guerlain Homme
-Zara Vetiver Pampelmousse 
-Tuscan Leather
-Rendez-vous au Cap Ferrat by Godet
-Anubis by Papillon Artisan
-Knize Ten
-Oud by Robert Piguet

Sorry, more than 5..."
58705,"Blue de Chanel parfum 

Chanel egoist

Tom Ford ombré leather 

Chanel coromandel 

Cahsee"
58706,"Clive christian 1872

Initio psychedelic love

PDM Godolphin 

Andy tauer heart of the desert"
58707,"These are fun.

TF Fougere Platine

Zino Davidoff

TF Ombre Leather

HDP 1899

GIT/Egra/Cool Water"
58708,"Since it’s summer in Australia:

1.	Bleu De Chanel Parfum
2.	Dior Homme Cologne 
3.	Armaf Milestone
4.	D&G Light Blue Intense
5.	Chanel Allure Homme Sport

Bonus: Yves Saint Laurent Y EDP/EDT"
58709,"Some great lists so far. I have not tried Eros Flame, however my brother in law swears by that along with  Versace Man Eau Fraiche as his daily go-to."
58710,Longevity/Performance is not solid.. it smells great but doesn't last long. I think Eros Edt was a better performer and I believe its Edp version should be even stronger imo but im yet to try it.
58711,"- Prada Luna Rossa Carbon
- Bleu de Chanel (have both the edp and edt)
- Armani Code edt
- Grey Flannel
- Burberry London"
58712,"Can you smell the difference from edp and edt? I only have edt, but it's my favorite perfume so far."
58713,"I personally like the EDT better than the EDP or Parfum, but most people like the EDP best"
58714,I just answered this exact question in another post: https://www.reddit.com/r/fragrance/comments/kn5gtu/_/ghihuwn
58715,ty
58716,"Yes, the EDP is a sweeter, richer experience with a thick vanilla waft on it. They are both fantastic, I’d personally go for the EDT first in terms of versatility, but then EDP for a after work, weekend, or date night scent."
58717,"Vintage versions of:

Azzaro Pour Homme

Heritage

Safari

Egoiste

And...

Aventus"
58718,"MFK BR540
Gendarme
Prada Luna Rosa"
58719,"1. Creed Aventus (19u11 batch) 
2. PDM Herod 
3. Roja Dove Creation-E Enigma Pour Homme 
4. Dior Sauvage EDT 
5. ADG Parfumo 
 
Bonus: Versace Eros, Roja Elysian, or Mugler Pure Malt"
58721,"I wore it last night  and I got a decent amount of performance with it  (I could still smell it on my skin this am). The projection was moderate tho, which is a travesty because it smells so damn good. I could just keep inhaling it."
58723,"No, you could have sprayed more and it would have been longer and projected more. I went easy with three sprays two on each clavicle and one on the wrist which I dabbed on the other wrist. 5-6 sprays would more than likely be perfect."
58724,Right now only Puredistance Black. I wear other stuff maybe once every couple of weeks to break the monotony but I’m not emotionally attached to these frags.
58725,"Black Orchid Parfum
Neroli Outrenoir
Mon Précieux Nectar
Ombré Leather
Sauvage
Bonus: Ariana Grande Cloud"
58726,"Sauvage edt
Stronger w you intensely
Gucci made to measure 
Y edp 
Coach edt"
58727,"cold weather:

tobacco vanille 

tuscan leather

tobacco oud

polo red

ferragamo pour homme 

warm weather:

versace pour homme

burberry for men

gucci guilty"
58728,"Ombré leather 
Layton 
Artisan pure 
Dark lord 
Herod 
Black phantom"
58729,"Valentino Uomo intense
Spice bomb extreme
Kilian rolling in love
Bond no 9 signature"
58730,"In no particular order.

* Stetson Black. This one goes *perfectly* with some soaps and deodorant I received for Christmas and is thus higher up on my list than it normally would be. It's an object lesson that layering makes a difference.

*  Zoologist Tyrannosaurus Rex. This one is hard to wear-- what's the appropriate social situation to smell like a Cretaceous apocalypse?-- but I appreciate it for the artistry and I've spritzed it on around the house more than once. Definitely going to look into Gardoni's work with Bogue, I think he's got an incredible nose.

* Givenchy Gentleman Only Absolute. My go-to spicy winter scent for a few years now, it never fails to get positive attention when I wear it out. 

* Roja Creation-E Parfum Cologne. Probably the most sophisticated frag I own a decant of (certainly the most expensive at retail) and it smells like it. Beautifully boozy and robust, I was worried at first that I'm too young for it but I love it so much that I'm gonna keep it in rotation.

* Jovan Fever. Yes, another cheapie, but a fragrance doesn't need to cost $300 to be worth wearing, and this one's the workhorse of my fragrance drawer-- to extend the ""starting lineup"" metaphor, one could say it gets the most ""minutes per game"". It's a very wearable, slightly sweet woody-tobacco cologne that I wish I knew existed when I was in college. Its relative obscurity (this is a fairly uncommon Jovan flanker) appeals to me as it's not overexposed, and the insanely low price makes it a great addition to anyone's medicine cabinet. This is the bottle I reach for when I don't feeling like debating what to wear and I've only heard good things when wearing it. I will take it upon myself to be Fever's one-man hype brigade in 2021."
58731,Happy New Year Gents - hope to keep this thread going
58732,"Bumping this...

Any new additions for Summer 2021?"
58733,"You have any recommendations for the Summer? Looking to buy one today, not sure which one to get(first time buyer). 

My friend let me borrow Versace cologne a couple years ago and I liked that, but wondering if there is one that is better that I should go for"
58734,"So, if you're serious about choosing a scent for yourself, here's what you need to do:  
Start talking to a fragrance employee at a reputable store like a Nordstrom or Macy's. Tell them what you just said. They'll ask you some more questions and then pull out some stuff for you to sample based on that. If they are good employees they will be patient and let you smell a lot of them. Give them feedback when you smell one you really like and don't like.  
When I decided to get serious about choosing a fragrance I told the lady behind the counter that I really just don't want something 'sporty' at all. (I think sporty scents are slightly douchy, but that's just me.) I told her that I want something that is more earthy, but not bitter. She asked me some more questions and told me that I have what is usually called a more ""woody"" taste for scent. She let me smell some samples and I agreed with her. Ended up going with Calvin Klein Encounter, but don't take that as a suggestion for you. Everyone has different tastes.  
Also, if you don't already know this stuff, some other tips about wearing a scent:  
Find that one perfect fragrance for you, and use ONLY that. You should NOT have a variety of scents based on the situation or your mood. They are NOT like clothes. Your fragrance should serve as an subtle, pleasant, reminder of you. An unconscious reference, but it has to become that over time. That won't happen if you alternate scents. Do - not - alternate - scents.  
This is also one of the reasons why you shouldn't, unfortunately, go with the cheap scents like Old Spice or Preferred Stock, etc. I'm not a snob. I think they smell ok. They're a little harsh, but classic. They're WAY too common, though. If you were to ever wear a common discount brand, a girl might think to herself ""he smells good today"", but she will never start that process of unconsciously associating a specific, unique scent to you. She will always smell old spice and think, ""that's old spice, it smells good."" But YOU probably won't pop up in her mind.  
Wear your scent every single day. Only a little, just behind the earlobes and upper neck. One or two sprays at the most. When you first apply a scent, you will notice the smell of it. If after 10 or 15 minutes, you (the wearer) are still noticing it, you are wearing too much. Remember that your scent should be a subtle, pleasant reminder of you. It's phycological. Not something people should consciously notice (unless they get very close).  
A couple months back a couple of (male) coworkers were talking about a cologne that one of them just bought. They asked me if I wore anything. I told them I wear Encounter, and I always keep a tiny little card spray (a little flat sample-size) in my desk in case I have to work late. I let one of them sample a bit on their wrist, because they were interested.  
They said ""Holy crap. This is Reas0n. It's like they took what Reas0n smells like and put it in a cologne. This is so weird. Dude, smell this.""  
It's funny because, of course, the opposite is true. That's what you want to be going for, though.  
Man, I really over-answered your question. Sorry. :P  
  
Edit: Forget everything I said. The correct answer is Sex Panther."
58735,"This is a massively inspiring post. Thanks for sharing, I will need to rethink a few things."
58736,":D Thanks! Another tip is: buy your first bottle from the retailer that helped you, because they deserve it for helping you.  
Buy only a small or medium bottle, though. For all subsequent bottles, get the largest size you can from Amazon if they have it. (They carry most designer brands). They are legit, but so much cheaper."
58737,"Quick question, you say don't alternate scents across short periods of time.  Does that include across seasons?  Or would you recommend having a more 'summer' one for the spring/summer and a more 'fall' one for the fall/winter?  Thanks, sorry I'm very new to this!"
58738,"I do not recommend this, for all the reasons I described.  
HOWEVER, if you or anyone else really wants to do this because you like the idea, it is ok, as long as you realize that you won't be getting the benefits of a permanent association. None of them will be ""your"" smell. You will be treating fragrance more like an accessory, rather than a foundation. If you are ok with this, then it's fine. Not being sarcastic at all. Like I said above, I try not to be a snob about it. It's not taboo, or anything like that."
58739,"Got it, thanks so much for the reply!  Really appreciate the advice"
58740,"As someone who is into frangracnes, I severly disagree with Reas0ns opinion. If you talk to anyone in the fragrance community on youtube, fragranctica or basenotes, the vast, vast majority, nearly 100% does not treat fragrances as a ""foundation"". We like to appreciate and evaluate scents based on the image we get in our mind when smelling. Some fragnces smell dark, earthy, smoky. Some smell sweet, floral and musky. Some smell fresh, soapy and clean. We like to treat frangrances based on how they make us feel.

If it is a hot sunny summer day, I don't want to smell smoky, leathery or of tobacco. I generally want to smell fresh, clean and invigorated. If I am going out to a nice bar on a cool night with my girlfriend though, I might absolutely want to smell that way though. This is how 99% of people who are in the community feel. Reas0ns statements are very, very rare in the community."
58741,"Yeah I'm mostly used to hearing about fragrances as revolving around the season/weather/etc. as opposed to a ""foundation."" Thanks for the input, I think I'll probably be using a couple depending on how I want to smeell"
58742,"You will find some fragrances work better in winter vs summer. Some need heat to come out more, some will just cloy at you. Citrus/aquatic is good in summer, etc Wood/Leather for winter."
58743,"How would you recommend using them then?  Say I had Fragrance A (Citrus/Aquatic) and Fragrance B (Wood/Leather).  Would you opt to use A throughout the summer season and B for the opposite?  Or would you judge it by the day - hot day is A, cold day is B.  So if it's a freak cold day in the summer you use B, etc.?"
58744,"I usually go with your second approach listed. I've actually got a ""rainy day"" cologne that I think works really well with the subdued atmosphere of gray clouds and wet air. Usually cold summer days don't get an absolute winter fragrance, tho, because it's not truly cold outside."
58745,"Yeah that makes sense, probably will be awhile for me to work up a collection haha"
58746,"When people associate frags with season, it generally just is a way of references temperature ranges. So frags that do well in cold weather are more F/W and vice versa."
58747,"Gotcha, thanks"
58748,"Well shit, I've been wearing cologne exactly like you said not to

Alternating it based on the situation + my collection is about 6 or 7 bottles big :l"
58749,Do they come out of a sliding panel in the wall?
58750,"Well, I personally think there's never a right way to wear cologne. As long as you don't offend anyone, don't overspray, fit in the situation, and like the cologne yourself, then you're good"
58751,"Don't worry, I think it is much better to experience frags based on your situation and use them dynamically. Using 1 frag for everything is like only having one outfit. It might be okay, but it isn't ideal for all situations.

Besides the world of frags is so vast, it makes no sense to only wear a single one."
58752,"This is pretty good advice. There are two schools of thought when it comes to cologne and scents. 

1. A signature scent: A person will wear this scent for their entire life, it becomes a part of them. I won't go into this because you covered it let much on the nose.

2. Scent as an accessory: this might be more of a younger generation invention in the US, but it's a common school of thought in other countries. Some scents are designed to be used for certain occasions, lighter citrus for the day/summer and heavier spicy scents for night/winter. 

I personally like a hybrid of the two. I have 2 scents that I alternate fit the day and about 3-4 that I alternate when I'm going out or dressing up for something fancy. It all depends on how I'm feeling or the feelings that I want to evoke. If it's a cold winter day I'll choose a warmer heavier scent. If I'm in a meeting I'll choose something that is crisp, strong, lightly citrus but not overbearing. Date night will call for something a bit more perfumy, something that will linger a bit where you get light pleasant wisps of scent when you come closer.

There is no right or wrong it's preference. Just don't spray half the bottle on your self so people can smell you a mile away.

Source: sold perfumes and cologne for about 7 years, just some of my observations from experience"
58753,"I'm one of the scent as an accessory school of thought 

Smelling light and citrus when cuddling with a girl out in a corn field making smores around a bonfire on a chilly autumn night just feels to go against the grain if that makes sense, vs say, Givency Pi feels more appropriate.

That, or I just have not found the jack of all trades cologne yet."
58754,"Yup, I would agree with this.  
Fragrance-as-an-accessory is definitely looked down upon by enthusiasts, but I think if it's what you prefer, then it's ok, especially if you're young and trying to figure out where your preferences fall on the [fragrance wheel](https://en.wikipedia.org/wiki/Fragrance_wheel)."
58755,"You are 100% wrong. Virtually every fragrance community on reddit or otherwise involves owning multiple if not dozens of fragrances that you wear for different times. Limiting yourself to a signature scent is ignorant at best. 

There is literally no way a fragrance for a club is one that is ideal for eating dinner at a nice restaurant or going on a road trip.

HoM Blackbird is something that I wouldn't probably wear at a meeting, unless I wanted to offend people. TF Tuscan Leather is not particularly good for a nice day at a beach in the Galapagos. 


The idea of having one core fragrance is fine and is good, but saying ""it is looked down upon by enthusiasts"" to wear fragrance as an accessory demonstrates that you are about as far from an enthusiast as it gets.

So yea, have your signature sent, but not mixing it up is for people who can only afford a single bottle and want to get the most use out of it, not people that like fragrance."
58756,"> HoM Blackbird

Cannabis? it has cannabis as a fragrance note? O_o"
58757,"It isn't so much a burning joint smell as a earthy leafy cannabis smell. If you are looking for it you will notice it, but it doesn't really smell like you are smoking weed. It is actually a pretty amazing fragrance, just not something for every day."
58758,"What other ""enthusiast"" agrees with you? Every single person into frags usuallly has dozens if not hundreds of frags that they alternate based on on situation."
58759,People WILL start identifying you by your smell it's really interesting. I left my backpack in a room and someone brought it to me knowing it was mine purely because it smelled like me. That was nuts. At that point I knew how important scent was.
58760,"I wear the same cologne for the last 5+ years, kenzo power. But it's been discontinued for most of that time. 

Part of me loves trying to find remaining specimens on eBay because I want to be the only one wearing it, but I fear it's starting to get too sparse and expensive. 

Colognes are difficult balance of common and rare."
58761,">I wear the same cologne for the last 5+ years, kenzo power. But it's been discontinued for most of that time. 

That sucks, dude. You'll have fun choosing a new scent when the time finally comes, though."
58762,Yeah and I'll just buy ten years worth of it lol. To be honest our sense of smell gets more defined with time so a change makes sense in that context.
58763,It seems you have found the your balance between a signature scent and an everyday scent that is both suitable for office wear and night out. Congrats!!!
58765,"Ok, so to answer that would be to get into coordinating scents, which is a thing, and a sentless deodorant is actually a very good option.  
A long time ago I used to just wear Speedstick because who cares, as long as it works. Once I started learning about fragrances I realized that Speedstick has a more fresh/watery scent that doesn't coordinate well with me.  
Now I use a Dove Men+Care that has a darker, aromatic smell that matches up better. I honest-to-God can't remember which one right now, I think it has like a grey & blue package.  
In any case, there are hundreds of types of deodorants at the store, right? A whole wall of them. Just use common sense and pick one that pairs well with your fragrance. No need to spend a ton of money on some obscure deodorant."
58766,"I wear Kiehls superbly efficient anti perspirant it's scentless and ""superbly efficient"""
58767,"Awesome post.  One thing to note:  if worn correctly as you suggest, a cologne will not smell the same on another man as it does on you.  If you do not apply too much of it, it will mix with your natural scent as well as the smell of your deodorant.  Your deodorant should complement your cologne, not clash with it.

I have found in the past that having a few female friends smell the cologne you are wearing and offer their opinion helps, since you cannot always smell exactly how it's going to smell on you, since you cannot smell your own natural scent."
58768,All good points! Nothing wrong with getting other people's input.
58769,You changed my lifw
58770,"How much should I expect to spend if I do this? Will I have to break out $100+, or can I get something good, not cheap or too common, for like $40?"
58771,Scents have very high markups. It's possible to find stuff in that price range online once you know what you like.
58772,"Nice post that I agree with. My first real cologne that I picked and accepted as my scent was Rochas Man. I still use it after 4 years. Considering im 20 its a long time. 

Now funny story about a perfume being associated with your name... My close friends know how I smell however whenever they ask me what I use, I say its a secret. Kinda teasing them. A year ago a close girlfriend of mine started dating a guy, which coincidentally used Rochas. She made him change his perfume because he smelled like me and she felt uncomfortable about it.

She loves the scent on me, complimented to me about it many times before they got togather."
58773,> [She made him change his perfume because he smelled like me](http://www.themarysue.com/wp-content/uploads/2013/11/captain-picard-face.jpg) and she felt uncomfortable about it.
58774,"""Find that one perfect fragrance for you, and use ONLY that. You should NOT have a variety of scents based on the situation or your mood. They are NOT like clothes. Your fragrance should serve as an subtle, pleasant, reminder of you. An unconscious reference, but it has to become that over time. That won't happen if you alternate scents. Do - not - alternate - scents""

This statement is very, very debatable and very, very opinionated. And that is a supper strong opinion. Personally, I disagree, and I bet 99% of people into fragrances share my opinion. Some fragrances are designed for certain situations, or are just more appropriate. I wouldn't where a fragrance that projects heavily and smells very strong and weird to work for instance. I might however, wear it at a bar or something.

I just find your opinion on this incredibly harsh. I understand that it is an opinion, but the way it is worded just comes off as combatant against others who disagree.

Why do you feel fragrances are so static, and should never be alternated? I like to look appreciate fragrances and their effect on scent memory and association.

I hope no one reads your comment and takes your opinion as something other than that, and never discovers how amazing fragrances can be.

Also, Macy's fragrance department is sometimes staffed by contractors from a fragrance house. They are extremely biased because their job is not to sell you anything other than the house they represent."
58775,My all-time favorite: Terre d'Hermès.
58776,second that
58777,Third that. i was surprised at first how citrusy it was but it is pretty awesome.
58778,"The new ""fraiche"" flanker is really good, they took away a little of the earthy/dirt note (i loved that note so much) but brought forward a really genuine orange in it."
58779,Agreed. Can't live without it
58780,"Colognes are a very personal thing as they smell different on each person. For summer, I really like Aqva by Bvlgari but I can't be sure you'll like it or that it'll smell good on you."
58781,They don't smell *that* different. I'm pretty sure I could tell if someone is using Armani Code or Bvlgari Aqva on just about everyone.
58782,"You're both right. Most folks who spend a moderate amount of time around other people can spot Code, AdG, etc. But for example, I love most of what Polo offers (it's cheap and dept store but I don't care, it smells great) until I get it on my skin. Without fail, every Polo fragrance develops a ""rotting basil"" note on my skin, within 10 minutes. It doesn't happen with other frags that have those notes, so it must be some ingredient/formulation that is unique to Polo."
58783,"I bought a bottle of Aqva because it was so highly rated. Sadly, I'm not a fan; it smells like a generic, strong cologne to me without any obvious notes. Also, the bottle is so weird it doesn't play nicely with my current collection.

The bottle is basically new if anyone wants to take it off my hands (for a price)."
58784,"La Nuit de l`Homme Yves Saint Laurent for men


It's a great cuddling scent. Read more about it here 
http://www.fragrantica.com/perfume/Yves-Saint-Laurent/La-Nuit-de-l-Homme-5521.html

Also check out /r/fragrance"
58785,"I second this. I've been using the L'homme version for the past 3 years. Unlike the La Nuit, this one's a little sweeter and subtle, which is what I prefer. Definitely a killer on date nights."
58786,"I don't think it is sweet or subtle, it is just not as dark and spicy, especially at the top. You get that fresh citrus top with l'homme, la nuit doesn't really have that."
58787,I suggest joining r/fragsplits. It is a subreddit that splits bottles of really expensive colognes. You get to test nice colognes and the 10ml bottles tend to last a long time if you vary your scents. When a new split pops up look and see if the scent is something you think you might like.
58788,"Yeah, I've gotten some stuff I love that I otherwise couldn't afford.  I've been rocking Tom Ford Plum Japonais a lot this summer, and I don't think I would have ever found it if not for that sub."
58789,Creed Aventus - Smokey Apple/Pineapple scent
58790,"Note: will also empty your wallet.  

If you're interested in this one (it is fantastic) you should probably try a sample first.  Could look at /r/fragsplits , [decant shop](https://www.decantshop.com) or another decant store for the more expensive fragrances

Edit:formatting"
58791,Anyone try the combo where you layer with Tuscan Leather?
58792,"Yep. Frankly didn't love it as much as plain old TF but I can see the appeal. Having owned Aventus I am not actually as impressed with it as many are, but it is the best selling Creed for a reason."
58793,"Go to a Nordstrom and they will have a jar of free testers, try different scents and see what **you** like."
58794,"Check [this] (https://www.reddit.com/r/malefashionadvice/comments/2nl538/advice_what_is_a_decent_cologne_to_buy/cmeo73r) out! 

I personally like Armani Code the best. And Diesel Only the Brave for warm summer nights."
58795,"does anyone have thoughts on CdG wonderwood? Heard it mentioned a lot on SZ and was curious. 

If only creed aventus were cheaper :["
58796,"Not a fragrance expert but I did like it for a while - its definitely a strong woody smell but the thing is its a very synthetic wood smell. Many people still like it though so I would recommend getting a sample to at least try it.

I tried slumberhouse norne and I liked the earthy/mossy wood smell over wonderwood"
58797,VERSACE BLUE JEAN.
58798,I recently bought this. Very good!
