idx,text
13849,"Hands down: [Who says you cannot get published?](http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2492027/) References papers like: ""Will humans swim faster or slower in syrup?"" ""How chewing gum flavor affects measures of global complexity of multichannel EEG."" And my personal favorite, ""An analysis of the forces required to drag sheep over various surfaces."""
13850,"[Recursive Functions of Symbolic Expressions and Their Computation by Machine](http://www.cs.nccu.edu.tw/~chenk/Courses/PL/Papers/Mccarthy-Lisp60.pdf) by John McCarthy, and Paul Graham's [article](http://lib.store.yahoo.net/lib/paulgraham/jmc.ps) about it, made me understand computer programming as a formally definable endeavor and not just a hack"
13851,"[The first case of homosexual necrophilia in the
mallard Anas platyrhynchos](http://www.nmr.nl/nmr/binary/retrieveFile?instanceid=16&itemid=2574) (pdf warning) is concise and quite the interesting topic."
13852,"This may be a good time to mention that the British Royal Society has released their historical archive to the public. It includes:

[Theory about Light and Colours](http://rstl.royalsocietypublishing.org/content/6/69-80/3075.full.pdf+html?sid=0d477dd8-8dec-4ac3-8187-b6df96d4d670) - Isaac Newton

[Philosophical Transactions of the Royal Society](http://rstl.royalsocietypublishing.org/) - First ever peer reviewed journal (1665)

[Electric Kite Experiment](http://rstl.royalsocietypublishing.org/content/47/565.full.pdf+html?sid=491066f9-1f77-4232-a45c-3e859a60867e) - Benjamin Franklin

[Search the archive](http://rstl.royalsocietypublishing.org/)."
13853,"I really like the following:

[Tonegawa's paper on DNA recombination in immunology](http://www.nature.com/nature/journal/v302/n5909/abs/302575a0.html) (Sorry I don't have the PDF available)

Barbara McClintock's paper on transposons (McClintock, B., 1950. The origin and behavior of mutable loci in maize. Proc. Nat. Acad. Sci. 36: 344-355.) This paper is socially interesting as much as scientifically. The amount of evidence she felt she needed to have in order to publish a paper (presumably because she was a woman) is astounding. 

The last suggestion is about [Educational Research: The Hardest Science of All?](http://www.google.com/url?sa=t&rct=j&q=education%20research%20hardest%20science%20of%20all&source=web&cd=1&ved=0CBsQFjAA&url=http%3A%2F%2Fciteseerx.ist.psu.edu%2Fviewdoc%2Fdownload%3Fdoi%3D10.1.1.64.2102%26rep%3Drep1%26type%3Dpdf&ei=up66To26KYi22gXhv4S7Bw&usg=AFQjCNFvT-B41SJbTSdOznKU4Dcfvf1BQQ&cad=rja) which allows you to discuss the differences in science in different fields. In education we can't control all the factors so we have to approach some things differently. Doesn't mean we're less scientific, we just have to make adjustments to our expectations and results."
13854,"Here's one of my favorite's: [""How long is the coast of Britain?""](http://nature.berkeley.edu/~bingxu/UU/geocomp/Readings/MandelbrotScience1967.pdf) by Benoit Mandelbrot. An incredibly clear (and incredibly early) discussion of the importance of fractals published years before fractal was a word!"
13855,"Not sure, but the worst ones I've read are definitely the ones I've written &#3232;\_&#3232;"
13856,[Maybe this…](http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1311997/pdf/jaba00061-0143a.pdf)
13857,"Hopefully, this doesn't get buried but, [RNAi in C. elegans, work which Fire and Mello recieved a Nobel for in 2006](http://www.nature.com/nature/journal/v391/n6669/pdf/391806a0.pdf) 

While not the best it is still pretty well written. I think it would be a beneficial exercise to have the class, read and critique the content, writing style ect.  Of course, you get discussion going and the more critical the class is, the more of a shock you get when you reveal that they won a Nobel for the work.  

This is how this paper was presented to me in a class.  It really did a lot in the way of teaching us that papers in high tier journals are not perfect, and moreover that Nobel prize winning work is not perfect.  You also get the opportunity to speculate on the implications of their work at that period in time which is fun!  

Maybe this outside the realm of your class but maybe not?"
13858,"Tversky and Kahneman's [Judgment Under Uncertainty: Heuristics and Biases](http://www.math.mcgill.ca/vetta/CS764.dir/judgement.pdf).

The work is all about the way people make decisions in life based on an incomplete understanding of probability.  Totally changed my life when I read it the first time."
13859,"[Arms races between and within species by Dawkins & Krebs](http://www.google.ca/url?sa=t&rct=j&q=arms%20races%20between%20and%20within%20species%20filetype%3Apdf&source=web&cd=1&ved=0CB8QFjAA&url=http%3A%2F%2Fwww.oeb.harvard.edu%2Ffaculty%2Fpringle%2Fjc%2FDawkins%2520and%2520Krebs1979.pdf&ei=mfe5TqHMF4Ts2QW28Ji6Bw&usg=AFQjCNEHHyHoQr1oevG3B1CVhGv5T8Tg6A&cad=rja)

They write in a very clear and eloquent style which makes difficult to grasp concepts easy to understand. Its a greatly influential paper--it has been cited nearly 1000 times in biology and life science journals. One of the best biology papers I have had the pleasure to read.

Also, a few good books, available free online:

[The selfish gene by Richard Dawkins](http://www.macroevolution.narod.ru/gene/gene30.htm)

&

[River out of eden by Richard Dawkins](http://www.macroevolution.narod.ru/river/river.html)"
13860,"I love ""the selfish gene"", and had no idea it was available online! Thanks :)"
13862,"""A Mathematical Theory of Communication,"" Claude Shannon."
13863,"Roald Hoffman, How Chemistry And Physics Meet In The Solid State. He emphasizes the intuitive nature of chemistry and explains solid state physics through qualitative arguments ... Really nice."
13864,"I found [this paper](http://www.princeton.edu/~icouzin/Couzinetal2005.pdf) to be really interesting because it lays down mathematics to situations with which we have an intuitive understanding of. It discusses swarm theory mathematically, particularly how a few knowledgeable individuals in the swarm can direct the entire swarm. The exact example is in terms of a school of fish in which a few fish know where food is."
13865,"Doll, R. and A.B. Hill. 1950. [Smoking and Carcinoma of the Lung](http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2038856/). British Medical Journal 30:739–748. 

This was perhaps the first major use of the case-control method in epidemiology, a methodological approach which allowed the investigation of many long-term public health threats.  It also linked smoking and lung cancer, which saved certainly thousands if not millions of lives.  It is also relatively simple to read."
13866,Brainbow: http://www.nature.com/nature/journal/v450/n7166/abs/nature06293.html
13867,"My favorite scientific poster:
[Neural correlates of interspecies perspective taking in the post-mortem Atlantic Salmon](http://prefrontal.org/files/posters/Bennett-Salmon-2009.jpg)"
13868,"""Energy Gap in Superconductors Measured by Electron Tunneling"", by Ivar Giaever [Phys. Rev. Lett. 5, 147–148 (1960)](http://prl.aps.org/abstract/PRL/v5/i4/p147_1)

A straightforward experiment showing a phenomenal result:  the existence of an energy gap in superconductors"
13869,"The best three papers we learned about in school were the Framingham studies, the study finding estrogen replacement therapy increases risk for breast cancer, and the study linking folate to the prevention of neural tube defects. The first is one where an entire town has participated in the study generation by generation for decades, and has given really useful data that has shaped how America sees ""health"". The second one is remarkable because unforeseen side effects became so prominent so quickly during the study that they had to cancel it early because continuing it would increase risk of morbidity/mortality unacceptable in the researchers' behalf. The third used and absolutely INGENIOUS method of retrospectively questioning mothers about PNV use and confounding for their guilt in losing their babies.
These papers are all great examples of what practice-shaping clinical research is all about."
13870,"On computable numbers (Theory of Computation) - Alan Turing.

Brilliant."
13871,"From Anthropology:
[Deep Play: Notes on the Balinese Cockfight](http://www.google.com/url?sa=t&rct=j&q=notes%2Bbalinese%2Bcockfight&source=web&cd=1&ved=0CB0QFjAA&url=http%3A%2F%2Frfrost.people.si.umich.edu%2Fcourses%2FMatCult%2Fcontent%2FGeertz.pdf&ei=Nvy5ToD2IcTDgQe1kNHlCA&usg=AFQjCNGcJOllPpmzN9m-ARwPM1Msna7jew)
Makes me chortle every time I read it."
13872,My favorite is [Feline High-rise Syndrome: 119 cases](http://www.scribd.com/doc/35730924/Feline-high-rise-syndrome-119-cases-1998%E2%80%932001). I found it a really neat read with pretty cool statistics about cats and apartment buildings.
13873,[Simon's The Architecture of Complexity](http://www.informatics.sussex.ac.uk/courses/ModDis/Internal/SimonAoC.pdf)
13874,[Binford's 1962 'Archaeology as Anthropology'](http://www.scribd.com/doc/30525496/Binford-1962-Archaeology-as-Anthropology) is one of the landmark articles for archaeology as a discipline.  I can name a bunch of other ones that are much more relevant to my specific research interests (Neutron Activation Analysis and Inka Administration in Coastal Peru) but this is the best archaeology article I can give you in terms of being broadly accessible and relavant.
13875,"It's not exactly a paper, but it is a fairly quick read.  *The Structure of Scientific Revolution* by Thomas Kuhn is indispensable, IMHO."
13876,"[Evidence](http://www.pnas.org/content/99/19/12252.full.pdf+html) of van der Waals forces in gecko setae.

Rarely do you see evidence presented so simply. Hopes for setae dry-adhesive products in the future have sky-rocketed since this paper."
13877,"Not sure if somebody else posted this...and also this is by no means the best scientific paper I've ever read but nevertheless it is very interesting and IIRC Feynman called it the best paper he has ever read.
[N.D.Mermin's experiment to make quantum behavior obvious to 'anybody'](http://hep.ucsb.edu/courses/ph125_02/mermin.pdf)"
13878,"http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1311997/pdf/jaba00061-0143a.pdf

The Unsuccessful Self Treatment of Writer's Block always gets a laugh, and can provide a nice break for your students."
13879,[Geminoid: Teleoperated Android of an Existing Person ](http://www.intechopen.com/articles/show/title/geminoid__teleoperated_android_of_an_existing_person) - For everyone who likes some robotics.
13880,"Ronald Coase's ""The Problem of Social Cost"" is widely considered one of the most important social science papers ever written.  It deals with the economics topic of ""externalities.""  It has been massively cited in the social science literature and does not require advanced mathematical, legal or economics knowledge to understand (Coase was a lawyer turned economist).  

Interestingly, readers of ""The Problem of Social Cost"" seem to reach quite different conclusions about what what the paper means, with widely differing papers citing it in support of their conclusions.

Coase is considered to have earned his Nobel with this paper and his other classic ""The Nature of the Firm"" (about transactions costs). The papers are available on JSTOR and there are pdf copies around on the web (whose legal availability I cannot speak to)."
13881,"Grave Shortcomings, Gargett et al 1989.  Great article on the reinterpretation of supposed Neandertal ritual behavior, notably burials.  Hence the cool title.  In addition to being an interesting and accessible topic, it is a fantastic illustration of things that influence all scientific literature and the value of critical thinking and balancing different hypotheses in general.  In this case, some previous conclusions (that neandertals had various examples of ritualistic behavior including burying their dead) were influenced by the social and political environment in which they were written, among other things.  Gargett takes another look and some of the most famous examples, and alternately applies various hard sciences and occam's razor to dispute some of the original findings.  There are plenty of peer responses, as this was in Current Anthropology.  Anyway, I haven't read it for 10+ years, and I don't even recall agreeing with all of it, but it should be helpful to discuss ALL sorts of topics related to scientific literature.  Especially for that audience."
13882,"[Right here.](http://wings.buffalo.edu/academic/department/eng/mae/cmrl/Interface%20between%20steel%20rebar%20and%20concrete,%20studied%20by%20electromechanical%20pull-out%20testing.pdf) I used to work as ""Mr. Concrete"" for a Q and A website, and this was one of the most useful articles I ever used in my research. Who knew concrete was so fascinating?"
13883,"To me, nothing compares with the Einstein, Podolsky and Rosen paper on the nature of physical reality and quantum mechanics. It's beautiful for the simplicity of its argument, and it is basically the spawning point for all subsequent work in quantum foundations. It can be found here:

http://www.staff.science.uu.nl/~stief101/epr_latex.pdf

Staying with Einstein, his book on special relativity is extremely intuitive and understandable to anyone, and is definitely worth a read."
13884,"""Consequences of Erudite Vernacular Utilized Irrespective of Necessity: Problems with Using Long Words Needlessly""

http://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&ved=0CCAQFjAA&url=http%3A%2F%2Fpersonal.stevens.edu%2F~ysakamot%2F730%2Fpaper%2Fsimple%2520writing.pdf&ei=-I66ToXINOe62wWukb2fBw&usg=AFQjCNEO1mrPKwyEFwxuei-25QArSHR5Yw"
13885,"[Primer](http://mitpress.mit.edu/books/chapters/0262610620chap1.pdf) from the book, but I found 'Structures of Scientific Revolutions' by Kuhn to be impressive and insightful for me as I went through college."
13886,"The entire book is better, although I find The Darwin example to be a better one than the Newtonian->Einstein change."
13887,"This may be the best Reddit topic on r/AskScience I've seen in a while! I have  [Kaila, Ville. ""Natural Selection for least action""](http://rspa.royalsocietypublishing.org/content/464/2099/3055.full) where natural selection is described using physics terms, the law of least action and the 2nd law of thermodynamics."
13888,"My favorite is a short article from Nature in 1985 by Harold Kroto that more or less won a Nobel Prize for him, and pissed off a slew of Exxon researchers who realized that they had observed these ""C60"" structures but just didn't know what they had a year before the article was published.... Gene Dresselhous has a great video about it. This was the first mention of the now ubiquitous Buckyball.

http://www.nature.com/physics/looking-back/kroto/kroto.pdf"
13889,"[Matrix elasticity can dictate stem cell lineage](http://www.sciencedirect.com/science?_ob=MiamiImageURL&_cid=272196&_user=655046&_pii=S0092867406009615&_check=y&_coverDate=2006-08-25&view=c&_gw=y&wchp=dGLbVlS-zSkzS&md5=378a9d3770e4afcb3787320cb0eace50/1-s2.0-S0092867406009615-main.pdf)

I find this paper fascinating - mechanotransduction as a field seems to be growing exponentially and showing this profound an effect is really cool."
13890,"Here's a good list, with more being added each week:
http://greatexperimentsblog.blogspot.com/"
13891,"I used to work in programming language design and the following paper on planning for growth -- for unexpected uses in the wild -- is a delightful and brilliant read:

[Steele, G. R. Jr. (1999). Growing a language. Higher-order and symbolic computation, 12, 221-236.](http://cs.au.dk/~hosc/local/HOSC-12-3-pp221-236.pdf)

The paper works really well as a [talk](http://video.google.com/videoplay?docid=-8860158196198824415) because of its unique and surprising rhetorical structure."
13892,"The Expensive-Tissue Hypothesis by Leslie Aiello. The actual article [here](http://www.jstor.org/pss/2744104) needs JSTOR access, but she published a very similar paper in the Brazilian Journal of Genetics [here](http://www.scielo.br/scielo.php?pid=S0100-84551997000100023&script=sci_arttext).

Amazing read. Best article I've ever read on human evolution."
13894,What has really helped my scientific writing alot is editing articles in Wikipedia. Perhaps an assignment for your students could be to edit or write (or atleast verify) an article on the site?
13895,"I am a scientist, and I normally would not read papers using the method described in the articles you posted. If a nootropic's effectiveness is so speculative that it depends on the exact conditions of one experiment, I don't think it should be recommended. Even totally correct papers vary in their results. Reading just one paper is a classic failure mode that I think you should warn against more heavily, e.g. http://slatestarcodex.com/2014/12/12/beware-the-man-of-one-study/

Assuming you have a limited time for reading, it's safer to read broadly instead of deeply. Review articles are good for this, but that failing, you can just read several papers from different labs. For a typical nootropics paper, I think the abstract will often be all you need: the dose, time, number of patients, and the results. The only reason to dig deeper than this is if the abstract is incomplete (sadly common) or if you are going to draw precise conclusions from one study, which you shouldn't do anyway."
13896,"Thanks for the comment on review articles.

**People need to take this seriously**

Libgen is great for searching and if you use the word **review** in your search you will greatly limit the super specific links from your search, and get a start on an overview.

Thanks for the reminder.

edit, also because you are in the science fields you can see the limitations of the ""quick advice"" for the uninitiated.

I did most of my actual lab research in the [pharmacology department at Dal University](https://www.dal.ca/search.html?stype=main&_charset_=UTF-8&q=pharmacology) back in the '80s but I am no longer current."
13897,"Fellow scientist/academic, came here to say exactly this. Never draw conclusions from one study.

Regarding reviews and might be obvious - several reviews might be written on the same subject. *Try to always find the most recent one*, if it's a well-studied subject you might find critically different data."
13898,"Ah yes, academic journals, the original masters of search engine cloaking (making content available to Google Search but not to people actually following the link)."
13899,"Wow, I just used libgen minutes ago to get the full pdf of the new study that shows humans have 27 emotions. Worked like a charm."
13900,"Great tool to put learning to the masses.

I have donated to SciHub because they are awesome.

I also disable ad blocker on the open science sites."
13901,"The founder of Sci-hub is a neuroscientist who lives in hiding to maintain this service. Elsevier recently won $15 million in damages against her. ""Public good"" arguments were rejected by the court. Here is a comment on the ruling from Matt McKay, a spokesman for scientific publishers:

""Sci-Hub does not add any value to the scholarly community. It neither fosters scientific advancement nor does it value researchers’ achievements. It is simply a place for someone to go to download stolen content and then leave"".

https://www.nature.com/news/us-court-grants-elsevier-millions-in-damages-from-sci-hub-1.22196

Please donate to this amazing service if you can afford to.

Off topic but the service continues an idea that may have been popularized by Aaron Swartz, who was indicted by a federal grand jury on charges of wire fraud, computer fraud, unlawfully obtaining information from a protected computer, and recklessly damaging a protected computer. Swartz automated a laptop stashed in a closet at MIT to download scientific articles from JSTOR. He committed suicide in 2013 after contributing to multiple projects that enhanced the internet including RSS feeds, Creative Commons, and Reddit.

https://en.wikipedia.org/wiki/Aaron_Swartz"
13902,"**Aaron Swartz**

Aaron Hillel Swartz (November 8, 1986 – January 11, 2013) was an American computer programmer, entrepreneur, writer, political organizer, and Internet hacktivist. He was involved in the development of the web feed format RSS and the Markdown publishing format, the organization Creative Commons, the website framework web.py, and the social news site Reddit, in which he became a partner after its merger with his company, Infogami.

Swartz's work also focused on civic awareness and activism. He helped launch the Progressive Change Campaign Committee in 2009 to learn more about effective online activism.

***

^[ [^PM](https://www.reddit.com/message/compose?to=kittens_from_space) ^| [^Exclude ^me](https://reddit.com/message/compose?to=WikiTextBot&message=Excludeme&subject=Excludeme) ^| [^Exclude ^from ^subreddit](https://np.reddit.com/r/Nootropics/about/banned) ^| [^FAQ ^/ ^Information](https://np.reddit.com/r/WikiTextBot/wiki/index) ^| [^Source](https://github.com/kittenswolf/WikiTextBot)   ^]
^Downvote ^to ^remove ^| ^v0.27"
13903,Woah that sounds pretty interesting. Can I get the name or something of that?
13904,"""Self-report captures 27 distinct categories of emotion
bridged by continuous gradients"""
13905,"please name them, very curious"
13906,"Here is a tweet/graphic with a list of them:

https://twitter.com/SteveStuWill/status/906746916825833472"
13907,"Awesome. I use Sci-hub frequently, but I didn't know they had a Chrome extension. Also didn't know about Libgen. Good way to start my day, thanks!"
13908,"I use the Chrome extension, it works better than directly from the site."
13909,"Just so I'm sure, are you talking about [this](http://imgur.com/a/VNFrQ)?"
13910,"^(Hi, I'm a bot for linking direct images of albums with only 1 image)

https://i.imgur.com/eBZEAEw.png

^^[Source](https://github.com/AUTplayed/imguralbumbot) ^^| ^^[Why?](https://github.com/AUTplayed/imguralbumbot/blob/master/README.md) ^^| ^^[Creator](https://np.reddit.com/user/AUTplayed/) ^^| ^^[ignoreme](https://np.reddit.com/message/compose/?to=imguralbumbot&subject=ignoreme&message=ignoreme) ^^| ^^[deletthis](https://np.reddit.com/message/compose/?to=imguralbumbot&subject=delet%20this&message=delet%20this%20dmuy2fj)"
13911,same for me as it comes to sci-hub. just two clicks. I'm in heaven.
13912,"[Publish or Perish](https://harzing.com/resources/publish-or-perish) will search the literature for you and give you useful meta-information, like the impact of the paper and authors (so you know if something was published in a garbage-tier journal). It's good for getting into a new literature.

[SJR](http://www.scimagojr.com/journalrank.php?area=3200&order=sjr&ord=desc) is good for getting journal rankings. Not all scientific journals are created equal!

There are also open-access journals like [Frontiers](https://www.frontiersin.org) and [PLOS](https://plos.org).

You can also search for newer articles in pre-print archives like [bioRxiv](http://www.biorxiv.org/) and [PsyArXiv](https://psyarxiv.com/). 

Lastly, if you find some article you want to read and cannot find it somewhere else, find the corresponding author and send them a short, polite email asking for the paper. No need to elaborate on who you are or why you want it, just ask. It's so easy."
13913,thanks for this - more things to look at as time allows
13914,+1 for libgen. They also have a great selection of ebooks.
13915,"Wow, libgen is pretty slick. Thanks for sharing!"
13916,[booksc](http://booksc.org) has a nice smattering of hard to find stuff
13917,Awesome post. I had only used pubmed in the past. Thank you!!
13918,"I know this doesn't apply to everyone, but it is worth saying: 

If you enrolled in college, even once, even for a short period of time, your login-in credentials probably still grant you access to everything your school's library subscribes to. I can still login and use resources for three different institutions. None of which I have attended in years. 

(This is fairly common knowledge, but sometimes people graduate and forget they can do this.)"
13919,":( I wish (it were permanent).... I used that for a year after graduating, and then it stopped working. As soon as my college email address was eliminated, so was access to all this science.

So grateful for this guide"
13920,For science!
13921,"You can also try to email the author. I have publications, if you email me I'd send you the paper."
13922,"WoW!
Thanks man! 
In our time of occurring everywhere paywalls this is a great post!

FYI: sci-hub was established by a woman from Russia. And this source cut off access for Russians because of extremely inadequate, offensive behavior of Russian scientists towards the creator of the service. ( here are more details http://foreignpolicy.com/2017/09/06/the-worlds-largest-free-scientific-resource-is-now-blocked-in-russia/ )"
13923,Please update this with suggestions you have found as well.
13924,"This is awesome - thank you, Gordon!"
13925,"It took some time to write up, but it may help us avoid ""bro science""

I hope people read the ""how to read science journals"" stuff, as you waste way too much time trying to figure stuff out from the abstract if you are not current in the field.

I suggest the following order when you have the actual article.

[1] Read conclusion (this is what the well informed people think it means)

[2] Read the intro - they put background info in for people not fully current in their field.

[3] Read discussion - they talk about limitations of their study and warn of dangers of wrong interpretation."
13927,"Sci-hub worked for me every time. If it doesn't, check back in a day or two... bam.

Thank you for the usefull info :)) I really appreciate it and will come in handy when the sci hub is down."
13928,"Thanks man, I was looking for this"
13929,This is awesome. Wish I had this Reddit post when I was at Uni. Although none of these would have existed when I was at Uni.
13930,Thank you. Bookmarked.
13931,"I just bumped into a book I want on BookSC that is available, but only through the TOR network

This link explains it.

http://b-ok.org/msgn/tor"
13932,Thanks a lot from a random scientist who still encounters paywall'd stuff from time to time. LibGen was painless and super helpful!
13933,"You forgot Sci-Hub.

LibGen is also great for textbooks. You can get just about any edition of the popular textbooks for major classes, in searchable PDF format."
13934,Google Scholar (not regular Google-- use Google Scholar)
13935,It's not limited to CS but there is ([https://arxiv.org/](https://arxiv.org/))
13936,Try to figure out the most important conference and journals and check their programs/recent issues.
13937,This! You will find a lot of non-published work on arxiv and Google scholar. Looking at the top conferences for a subject you're interested in is the best route if you want to find good work.
13938,https://en.wikipedia.org/wiki/List_of_computer_science_conferences
13939,"ACM Digital Library: https://dl.acm.org/

IEEE Xplore: https://ieeexplore.ieee.org/

Dimensions: https://www.dimensions.ai/

Lens.org: https://www.lens.org/

MDPI: https://www.mdpi.com/

I use these databases and search engines in my CS research."
13940,"Your local library. Seriously.

A few years ago I wanted to find a copy of “Mutually Orthogonal Latin Squares of Order 10” by E.T. Parker, mentioned in Knuth’s “Selected Papers on Discrete Math”.

Couldn’t find it online anywhere, but found it had been published in conference proceedings in 1963.

Went to my local library.  They didn’t have it, but told me they could probably find it.

3 days later I had the freshly scanned pdf emailed to me, along with a request to pay $3.81 next time I came by the library.

This isn’t some major university library either... this is the local community library in Purcellville, VA."
13941,Damn.
13942,[Papers We Love](https://github.com/papers-we-love/papers-we-love) is another very good one on Github
13943,"One professor's opinion, recorded earlier this year:

https://youtu.be/YFUIPg8P2sY?t=578"
13944,"There are an _enormous_ number of academic CS papers. They're all archived on [Google Scholar](https://scholar.google.com/), but that's like saying ""how do I find good websites?"" ""Use Google."" You really need a more specific query than that.

If you find a sub-field that's particularly interesting to you, then you can look for conferences related to that field. The [Association for Computer Machinery (ACM)](https://dl.acm.org/conferences) hosts many, but far from all, computer science conferences. If you find a conference that's interesting to you, like Computer Supported Collaborative Work (ACM-CSCW) or Hypertext (ACM-HT), then that gives you a much more specific starting point, and you can look at publications from that conference to get a starting idea of what's going on in the field, then use the topics and keywords you've gained to search Google Scholar and find related papers from other conferences and journals."
13945,semantic scholar
13946,Paperswithcode
13948,https://www.researchgate.net
13949,"A couple have already mentioned it, but I just wanted to give another shout out to IEEE Xplore. Bloody good resource, even using Google Scholar it's likely where you'll end up."
13950,dblp
13951,Check what sources Wikipedia articles use for the topics you are interested in.
13952,"PhD student here: ACM, IEEE (lots of journals but can't access much without using a Russian website or paying), and Google Scholar are my go tos for general searching. If I want to dig deeper I have to start looking at conference proceedings. That's where the CORE conference portal helps. Just type in something like ""artificial intelligence"" and it will come up with conferences that have to do with AI. It also ranks them so you get an idea of how good they are. 

http://portal.core.edu.au/conf-ranks/

Edit: grammar"
13953,For IT template you can visit: [https://gmpwebsource.com/collections/it](https://gmpwebsource.com/collections/it)
13954,You can use sci hub to bypass paywalls.
13955,[PaperwithCode](https://paperswithcode.com/) the best one
13956,Libgen and scihub
13957,"The best place is probably a journal subscription.  
  
If you are attending college your school's library may provide access to some things or you may be able to get something from a professor who has a subscription.  
  
Otherwise, google away and maybe check out the other websites people have mentioned.  
  
P.S.  
It may help to familiarize yourself with technical terminology and specific fields of study. Searching for ""computer science"" is too broad as compared to: artificial intelligence, machine learning, operating systems, cryptography, etc."
13958,"I think conferences are a better bet. Journals are not as prestigious in CS. Nonetheless, there's also a bunch of good stuff in journals."
13959,Really?
13961,"Do you have any justification? In my opinion conferences in CS are the same as elsewhere: more common, easily to get accepted, shorter papers, more specific topics, less impact overall."
13962,"It's just the culture. Most of the major breakthroughs came from conference papers and everyone wants to publish at the top conferences. For example, want to publish ML stuff, NeurIPS and ICML are the most prestigious venues. Distributed systems or operating systems? Publish at OSDI or SOSP. Security? USENIX security is where you want to publish.

There are probably some other historical reasons as to why conferences are more prestigious, but one of the reasons is because papers are smaller. Often no one will read a 40  page long journal entry, when a 14 page conference paper suffices. Also, not wanting to sound accusatory, but are you in the research community? Because it's definitely not true that journals are harder to get accepted or have more impact. Not that there aren't good journal papers, but the community definitely cares way more about conferences."
13963,"Emailing (politely) to the ""corresponding author"", asking for an electronic reprint, is also a very good strategy to get a copy of a paper behind a paywall."
13964,"I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:

- [/r/advancedmathematics] [A Guide to Finding Paper and Textbook PDFs.](https://www.reddit.com/r/AdvancedMathematics/comments/bul3uo/a_guide_to_finding_paper_and_textbook_pdfs/)

&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*"
13965,"I'll kindly plug [/r/Scholar](http://www.reddit.com/r/Scholar/), where you can conveniently request a specific scientific article for purposes of fair use!"
13966,Yes! I meant to mention that in my original post: /r/Scholar and /r/Scientific are complementary reddits.
13967,You should link /r/scientific on the /r/askscience side bar.
13968,I have an upcoming paper and good relevant articles can be very time consuming to find. Thanks :)
13969,"There is a subreddit for everything!

I thought that this would be a neat idea, looks like it was already implemented. Sometimes there are just some papers that I don't have access too / interlibrary loan doesnt work."
13970,Hi everyone! I'm /r/scientific's creator and moderator. Feedback welcome!
13971,"I apologize in advance for my cynicism but I don't see how this idea is going to work. There are just too many fields of science and scientific papers tend to be in niche and esoteric subfields. I don't know if it is possible for a subreddit, but a tag cloud or some other method to categorize the papers by discipline would make it a lot more readable."
13972,"I know this is one of the main limitations of this idea, but it can also be one of its strenghts: instead of wasting your time reading the same pop-sci articles again and again on /r/science (""scientists invent time travel!), you have the chance to read and learn about what scientists are actually doing. It doesn't matter if you don't understand everything."
13973,"IANAS, so I will gladly lurk in your subreddit (unless I happen upon a particularly interesting paper).  Cheers.

*Edit*: Question: If I do happen upon a paper I would like to share, is there any limitation I should keep in mind in terms of age? In other words, hypothetically, would it be appropriate to post a paper that is, let's say, a few years old?"
13974,">Question: If I do happen upon a paper I would like to share, is there any limitation I should keep in mind in terms of age? In other words, hypothetically, would it be appropriate to post a paper that is, let's say, a few years old?

As long as it's interesting and not universally known, I don't see why you couldn't share it. Even Einsein's papers would probably be interesting :)"
13975,"Cool, I kind of did the same thing, except the subreddit was for papers that I thought was interesting. It's only been in existence for about 2 weeks though. Will subscribe to yours. :)"
13976,Don't hesitate to submit papers you find interesting!
13977,"while you're at it, check out /r/scientists which is for topics of interest to scientists!"
13978,"Heyyyy, did not know of this one!"
13979,http://www.reddit.com/r/scientists For the lazy.
13980,"Off topic, but there are some things I can't unread.

Is bioactive glass actual silica-based glass that has been functionalized or study of various glasses that can be modified by cells sort of like a cleavable peptide in a PEG gel?"
13981,"Funny stuff, my tag always sparks curiosity.  Bioactive glass can be a silica-based or borate-based functionalized glass.  Its different from ""window"" glass in that the silica content is reduced to around 50% and much more active components such as sodium oxide and calcium oxide are introduced.  

Bioglasses (BGs) are low silica glasses with the ability to bond to living bone. They can be designed to resorb into the body or maintain bonding with soft or hard tissues in a physiological environment. BG is able to facilitate hydroxyapatite formation through dissolution in a physiological solution; hydroxyapatite is the chief mineral component of bone, having a chemical formula of Ca5(PO4)3OH.
Bioactive glasses have been used successfully in applications involving ossicular prosthesis (middle ear implant) to restore hearing; another application involves endosseous ridge maintenance implant (ERMI) which fills the cavities of extracted teeth to maintain the strength of the jawbone prior to denture fitting, to prevent erosion of bone due to extended use of dentures. Periodontal disease causes gaps surrounding affected teeth, bioglass particulates are used to fill the void and induce natural bone growth. Some bioglass particulates are used in dental fillings too.
I hope this answers your question."
13982,"Well that is absolutely fascinating.  

I just grabbed [this](http://www.ncbi.nlm.nih.gov/pubmed/16504284) review by Boccaccini to do a little more reading on the subject, seemed to be the most recent highly cited review.  Any other crucial papers you would recommend?  

(I also blame you for the 3 hours I'm inevitably about to lose)"
13983,"I am pleased that you have researched the topic!  It is always a pleasure when people discover glass can be used in many applications.
I intend on having Boccaccini as one of my reviewers in an upcoming paper, ironic that you chose one of his papers.
Hench is essentially the father of bioglass, he has a nice review of technologies encompassing both the bioceramics and bioglass.  

[Hench Review 1](http://dev.ceramics.org/wp-content/uploads/2009/03/hench_bioceramics.pdf)
[Hench Review 2](http://fab.cba.mit.edu/classes/MIT/960.07/people/Lafuente_Luis/hw0305/Science295_1014_02.pdf)

These reviews provide a good overview of the technologies as they  exist, or where they are headed.

What aspects of it interest you?  I might be able to point you in the direction of some good papers."
13984,"Sorry if this is painfully obvious, but I was just perusing /r/HardScience, and I'm not sure what distinguishes it from /r/science?  What's the mission statement (or whatever) for the subreddit?  Don't get me wrong, it looks so nice I frontpaged it, I was just curious about its intended purpose.

Edit: is it the level of rigor/jargon of the postings or discussion?  I also just noticed /r/SoftScience, and there does seem to be a difference on that level."
13986,">Well it used to be anyway, now it seems that r/scientific takes it place until that gets overrun or sloppy.

It shouldn't get sloppy, because moderation rules are very clear: stuff that is not scientific papers will be deleted.

Also, it's not limited to ""hard science"". Any scientific field is welcome."
13987,"If I get all my papers through a proxy server, what is the best way to post to r/scientific so that others without a subscription can still read them?"
13988,"This is a good question, and I don't have an obvious answer. Of course, you could paste them in a filesharing site, but that would be illegal..."
13989,i don't suppose posting them as a comment is legal either is it?
13990,"Of course not, but I think people in some countries are less at risk then others."
13991,"I'm curious to see how this will work out... I'm afraid I might have the same experience I have when browsing *Science* or *Nature* -- the stuff from my field is awesome, and the other 90% of the journal is incomprehensible because I'm not a specialist in material science or a branch of chemistry."
13992,"I love the idea of this, but may I request a new semicolon-ism for those of us who need a dumbed down version?

TI;CR: Too Ignorant; Couldn't Read"
13993,"What's the difference between /r/HardScience and /r/Scientific ?  I swear that's exactly what HardScience is (though checking its side panel seems to be empty), so I guess someone could post to trashy blogs there though I've never seen it done."
13994,"I'm totally going to be an asshat and mention the subreddit I created. [/r/Sciencelounge](http://www.reddit.com/r/ScienceLounge/) is for scientists, grad students, whoever is working directly in science. 

We have a lot of humor here that doesn't get let out and no real subreddit to do it in. Come share your frustrations, stories, jokes, ""nailed it"" triumphs, whatever. 

Maybe we don't need it, but I personally feel like I would love a place where I can casually talk about stuff that only we get."
13996,Ooooh. Do people actually post?
13997,But /r/hardscience is supposed to be only links to scientific papers anyways. What niche is it filling besides being another dying subreddit with redundant subreddits to take its place?
13998,"Does anyone else feel that reddit should move to a tag based system (e.g. like gmail.com or stackoverflow.com)?

Reddit's community is getting fragmented across multiple subreddits with overlapping content."
13999,"There was some discussion about this a while back. It seems like the idea crops up every now and then.

I personally don't mind this ""fragmentation"". Each community is a microcosm and fully in control of their little sphere, and yet they are all part of a giant transcosmic network: cross-posts happen when somebody in one microcosm discovers something interesting to another microcosm, and while some redditors will be subscribed to both subreddits, that's not really a problem.

I'm subscribed to practically **every** science-related subreddit, and I have not once been annoyed by a double post."
14000,"This is *somewhat* related idea that I was thinking. If you haven't been to the IAMA sub they added a nice feature where posts get tagged if theyre verifiable or if they are probably a troll, etc. It would be cool if we could tag posts either colors that match the panelist colors **or** a system to tag non-science, previously asked question, etc. It's more work but again I'd be willing to do it."
14001,"That's actually a pretty good idea. That is, of course, if the mods (or panelists) have enough time between answering questions to make this feasible."
14002,"Yep, I think it would require one person dedicated to it."
14003,">Reddit's community is getting fragmented across multiple subreddits with overlapping content.

I don't see that as a problem. The goal of the subreddit system was precisely to allow multiple communities with conflicting interests (people who love pun threads in every link vs. people who like in-depth discussion, for example) to live together."
14004,"shameless plug: [/r/environmental_science](http://www.reddit.com/r/environmental_science/). the goal of this subreddit is to foster discussion, analysis, debate, and to aid research in the area of environmental science or geoscience."
14005,How is /r/science a mess?
14006,"A while ago we tried to do the same thing with [/r/hardscience](/r/hardscience). Didn't end up sticking. Best of luck though.

edit: Just saw that you mention /r/hardscience. What niche is it fulfilling beyond the laying stagnant one?"
14007,"Well, there's been a couple of submissions so far, but I would like to point out my subreddit [r/LaymanJournals](http://www.reddit.com/r/laymanjournals). It's intended more for generally accessible content, whereas r/Scientific might be more specialized, but I am vain and jealous and want to give one of my children some due respect. And if you want to put it on the sidebar, I wouldn't mind :)"
14008,Gen.lib.rus.ec also works as well! It’s the mirror version I use when any others are down
14010,"Thank you for commenting this site, I just checked it out and found some books that I've been looking for forever but haven't been able to find on libgen or anywhere else"
14011,"Thanks, opened a new world for me."
14012,Bookfi.net
14013,you are a savior
14015,Does this work for iphone?
14016,Works on android as well btw
14017,"Thanks, didn’t know that!"
14018,What app would you use for it to go onto? My phone Dosent have a book app like my old iPhone
14019,"Play Books would be the Android equivalent of the Books app on the iPhone.

Lithium if you want a third party, clean reader.

Moon+ reader is regarded as the best overall reader though, in terms of how customizable it is. So pick your poison."
14020,I like AI reader
14021,Lithium epub reader
14022,I use ReadEra :)
14023,Play books or just any app that reads ebooks
14024,"On my samsung it's ""my files"""
14025,You can use tht but other apps have way better interfaces
14026,"fbreader is the best on android. a lot of customisation, change fonts, margins, colour etc"
14027,"I use an app called FBReader, I've been using it since I got my old HTC Inspire back in like... 2011?"
14028,Better ILPT just fuckin visit /r/piracy and look at the megathread.
14029,Happy Cake Day!
14030,Oh shit! Thanks I didn't even notice!
14031,Great!!
14032,"The app called Overdrive connects to my library and I can borrow ebooks to kindle and audiobooks to the app for free, just like a library."
14033,Really? My local library doesn’t do that. I would also want to know are all books in eBook format or just select ones?
14035,"It works really well.  Our library has a lot of cool resources like that.  There's Hoopla, which has movies, music, and graphic novels.
There's an app that lets you download magazines, a service that lets you download drm-free not-obscure music, and there are a couple of other, smaller ebook databases."
14036,"You should check online for some of the major cities near you. For example, I didn’t have a local library card but I found I could get a Houston library e-card online. And I have been able to use it for Overdrive and Hoopla to check out ebooks and media. You could even try Houston, I can’t remember if there was a state requirement or anything for it."
14037,"If the book expires and you still want to read it, just set your date and time back."
14038,Anyone have anything for Audiobooks?
14039,[Audiobookbay](http://audiobookbay.nl)
14040,I have never been able to login to that site :( Tried creating an account 3 times. What am I doing wrong?
14041,"What issue are you facing? This is the signup page.

http://audiobookbay.nl/member/users/index?mode=register

You need to ensure you press the grey Torrent download button, the other two are just external sites.

Then once you've done that, it should ask for username & password details and email, and then voila account created. I just did it now so it is working.

Let me know if you still can't fix it and i'll create the account for you."
14043,Do you have to make an account?
14044,Mobilism i think
14045,"I just searched for an ePub book by author, clicked a mirror, clicked download, and it opened in iBooks on my iPhone. Am I missing something? Seemed too easy."
14046,Nope. I just over explained to avoid stupid comments.
14047,Like u/HonkyMagooo 's
14048,I was afraid of that...
14049,Do you need to use a VPN for this
14050,"I have to because virgin media blocks the site, but I’m using a free mobile one and it works without issue"
14051,"Mind if I ask which one? And if you know whether it's for Android, iPhone or both? I tried a few of the highest rated free VPNs on the play store earlier this year but they were all horrendously slow (I don't think I saw speeds above 20kb/s). I have virgin too, seems they're blocking more and more stuff recently."
14052,Lpt: pay for a premium vpn if you don't like the free ones that are all complete garbage cumdumpsters
14053,Windscribe is actually really good and is free
14054,I got it pro lifetime for $30 off of the xda developers market
14055,"That’s a good deal, but I’m using the free version where it refreshes monthly. I think I might like it so much because I don’t always have it running. And I also like how you can earn permanent upgrades without spending money. Great deal for when you’re brokeboi ™ like myself"
14056,"I use VPNProxyMaster for iPhone, works pretty well for smaller vpn usage from time to time. I remember there was a way to bypass all the virgin media blocks by changing the DNS’s but i forgot the video that talked about it 🥶"
14057,I never have. Probably will once my ISP sends me a warning.
14058,"I've never had a problem. And my ISP has sent letters to me about downloading movies. 

You're safe."
14059,"Amateurs.

Go to

https://github.com/Igglybuff/awesome-piracy"
14060,nice. thanks
14061,I can never find my books in these sites
14062,"check r/Piracy megathread, has lots of good ebook pirate sites"
14063,"Here's a sneak peek of /r/Piracy using the [top posts](https://np.reddit.com/r/Piracy/top/?sort=top&t=year) of the year!

\#1: [Avengers.Endgame.2019.2160p.BluRay.REMUX.HEVC.DTS-HD.MA.TrueHD.7.1.Atmos-FGT](https://np.reddit.com/r/Piracy/comments/b81pjb/avengersendgame20192160pblurayremuxhevcdtshdmatrue/)  
\#2: [Sigh](https://i.redd.it/d3423w2g5ur21.jpg) | [1145 comments](https://np.reddit.com/r/Piracy/comments/bce78n/sigh/)  
\#3: [Piracy FTW](https://imgur.com/7mMWdkJ) | [543 comments](https://np.reddit.com/r/Piracy/comments/a6xasl/piracy_ftw/)

----
^^I'm ^^a ^^bot, ^^beep ^^boop ^^| ^^Downvote ^^to ^^remove ^^| [^^Contact ^^me](https://www.reddit.com/message/compose/?to=sneakpeekbot) ^^| [^^Info](https://np.reddit.com/r/sneakpeekbot/) ^^| [^^Opt-out](https://np.reddit.com/r/sneakpeekbot/comments/ciakte/blacklist_vi/)"
14064,"So.. I have an iPhone, I followed everything said, and nothing is appearing in my Books app. Help?"
14065,"Epub should just download and say “Open in Books” 
I downloaded a pdf from [https://b-ok.xyz](https://b-ok.xyz) and I had to press the middle button on safari to share. The book option popped up and it opened it there. Doesn’t look as clean as a epub one"
14066,Thank you! It was the pop up that wasn’t showing up. ♡
14067,Sick i didnt know about this website. Thanks bro
14068,our school gave us this lol
14069,u got a clown school 😂
14070,got me my free textbooks so i'm good
14071,I have android
14072,"Not relevant, epub and pdf are universal."
14073,"There's an app called Anybooks, has lots of books and it's free. I've been using it for a few months now"
66611,Why?
14075,Because it's a lot better for people who like doing things their own way and customizing their hone as much as possible
14076,Don't forget price and repairability.
14077,"Jailbreaking is a thing, but android does it better"
14078,And iPhones have bullshit prices
14079,Apple products are for the technologically feeble.
14080,Big OOF. lol
14081,I could spend hundreds for a iphone with a screen big enough to read on or a $20 android/kindle tablet that does it better anyway.
14082,Does this site have University textbooks?
14084,Do you know any other websites that are more directed towards textbooks? I don’t want to be paying 250/book when i go to college
14085,Thank you so much. Got anything for audiobooks?
14086,"Audiobookbay, Mobilism"
14087,"After downloading audio from audiobookbay, I put it on my phone and use the app smart audio book player to play it. Just like audible but free"
14088,fuck the formatting.. this post was a life-saver. Thank you my friend
14089,"god bless Russia

the land of opportunity"
14090,literally made this post right after I downloaded a book called a Gentleman in Moscow
14091,Or just go down to your local library and stuff books in your backpacks and or purse and sneak them out of the library the old fashioned way
14092,Since we are doing books can someone find me the book called naoko by keigo higashino ? I've been searching for it for over 5 years now. The Amazon copy is fucking overpriced in my country
14093,"Thank you but a little more emphasis on how ILPT this is, would make it more satisfying beyond useful."
14094,you mean more emphasis on the part of it being piracy/illegal?
14095,That's the spirit!
14096,It's one of those things where it's illegal but nobody is going to care. Book companies don't go balls out like movie producers.
14097,Thank you so much for this!
14098,will it appear in apple books or is it another app?
14099,It works in Apple Books
14100,!remindme 2 days
14101,"I will be messaging you on [**2019-08-15 22:58:16 UTC**](http://www.wolframalpha.com/input/?i=2019-08-15%2022:58:16%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://np.reddit.com/r/IllegalLifeProTips/comments/cpzfsg/ilpt_free_ebooks/ewswyjc/)

[**1 OTHERS CLICKED THIS LINK**](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FIllegalLifeProTips%2Fcomments%2Fcpzfsg%2Filpt_free_ebooks%2Fewswyjc%2F%5D%0A%0ARemindMe%21%202019-08-15%2022%3A58%3A16) to send a PM to also be reminded and to reduce spam.

^(Parent commenter can ) [^(delete this message to hide from others.)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%20cpzfsg)

*****

|[^(Info)](https://np.reddit.com/r/RemindMeBot/comments/c5l9ie/remindmebot_info_v20/)|[^(Custom)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://np.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://np.reddit.com/message/compose/?to=Watchful1&subject=Feedback)|
|-|-|-|-|"
14104,because i want to build a web server for all my books
14105,I'd recommend sumatrapdf to view .pdf and .epub files
14106,"There are no numbers under mirror, am I missing something?"
14107,Idk. Try some of the other websites people have mentioned in the comments
14108,"Do you go to an IB high school? I do, and the kids there use this all the time."
14109,"Is that like an AP high school? If so, yes"
14110,Tysm!!
14112,Does this work for Kindles?
14113,"For my kindle, I get any book I want in any format from either the website op mentioned or b-ok.org. 

Then I use a program called Calibre. It's free. It converts my book files to the correct file for kindle. Then I email the file to my kindle from Calibre. Free books for the past 2 years has saved me so much money"
14114,Thanks for the tip! I'm definitely going to try it!
14116,B-ok.org is legit
14117,what's the difference betwen that and [https://b-ok.cc/](https://b-ok.cc/) ?
14118,Mirror?
14119,Exactly why I love this sub
14120,I've never found a book I've needed on these websites... Am I doing something wrong?
14121,"Make sure you’re choosing the right genre. If you are, try b-ok.cc (i think that’s the url)"
14122,Will this work on Android and Windows too?
14123,"As long as you have an epub reader installed, yes."
14124,b-ok.cc is my go to
14125,This is common sense not a tip at all
25363,cool
14127,"A) does this work on a kindle? B) someone asked something like this, is there an audiobook version of this free hack?"
14128,"A) No idea, you could try hooking up a kindle to your computer and transferring the file?

B) Audiobookbay and Mobilism are two i think someone mentioned"
14129,"You can also use this [textbook search engine](https://courseherounlocker.com/wp/free-textbooks/) which makes it easy to find most textbooks. It does not index libgen (Google's fault), so you can check both."
14130,Epubs also work on kindles if you have one
14131,Anything similar for audiobooks?
14132,Could go to archive.org ..... they got books
14133,It amazes me that anyone from public high school/university doesn’t know this
14134,/r/FreeEBOOKS
14135,Thank you so much! Your a lifesaver!
14136,Bruh !! Thank you so much
14137,"Thanks, man."
14138,Ahhhh life saver! Thank you so much!
14139,Thank 🙏💕 you so much!
14140,Holy shit this is legit as fuck
14141,There's this place called a library where you can get books for free
14142,LPT: Free Books and eBooks. Visit your nearest library and check out the book that you want!
14143,"I suppose if you want only a tiny fraction of the selection this site has, and you'd rather travel to search and borrow for a short period instead of downloading it in several seconds and keeping it forever, then yeah go to a library."
14144,"As I said in another comment, I was making a joke, not trying to discredit the original post."
14145,Ehh too much work
14146,Egg. Library doesn't carry half the books I read.
14147,"If my local library had even half the books in stock that I search for, I'd be there. I prefer the feeling of an actual book. But this website is awesome. Used to have to navigate torrent sites to hope to find a book. This has everything I've looked for so far"
14148,"Agreed. I was just making a joke, not trying to discredit the original post."
14149,Anyone else wanna get all the viruses and tell me how bad they are?
14150,"Haha, i’ve actually used it for [so many books](https://imgur.com/gallery/Y63xJrB)  and never gotten a virus."
14151,I got through high school and college with this website. I haven’t spent any money on books I’ll never look at after school was over. It’s a great resource.
14152,"As long as you don't download .exe files thinking that they're ebooks, you should be fine."
14153,"Both PDFs and EPUBS are fully capable of executing malware.

Wiki: An EPUB file is an archive that contains, in effect, a website. It includes HTML files, images, CSS style sheets, and other assets.

Don't need to elaborate on PDFs, of course."
14154,"Thanks, that's good to know, I've never heard of malware in epubs before, so I guess they are not that popular target (also I'm pretty sure ebook readers are way less vulnerable to viruses)."
14155,"They definitely are, especially since they usually get passed through legal mediators like Amazon, just gotta be careful these days."
14156,"You can't hack with HTML, hun."
14157,"... You can't... cause problems... with a website...

Yikes. Good luck out in the real world. You'll need it."
14159,"... ... What the fuck is going on here? Is this reality? 
I have no idea how to respond to people who think HTML and CSS can't be used to execute malware. Good luck browsing the internet."
14161,"Holy shit man, you think scripts are required to install malware from a website? How did malware pass via websites before CSS?
Please stop talking to me about this. It's fucking insane to have to argue with people about whether or not HTML and CSS can vector malware."
14164,... I have no idea how to respond to people who think HTML and CSS can't be used to execute malware. Good luck browsing the internet.
14165,"Yeah, the only time my phone/computer notified me of a virus was an .exe file"
14166,Or .APK
14167,Do books even come in .apk?
14168,Drive by drive viruses do
