idx,text
16661,"I have a leopard gecko, my 2.5yo loves ""helping"" me feed crickets to her!

(This is not a recommendation of a gecko for a 3yo--Miss Elizabeth Lizard is my pet, not my kid's)."
16662,"Hey..on a scale of stupid easy to super difficult, how hard is it to properly care for a gecko?

I kinda want to get one, but I haven't had a lot of success in the past with ""high maintenance"" pets. :("
16663,"Leopard geckos are the most basic of reptiles to keep after the initial start to set it all up--if you aren't sqeamish about also keeping live bugs for them. I would say quite low-maintenance overall, with periodic need for cleaning the tank and obviously feeding every 2-3 days.

But the geckos themselves don't need a special light the way some lizards do (either for UV or for heat). 

--They need a warm area on one side of the tank so they can move around according to their temperature needs. You use an under-tank heater, which is a flat pad that's sticky on one side, you just slap it on underneath. 

--They need a ""damp hide"" for when they molt, to help their skin come off, a small tupperware box you keep damp, there are different ways to do this from keeping paper towel wet (easy but dries fast and can get moldy) to stuff like the ""frog moss"" i have in mine which comes in a box as dried chunks of moss that retain water for a long time after you wet them. 

--Weekly you need to feed them their crickets dusted with a couple kinds of (inexpensive) powdered vitamin/calcium. Helps keep their bones healthy.

Likewise you need to take care of your crickets--there is powdered food you can buy and premade gel to give them water (crickets are very stupid and will drown easily in a bowl of water). A couple of paper towel rolls in a tall-sided rubbermaid container with holes in the lid and you're good. 

Here are some pics of mine:  
- [Gecko face](http://imgur.com/NEoQg8B)  
- [Current tank](http://imgur.com/z6Eu004) (sorry about the reflections). This tank is a 30 gallon, I used to have gerbils in it years back. You can use a 20-gallon tank just fine too.   
- [Chilling at the rock pool](http://imgur.com/zZ8nAuT). I filled a low and wide plastic container with river rocks and water. The tupperware with the door cut out is her ""damp hide"", and the bowl in front with the powder is the calcium dust. Some people leave it in for on-demand feeding, some don't. (the second supplement still goes on the crickets even if the calcium powder is in the tank.)

My tank has ceramic tile on the bottom. Lots of people discourage using a sand substrate because if they eat it accidentally it can get impacted in their guts and kill them. Also tile is easy to wash."
16664,"Do you HAVE to feed them crickets or can you feed them something else?

>Lots of people discourage using a sand substrate because if they eat it accidentally it can get impacted in their guts and kill them.

That I did know, actually, from watching an episode of *The Incredible Dr. Pol*. This dude brought in his gecko and it was all kinds of jacked up because he put sand in the cage instead of something else. Dr. Pol fixed it (IIRC) but he was like, ""Don't fuck this shit up again. Get rid of the sand. Sand is bad."""
16665,"Oh I liked that show!

Crickets aren't the only food, there is also mealworms, but they're often recommended not to be the staple diet because they have some hard bits that can cause impaction too (their heads mostly I think) however I've also heard this is mostly an issue for baby geckos. I find them more gross compared to crickets because they crawl inside a substrate and can metamorphose into little black beetles.

There's a small kind of roach called nubia roach as well, but they are banned in Canada so not an option for me.

Crickets are a little stinky when you open their box, but they can't bite, and at night they often chirp, which I like.

If you give them paper towel tubes in their box, you can just use the tubes to feed the gecko--crickets will hide inside, so you just cover both ends and tap or shake the tube into the gecko tank. Should peek inside the tube to see how many because if you shake too hard on a full tube you get like 50 crickets in the tank--that's way too many.

Also if a cricket or two escapes your container it's no big deal. They need particular conditions for breed. At worst you hear it chirping for a few days until it dies.

tbh while I don't love having to feed crickets, it is pretty fun watching a gecko hunt them."
16666,"Ok.

How often do you feed the gecko and how many crickets? Do you just go buy fresh crickets every week or two?

I'm from Texas, so when I think ""cricket"", I don't think of something small enough for a smallish lizard to eat. I think of these giant black nasty things that like to swarm all over building walls in August/September during what I assume is breeding season. Eew.

I also have geckos..just not PET geckos. They live in my yard and my garage and are about the size of my pinky finger. [They are SO freaking cute!](http://citybugs.tamu.edu/files/2010/04/gecko1s.jpg)"
16667,"Yours are adorable!! I wish we had those in Canada.  But, winter :/

You know, I don't know where leopard geckos come from originally but they look a hell of a lot like your outside ones! They get bigger though, [see, my wrist for scale](http://imgur.com/NBmc29T) (I'm a lady so it's not a man wrist though). I guess mine is about 7 inches now including tail. 

The feeder crickets are small and brown--they are usually sold in three sizes (small/medium/large) based on age since hatching, so you can end up with a size up from when you bought them if they live that long. Smallest are like, 1cm which is uh... a bit less than half an inch? Really not big. Maybe they reach 2cm full grown but that is still under one inch.

I usually buy a container of 100 mediums that lasts about three weeks. Some die just because, can't really help that. I feed every few days--they don't need to eat daily--about 5-10 crickets at a time. Seems to be enough because my girl has a good fat tail. Leopards store extra fat in their tail :)

Oh and they *can* bite, sort of-they have a reflex to lunge at anything twitchy so especially when hungry you might get nommed. But it's not a strong bite, they have no teeth, and I wouldn't even call it a pinch. It can surprise you, but won't hurt and they can't hang on to you at all."
16668,"Thanks.

We've always had a kind of ""Whatever wants to live here can live here"" policy when it comes to our yard. We don't use any pesticides or insecticides unless we're killing wasps or fire ants. Because fuck fire ants and wasps. We have lots of bunnies (they like our yard cuz no dogs), birbs (although,  fuck the damn mourning doves right in the ass. Seriously. EVERY GODDAMNED MORNING. ""Coo. Coo. We are DOVES. We are the only ones who get to be DOVES. Coo, motherfucker.""), geckos, a few other lizards (anatoles I think probably) and I've seen a couple of small snakes.  I've never understood the ""OMG KILL IT KILL IT ALL RIGHT NOW!"" attitude that a lot of people take when it comes to critters living in their yards. As long as it's not actively trying to assassinate me with a bite or a sting (because again, fuck wasps and fire ants), why should I bother it at all? The critter can go its way and I'll just try to be kind to it. Because they deserve to live too. :)"
16669,"Lmao at the doves. 

We have bunnies around here too, though somewhat rare I will see them a few times a year. 

We had to live and let live with some wasps two years ago because we discovered the hive too late (would have been dangerous to tangle with it, where it was built). Luckily wasps all did in the winter so removed it around November.

Whether or not you have a gecko pet it sounds like you are rich in wildlife at least :D"
16670,"Same here -- not a gecko, I just mean that the pets are ours and not the kids'."
16671,"If your cat doesn't come back, but you're still ok with having a cat at some point, you can get one as a kitten and never let it outside. Most of the time, a cat raised only indoors is pretty afraid to go outside. It's the indoor/outdoor ones that grew up that way that have the biggest problem with it. 

I can't really think of anything that doesn't ""bite hard"". Any pet type creature that isn't a fish is going to be able to bite enough to defend itself if it feels it needs to. 

Having been an owner myself, I'd go with rats. Hamsters are bastards through and through, I'll never be convinced otherwise. Rats are wonderfully intelligent, emotional, social creatures that can be quite a bit like little dogs. You can teach them tricks, they can learn their names, they can be somewhat litter trained. Get some babies from a local breeder of pet rats, not a pet store or feeder breeder so you get the best start possible (you *have* to have more than one, they require at least one rat friend or you have a depressed rodent. Luckily two or three isn't any harder than taking care of one.). The worst thing about them is that they only live for about 2 years, and in that amount of time you will fall hopelessly in love with them, and they will break your heart to little bits when they go."
16672,"Others have recommended rats and I've heard how their intelligence is on par with dogs. I'll definitely keep this in mind. I'll look into how to take care of baby rats, necessary equipment, habitat, when they reach maturity, etc. I'm going into this knowing nothing about rats other than that they're intelligent. 

Thank you for the advice for going to a breeder. I'll hold them, my kids will hold them, and if they seem happy and not aggressive, (and if we can take care of rats by giving a proper habitat and required amount of attention -- which is an unknown because I literally know nothing) then maybe we'll get a couple."
16673,Be sure to check out r/rats
16674,"Look into dumbo rats if you can find them.  They seem to get a little bigger than normal domestic rats (as far as I remember, it's been 15 years since I had them) so they're not as ""fragile"" as regular rats,  and the males I had were super chill and friendly.  

Also, for what it's worth, use aspen as bedding, not pine.  Cedar is toxic to small pets, pine can cause allergies.  Aspen is the healthiest wood chip option, and it's cheap cheap cheap at feed stores. Martin's Cages makes a couple pretty kickass rat cages too. 

(This thread is making my day, love how many ratty owners there are here!)"
16676,"I am so sorry the cat ran away. I seriously hope it wasn't hit by a car. :(

And not all cats are Houdinis...IMO (and keep in mind this is strictly my opinion so take it as you will) they're less likely to want to get out if they've been fixed (you didn't say whether yours was or not) and if they've ever only been indoor cats. If they've been indoor/outdoor cats they are GOING to want to get out because that's what they're used to.

I wouldn't, at least for the time being, get her a new pet just because the old one MIGHT have died. You don't know for sure and honestly,your attitude is a bit worrisome. ""Oh the cat is *probably* dead..let's go get a new pet RIGHT NOW sweetie!"" screams to me that you treat your pets less as family members and more of a cute but somewhat annoying fashion accessory. :("
16677,"Yep, she's fixed. She's just an adventurer, an outdoorsy cat."
16678,"Our rule (we have dogs and cats now) is no more pets until our kids can take (partial) responsibility for them. I don't believe a kid under 10 should be the sole caretaker for any animals, but that does depend on the kid...

 Once she's 5 or 6 a guinea pig might be a good choice; they're pretty hardy, low maintenance, and  she will be old enough to help you clean the cage & feed/water it.  Plus, you can get hairless ones (skinny pigs) if allergies are a concern.  

FWIW,  I will be 6 feet under (and I'm being cremated!) before I ever allow a hamster in my house.  I hate them more than I hate low fat ice cream."
16679,"I agree. I've got 3 myself, but even at 5/6 she'll still need supervision. Squeezing them too hard or dropping them can result in broken limbs, paralysis,  or death. 

Furthermore they need unlimited hay 100% of the time. There are kinda that people are less allergic too, but it can still cause issues.

Third, they generally live 5-8 years and you'll need yearly check ups. You'll need to find a Cavy Savvy vet (someone who specializes in guinea pigs). This is usually an exotics vet. Each visit will likely cost around $100. They need this to keep tabs on their health, and the vet can check things you can't see, like their back teeth.

Also you need two. They're extremely social.

Guinea pigs are a lot of work, but for an older child, they could be a good pet as long as you do most of the work and supervise her while handling."
16680,"I've got 3 guinea pigs. Guinea pigs are cute and cuddly and let you hold them. Thet rarely bite. They're friendly, make cute sounds, and generally look adorable. They're not suitable for a young child, though. They're extremely delicate I'd recommend them for a 5/6 year old at the youngest.

 But even at 5/6 she'll still need supervision. Squeezing them too hard or dropping them can result in broken limbs, paralysis,  or death. 

Furthermore they need unlimited hay 100% of the time. There are kinda that people are less allergic too, but it can still cause issues.

Third, they generally live 5-8 years and you'll need yearly check ups. You'll need to find a Cavy Savvy vet (someone who specializes in guinea pigs). This is usually an exotics vet. Each visit will likely cost around $100. They need this to keep tabs on their health, and the vet can check things you can't see, like their back teeth.

Fourth they need a cup of fresh veggies per day. Usually romaine or butter lettuce is good. Occasionally you have to give them bell peppers. It's high in Vitamin C, which you need to prevent scurvy. Too much calcium in their diet can cause bladder stones. Too much sugar can cause diabetes. An improper diet drastically shortens their lifespan.

You need two. They're extremely social. You'll need at least a 2x3 foot cage. Store bought cages are too small. 

If they ever escape, expect to never see them again. They're liable to get eaten, overheat, or freeze to death.

Also they poop a lot.

Guinea pigs are a lot of work, but for an older child, they could be a good pet as long as you do most of the work and supervise her while handling."
16681,"This is going to sound strange... But ants. 

I bought a couple of Uncle Milton ant farms and connected them together for my 3 year old. They are cheap, low maintenance and extremely interesting. 

I hang them on the wall kind of like a living picture above her play table. This way she can spend all the time she wants watching them without being able to access the top portion where the openings are- except when I help her up for feeding time."
16682,Get a dog.  Dogs have a symbiotic relationships with humans and have literally evolved to live with us
16683,"My husband really wants a dog. My youngest daughter loves dogs and asks pet every dog she sees. My oldest daughter is just barely getting over her fear of dogs. Unfortunately we can't have dogs in our apartment. My oldest daughter has autism and my husband planned on using that as a loophole to get a companion dog, lol.

Ultimately it seemed easier to get a companion cat for her (we initially got the cat for her but my youngest daughter was the one who the cat became a companion to)."
16684,"That's completely understandable then.  

Although I'll add the companion dog thing works really well to get them into apartments that don't allow dogs"
16685,"IANAL but I have experience and Feels about this, so...

There are 2 kinds of companion dogs: service dogs, which do trained tasks to mitigate disability, and emotional service animals, which provide emotional support for people with disabilities (usually mental/emotional).  In the US at least, the ADA governs service dog access (or rather, gives disabled people the right to bring service dogs), and the Fair Housing Amendments Act of 1988 (FHA) covers reasonable accommodations for ESAs.

ESAs cannot be disallowed by species/breed restrictions -- within reason; an ESA dog can live in no-dog areas, but an ESA blue whale is kind of implausible -- and cannot be charged pet fees in advance.  (But property owners can charge for actual damage, and can take action if an ESA is vicious, threatening, loud/disruptive, or otherwise behaves inappropriately.)

It's important to distinguish between service animals and ESAs, although both are permitted in housing -- and you (general you, meaning people owning an ESA) should have a letter from a doctor/psychiatrist ""prescribing"" the ESA, especially for non-visible disabilities.  (The letter must state that the animal’s handler has a disability identified in the DSM V, and that the animal helps mitigate specific symptoms of this disability. It doesn't need to go into specifics about the diagnosis or specific symptoms.)"
16686,"I think a gerbil would be a good fit. They're nicer than hamsters in my experience, and they're smaller and thus less work than a rat. Just know that they don't do well in those small plastic cages you get at the petstore. Just pick up a good sized aquarium tank and put the bedding right in there. If you have questions feel free to pm me."
16687,"I know growing up, our hamsters would immediately chew their way out of the cool looking plastic cages with all the tubes and crap they sold at the petstore.

It kinda sucked because I really wanted my hamsters to be happy with all neato tubes and shit to climb but nope..they'd chew out EVERY SINGLE FREAKING TIME."
16688,Yeah Haha I don't even know why they make those.
16689,"I've had a two hamsters, one when I was a in my teens and one as a young adult. My first was so friendly. She was a good pet and I enjoyed holding her and watching her play in her ball, running around all over the house. She eventually died though.

After a while I got another hamster who was mean and awful. Very bitey. I always dreaded changing her cage bedding because she was scary. Ever since then, I've been afraid of hamsters because of how vicious they can be.

Now that I'm an adult, I know now that I should ask to hold the hamster in the pet store before committing to take it home as a pet. Still, I'm afraid of that initial interaction and getting bit."
16690,"The only time I've ever seen someone get bit by my gerbil is when they were stressing him out by pinning him down. Also, male gerbils are nicer than females."
16691,"I guess a rabbit? I don't know much about them as pets though, or their general demeanor. Would she be happy with a Hatchimal or Furby or something pet-like?"
16692,"Rabbits are messy, chew on EVERYTHING and shouldn't be picked up. I wouldn't recommend one for small children"
16693,"I have a rabbit. He's awesome, I love him, they're great for quiet, introverted, homebody adults.

Rabbits are terrible pets for small children. They're delicate, kick hard enough to break their own back, and are not cuddly. Rabbits hate being picked up, because they associate it with being carried off by a predator. Their body language is extremely subtle and completely alien for anyone who's used to dogs and cats. They're very independent and while they enjoy attention, they're not really a pet you actively play with; they prefer to be in the same general area as you and do their own thing. They're destructive and difficult to train (although they do litter box train easily). They require vet care from an exotics specialist, including spaying or neutering, which costs many times more than a regular vet and isn't available in all towns. A rabbit is just as much work as a dog, has a similar lifespan of 10-12 years, and can be even more expensive.

Please visit www.rabbit.org and r/rabbits to learn more about proper rabbit care. They can be rewarding companions, but are generally unsuitable in a home with a toddler."
16694,Rabbits be vicious.
16695,"Agreed.

When my son was in kindergarten, somebody had the bright idea for two of the classes (one of them being my son's) to have a shared ""class pet"". In this case, it was a dwarf rabbit..very cute, white with black eyeliner.

Every kid had to take the thing home for at least one weekend and when it was our weekend, my son was too afraid of the thing to feed it, etc. So I tried to feed it and the damn thing would attack my hand every time I tried to get near the food bowl.

I hate rabbits.

Unless they're being made into stew. Then they're OK."
16696,"We gradually worked our way up from betta fish to hermit crab to guinea pig to cat.

One thing I’ve learned is sometimes the “low maintenance” pets are harder and more expensive to care for than just getting a dog or cat."
16697,Yeeep. I had rats for years. I've not got 2 cats and a dog and they're so much easier(and less expensive) than my rats were.
16698,"Cat.  At that age the girls can clean out a litter box and feed and water it.  Cat also entertains itself.

A dog needs to be walked and shit picked up. At that age your kids aren't ready for that - a dog would basically be more chores for the adults, do you want more chores?

Rodents are bad for the same reason - gerbils, hamsters, mice, rabbits, guinea pigs - bedding needs to be changed frequently.

Fish are ok, after the initial $$$$$ getting the setup equipment, they just need to be fed daily and the filters swapped out and whatever with the water."
16699,If you use fleece with guinea pigs you only have to sweep daily and wash weekly. They are super easy. We have two. Quite easy as a pet and they don't need constant attention like a dog or cat.
16700,"Only get a dog if you have a lot of free time and enjoy it too. He has to go out a lot of times a day. They need to be trained harder than kids at the beginning so that you have some kind of harmony at home. Sometimes they get I'll and poo in your house... :) 

A cat might be easier to handle if you get a nice one.

More easy are birds. And kids have fun too with them."
16701,At there age unless you also 100% want the pet I wouldn't get one. Small animals are often praised as great first pets but often they need a lot more care then people think/want to commit to and they often don't like to held or loved on which is mostly what little kids want from a pet. If anything maybe sign up to foster a cat or dog to see how it would fit into your life style.
16702,Don't get any pet just to get a pet. Identify what pet you are interested in and then research it. The kids won't be into a pet if it isn't one they want
16703,"You and your partner should get the pet you want. If you don't want a pet, then don't get one. The lionshare of the work will fall on you.


Edit :assumptions are bad yall."
16704,"We have been married nine years.

But thanks."
16705,Oops! I fixed my post
16706,"It's not important I just thought it was funny, where did you get that idea from?"
16707,Not sure. I may have made an assumption based on your use of the word partner. I may have merged your thread and a different one.
16708,"Don’t go for the small animals (seem easy to care for but cage cleaning+having to be carful with handling = board children and more work along with shorter life spans). cats are good especially if you get a lazy, nice, shelter cat who likes kids (I had one and he was the best pet ever). If you do go the dog route bulldogs are amazing, I had 2 when I was younger and they were probably the most patient, loving dogs ever. They are also really easy to care for since they don’t shed as much as some other breeds I’ve had."
16709,"A shelter dog.   

Actually whatever kind of dog you get should be the kind you want because at that age they are too young to really take care of a dog.  OR you could take them to volunteer at the local no kill shelter so they could get some exposure and experience with dogs before you get one."
16710,"We got a shelter dog.  We can't go to the dog park or hang out with other dogs because he's too darn excitable and hates car rides.  With kids that young, op, you'll need to do a lot of visits and hopefully get a dog that was surrendered and has a truthful bio as far as if it's good with kids.  Also, your kids are probably too young to volunteer at a shelter."
16711,Do not get a shelter dog if you’re not dog experienced and have little time. Having young children is so consuming you won’t have time for a project dog. Get a cat as a maximal level of commitment. Smaller pets like guinea pigs and hamster still need time and money. Maybe fish or hermit crab for now if you guys are not so much of animal people
16712,A friend of mine adopted a shelter dog and it bit her child in the face... not always the best idea for a first dog especially with young children. It’s not as “ethical” but just buying a puppy is so much safer for the kid
16713,Golden retriever or a lab.
16714,Aren't they really energetic? Why do you think they are the best?
16715,Very energetic. They are very intelligent and easily trained but require a lot of attention or they use their intelligence for evil. And they do enormous craps. Your back yard will quickly become a mine field that requires daily  cleanups.
16716,"Mmmmm. 

I’d prefer a stick insect to start."
16717,"If your idea of a pet is an insect, don't get anything."
16718,"Yes, but they are so amazing with children & easy to train."
16719,Get a hamster. They are pretty easy to take care of and not very expensive. I wouldn’t get a dog they are a ton of work. We have 2 that we had prior to kids and everyday I wish we didn’t have them. They are so annoying but they are older so I can’t really just get rid of them since no one will take them. Plus the worse part is we travel a lot and it cost us $60 a day to kennel them when we do. Ughhh.
16720,"Rats make phenomenal pets. I think of them as tiny dogs. They are not as stinky as mice (male mice stink to high heaven). They are incredibly intelligent - can learn their names and learn tricks. They are affectionate and social. But, always get them in pairs. They go psycho if kept as singletons. You can get 2, 3, or 4, but never just one."
16721,"I think rats are the right answer, too. Our kids have expressed interest in having their own personal pets when they get older and rats seem the best. Sociable, friendly, trainable, and easier to care for than things like rabbits and fish while also being more cuddly."
16722,"This was my first thought, too. I work in the veterinary field, and one of the first things we learned in our exotics class is that rats make the best pet."
16723,"I’ve owned hamsters, rats, and a mouse, and out of those, the mouse was my favorite. He was intelligent, curious, and friendly. Hamsters are cute but not very intelligent. Rats and mice are much smarter. Temperament is really important with rats, because rat bites can be very painful (my roommate chose a neurotic rat. Mine was perfectly fine). Mice are more fragile, so I wouldn’t recommend them for young children. The big downside with rodents is cleaning their cages - it can get old after a while.

One thing that’s important to look at is lifespan - some small animals live much longer than others. Mice, hamsters, and rats have fairly short lifespans (2-3 years, usually). Snakes can live 20 years or more. I think guinea pigs are 8-10 years?"
16724,"I heard that hamsters are stinky and mean. Snakes are a no from husband (he has almost a phobia!) 
I have heard rats are pretty good pets. I’ll look into that thanks!"
16725,None unless you are getting it for yourself. Otherwise you'll be here posting about how the triplets are bored with the pet and don't take care of it anymore in a couple months.
16726,"If you don’t mind spending some cash, Siberian cats are a wonderful, dog-like cat breed.  While no cats are truly hypoallergenic, Siberians carry far less of the protein in their saliva that you are allergic to.  I have a coworker whose husband is *deathly* allergic to cats (literally cannot be in the vicinity of a cat without an asthma attack) and they successfully own a Siberian.  Their temperament is amazing.  If I wasn’t so anti-purchasing a cat, I’d get one.  (Though obviously in your circumstances you don’t have a lot of options!)"
16727,"Hamsters are pretty gross IMO. Lots of poo to clean and not very interactive. I hear bunnies can be trained to use a litterbox and rats (if you can get past the thought of it) are quite smart, trainable and affectionate. Bearded dragons and ball pythons make great small pets too and don't smell as bad as hamsters. Whatever you choose please do your research on what each animal requires for care and what is a good fit for your own family"
16728,Never thought of bunnies! I’ll read up on them thanks!!
16729,"Bunnies are great, but your house needs to be really bunny proofed because they will chew any cord they can get their teeth on. It’s also really important that your kids (and adults, too) know proper handling for bunnies because they can very easily break their backs with inappropriate handling, or if they struggle while being held. [The Rabbit House Society](www.rabbit.org) is a great resource for learning all about bun buns."
16730,"Although I think rats are a far better choice than a hamster or rabbit, I'll be the odd one out and also suggest some beginner reptiles. They are infinitely easier to care for than fish and can be incredibly gentle, rewarding pets. Unlike rats, they have essentially zero social requirements, i.e. your reptile will not mind if it becomes a pet that doesn't get held every day. I would personally recommend corn snakes, which are a more active species that likes to slither and explore, or ball pythons, most of which will happily curl up anywhere warm and stay there indefinitely. Not every individual is going to be a good choice for a child, but most individuals in these two species are docile and become quite tame with a little handling. They also eat (and therefore poop) infrequently, so cage cleaning is far less frequent than with something like a rat."
16731,None if you're planning on having your children be solely responsible for it.
16732,"I know I phrased it like that but I wouldn’t expect them to be solely responsible. I know I will be the one doing the feeding, cleaning and I’m totally fine with that."
16733,I would literally just get a fish for them right now!
16734,That’s something we’ve talked about.  I’m reading up on aquariums and all of that.
16735,"Do your research on hamsters. They need a very large tank (40 gallon minimum) and nearly all species need to be solo. They are funny inquisitive creatures. Having a large tank with room to burrow and explore helps with the smell and with their aggression. A bored hamster in a small cage will bite. 

I kept rats for a few years. Very intelligent, can learn their names and simple tricks. Must have at least two at a time since they are social creatures. Males will mark their territory. They also need a lot of space for the same reason a hamster does. 

Personally I wouldn't trust a 7 year old with either of these critters. I'd start either smaller like fish or sturdier like a ball python."
16736,"Yeah, I’m actually just leaning towards either fish or nothing at this point."
16737,"Surprisingly, fish are a lot of work if you wanna keep them alive. I gotta clean that tank once a week with a little pump thing so they don’t die from the toxins of their own poop. It takes forever to pump that little pump."
16738,If done correctly most tanks can become self sustaining environments when you use electric pumps/filters.
16739,Where do I find an electric pump?? They sold me some crappy hand pump at petco.
16740,Basically anywhere ZooMed makes one they sell at Petco and PetSmart or order one on amazon
16741,"Gerbils are good. They don’t poo and pee very much, and aren’t as stinky as other rodents. They are also fairly friendly, don’t bite, and they all have their own little personalities. 

They don’t like being alone, but they are also territorial, so make sure you buy as many as you want from the same clan. You can’t really mix and match them from different places."
16742,"If they’re seven, I honestly wouldn’t get them anything unless you plan on picking up their inevitable slack and help take care of it."
16743,Of course! I phrased the question wrong. I know the deal with kids and pets
16744,"Gotcha! In that case, I’d honestly recommend getting two rats. They’re very social, clean, and easy to train!"
16745,Good to know!
16746,"I advise against “critter” type pets... they’re smelly, extremely messy and can bite. I would say get a reptile (turtle, lizard, etc) or maybe let them get fish. If you do go with a critter- get 2 rats. Rats are fairly clean and they have personality but they still need weekly cage cleanings and attention."
16747,Don't get a pet unless you want a pet. Assume you'll be solely responsible for any animal you adopt and make decisions accordingly.
16748,Yes! Our dog is the first pet I’ve owned and although I’ve always wanted a pet it took me 2-3 years to finally decide to get a dog. Before we got our dog my husband kept saying he was surprised I hadn’t come home with one as I worked next to a pet store in a mall. I told him I wasn’t just going to get a pet (especially a dog) on a whim and definitely wouldn’t support a pet store!!
16749,"I think a bunny would be cool, they are small, friendly, and there are nice pens for them on Amazon. I had one growing up for a while and I loved taking care of her."
16750,"I do not recommend rabbits for kids. They are expensive(you need to see an exotic vet), a lot of work (dietary needs are very specific) and are not good with kids due to them being very skittish(prey animals). Bunnies don’t normally like being held and some only tolerate petting. They can easily die due to GI stasis in a day if they don’t eat.

*I have two rabbits"
16751,I’m sure OP will do research on whatever pet they choose :)
16752,"It depends on your kids: are your kids good with dogs? Can they be trusted not to be screaming at them, punching them, grabbing ears, poking them in the eyes, riding on them, etc?

Kids need training just as much as dogs, and you can't get a dog and think that all will be sunshine and unicorns, regardless of what sort of dog you get. 

Kids under the age of three are usually not good with dogs, and need to be constantly watched, if they are interacting with the family dog. By about five or so, kids more or less understand, ""don't be a jerk to the dog"", but still need to be watched. 

One of the big reasons why dogs fail in a home with kids is that the parent assumes that the dog will tolerate all sorts of crap from kids, and the dog can't or won't...and turns around and nails a kid. 

The reason why I'm so strong on this is that I have known dogs who were PTS because the parents did not enforce any rules of engagement with the family dog for the kids, and the kids acted like kids will if not told otherwise, and the dog bit a kid. 

So yeah, if you get a dog, the dog is for the adults in the home, who have to keep an eye on things, and train the dog and the kids. 

People often will tell other people that retriever breeds are good with kids: they are also very oral dogs, and will happily bite a kid who is doing something they think should stop, or grab something from the kid, or go thru the house and pick up the kid's favorite toy and destroy it. So there's that..."
16753,"An acquaintaince of mine who used to work in insurance told me most of the bite claims he saw were for Golden Retrievers.

The problem is likely that they have such a good reputation that people think they can let the kid just do whatever to the dog."
16754,"> An acquaintaince of mine who used to work in insurance told me most of the bite claims he saw were for Golden Retrievers.

One reason why I make sure my dogs are 100% kid broke is that I know that at some point in their lives, some stupid parents will allow their kids to run screaming into their faces. 

So no matter how much my younger dog may be a high flying tough guy, he knows, kid gets in my face, I wag wag wag and it will be ok. 

I have had parents allow their kids to mob my middle dog at the local farmer's market, and look at me like I'm a bug on their shoe, when I suggest that maybe, just maybe, they may want to be sure that the dog their kid is hugging is actually ok with kids. 

>The problem is likely that they have such a good reputation that people think they can let the kid just do whatever to the dog.

Yup. And I'm not going to change the world, so to protect my dogs, I make sure they can handle kids, even poorly raised ones."
16755,"I usually recommend beagles as family dogs for a family that wants something smaller than a lab or golden. Beagles are sturdy, like to be pet, and not high energy. Also excellent at cleaning up any crumbs or unwanted leftovers :)."
16756,Second beagles.  They're incredibly tolerant and good natured and are basically the Tonka trucks of small dogs.
16757,Love that description! Makes me nostalgic for my childhood.  Do they even make tonka trucks anymore?
16758,I have no idea! Haha.
16759,"Cavalier King Charles spaniels are hard to beat, as are rough/smooth collies. Both breeds love children more than any others I’ve worked with."
16760,"Medium sized dog breeds tend to be better choices for houses with kids because smaller dogs can get underfoot and large dogs can knock children over with ease, just by moving around.

Typically a lower energy breed is best so they’re not bouncing off the walls, less mouthy is always a good choice (mouthy dog breed examples would be Labs, Rotties, Shepherds, etc)

There is no set “breed of dog that is good with children”, it varies quite heavily from dog to dog."
16761,"IMHO it depends on the kids.  I've known families with breeds not normally recommended for families (Afghans, Irish Terriers, Malinois) and it worked out great because the parents were smart and dog savvy and raised nice, dog savvy kids.

And even the nicest dog can bite if the kids are allowed to run roughshod over the dog and he finally hits his limit.  I think many dogs should be put up for sainthood but it should never be allowed to get to that point."
16762,"Labrador Retrievers are the official best dogs for families! Mine was sweet and gentle with children and she had a very patient personality. Kids would yank her tail and ears, poke her in the eyes, try to ride her.... she just let it all happen and loved them all the same :)"
16763,Your dog had a long threshold and tolerance for being bothered. Dogs should not be measured in terms of “good with kids” by how much torment they put up from children... kids ahould not be allowed to treat dogs like this.
16764,"I totally agree! I remember taking Daisy out to a park for the first time and the kids were awful to her. I felt so bad for my pup, but you can’t do much about the kids these days. I was eventually able to get the parents to mind their kids, but you’re right."
16765,WTF? Of course you can and it's your responsibility!
16766,"> I felt so bad for my pup, but you can’t do much about the kids these days. 

Erm, yes you can. Tell them ""do not touch my dog"" and walk away."
16767,We were at a baseball game for my little brother and sitting in an area designated for her to be able to lay in the shade and not be in the stands.
16768,"I've been in very similar situations at soccer games. Say ""Do not touch my dog"" and body block them or gently grab hold of and remove their hands if necessary. Just be pleasant but also absolutely firm."
16769,I’m always scared with parents these days claiming assault about something so simple as that.
16770,"Well, blocking would be a best primary strategy, but if a kid puts their hands on your dog after you've told them not to, you can remove those hands gently without much risk of being accused of anything. You'd do the same if they stuck their hands into your backpack."
16771,Hmm I guess you’re right
16772,"You tell the kids to stop doing that to your dog!  I tell kids to stop when they approach without asking.  That's much less than yanking, grabbing, trying to ride, etc."
16773,"Cairn Terriers are great with kids. The Cairn Terrier Club of America states ""Cairns seem to have an inborn affinity for children. They are physically very tough, and forgive or overlook mishaps and stepped-on feet with characteristic generosity of spirit.""

They're very playful without being over the top and they're sensitive enough that they're careful not to take a child down. When the breeder of our last Cairn found out there were young children in the family (under 4 years old) she was ecstatic and told us the dog will love the children and that has been absolutely true."
16774,"Labrador retrievers are good with people of all age, you can never go wrong with a lab. They will love you to death."
16775,"I grew up with a Sheltie who was the perfect choice for our family. The dog had no prey drive. He hated strangers, but was bonded to our family and never showed the slightest aggression or irritation with any child. And my parents had five kids, so he was around babies and kids of all ages.

That being said, me and my siblings (probably due to our parents guidance) were calm and gentle with all animals of all species, and never interacted inappropriately with any of them. 

*No* dog is the right choice if the kids will engage in those behaviors that would make any dog uncomfortable."
16776,"Golden retrievers too. We had a lot of kids in and out of the house. They would play airplane with his ears, sit on him, play, etc. dude just took it and actually enjoyed it. He loved being around kids. We got him early 2000s before we really had internet and he was from a BYB. Risky for sure but it’s nice looking back now that the golden retriever nice behavior still shone through"
16777,"Although I don't condone the way you allowed the kids in your house to play with your dog (please never allow kids to sit on a dog, it's terrible for the dog and an accident waiting to happen), I agree that Goldens are excellent with kids. With any dog though, a lot of that comes from socialization and training as well.

My dog has loved kids since the day we brought him home at 8 weeks old. Even as a young puppy, he confidently approached kids of all ages, sizes, and genders and showered them in kisses. When we take him out for dinner and to local dog friendly places, we bring treats with us and allow the kids to give him some (to further reinforce that kids are a good thing), and he takes treats so incredibly gently from them (again though, this is thanks to a lot of training). When we first started this, we tried to keep treats just to older, more mature kids, and when we did start to allow toddlers and babies to give him treats, we'd ask them to throw the treat to him (as a safety precaution until he learned how to take treats more gently). Now he will gently accept a treat out of any child's hand."
16778,"My English Bull Terrier loves kids.  She's super shy of strangers but will approach children. She loves to play with my 3 year old and let's him pet her. But I'm very strict about how he's allowed to play and interact with her.That said, terriers are not particularly recommended for first time dog owners, but I think it can be ok if you do your research and go in with your eyes open."
16779,In my experience labradors and golden retrievers are the best for households with children. Though I’m sure most dogs will be lovely if raised well.
16780,"Just today my Siberian Husky Riley had a really lovely interaction with a 8mo old baby. We met these people at the park and they said their son likes dogs and asked if he could meet Riley and I said sure. They put him on the ground right next to Riley and she laid down in front of him and gave him very small gentle kisses on his face. She let him touch her nose and muzzle and ears, she definitely knew she needed to be gentle kind and patient with him, it was very sweet. Obviously I can’t vouch for all huskies but from my experience and from what I know about the breed they tend to be really good with kids!"
16781,My Rottweiler and corso loves kids
16783,"FYI the nanny dog thing actually came from a 1971 [New York Times article](https://mobile.nytimes.com/1971/09/19/archives/a-breed-that-came-up-the-hard-way.html) no one has found an instance of it being used before then. It was a term coined by the editor of the Staffordshire Bull Terrier Club of the United States newsletter. It was largely an attempt at rebranding the image of the dog. So the bully breeds being called nanny dogs is a myth; not to say they can’t be good with children, but they’ve never been historically called nanny dogs."
16784,"Honestly, a cat meets all of your criteria."
16785,"Oh man, I was thinking the same thing.. but they are so useless it seems!"
16786,"Well, you want an animal you don't have to exercise or groom or take outside to potty... that's not a dog."
16787,"Alright, maybe I need to edit my post, I am not completely against the idea, I have heard of friends who make their dogs peed on pad so thought that was a ""normal"" practice for small dogs. I don't mind letting it out, but we are both not home for 8 hours a day. I assume that having a dog then may be out of the question!"
16788,"If you're not home, then why specifically a dog? Why does your wife want you to get a dog?"
16789,"She hates seeing our child play alone... having trouble having another child and as much as we try to always keep him company, its hard to do so every minute we are home. Hes very active and always asking for attention... and he loves playing with dogs when we go over to friends houses etc... I know, might not be the right reason, but that's why she wants a dog, basically to give him a companion..."
16790,"Eep. A dog is not a toddler's toy.

If you're both gone all day, is your son in daycare or do you have a nanny or relative watching him?"
16791,"he goes to his grandmothers... Hes pretty good with other peoples dogs.. But your right, maybe too young still since that interaction is usually limited..."
16792,"Age three is when cooperative play becomes such a thing. 

I wouldn't get a dog in this case. I'd take all the money and monthly budget I would have spent on a dog and enroll him in a couple of playgroup-type classes, group music like Kindermusic, toddler gym, and of course, there are free activities like library story (and craft) time. Kids' museum, playgrounds and parks, Rec Department classes, etc. 

You could also join a local playdate group through a mothers' club and go to weekend playdates. 

We started a co-op preschool around that age."
16793,"You shouldn't leave dogs and small children alone together. Ever. That's how accidents happen. Eg. Dog has ear infection you aren't aware of, kid comes over as normal to normally happy friendly put up with anything dog, child ignores warning growl and thinks dog is 'smiling' with teeth. Child pulls on ear. Child bitten - possibly on the face. Child left with scar and a fear of dogs, dog put down, entire family upset.

A cat would be a much better option in your circumstances but **no** animal should be brought in to be a plaything for your child. That's what toys are for :)"
16794,"> She hates seeing our child play alone... having trouble having another child and as much as we try to always keep him company, its hard to do so every minute we are home.

That is an AWFUL reason to get a dog and you definitely should not get one.

If you get a dog it should be because you love dogs and want to spend time with a dog. A dog is not a playmate for your child. A lot of dogs dislike or barely tolerate children. Even dogs that love kids should *never* be allowed to play with a small child unsupervised.

You and your wife are obviously not actually interested in *having a dog*, just in providing a playmate for your child. This is incredibly obvious. I'm sure you'd do your best to take proper care of the dog, but this is just not a good situation for one."
16795,"I grew up rurally without any other boys my age around and just a little sister.  I didn't play with her ass she sucks.  I like to think I turned out okay, learning to be comfortable is very important especially as an extroverted person."
16796,"Personally, I wouldn't recommend getting a dog right now. *Any* dog, regardless of breed, will require at least sixty minutes of physical and mental exercise a day, and at least three more hours for training/socialization/management during the first few months at home. Most of the qualities that you are looking for are depend more on how well you train and socialize the dog than on breed. So I'd *highly* recommend waiting until you have done at least six more months of research before adopting a dog, but I'm sure you'll be overwhelmed by then (don't worry! I can be pretty lazy too!). Don't get me wrong, dog's are incredible animals, but I think a cat would be better suited for your situation. He/she would require less physical and mental stimulation, could be house trained indoors, and you could even take him/her for occasional walks on leash. 

I like the general rule of waiting to get a dog until you can look in the mirror and honestly say that you know everything there is to know about raising your new companion, because even then you aren't fully prepared. 

Best of luck!"
16797,"Thanks yesthis11. Your post makes so much sense. Of course I would obviously spend time with it to train and exercise, but maybe I am not quite ready yet. I am just trying to learn more and more. I absolutely hate people who get a pet/dog and keep it locked up in a cage or secluded in a room or outside on a leash. I think its cruel! If I do get a dog one day, it would be a real family member that I would keep by me all the time when I am home etc... that being said though, not sure if I am ready for that lifestyle change just yet.. I have always wanted a dog, but my current lifestyle doesn't make it a very easy option to consider at this point..."
16798,"Honestly, it depends on the cat.

Some cats are ""boring"" or ""decorative"" - depending on which way you look at it! They just enjoy sleeping in several spots for most of the time.

Other cats are interactive, animated and curious. These are the clowns, the adventure-seekers and the ones with ""character"".

I've had and known both types and currently have one of each. My ""interactive"" cat comes on walks with me and will come when I call her. 

Having said that and seen your (wife's) reason further down for wanting an animal:

> She hates seeing our child play alone...

Really, I don't think an animal is the answer to this. I agree with /u/je_taime's suggestions and add, that one of the beauties of being an only child is we learn to entertain ourselves and not need constant company."
16799,My cat drives me crazy! She's always has to be near me unless my dog is outside and then she cries and cries until the dog comes in. She also loves to play and will come when called. If there is something new in the house she has to check it out.
16800,"Haha! Come to think of it, all the cats I've had have come when called. The two I have now know ""off"" and ""out you get!"". 

They have trained us humans to open the door whenever they say ""miow"". Sometimes they do this for no apparent reason - I think it is their way of proofing the command... ; p

> If there is something new in the house she has to check it out.

I love how the curious ones do this!"
16801,"My favorite currently is any time the dog does her ""someone is at the door bark"" the cat growls in response. She HATES visitors and will growl from wherever she is, even if she is in another room.

Its very weird because she is VERY affectionate to me and my dad (who lives with) and my brother (who comes about once a mont) and my exboyfriend (who used to spend a lot of time over). Anyone else and she is out of there so fast. If it is a kid you won't see her for an hour until after they leave. If it is an adult she might make some appearances."
16802,"\*LOL* That's brilliant, the cat growling!

My interactive cat is similar with most visitors, she stalks off outside and performs her magic spells and rituals... after a few hours she usually returns to find they have worked and that the strange humans have gone. Occasionally, the method fails her - she returns, looks somewhat annoyed and slinks off again.

In her heyday, my other cat has literally bitten guests, unprovoked. When she growls it is a serious warning!"
16803,"Cats provide companionship and affection, a belly to scratch, a responsive meow or purr, a buddy to curl up with on the couch, a friend to play with, etc. Cats are wonderful in their own way, and honestly it sounds like you could enjoy one very much."
16804,Fourth vote for cat.
16805,"I wish your wife was in this thread: it honestly doesn't sound like she understands what she's asking for, and how far off it would be from the reality of owning a dog. 


Small dogs tend to not be good with kids, AND tend to bark. They're not good with kids because they are small. It's really easy for a kid to accidentally seriously injure or kill a small dog. Lots of small dog breeders won't sell to families with toddlers, for just that reason. 

If you have a dog who weighs upwards of 50 pounds, you usually know where the dog is. And if the kid steps on the dog, the dog won't die. If you have a dog who weighs 7 or 10 pounds, that's a dead dog if the kid steps on the dog or drops something on it. And if you're getting ready to leave the house, it's far easier for a Maltese to dart out the door than it is for a Lab. 

All dogs are destructive unless you train them. Small dogs tend to not be as trained as big ones, because people don't take them seriously. They can't take apart a couch or a kitchen as fast as a big dog can, but they can still destroy things. And if you want a dog who pees on a pee pad, then get ready for 10 or 15 years of your house smelling like dog piss. 

I have a friend who's wife really really wants a dog. They have three kids, and an incredibly over-subscribed life. I know that in their head they're seeing the kids come down the stairs on Christmas day, and finding a puppy with a bow on it. I tried to tell them that the dog is not going to be all about that, but I suspect they'll go to some pet store and buy a dog. 

Anyway, dogs are like toddlers that never grow up. if you train them, they're not bad to live with. If you don't, it doesn't end well for anyone involved. As I said, if your wife was in this discussion, I'd ask her why she wants a dog, and what she hopes to get out of the relationship. My experience is that unless a kid really LIKES dogs, there is very little interaction with the dog (way more with the Xbox or whatever other electronic crap is in the house), and the kid is just not that bonded with it."
16806,Thank you very much for such an insightful reply. I made her read this comment and many others... I think I am in the clear now.. Don't think she is as adamant about a dog. Thanks again!
16807,A cat
16808,"Yes, it is a bit unrealistic. Even the laziest dog needs to be walked everyday. If it is not exercised and/or properly trained, it will destroy things, act out, etc. There is no dog that automatically comes with perfect manners -- these things require daily effort and maintenance! 

You don't sound extremely into the idea of a dog. They aren't the sort of pet you can just sort of feed and ignore the rest of the time (like hamsters, fish, lizards, cats, etc.). They require a lot of attention."
16809,"Thanks 440_hz. I think your right. I am not sold on the idea. That's why I am here asking for opinions. I am not completely against doing anything. As most people here have already said, if that's the case I should just get a cat! But we both work 8 hours a day so will make it hard to be there all the time, hence my ""wishlist"" however It seems I might be asking too much. Of course I would take it for walks and stuff, just not very active, especially during winter. I am in a gym and will not go out in the cold.. Summers would be fine. My 3 y/o would keep it running around the house i'm sure.. but again just was hoping I could find a breed that is an easier option that some of the others...."
16810,Thanks for all the comments so far guys. I sincerely appreciate everyones input! I am just signing off for the night since I need to be up for work in less than 6 hours. But I look forward to reading more comments in the morning! Thanks again!
16812,"Hmm, never thought of the pee pad + carpet. Your right... but then again, I'm not completely against doing anything, I just want something that's an easier fit. I know I wont be able to get all my criteria spot on, just looking for  a good balance..."
16813,"The pads you are thinking of are puppy pads and they are for house training a puppy. Puppys obviously do not know where they are supposed to go at first and often cannot hold it anyway, the pads are to train them where you want them to go and you gradually move them closer and closer to outside until that's the only place they go."
16814,I have a cousin with chihuahuas that have them litter trained. Mostly because they live some place that gets hellaciously cold in the winter and the winter lasts forever.
16815,I think you should probably try an easier pet first. All of the things you mentioned minus size are hugely affected by training.
16816,I think a plush dog is what you are looking for
16817,And they come in a choice of colours.
16818,"Points in turn

1. Small dogs can be high energy too

1. Down to the individual dog, and whatever breed still requires training.

1. Does not exist in nature. My hamster recently skinned me £20 for a 5 minute vet visit!

1. Down to the individual dog, requires training, accidents will *always* happen

1. Down to the individual dog, requires training

Dog's are great, but your life will need to change to fit the dog in. 1 to 2 hours (maybe a lot more!) exercise every single day, rain or shine. First thing in the morning, last thing at night (minimum). Training classes, socialisation etc. Do that and you will have a well behaved, calm companion. If you don't, you will have a poorly behaved, stressed furball going up the walls with frustration.

A dog (any breed) should also never be left alone with a child of that age. Young children often can't read a dog's body language and it only has so many ways of saying ""Back off"" before, well, you work it out.

You are being unrealistic. Getting a dog (or any pet) requires commitment. If you are not prepared to put in the effort, don't get a pet."
16819,"Like everyone else has said, a dog probably isn't right for your family right now. However, cats can be awesome, and they easily meet all of your criteria! If you're looking for a cat that would be very friendly with your son, try a [Ragdoll](http://www.cfainc.org/Breeds/BreedsKthruR/Ragdoll.aspx).

Good luck!"
16820,Try a plush toy dog.
16821,There is no dog that meets these criteria. If you get a dog I fear that both your family and the dog will be unhappy because it doesn't sound like your family is willing to put the work of a dog in.
16822,"1 and 2:  are kind of incompatible, in my experience. The smaller the dog, the nippier it is, and they tend to be twitchy around kids. But then, I'm biased against small dogs.

3 and 4: should be easy to manage.

5: you wanted a dog. They bark."
16823,"You need to wait until your kid is older, until he starts asking for a dog. 

Dogs don't generally do very well being left alone all day every day, unless you hire someone to walk them. I think you should look at other pets like a cat. Yes, I know, cats are crap, but they're much lower maintenance than a dog."
16824,"please, do yourself AND your dog a favor and do not get a dog. Get a cat."
16825,"Thank you everyone for the very helpful and insightful comments. I am greatful for all your responses. I will not be getting a dog anytime soon, that's for sure. Not until I know we are ready and fully committed.

I'll just stick with a fish since it meets all my wonderful criteria!"
16826,"Our Shih Tzu's are the most chill dogs ever.  They aren't ankle biters, they never bark, except when trying to get one of the other dogs to play, and all they want to do is be next to you to get a belly rub."
16827,"If you guys don't want a pet, don't get one. It's pretty simple. She's 8 and yeah, she wants a dog, but I wanted a pony and didn't get one. She can have a dog when she's older and lives on her own, or when you guys are more ready for the task.

*If* you really want to scratch this itch, you guys do have the option to foster a dog through a rescue or shelter in your area. The benefits to fostering is many-fold, but here are some highlights:

* The dog is temporary and if things escalate beyond your capabilities, the rescue and shelter will always take them back, that's their job.

* The dog's needs are often paid for by the organization, including medications, food, etc.

* You actually save 2 lives in one go because you house the dog you're fostering and make space in the rescue or shelter for another dog to also be saved.

* Your daughter gets to experience the joy of a dog, helping the dog adjust to ""family life"", and gets to unite this animal with their forever family, which can be a sad, but rewarding experience.

* You can do it repeatedly or just once, without feeling like you're living in a zoo 24/7."
16828,"Fostering dogs is a great suggestion! We fostered through a local greyhound rescue and it was nice to see them get adopted eventually to a loving family. You learn not to get too attached and you are helping two lives at one as the above poster mentioned. If you find the right fit for your home, you can adopt the dog that you are fostering."
16829,Ive been wanting a dog for about 20 years now. Still wishing.
16830,"Whatever you do: if you (and I mean *you* as the adults in the family) do not want a dog and feel fully prepared to take care of one, do not get one. Just don't. People vastly underestimate how hard dogs can be to care for, and a fence is not the only problem. And people also vastly underestimate the costs associated with a dog. 

The first few months after my husband and I adopted a puppy were literally harder than the first few months of having a human child. And that nearly-free dog had over $5,000 in vet bills the first year we had her. Sure, that might not happen in every case, but you never know, it can. So if you don't want a dog, don't get one. Give your kid other opportunities to interact with animals, whether that's volunteering at a shelter if any in your area have programs for young kids, taking horseback riding lessons, or if you have a friend or neighbor with a pet, perhaps seeing if they can arrange for her to spend some time with the pet."
16831,"I’m going to be real. No matter how much a child swears up and down the pet will be 100% their responsibility it never ends up being that way. The responsibility always ends up being unloaded on the rest of the family once the novelty wears off. 

So, unless YOU want a pet, do not buy one. It’s okay to say no. She will live. 

If you eventually decide to just not get a pet, though, please just tell her that. Just a hard no. It’s kind of sad that she’s selling baked good to the neighbors over something that won’t ever happen."
16832,"I cannot emphasize this enough. When parents look at getting their kid a pet, they need to look at it as *themselves* getting a pet. Otherwise it will end in heartbreak one way or another.

My husband had a hedgehog as a kid, when he was about 6 years old. My MIL told him, a six year old, if he didn't take care of it she would give it away. Of course a *six year old* couldn't remember to do things like clean it's cage often enough. So she gave it away after he became attached to it. He still remembers that sadly while she seems proud that she ""taught him a lesson"" about caring for pets."
16833,"My boyfriend in high school had a ferret that his dad just randomly gave away one day. It wasn’t even that he didn’t care for it, I think his dad just got sick of having the ferret around. He was heartbroken."
16834,"Could you look into letting her volunteer at sn animal charity? I do not know if there is an age limit,but it might take the edge off her desire if she can spend time with some animals."
16835,"Don't get a pet if you don't want to take care of one.

Instead sign her up to volunteer at the animal shelter every week."
16836,You could have her volunteer at an animal shelter so she gets time around pets and also gets to understand the responsibility that goes into taking care of them.
16837,"K so I’ve pretty much had every domestic pet you can have. Rabbits, ferrets, lizards, cats, dogs, horses, exotic parrots etc. 

Easy lizards, like geckos or anoles would be a good bet. I had anoles/longtailed lizards when I was a kid, it was one of my first pets, and they’re insanely easy to take care of. Plus you do get to touch them (minimally, anoles tend to bite even though it’s not painful, it’s like a dull pinch). 

Leopard geckos were my favorite because they’re super docile. 
Parakeets are pretty easy too. The budgie/cockatiel types even. Be aware that you guys may be allergic to the down feather dust. 

Fish can be a pain in the ass but overall once you get a tank set up (water at the right PH, nitrate and nitrite balances etc) they’re really easy to maintain. But that probably won’t suit a kid that wants a cuddly pet. 
Otherwise, someone above suggested volunteering at a shelter. That’s genius. You don’t have any responsibility and plenty of shelters are looking for people to help socialize animals, particularly cats (as I’m aware of) since they’re usually filled with them. Dogs a little less so because some no-kill shelters have more aggressive types that wouldn’t suit young children. 
Or you can always make friends with people that have pets. Then it’s not your burden. I have to say, as a kid I hung out with far too many people simply because I wanted to see their dogs/horses/what have you than I should admit lol."
16838,"I would be wary of getting anoles, because even though they are the cheapest lizard, they do require UVB lighting and heat, and they only eat live insects. Also, most of them are wild caught and prone to carry diseases."
16839,Rats make awesome pets. But they don't live very long.
16840,"This! 

I have had cats, dogs, rats, 3 species of hamster, gerbils and mice. Rats are my second favorite after cats, maybe tied with dogs, but my husband is allergic to both cats and dogs, so here we are. 

Rats are literally like little dogs or cats in terms of intelligence, personality and bonding (must get 2 because they are very social-- if you want a little less smell/pee, make it sisters, not brothers). You DO have to clean their cage about every 2 weeks, but otherwise, extremely low-maintenance and cheap. 

Only sad thing is you have about 2-3 years max with them. 

Our little ones are 1.5 years old and bring our family so much joy.

ETA, for non-OP readers: For the OP, rats could be a great option, because her kid is 8. I wouldn't recommend them for any child under 5, and that's a 5-year-old who is very responsible and gentle. Maybe 6-7 for an average kid, because rats weigh about a half-pound each and although somewhat resilient (land on their feet like cats), are still a lot more ""fragile"" than a cat or dog, simply due to their size."
16841,"Crested gecko! 

They don't smell bad

They are easy to tame

They rarely bite, and when they do, it doesn't hurt in my experience

They don't require special lighting or heat

Their diet is mainly a fruit powder mix

If you get one, I recommend getting from a breeder / at a reptile show. 

Let me know if you want more information

https://i.imgur.com/ga1jiSq.jpg  <-- Here's one of my little guys."
16842,Leopard geckos are great too!
16843,"I have a leopard gecko also, but crested geckos are so much easier. Leopard geckos have specific heat requirements and they eat live insects. And my leopard gecko is super dumb and thinks my fingers are worms and when he bites he draws blood. Crested geckos are much lower maintenance. Also they take up less of a footprint, because they require terrariums that are tall and climby rather than a ground-dweller like a leopard gecko that needs more floorspace than height."
16844,"Oh, mine's never drawn blood, she doesn't have teeth, I didn't think it was possible. But she's never hung on or anything, just jabbed at me sometimes in a feeding frenzy. 

The heat requirements are easy, too. Long as the room isn't too hot and there isn't direct sun making the tank into a greenhouse, you just need to slap an under-tank heater on one end of the tank and you're good. 

I find it pretty easy! The crickets are a bit inconvenient though you're right."
16845,"Oh they have tiny little sharp teeth lol. Maybe males just have a stronger bite, I don't think any females I've had have drawn blood. I bred them for a little while, then downsized to 1 leopard gecko and now 2 cresties."
16846,"I’ve had fish, turtles, frogs, geckos, ducks, rabbits, hamsters. Pretty much every category. I’d say a cat is the least work of any of them — but if allergies is a problem that’s obviously not an option. Of any of the pets I’ve ever had cats are the least maintenance. 

Basically, don’t get a pet."
16847,"I really wanted pets as a kid. I didn't get any, and it was probably for the best (I have learned as an adult that pets aren't really a good fit for me!). I think you can encourage her love of animals in other ways if you don't want a pet."
16848,"DO NOT get a rabbit. They need lots of exercise but eat and cheew on everything when out if the cage.

They have a constantly running digestive system which means they eat round the clock and POOP around the clock. So much poop. SO MUCH POOP. and they live a long time. And their cage needs to be gigantic and that isn't even enough space. And it stinks FROM ALL THE POOP.

Mouse or hamster or little lizard is a better idea."
16849,"Yes, a rabbit!

Our rabbit lives in our house, in a cage. He was raised very carefully as a baby (before we got him) to be used to and comfortable around humans. 

He has a toilet, that he actually uses, that we just clean out daily. No smells. He loves to be petted and attention and to be social. Other then that, he's very low maintenance. We usually have his cage open, but he doesn't get out. He just puts his head out to ask for cuddles. 

We have cats too. Cats are assholes. They destroy our house, are loud and leave hair everywhere. Plus they poop in our garden if they get the chance (yes they each have a perfectly fine and clean litter box inside the house). The rabbit is 100 times better at being a good pet. 

If you do decide on a rabbit, get one from a responsible breader that gives plenty of human contact when they're babies."
16850,"Not all rabbits are like this, just so you know. 

I've known several, all owned by close friends. One is a joy (we actually fostered her for a week), one is a turd and does as he pleases, and one reaaaaaally doesn't like to be touched, despite frequently handling when he was young.

Ya just never know. Not to mention their diets are very specific and over-doing it on fruits and carrots can actually make them very sick."
16851,"I'd like to add a) hay is a very common allergen and b) rabbits have fur and shed heavily. There's a good chance that if their spouse is allergic to cats, they would react to the rabbit, too."
16852,I've always heard that rabbits are terrible pets for children. My ex had a house rabbit that was sweet as pie to him but loathed me and attacked me whenever I was around. I guess they can bond to one person.
16853,"I've had a rabbit. You're right, they tend to attach themselves to one or two people and need a lot of socializing to adjust to strangers. They're not really suited for for kids, although a rabbit can work as a family pet with heavy parental supervision. They aren't ""cuddly"" and have an instinctive fear of being lifted off the ground, so they shouldn't be picked up under most circumstances, which can be an issue for kids who want a pet they can hold. They're also destructive, messy, expensive (especially the vet bills), and surprisingly long-lived--10+ years isn't uncommon. A pet rabbit could easily see their daughter into college. Their personalities are a weird combination of sensitive, aloof, inquisitive, and stubborn. It's more like having a fluffy, bouncy roommate than a pet. Think vegan cats.

In short, rabbits make great pets for quiet, introverted, homebody adults that aren't house-proud or hung up on snuggling their pet."
16854,"Rabbits are interesting- Ive had them. Definitely not for everyone, especially small kids. Much like birds, they really only bond to one person and have a longer than anticipated life span (for most people) and many wind up dumped   or in shelters because people weren’t ready for the commitment."
16855,"Cats are not assholes- Im sorry you had a bad experience with a cat or two but cats are generally quite affectionate... and rabbits are not a great suggestion for kids. They stink, poop constantly, and are not very cuddly, plus they chew EVERYTHING and are very destructive unless they have an area set up properly for them."
16856,I have noticed any smells coming from my friend's hedgehog. But I don't really see the hedgehog much. Nocturnal.
16858,I don't believe in getting pets for kids. What kind of pet do you want? If you don't want any then don't get any.
16859,A fish is really the only thing I can think of that fits the bill for low maintenance and not a smelly cage.
16860,Fish are harder than most people think. Even bettas need heaters and filters and goldfish need a huge tank. Plus there's weekly water changes and testing.
16861,"My parents always considered fish to be closer to a living chemistry experiment than a pet. There’s a lot of chemical adjustments, tank checking, water changes, etc."
16862,Maybe....my roommate had a beta fish in college and I don’t remember anything too extensive going on.  At least not anything an 8yo couldn’t handle.
16863,"With parental supervision I agree. A betta fish is as good as you're going to get for a beginner pet. They're still a lot more work than most people think, as well as more delicate , so I'm always hesitant to recommend them."
16864,My beta lasted 3 years in a regular plastic tank
16865,"Ehh, a lot of fish *can* live in bowls, but it's unless you're properly changing the water every other day and testing often for chemical levels, it's actually a pretty miserable experience for the fish. 

If you're doing it properly, a betta fish should have at least a five gallon tank, but ideally s ten. You should get a proper nitrogen cycle going in your tank before you even purchase your fish, and then it needs to be properly heated and filtered. 

Betta fish are marketed as easy to keep in a unfiltered, small bowl/trendy mason jars because ""they live in puddles"" in their natural habitat, but it's only for a very short dry season. In reality, they're long distance swimmers for being such small fish. With proper care, Bettas can live an average of 3-5 years captivity, and often longer. They have personalities, can learn tricks, and they do develop a sort of basic attachment to their caretakers. 

I don't mean anything against you personally! I just hate the misinformation spread by pet stores who benefit from selling as many as they can, and try to combat it as often as possible. It's cruel for the fish and disappointing for the child when their new pet passes away in a month from accidental poor care."
16867,"That doesn’t mean the fish are low maintenance. To give them a happy, healthy life fish need some very specific care. Keeping them healthy is like running a years long chemistry experience that’s very finicky and needs a lot of adjustments."
16868,"If you're interested in learning to properly care for your fish, you should check out r/bettafish

They helped me when my roommate left her fish in my care. If not, it might not be a bad idea to consider rehoming them. I know they're just fish, but for fish, Bettas are pretty intelligent and require a good amount of care to live comfortable, healthy lives."
16869,"Prior to getting a cat, we bought SD5 two feeder fish from the pet store for around .17 each.  Those little shits lasted for nearly 4 months.

In that time, kid enjoyed looking at them exactly 3 times, other than that it was just me and mom feeding them and changing the water in their bowl.  Once they both died (at the same time...SO thinks she accidentally oversprayed some surface cleaner and it got into the water) we got the cat.  Mostly for me, lol."
16870,"My 3 year old informed me that fish are not pets because you cannot ""pet"" them. I have to say I agree with him. For most people, a fish would not be an appropriate substitute if they have their heart set on a dog."
16871,I agree. They can be very interactive though. I had a betta that would always come over and recognized me and my mom. Some fish are even smarter.
16872,"Assuming you realize that you will be taking care of the pet (and do the appropriate research and decision-making), crested geckos are great, fairly low maintenance pets. Most tolerate handling very well, if your daughter is comfortable with (cute) reptiles and gentle with animals. I suspect that this suggestion will be a bridge too far, but snakes (corn snakes are great for beginners) and tarantulas are also extremely low maintenance pets--depending on everyone's comfort level.

The reality is that despite your daughter's passion right now, you will most likely participate in most, if not all, of the pet maintenance--or at the very least, you'll be pestering your daughter to keep up her end of the deal. I think it's fantastic for kids to have pets and my son has plenty (reptiles, fish, and insects are his passion) and he actually takes care of them pretty well at this point (he's 13), but even with his uncommonly dedicated pet maintenance routines, we still end up having to pick up the slack on occasion and remind him not to neglect his animals. And this is a kid who has been obsessed with animals since he could talk and received his first snake when he was five years old. We've let him keep a number of pets in the years since because he's proven himself capable of taking care of them--mostly. But no kid is flawless--they have a lot going on. Don't ever agree to get a pet unless you're willing to step in and make sure it doesn't die of neglect--or take over its care when your kid is away at camp, or whatever.

All that said, if you can manage to take on a bit more responsibility to get your daughter a pet, do try. My parents let us get a lot of small animals (fish, turtles, newts, hamsters, guinea pigs, rabbits) and I cherish those childhood memories. They never did let us have a dog or a cat, however, and I yearned my entire childhood for the kinds of experiences my friends had with their furry companions/confidantes. I still hold it against my dad a little bit that he was so adamant about not wanting the mess and fuss of a dog when, as an adult, I now know how much they bring to my life and positively impact my mental health. My son's relationship with our oldest dog is one of the most beautiful things I've ever seen. They've been together since my son was 18 months old. They're best friends. I'm so glad I was able to give my kid what I never got in that way."
16873,"Get a bunny, hamster, guiny pig..If you don't want a smelly cage clean it.
If your getting a dog remember that you are the one that walks it at least 3 times a day, and not only a 5min. walk. Feed it water it take it to the vet, if you go on a holliday make sure to take it with you or find  place it can stay for when you return..If you don't want to do these things then please don't take a dog.there are cats for allergic ppl, those scary sfinx ones:P"
16874,Hermit crabs are really cool and low-maintenance.
16875,Guinea Pig?
16876,"They smell fucking weird and are nocturnal so they make chirpy noises all night.


Also, they smell weird.


Did I mention they smell weird? Because they smell weird."
16877,"They aren't nocturnal.

The chirping noise is very cute. We always kept ours outside so it wasn't an issue. Don't remember the smell."
16878,"> The chirping noise is very cute.

To *you.*  Not everyone likes the same things.  Kids singing in commercials makes me want to jam a fork in my ears, yet somehow people keep doing it."
16879,That's weirdly specific
16880,"My point is one man's ""cute"" is another man's ""OHGODPLEASEKILLME."""
16881,"Well yes, you can say that about just about anything. 

The real response I wanted to give to this post was 'Don't get a pet. They are more trouble than they are worth' but I thought I'd try and be nice and helpful. Will go with gut next time."
16882,"Well the one my sister had seemed to be, because that little shit chirped all fucking night. She put him in my room because of that amd the smell. I ended up caring fot the little noisy shit until he was rehomed."
16883,"I can’t put them in order from 1 to 5, but here we go:

**Grimvalor** (side-scrolling action game)

**Villagers and Heroes** (MMORPG)

**Silversword** (old school first person dungeon crawler)

**Necrobarista** (from Apple Arcade, Visual novel)

**9th dawn 3** (Open world RPG action RPG)"
16884,"Love silversword. Try out the bards tale, very similar and one of my favorites."
16885,"[Phoenix 2](https://firigames.com/phoenix2)

[Micro Breaker](https://rasterage.com)

[Color Defense](http://www.colordefense.de)

[Horizon Chase](https://apps.apple.com/us/app/horizon-chase-world-tour/id991018252)

[Neon Chrome](https://neonchromegame.com)

[Jydge](https://www.jydge.com)

As someone else mentioned, no particular order. All equally quality games."
16886,"Neon chrome looks like a fantastic game, definitely putting that one on my list of games to play !"
16887,"It’s awesome. After you play through the levels and destroy the Overseer, you’ll fight a higher level Overseer and open up opportunities and unlock stuff. Highly replayable with [procedural level generation](http://neonchromegame.com/2016/03/03/neon-chrome-level-generation/) — [10tons (makers of Neon Chrome and Jydge) Discord chat](https://discord.gg/6QYnMkKk)"
16888,I loved neon chrome. TBH I only found two good gun/strategies which was shotgun with bullet spilt and damage then the fire grenades with the thing that makes you immune to fire and increase blast of grenade
16889,"One of my favorite combos is RG-115 Electron, Fire or Frag Grenades, Assassin."
16890,"My favorite combo was shotgun. Rounds split up, extra energy, extra clip and reload speed, more damage and then you pick the class with shield i don’t play chrome much anymore but those where my go to no skill combos"
16891,You’ll probably like Jydge too. Similar universe. Jydge is a prequel to Neon Chrome and has a lot of interesting aspects as you’ll develop your character and face numerous challenges.
16892,"1. Wayward Souls
2. Downwell
3. PathPix series
4. Hearthstone (May change given recent events...)
5. Galaxy on Fire 2"
16893,What events?
16894,"\#StopBlizzardGreed

Updates to make the free reward system less generous."
16895,"Not in any particular order:

Minecraft

Dungeon Raid (RIP, Dungeon Falan as it's proxy)

The Quest (and expansions!)

868-HACK (hard to decide between this one and Imbroglio, I love them both)

Mindustry (which just got an AWESOME UPDATE!!!)"
16896,"> Dungeon Raid (RIP, Dungeon Falan as it's proxy)

Check out Troll Patrol; https://apps.apple.com/us/app/troll-patrol/id1394832108"
16897,"Not OP, but I was reminiscing on Dungeon Raid and decided to do a reddit search on it. Thank you so much for troll Patrol! It doesn't feel as snappy but it scratches the itch!"
16898,Oh my fucking god. Your a legend bro. Thank you.
16899,Which one is the best?  Asking for a friend
16900,Troll patrol is a game that works great in mobile. I love these ‘match three’ dungeon crawlers
16901,"Oceanhorn 2, Asphalt 9, TheoTown, GTA:SA, Game Dev Story"
16902,"Star Trek: Timelines

Hades’ Star

Dig Deep

Sky

Dark Echo"
16903,"I love my strategy games so:
Civilisation 6
Kingdom: Two Crowns
Bloons TD 6
Kingdom Rush series
Splendour (card game)"
16904,"I love the awesome zombie 2D games  like **Force Legend: Zombie Invasion** and **The Walking Dead: The Game**. The zombie games are my favourite mobile, and overall games of all time. **Into the Dead 2**, **Dead Island: Survivors**, **Minigore 2: Zombies** in there also.

Let me share some details about the games:

[Force Legend: Zombie Invasion](https://apps.apple.com/us/app/force-legend-zombie-invasion/id1475439440)

It's my all time 2D favourite game. It's a zombie shooter game with 6 chapters and each chapter has 6 levels but the last level is boss. One of the chapter can be accessed only if the user has a special chapter. Moreover, Each character has own different weapons and bullets. The game is quite interesting and addicting.

[The Walking Dead: The Game](https://www.pocketgamer.com/games/018078/the-walking-dead-the-game/)

It’s a game that explores some very dark psychological places, revealing that the undead are not the only thing to be afraid of when society crumbles.

[Into the Dead 2](https://apps.apple.com/us/app/into-the-dead-2/id1151220243)

You will experience a journey through the zombie apocalypse in a race to save your family. Arm yourself with an arsenal of powerful weapons and do whatever it takes to survive in a world where no one is safe, how far will you go to make it out alive?

[Minigore 2: Zombies](https://apps.apple.com/us/app/minigore-2-zombies/id576939960)

In this game, you have to help JOHN GORE fight his way through sunny lakes, graveyards and freezing plains into a stormy forest where the legendary METUSALEM has brought to life murderous chefs, giant lumberjacks, killer penguins, a single moose, three hundred rabbits and the entire undead army of the COSSACK GENERAL."
16905,"The quest 

Goblin sword 

Doom 

Keroblaster

Exiled Kingdoms"
16906,"1: stardew valley ( just about everything)

2: CoD mobile ( you know)

3: Pascal’s wager (dark souls style game)

4: Minecraft (you know)

5: dead cells (very hard dungeon crawler)

6: villagers and heroes (mmorpg)"
16907,"Which control scheme do you use for Stardew? I’m obsessed with the game on PC, but feels kinda awkward on my iPhone."
16908,"I just use touch controls, they are pretty good when u get used to them"
16909,sky genshin impact btd6 grid san andreas
16910,"1. Stardew Valley
2. Solitarica 
3. Dead Cells
4. Death Road to Canada
5. Hearthstone"
16911,"In no particular order:
1. Monument Valley
2. Thronebreaker
3. Playdead’s Inside
4. Grimvalor
5. Slay the Spire"
16912,"My yet favourites in this order: 
1:Slay the Spire 
2:Moonlighter
3:Oddmar
4:Thronebreaker 
5:Dead Cells
6:Krumit’s Tale 
7:8 Ball Pool ( this one is a free game )"
16913,What do you play dead cells with. I am a bit worried my iPhone wouldn’t be able to handle it. I am thinking of buying it for Christmas
16914,I play it on a iPhone 11 But my wife is playing it on a iPhone 8 so it runs exactly the same. No problems
16915,"Bloons TD6
Clash of Clans
Nonogram
Plague inc
Cookies inc"
16916,Super Hexagon. I've bought it on Android AND iOS. Twice. (Made a US account when my country had the worst catalogue. Then I got a new phone and couldn't use the US account.)
16917,"Archero 

Soul Knight

Otherworld Legends

Mobile Legends

Night Of The Full Moon"
16918,"Minecraft,
Stardew Valley,
Grid Autosport,
Call of Duty Mobile,
Prison Architect."
16919,"Genshin Impact
GTA
PUBG
Dead Cells
Thumper"
16920,"It’s too hard to decide, I do like a lot of idle games but I am trying to get away from them I do like Almost a Hero, Just Mowing, and BitLife I play a few other games here and there like StarDew, Nexomon, Juicy Realm and recently I just bought HyperLightDrifter"
16921,"I just got into hyperlightD. Really cool game, I’ve connected my PS4 controller and it’s great"
16922,Nice idk how to do that
16923,Oh super easy! Hold down the share button and ps button and it’ll flash. Go into ur iPad Bluetooth devices and it’ll appear there
16924,"Phoenix 2, Go quest, eternal, chess.com + lichess, pathos: net hack codex

The only games I’ve continued to play on my phone"
16925,"codm

pubgm

among us

pokemon go

alto's adventure 

these games are not in order"
16926,"All time in no order:

Heroes vs Monsters

Clash of Clans

Summoners War

Lil Alchemist

Mino Monsters

Honorary Mentions:
Flow Free, Baseball Superstars, Battle Cats, Endless Frontier, Ninja Warz"
16927,Wasn’t Mino Monsters removed?
16928,When Mino Monsters 2 came out they removed the first one seemingly abruptly. I enjoy 2 but I love the original and am sad I can't play it anymore.
16929,"Same, it was really good back then."
16930,"CSR 2 (racing and building cars)
WWE champions ( gem crunching wrestling game)
DC Legends ( super hero rpg)
COD mobile ( really cool and very free 2 play)
Madden mobile (sucky football but I am hooked)"
16931,"I use iPad, so apologies if any of these aren't on the iPhone.

Top 5 games: 

- Ticket to Ride
- Solitairica 
- Thomas Was Alone
- Mini Metro
- Sproggiwood

Top 3 game series:

- Kingdom Rush
- Go (Lara Croft, Hitman, Deus Ex)
- Monument Valley

Bonus 2 games no longer available:

- Wonderblade
- Monster Hunter Freedom Unite"
16932,Ticket to ride is a great board game
16933,"1.Raid Shadow Legends(yeah don’t ask)

2.King’s Raid

3.Illusion Connect

4.Genshin Impact

5.Summoners War

Big fan of gacha games  although I enjoy other genres from time to time"
16934,"Trigger fist (first one) 
Two spies

That's it, that's the end of my comment"
17722,AFK Arena
16936,"Legends of runeterra

Brawlstars.  

I like clash royale but I’ve played since beta"
16937,Call of Duty Mobile. It’s absolutely legendary.
16938,Surviving High School by EA. This game was great. But nothing compared to it these days. Everything is shit in this genre.
16939,"Worldbox
Conduct This
Horizon Chase
Mathematik
Alto"
16940,"Rush Rally 3

Fez

Forager (recently)

Grid auto sport

Bullet hell monday

Not in this order"
16941,"Opinions of forager...
I’m on the fence"
16942,"It’s fun. It’s addicting but the game doesn’t tell you what to do so you can mess things up for yourself in the long run. I started buying land and not upgrading my stuff so I almost literally cant organize crops or anything. My item management sucks too. And my upgrades too. Most of this is my fault, but because there is no rules that are set out, it’s a figure out stuff for yourself type game where multiple saves will be happening and you’ll be better an better each save file."
16943,"Not in order:
Infinity blade 3, Minecraft, Dead cells, Honkai impact 3, The Room (all the games)"
16944,"My top 5 would be 
1) call of duty mobile(FPS game)

2) arena of valor(moba similar to league of legends)

3) modern combat 5(I used to play this game the whole time just when they added in the shield class and when more P2W I quit)

4)age of civilization(my phone isn’t as strong to play game so I usally just reduce down the size of map in editor, I think it is called age of history now, basically EU4 mobile and is grand strategy game)

5) be a hard choice of many games"
16945,"Stardew Valley

Dead Cells

Genshin Impact

Space Marshalls

Brawlhalla"
16946,"1: cod mobile

2: archero

3: csr racing 2

4: tap titans 2

5: bloons td 6"
16947,"Of all time? 

Eliminate Pro

Archetype 

Minecraft

Brawl Stars

KartRider"
16948,"1. Paladog - still playing this on an old device. My favorite mobile game of all time.

2. Chrono Trigger - the greatest game of all time.

3. Street Fighter IV - my go-to game if I wanna beat someone up.

4. Zombieville 2 - mindless fun

5. Retro Bowl - the best football game of all time lol."
16949,"My go to’s are

1. Hearthstone 
2. Dead Cells
3. Slay the Spire
4. Wild Rift
5. Call of Duty"
16950,"Mine in no particular order

Nethack ... the rogue the roguelikes are “like”

Polytopia- civ lite for mobile

Gems of war - great game, match 3 puzzle rpg with so... much... content.

Mini metro

Hexiled"
16951,These are my favorite posts on this forum.  I’ve been gaming exclusively on mobile for 3-4 years now and love finding a good game that I missed.  Thanks so much!
16952,What made you go dedicated on mobile?
16953,"Most do it to save money. I know many people who’s only electronic device is their phone, they use it for everything including tv. They save a lot of money by minimizing tech."
16954,It makes sense but I would say not just saving money but time. The ability to jump right into a game on an iPad is another selling point. Not that XBOX or PlayStation takes hours but it does take longer. This is definitely more pick up and play.
16955,True yeah. Plus the durability of not needing to worry about a controller / buttons getting jammed or whatever. Touch screen gaming good imo.
16956,"Yeah, but more than just touch. The ease with which you can hook up a PS4 or Xbox controller and how that levels up a large number of excellent AAA titles on iOS is a great story."
16957,"true, I always preferred touch screen, I have trouble using a controller, knowing what each button does etc. it is complicated as heck."
16958,"The good news is it's really not an either or. In the case of the iPad, you can have your cake and it eat too with controllers."
16959,"I have a disability and am only capable of playing mobile for a while now.  This being more or less against my will, it makes me happy that there are people like you that actually choose to only play on mobile."
16960,"Strictly iOS gamer here, my absolute favorite games are:

Civilization 6: I love strategy games and this is the best in my opinion 

Company of Heroes: Amazing RTS game, so glad these companies are porting these classic games to iOS 

Rome Total War: Another GREAT strategy game, can’t believe this is a mobile game...wow

Northgard: Just started played this one and I’m already hooked, Strategy/Management game

XCOM 2 Collection: Console quality strategy game, amazing depth and graphics 

Six Ages: Create your own story game, please try this game if you like complex strategy games, I bet you’ll love it 

Dead Cell: Rogue-Like strategy game, one of the best dungeon crawlers ever made. 

KOTOR 2: I’m so glad they ported this to iOS, haven’t finished but it’s amazing so far."
16961,Have you six ages prequel? Kings of Dragon Pass?
16962,"Oh yes, I remember playing KODP for hours straight, such a deep and addicting game....and Six Ages is ever better"
16963,"Some really quality posts on this sub lately. Lots of lists! I love lists!  

Here’s my preloaded reply, apologies if you’ve seen this already...  

Not all on here are iPad exclusive but there are lots! I enjoyed;  

Sid Meier’s Civilization VI. (4X/Grand Strategy) https://apps.apple.com/us/app/sid-meiers-civilization-vi/id1235863443.  

Dungeon of the Endless. (Roguelike/Strategy). 
https://apps.apple.com/us/app/dungeon-of-the-endless-apogee/id1526466468.  

Book of Demons Tablet Edition. (ARPG) https://apps.apple.com/us/app/book-of-demons-tablet-edition/id1491139385.  

Darkest Dungeon. (Roguelike/RPG) https://apps.apple.com/us/app/darkest-dungeon-tablet-edition/id1199831446.  

Roller Coaster Tycoon. (City Builder/Management) https://apps.apple.com/us/app/rollercoaster-tycoon-classic/id1113736426.  

Crying Suns. (Roguelike/FTL-like) https://apps.apple.com/us/app/crying-suns/id1511788295.  

Atom RPG (RPG/Fallout 1-TBS style) https://apps.apple.com/us/app/atom-rpg/id1465288147.  

Pascal’s Wager. (RPG/Dark Souls like). https://apps.apple.com/us/app/pascals-wager/id1476649036.  

Slay the Spire. (Deck Builder/Roguelike). https://apps.apple.com/us/app/slay-the-spire/id1491530147.  

Dead Cells. (Roguelike/Platformer) https://apps.apple.com/us/app/dead-cells/id1389752090.  

Xcom: Enemy Within. (TBS/Base Builder) https://apps.apple.com/us/app/xcom-enemy-within/id881270303.  

Xcom 2 Collection. (TBS/Base Builder). https://apps.apple.com/us/app/xcom-2-collection/id1288508230.  

Star Wars Knights of the Old Republic. (RPG). https://apps.apple.com/us/app/star-wars-kotor/id611436052.  

Star Wars KOTOR II (RPG). https://apps.apple.com/us/app/star-wars-kotor-ii/id963230767.  

Company of Heroes (RTS). https://apps.apple.com/us/app/company-of-heroes/id1464645812.  

Sunless Sea. (Roguelike). https://apps.apple.com/us/app/sunless-sea/id1133500069.  

Baldur’s Gate collection. (RPG). https://apps.apple.com/us/app-bundle/the-infinity-collection/id1376284772.  

FTL: Faster Than Light. (Roguelike). https://apps.apple.com/us/app/ftl-faster-than-light/id833951143.  

Prison Architect. (Base Builder/Management).
https://apps.apple.com/us/app/prison-architect-mobile/id1174105466.  

Paper’s, Please. (Simulation/Puzzle). https://apps.apple.com/us/app/papers-please/id935216956.  

Project Highrise. (Base Builder/Management). https://apps.apple.com/us/app/project-highrise/id1277095117.  

Mindustry (Strategy/Base Builder/Tower Defense/RTS/Management) https://apps.apple.com/us/app/mindustry/id1385258906.  

Dungeon Warfare 2. (Tower Defense). https://apps.apple.com/us/app/dungeon-warfare-2/id1453661259.  

TheoTown. (City Builder/Simulation). https://apps.apple.com/us/app/theotown/id1459639864.  

Tropico. (City Builder/Simulation). https://apps.apple.com/us/app/tropico/id1264531625.  

Grid Autosport. (Racing). https://apps.apple.com/us/app/grid-autosport/id1179421849.  

Rome: Total War (Strategy/RTS/4X). https://apps.apple.com/us/app/rome-total-war/id1106831630.  

Craft the World. (Base Builder/Crafting). https://apps.apple.com/us/app/craft-the-world-pocket-edition/id921954809.  

Steamworld Heist. (TBS/RPG). https://apps.apple.com/us/app/steamworld-heist/id1093396572.  

Hidden Folks. (Hidden Object). https://apps.apple.com/us/app/hidden-folks/id1133544923.  

Stardew Valley. (RPG/Simulation/Farming). https://apps.apple.com/us/app/stardew-valley/id1406710800.  

Xenoworks Tactics. (RTS/Squad/RPG). https://apps.apple.com/us/app/xenowerk-tactics/id1469037103.  

Banner Saga. (RPG/TBS). https://apps.apple.com/us/app/banner-saga/id911006986.  

Osmos for iPad. (RTS/Gobble n’ Grow). https://apps.apple.com/us/app/osmos-for-ipad/id379323382.  

Kingdom Two Crowns. (Base Builder/Strategy). https://apps.apple.com/us/app/kingdom-two-crowns/id1477991646.  

80 Days (Choose Your Own Adventure). https://apps.apple.com/us/app/80-days/id892812659.  

Unknown Knights. (Roguelike/FTL-Like). https://apps.apple.com/us/app/unknown-knights/id1459797573.  

Rusted Warfare RTS. (RTS). https://apps.apple.com/us/app/rusted-warfare-rts/id1514329124.  

Northgard (Colony Builder/RTS).  https://apps.apple.com/us/app/northgard/id1533979882   

All flavors of game types to choose from, hope this list helps. Enjoy!"
16964,"Fantastic list! I forgot about Baldurs Gate 2, incredible game"
16965,"Sunless Sea is fantastic (albeit grindy) it’s got a sequel, sunless skies and it all takes place in the Fallen London universe. If I had an ipad I would absolutely have sunless sea downloaded but I see it more as a pc game and really only for those who know the universe. Was glad to see it on the list though!"
