idx,text
41476,"That is fine for making music in your bedroom with a computer.

Not everyone has a voice that everyone wants to hear! It's more practical to play an instrument that you can play with other people - you can sing at the same time."
41477,"Piano is so versatile, another vote for that."
41478,"^bass

Seriously, piano, doesnt even have to be a regular old one, can be a keyboard with nifty settings 

~~then guitar or bass~~"
41479,Piano is such a helpful instrument that music students in colleges or conservatories will also be taught how to play piano in addition to all of their musical studies.
41480,"For pop and rock, contemporary guitar is great. But the design and the fact that the same note can appear four times can be immensely confusing.

Piano is very linear and straight forward. There is only one C4, unlike guitar. Piano also gives a better visual reference in your head.

If you're just starting and want something fun, stay away from anything requiring breath. You will have a steeper learning curve as you have to practice even getting a proper sound it of it. Hope this helps."
41481,"So, piano?"
41482,"Maybe it's odd, but I found theory much easier to grasp once I'd learned a bit of guitar -- not that I'm any sort of expert!  Piano and guitar work in different ways, gabrielsab's comment above was pretty spot on about the trade-offs.  I think I know enough to explain.

Theory lesson 0: What it means when someone says ""We're playing in C Major.""  C is the key, Major is the mode.  Together they define a set of notes that are going to make sense to play together.  Piano makes it easy to stay in one key and change the mode.  Guitar makes it easy to stay in one mode and change the key.

With a guitar you can learn a chord shape or a scale shape and play the same chord or scale in different keys just by moving that shape up and down the neck.  On a piano, if you want to play in C major you can do so with only the white keys, but if you want to play in F major or any other major key you'll need to learn a different combination of white and black keys.  The trade-off for this is also the reason for it: If you stay in the key of C on a piano, you can play in other modes by continuing to use all the white keys, but resolving your melodies to a different note (e.g. beginning and ending a melody with F, using all the white keys, will be a phrase in F Lydian).

It's really easy to just stay in the minor mode and change key whenever you want on a guitar, but to change your mode freely you'll have to learn different shapes representing different modes.  On piano it's easy to stay in one key and change the mode, but to play in different keys you'll have to learn the shapes of the keys.  I think that, whichever instrument you choose, it would probably be helpful to play the other as well once in a while.  When I started learning about music, I was taught piano, but I was absolutely rubbish at it.  Later I learned bass guitar, and that seemed a lot easier.  Now it's helping me learn to play 6-string guitar, so I'm encountering chords again (note: it's still important to learn your chords when playing bass, you just generally don't play all the notes at once), and going back to learn just a bit about piano really gave me a different perspective.

With either, if you learn all the shapes corresponding to keys or modes on either instrument, you can do many of the same things.  A guitar can play six notes at once while a piano can play ten, where having five on each hand allows you to more naturally play two things at once, but a guitar can slide and bend notes and if you're into rock and roll you'll appreciate being able to play melodies with power chords in any key by holding one simple shape, as well as the portability and the powerful sound of a good amp.  If you prefer classical music, piano will probably be a better tool for understanding that world.  Those are the major trade-offs, but learning either or both would be worthwhile."
41484,"Is this just for yourself, or do you actually want to perform? If you want to play on stage with a group, Clarinet or Cello, depending on whether you are interested in band or orchestra. You can play clarinet in both, but you need to be really good. 

I'd do violin if it were just for myself. 

Why those? Piano is great for music theory, but it's not that interesting to me - you don't have much control over how beautiful you sound, and it all sounds the same. With a cello or violin, you can pluck the string, you can play with a bow, play with a bow upside down, add vibrato, don't add vibrato... you have a lot more control over what you sound like. 

I'd pick cello for orchestra because they always need cellos and they have gorgeous melody lines, or fantastically dramatic ones. Listen to the beginning of Beethoven's 3rd. Yep, that's cello. Bass lines in classical are awesome, unless you're a tuba. 

Clarinet for band because you are the equivalent of a violin section in a band, and you can do rhapsody in blue/cantina band jazz awesomeness. If you can get really good, you can play in orchestras as well. So... pretty much everything.

Violin if for myself only because there are tons of solo violin stuff. And it's easy to transport - I swear I'm going to try busking someday."
41485,">unless you're a tuba

umm tuba is great what are you talking about"
41486,Right? Stand Tunes breh :p
41487,"One, five, one, five, one all day long isn't really fun. Wagner has great tuba parts. Berlioz is pretty awesome, so is Stravinsky...

But usually tuba doesn't get good lines. Maybe in brass or jazz bands? Also, they're expensive as hell. 

Well, they can also have fun when military bands get [bored](https://m.youtube.com/watch?v=zmFYgc-Emmc)."
41488,"And the tuba is rarely used as such outside of bad band music. Composition had generally moved past that kind of harmonic simplicity before the tuba was even invented! The tuba holds down the bass on so many incredible brass moments in late Romantic music--Mahler, Strauss, BRUCKNER! You already mentioned Wagner and Stravinsky... The tuba was also treated quite favorably in Russia, just check out the music of Mussorgsky (leaping to France, look at the tuba part to the Ravel's orchestration of Pictures), or of course Shostakovich and Prokofiev in the next century, which I could go on about.

It just makes absolutely no sense to say ""bass lines in classical are awesome,"" and then assume otherwise about an instrument you clearly aren't very familiar with. Why would composers think, ""wow, all these root position tonic-dominant alternations are getting boring, why don't we write interesting and highly chromatic bass lines?"" and then not do the same for the tuba???

Tubas also get great parts in brass quintets. One of the most played brass quintets around starts with a damn [tuba solo](https://www.youtube.com/watch?v=5XXyrcmOKps)! 

I'll leave you with [this](https://www.youtube.com/watch?v=O-NkYMRUQvs)"
41489,"Mostly because that's all late composers, and community orchestras - or at least the ones I've seen/played in - only very rarely do they play anything later than Dvorak. Generally you're stuck playing the contrabass part at best if you're in an orchestra. 

The one and only thing our orchestra has played out of that entire list is Mussorgsky, night on bald mountain. And I wasn't there for it - it was ten years ago. Though we did play Jupiter a couple of years ago. Yay, orchestra tubas? We just got our director to green light sorcerers apprentice... which has bass clarinet and contrabassoon awesomeness. 

Trombones don't get the best treatment in orchestras either. 

Cello parts are great from Baroque to modern, meanwhile. You're never going to have a bad part."
41490,"But nothing about the question established that we were only talking about repertoire playable by a community orchestra. Putting a brass quintet together is a much more rewarding avenue for an amateur tuba player anyway. Repertoire with good tuba parts is all quite common for even decent youth orchestras and becomes increasingly common through conservatories and professional orchestras. I played Bruckner 7 and 8, 3 movements from Mahler 3, and Shostakovich 4 all before I left high school. And in a real orchestra they would never stick the tuba player on doubling a bass part, the tuba player just gets to leave whenever the orchestra is playing a piece without a tuba part. They still get to collect their salary even if for a week they only have to show up to rehearse some Berlioz overture and then go home while the orchestra does Mozart or Beethoven."
41492,"Then think of what kind of music you like and pick the instrument that fits it. Maybe also consider how expensive the instrument is. 

Oh, one other that might be good - French horn. You can play anywhere but a jazz band, and it's the star instrument of movie soundtracks. Pretty difficult to play, though, there are a lot of partials for each fingering. 

You're going to want a teacher whatever you pick."
41493,"Guitar. So many different things you can do with it because of amps and pedals, plus acoustic guitars. Piano is better if you want to learn theory but guitar is just more versatile and more fun imo."
41500,Piano
41495,"Drums, because even if you aren't interested in pursuing music as a lifestyle, learning to play drums can teach you the basics of rhythm, while also allowing you to exercise your multi-tasking capabilities, multi-THINKING capacities, and beating on things with sticks is a wonderful form of stress relief."
41496,"As a piano player . . . Learn both guitar and piano.  

Piano will give you a wider musical selection to learn from and easier visual cues to understanding the relationships between notes/chords/progressions, etc.  

Guitar requires you to actually understand musical relationships because there are less visual cues.  At least for me, anyway.

Ultimately, pick up an instrument and hammer away.  Really try to understand what's happening in the music and absorb it.  If you give yourself to it, you'll walk away with value regardless of what instrument you choose."
41497,"electrical signal to audible sound, by computer"
41498,"Piano, it so easy to understand harmony from it."
41499,"Piano.

Guitar is definitely more portable and convenient, but piano is the daddy of all instruments. Nothing even comes close."
41501,Get a cheap keyboard and a cheap electric guitar and learn both. This will set you up for creating/playing along with a wide range of modern music and IMO they both have qualities that help your understanding of how music works.
41502,"A great big violin. So a viola or maybe even some larger theoretical instrument. 

My reasoning: I would want to have a fretless instrument so that I could experiment with all the nice ratios of notes, but fretted instruments (the piano is also discrete and basically fretted, I'm a guitarist), don't let you get at these nice ratios. There are in fact 41 simple ratios between a unison and an octave, if you consider all possible ratios with numerator <= 16. Western music only considers some of these valid, but for no good reason.

I read the title as a creative one, but practically, guitar or piano or drums would be your answer. Guitar is the easiest and cheapest to get into."
41504,"well I'm thinking something you play like a viola, not stand up like a cello. Just to get a bigger range of frequencies. Or maybe even a cello I would choose. Maybe I'd go with cello then, the viola is probably the largest of the violin family that's played on the shoulder for a reason."
41505,Horn...? Am I the only one that finds the sound amazing?
41506,Guitar! The options are endless (especially in the electric guitar world)
41507,"You could learn either guitar or piano. As a low intermediate guitarist, I can confirm that it is hard, especially at first, but it is a very fun instrument to play. It has some advantages over the piano. For one, you have more options for very different sounding chord voicings. It is also easier to change keys, and you can do more techniques (electric guitar, clasical guitar, and acoustic guitar all have different techniques, although some techniques are shared by all kinds of guitars.) There are more lessons available for guitar, and it is more versatile. However, it also has its cons. On guitar, it will take you at least a couple weeks in order to get a decent sounding chord, and your fingers will hurt. a lot. On guitar, chord shapes and scales are harder to learn. The piano, on the other hand, has a wider range of notes (about twice the range of the average guitar.) Another pro of learning piano is that learning your chords and scales are a lot easier since they're all laid out in front of you. I'll say it is easier to learn the piano to a point of proficiency, but guitar is more versatile, and portable"
57289,Username checks out.
41510,"It's funny because SamOnDrums's username is very applicable to their comment.  
 ^^*beep* ^^*bop* ^^if ^^you ^^hate ^^me, ^^reply ^^with ^^""stop"". ^^If ^^you ^^just ^^got ^^smart, ^^reply ^^with ^^""start""."
41511,"As a 25 year + guitarist, and a 2 months old pianist. I say piano! :lol:

Though if you are looking at it as a lifetime pursuit(which you should), no reason why you cant learn both. They are different instruments, but my ability on the guitar definitely isn't a hindrance to learning piano. It's actually very helpful for me. As I've a much much bigger leg up than an absolute beginner(My learning curve is much smaller, as I've a lot of knowledge theory wise that transfers over and finger dexterity from the guitar helps too. Hand independence is very difficult, but i'm just using brute force, stubbornness and time to get over that! :lol: )."
41512,"Another one for piano here. Imo it is laid out the most logically and is the easiest way to really dig in to the theory part of things. Once you get some of the basics you can always use your piano knowledge as a reference to learn other instruments.

I've seen very good multi instrumentalists go back to the piano time and again to work out melodies, rhythms, etc. and apply that knowledge to all sorts of different instruments. 

Once you start getting a grasp of some of the basic patterns it is a magical thing and really fun. Music is the language of the universe. Start today and you will be surprised how quickly you can pick it up. Have fun and good luck!"
41514,"Piano, unless you want to play drums... Then play piano and drums."
41515,"Played piano a bit when I was young for a few years. Hated it. Too slow reading notation and it frustrated me. Played guitar when I was a teenager and bass and drums in my twenties.

So knew the basics. Chords were easy. So got my family piano from the old folks, moved it into the instrument room and started using my old guitar songs with the chords on it. I knew the basic shape of a chord so going back to piano was easy. Now I love the piano. 

Finding a way to play your instrument which makes learning/playing easy for you. For me it's finger/chord shapes and runs. I'm pleased my folks made me play piano (even though I hated it at the time) when I was 8 yrs old. It really laid a solid base for music knowledge with other instruments."
41516,"I'd say learn keyboard, down the line if you learn how to use any kind of DAW, you can effectively get any sound you want out of it with all kinds of control if your keyboard has modulation controls."
41517,"Videos in this thread: [Watch Playlist &#9654;](http://subtletv.com/_r6b0ayu?feature=playlist)

VIDEO|COMMENT
-|-
[Ryo Fukui - Scenery 1976 (FULL ALBUM)](http://www.youtube.com/watch?v=Hrr3dp7zRQY&t=15s)|[+3](https://www.reddit.com/r/musictheory/comments/6b0ayu/_/dhj64at?context=10#dhj64at) - This man started learning piano in his 20s (which many would consider ""too late"" compared to those 5 year-old piano prodigies) and he released this Jazz album only 6 years after he began learning. He obviously busted his ass off, but you can do it in...
[Stars and Stripes Forever with tuba playing piccolo solo](http://www.youtube.com/watch?v=zmFYgc-Emmc)|[+1](https://www.reddit.com/r/musictheory/comments/6b0ayu/_/dhjl1i5?context=10#dhjl1i5) - One, five, one, five, one all day long isn't really fun. Wagner has great tuba parts. Berlioz is pretty awesome, so is Stravinsky...  But usually tuba doesn't get good lines. Maybe in brass or jazz bands? Also, they're expensive as hell.   Well, they...
(1) [Brass Quintet No. 1 in B-Flat Minor, Op. 5: I. Moderato](http://www.youtube.com/watch?v=5XXyrcmOKps) (2) [Penderecki - Capriccio for Solo Tuba (Audio+Score)](http://www.youtube.com/watch?v=O-NkYMRUQvs)|[+1](https://www.reddit.com/r/musictheory/comments/6b0ayu/_/dhjmchv?context=10#dhjmchv) - And the tuba is rarely used as such outside of bad band music. Composition had generally moved past that kind of harmonic simplicity before the tuba was even invented! The tuba holds down the bass on so many incredible brass moments in late Romantic ...
[Tommy Emmanuel - Initiation - (part 3 of 8)](http://www.youtube.com/watch?v=kdQVdS_MsE0)|[+1](https://www.reddit.com/r/musictheory/comments/6b0ayu/_/dhjddrf?context=10#dhjddrf) - http://www.youtube.com/watch?v=kdQVdS_MsE0
I'm a bot working hard to help Redditors find related videos to watch. I'll keep this updated as long as I can.
***
[Play All](http://subtletv.com/_r6b0ayu?feature=playlist&ftrlnk=1) | [Info](https://np.reddit.com/r/SubtleTV/wiki/mentioned_videos) | Get me on [Chrome](https://chrome.google.com/webstore/detail/mentioned-videos-for-redd/fiimkmdalmgffhibfdjnhljpnigcmohf) / [Firefox](https://addons.mozilla.org/en-US/firefox/addon/mentioned-videos-for-reddit)"
41518,"Q: Whats a good musical instr......

A:**PIANOOOOOOOOOOO!!!!!!**"
41519,"""could only learn one instrument"" is silly. All great musicians know multiple instruments.

I actually tried to learn the piano when I was in my early 20/late teens but had to give up due to lack of materials online for learning piano. When I got into my late 20s I decided to start learning guitar. I found it much easier to learn as there are tabs and stuff for every song imaginable, while fining piano music for popular songs is very hard. Once I learned guitar well, I returned to the piano and I was able to be a pretty good pianoist from transferring what I learned on guitar. So I say learn guitar first then transition to piano. I find piano tutorials on youtube and stuff like that very poor."
41520,"But you can only master one instrument, right?"
41521,"Piano. 

If you ever want to learn a wind instrument: saxophone. I've played many wind instruments and sax was the easiest to pick up for me,"
41522,"Piano piano piano! Not only is there artistry in the modal structures/melodies, but there's an added level of customization through synth/sampler sounds, the possibilities are really endless"
41523,"I mainly play cello because it has my favorite timbre and range, with no frets allowing an ultimate level of expression, that few instruments have. But for composing, piano, and that's why I've been practicing piano so much."
41524,weenie whistle
41525,"It depends completly on what kind of music you want to make, and what you want out of your instrument. 

I prefer acouatic guitar, personally. Piano is also great, and it is more suited to visually getting theory, but it's not portable, and you can do bends or easy chromatic slides, and the timber sounds like a piano. Piano sounds cool for piano stuff but acoustic guitar sounds cool for acoustic guitar style stuff. 

Piano is also useful for doing production stuff with midi, but so is guitar, especially with some of the tech available that will only get better."
41526,"Since everyone's said piano I'll throw a couple of different solutions. 

Harp, it's more versatile than you think. Can do just about everything a piano can. Can get smaller models for portability. 

Accordion. It can be simple. You can solo with yourself, you can have great note dynamics, large range of good sounding options. You can then convert the left hand into free bass and play melodies with both hands as you get better. It's portable, has a nice wow factor, can play any genre of music including European traditional, jazz, classical, pop, and more. 

Piano harp and accordion would be the only three instruments I'd play to understand theory and play mostly by myself as a hobby. But if you like the sound of a particular instrument go for it. All instruments have their good qualities and the most important part of being a musician is enjoying the sound you're making."
41527,If you could only learn one I would say the guitar. You can do so much more with it than with a piano.
41528,"Guitar is my main instrument, and I disagree. Piano can have single lines, full chords, multiple independent voice textures. Complicated counterpoint is not always possible on guitar. Neither are open chord voicing. A piano's range is almost double a normal guitar.

There's a reason music theory is always taught in a room with a piano in it."
41529,"For me piano always ends up just being about pressing the note down and that's the only way to play it. You can't slide metal along the notes to make it sound different, you can't slide your finger down to make it sound different, you can't make a beat at the same time, you can't slightly bend the neck to create a new sound, you can't during a song detuned pat of the piano to give a new feel to a song. You can't wiggle your fingers in a certain way to again change the sound. For me there seem to be more ways to express yourself using a guitar. But them again I'm a total noob so..."
41530,"No, you're right. Theres a lot more organic kind of stuff like that on guitar. But you can still do some slide stuff sort of by dragging your nail on the keys. 

Piano has a lot of other advantages though. It has a bigger range, and the layout is really simple, and inversion possibilities far more flexible. 

It does have the pedals, which add a level of expression, and if you go digital, you can have after touch as well, and it *could* be even more advanced. There are mod wheels and stuff like that also, but, guitar is still better in the bend and tremolo and slide area and stuff like that.

It's also a lot more difficult. Especially acoustic guitar. Piano, you just press the buttons. Guitar is really difficult to play some chords, and do some things. Sometimes to just add one note you need to completely reset your grip, and there are a lot of chords you can actually fully play. 

On acoustic you are very limited for all the keys from A-Eb, for your low tonic. They need to be on the A string, which isn't very low, and you only have one higher chord you can play for it. 

Switching keys is easy on guitar and tough for piano, but guitars configuration is fucked up, whereas piano is real simple and logical layout. Visually easy for any given key, but transposing is more confusing."
41531,"I'm basing it from music i have heard and piano is nice but the things people do on guitar are so varied and Intriguing. I heard Tommy emanuel play a guitar and make it sound like a digeridoo, it was amazing, you couldn't do that type of thing on a piano. Perhaps a synth would provide more variety."
41532,"Tone wise, electric guitar beats piano no question. Music wise, the piano is more versatile."
41533,Unless you have a keyboard. You can spend days trying out different sounds
41534,He did that with a steel string acoustic.
41535,Do you have a link to that didgeridoo technique? Or a song name? I don't think I've seen him do that before.
41536,"I cand remember the exact title, once I get on the PC I will try and find it.  But the video is him playing in a mall in Australia, he is wearing a white suit jacket if I remember correctly. The song is a homage to the aboriginals and when he played I was amazed at what he was doing."
41537,https://youtu.be/kdQVdS_MsE0
41538,"Thanks for finding the link. Idk how much it sounded like a diderigoo, really, but still cool. That was some vintage Tommy right there."
41539,"Hahaha you're right, I noticed it when I listened to it again. I remember the first time I heard it I was really like wow I can totally hear a digeridoo in there. Guess I was remembering that feeling. Yeah Tommy is amazing with what he can do."
41540,"We could argue that the greater percussive and timbral capabilities of the guitar offer a similarly wide range. Classical music theory doesn't tend to consider percussion at all and timbre barely which is why piano wins in that context. Through a wider lens I can see them being equal, if for different reasons. It doesn't have to be all about voice leading."
41541,"You need two hands to play any one note on a guitar (aside from open strings). Lesser coordination aside, you only need one finger to play a note on piano. So by default there is much more possibility with a piano, since you can be doing two entirely different melodies/chords at once. Example: you can only play a max 6 notes at once on guitar, while you can play 10+ at a time on piano."
41542,"I'd say bass guitar or piano,"
41543,"Your voice!!
Then drums 
Then piano
Then guitar"
41544,How did you reply to a 4 year old post? I ended up learning nothing by the way. :')
41545,"I googled what the most versatile instrument would be because I had a feeling it’d be the drums. Google frequently finds quite good discussions via Reddit. Almost a reliable source. 
That’s how your question popped up. 

Too bad you didn’t pick up any instrument. But we’ve all been fooled by momentary motivation. 
Shit i sound old. 

See ya"
41546,"> I googled what the most versatile instrument would be because I had a feeling it’d be the drums. Google frequently finds quite good discussions via Reddit. Almost a reliable source. 
> That’s how your question popped up. 


I figured. 

> Too bad you didn’t pick up any instrument. But we’ve all been fooled by momentary motivation. 
> Shit i sound old. 


I've never had any hobbies, so I guess I'm just that kind of a person."
40711,"I am a music teacher who can play pretty much all of the common Instruments. This is a very subjective questions  with lots of answers. I have found that the instrument a person plays has a huge impact on their personality(or personalities are drawn to instruments).  For me, it's the lowest sounding instruments like the Tuba, baritone sax, trombone, that really are the most fun on a deep musical level."
40712,Which instruments attract which personalities?
40713,Most immediate fun? Voice or drums. After years of practice? Guitar or piano
40714,Voice and drums are more satisfying but piano and guitar are waaaaay more impressive.
40716,"Yeah the primitive stuff is fun but being able to artiliculate whatever comes to mind, no matter how complex is fulfilling at a very different level. Of course, sometimes you just want to bash the hell out of a drum kit too."
40717,Hitting a drum and playing percussion are two much different things.
40718,+1 for piano
40719,"Trombone is pretty fun to play. You can do a lot of interesting things with it and its just so unique. French horn is fun as well and is one of my favorite sounding instruments. 

The worst is the flute. Fuck that instrument. My ex wife was a professional flutist for a few years and even she agreed that it was no fun to play. It's just very uncomfortable to play."
40720,"I would have to say oboe. As a low brass player, going from those huge mouthpieces to that tiny opening on the double reed?? So awkward and I had the most beautiful duck sound when I would play it"
40721,I never played oboe but it is one of the most unique sounding and relaxing instruments to listen to for me.
40722,Haha why would she take it to a professional level if she didn't like it? And if it was actually physically uncomfortable she might have been doing something wrong.
40723,"Not to be stereotypical but she was Japanese and her parents were very pushy in that regard. She played flute and danced all her life even though she didnt like either. She was good at both (spent time as a professional flutist and ballerina) and was a U.S. National champion dancer in Jazz and some other style that i cant remember. And even with all of that it wasn't enough for her parents until she became a doctor. Typical disapproving Asian parents. And she didnt say it was uncomfortable to play, that's my opinion but i have bad shoulders so that could have something to do with it."
40724,"Oh wow, that sounds stressful."
40725,Second the trombone! I love me some pedal tones and true glissandos.
40726,Trombone.
40727,The harmonica is quite fun to play and not commonly used with the bands I've been around.
40728,I wish it was more common cause the sound is so cool
40729,South Chicago Blues.
40730,It is also pretty easy to learn the basics of.  It doesn't cost much and it fits in your pocket.
40731,"For me it's the trombone. In particular, my bass trombone."
40732,"Guitar, you don't have to be advanced at all to make something cool. Like just learn three or four chord positions in whatever key you want, and suddenly you can play many pop songs, or create your own. It's awesome. You don't even have to know which notes you're playing, if you don't want to.

In my opinion, guitar's the most fun for beginners, but any instrument is fun after you put work into it."
40733,"Electronic synthesizers.

With some technical knowledge you can design completely new kinds of instruments and expression. You can just make them sound funny and weird, too. You don't even need to buy expensive software/hardware: you can grab any free VST capable music application and rape it with one out of thousands of free VST synthesizers available."
40734,Tenor sax
40735,"What's the difference between playing sax and masturbating?

You eventually want to stop masturbating for a while."
40736,Damn it now I gotta tell my saxophone playing buddies this!
40738,Hahaha now this is even better!
40739,"Easy to pick up and play? Harmonica or Ukulele. Harmonica always stays in key and you can play a lot of songs off ear right off the bat. The technique isn't incredibly difficult to learn off the internet and pretty much no music theory is needed. Ukulele is a very calming instrument, and the fact that its pretty small means you don't need to stretch too far to hit some chords like with a guitar (although it can get quite cramped). Tabs are relatively easy to learn, the harder part would be chord transitions and strum patterns which just take a little practice.  
  
Most fun to learn overtime and dedicate yourself to? Id go with a couple here. Vocals pays off very well, and results in some pretty instant relief from the musical urge. Piano and Guitar are classic, because of their versatility and wide, rich range. Computer Programs like Fruity Loops and DJ software are really interesting if you like tech. Drums, are probably one of my favourites because its one of my first instruments. You can play it without sheet music and it's more repetitive than the other instruments. Ukulele again, because its got an amazing sound. And ill have to finish it off with Saxophone, because its always fun recreating the Careless Whisper solo."
40740,"Tuba! Although parts can sometimes be easy most of the time, it's still fun to be the low end of the spectrum that drives the beat forward and adds mass to the sound of the ensemble."
40741,Ocarina
40742,I really like playing piano. That feeling you get after you finally nail a part is amazing.
40743,Tuba. Right guys? Right?
40744,drums
40745,"I grew up playing guitar, but if given the choice between that and the drums I take the drums every time. They're so fun."
40746,"The kazoo. If you play it well, you sound like a professional saxophonist. If not, the comical tone is downright hilarious."
40747,"Electronic keyboard, for the sheer versatility in sounds and styles (auto-accompaniment) you can play."
40748,"I can't believe no one has said my instrument yet!

Cellooooo yagottabass :)

Seriously though, it can imitate the human voice, can do mad crazy sounds, play the high and low registers and is just generally awesome."
40750,I would argue but......
40751,"...and up and down, up and down, up and down."
40752,"Kazoo, hands down one of the most satisfying instruments ever devised."
40753,"You can make a great entrance with it if you play a well-known movie theme.

*Proceeds to salute Darth Vader while imitating the face of the angry basketball spectator*"
40754,Every kind of percussion. Just beat the shit out of it with some rhythm and you can feel like a member of some african tribe.
40755,The piano:)
40756,Piano of course.
40757,"I know trumpet and voice, but I prefer voice because I know how to sing by ear, and it's really easy for me to find stuff I like to sing that's made in the 21st Century, [especially made in 2014](https://www.youtube.com/watch?v=08wDeWQqWnw). Trumpet? Not so much outside hits"
40758,"I play the piano, but I always have great fun when attempting to play drums.  I am an awful drummer, but I enjoy it."
40759,"Guitar. Its easier to play than some other instruments, and still has enough substance and compactness to allow you to do cool things, like spin it around and play it in awkward positions."
40760,Saxophone. That Baker Street intro *mmmmmmmmmmm*
40761,"Ooooh! A question I can answer. I love the trumpet, it's a really expressive instrument. Euphonium has such a lovely sound. Trombone gets to be aggressive and Tuba gets to cover the basslines. But something about piano is awesome. The way it feels to create music with just your hands and feet is sooooo cool. So piano, I'd say."
40762,"Bass guitar. I've been playing guitar since I was a kid, but I find more satisfaction when grooving on a bass. Of course, I'm by no means great at the instruments I play.."
40763,"Well, if you are good at playing the instrument they all become fun in their own way. It's really satisfying to listen to yourself play and think "" Damn, I'm good."" It just makes you really happy. For me, Oboe is a fun instrument to play."
40764,"As a flute, alto saxophone, and oboe player, I say that it personally depends on me for the moment. My skills on each vary depending on how much I have to play each at a certain point of time, but sometimes I prefer a certain instrument over another. Each has its merit."
40765,"I would have to go with the cello. Depending on how it's played, it can sound like a beautiful voice, or a crunchy riff machine."
40766,"Guitar is really easy to pick up and learn quickly. You can also jam out with just about anybody if you can play the guitar. I do think the bass is more satisfying though, it's like building the song and putting everything into context, making it a cohesive structure. Banjo is also pretty great, but nobody ever wants to hear that sweet, sweet hillbilly melody."
40767,Is mayonnaise an instrument?
40768,drums yo 5ever
40769,Hells yeah
40770,"Guitar, by far the best. I've played the saxophone, trumpet, and even drums. I picked up the guitar and instantly fell in love."
40771,Bass Guitar! It's like guitar but smoother and sexier
40772,i've been a guitarist for 8 years so for me it's guitar.
40773,"I've been playing guitar for 6 years... yet when I'm in the car, blasting my music, or just dancing around home alone.... I find myself air drumming rather than playing guitar."
40774,percussionist here. tambourines and cymbals are the funnest things in existence.
40775,Tables.
40776,I loved playing the trumpet and baritone.
40778,"I have literally played all the instruments. So I can give you a categorical and objective answer to this question. The answer is the glockenspiel, it combines the versatility of the piano with the physicality of the drums and the intricacy of the xylophone. 10/10 would glocken again"
40779,Nice username. I actually believed you for five seconds.
40780,"Synth! Also synth+drum machine, and midi everything"
40781,Any of the Steel Drums in a SteelBand.
40782,Melodica
40783,"I'm a guitarist myself, but drums are so dang fun to play."
40784,The vibraslap. It is even more fun to play than to pronounce
40785,Drums for sure. Ive never played an instrament with as much raw energy involved as the drumms. Good times.
40786,"Drums. Nothing like hitting things and making a noise. Quite cathartic too.

Just wish I wasn't so crap at playing them."
40787,"I've tried **learned** violin&viola, **cello**, flute, oboe, Oriental harp (koto), **piano**&harpsichord, and guitar as well as **voice**. ***Prize goes to the oboe*** for not making my head explode as I expected."
40788,I play several different instruments and have for years. I still feel like a little kid when I sit down at a drum kit.
40789,"I would have to say either guitar, or timpani drums"
40790,The Seinfeld theme song instrument is a bass. Bass is pretty easy to learn.
40791,"It's a synthesizer.

Edit: To address OP, if quiet is really important, the strings of an electric quitar can still be heard and can be really annoying to others.  They will be twangy and possibly even a little out of tune, since they will be listening without the mask of gain or other effects you are listening through.  The keyboard will just sound like small clunks, like something rattling softly in a shoebox\( if anything can be heard at all.. \)"
40792,A synthesizer imitating a slap bass.
40793,"I'm also a college student and had no prior music experience. I chose piano because it seems the most versatile. I'm interested in eventually composing, and the piano keyboard seems to be (understandably) the standard as an interface to all musical notes and music theory. Using MIDI, you can input through the piano to a computer, and use samples to effectively play any instrument, or even a synth instrument that doesn't even exist! The downside is that it's not portable and you can't walk around playing it, and it's less ""cool."" If you want to save money you could start out with less keys, just a few octaves. I have a full 88 weighted key piano, but have never used almost 2/3rds of the keys."
40794,"LOL, less “cool”. I don’t think anyone wouldn’t be impressed by a skilled pianist. The only problem is that electric guitars start with a “cool factor” (to non musicians), whereas on a piano you really have to earn it."
40795,Y no Acoustic Guitar?
40796,"With electric guitar or digital piano, I could play without disturbing room mates; also, to me at least, less variety of songs seem to translate well to acoustic in the sense of retaining their emotion.  A lot of pieces seem to become more campy or aggressive pieces sound like a seductive Spanish serenade."
40797,"Well, I mean you do what suits you. Sounds like you've got a decent idea of what you want. No instrument is better than another.

Having played these plus violin I think classical guitar is a good start for low cost, but there are other factors like the quality of resources you have, personal taste, etc.

Edit: Also would say that if you do get into music you probably will want to play piano at some stage, even if only for a year or so. It helps with music theory. Don't feel like you have to master the first instrument you play."
40798,"The uke is a great way to go.  String it ""low G"" and you basically have a small guitar.  Full electric ones exist if you want to play entirely on headphones with little outside noise, but acoustic are better.  Easy to learn fun to play."
40799,"Piano.  Definitely.  But you should try to find a practice room if you're in college.  Get yourself some basic method books and just go to a practice room for an hour every day or so, and you can buy a keyboard yourself when you feel ready for it."
40800,"maybe keys if you’re on some kind of time constraint. you won’t have to let your fingers firm up or develops calluses. assuming you have a computer at your disposal, amazon has 49 key midi controllers for like $60 and there is a lot of free software you can use with those. And if you wanted to pick up guitar later the fundamentals of keyboard will give you a good musical foundation for other instruments. that said you’ll really only get out what you put in with any instrument. find time to practice regularly but don’t get discouraged if it takes some time."
40801,"In our case I'd go with the piano, but I suggest getting a teacher (this also goes for most other instruments) you dont have to go every week for x years but it's important to get the basics right (to prevent injury and getting better). With piano you can play practically everything (especially if later on you invest in a Synthesizer) and it's the easiest instrument to learn musictheory."
40802,"I play classical/fingetstyle acoustic guitar and honestly my advice would be go with the instrument you most like. I've been playing guitar for a long time but a part of me wishes I had taken up the piano/keyboard instead, though I'm quite happy with choosing the guitar. Piano is an excellent instrument for a beginner, to the point that a lot of instructors will teach you some very basic piano regardless of the instrument you play. (It is easy to teach music fundamentals on the piano) Many consider piano to be a 'complete' instrument (you can play bass, chords and melody at the same time, not all instruments give you that liberty). All instruments are expressive and beautiful in their own way but a piano has an edge in some way over others. 

End of the day, choose what you imagine you would most enjoy. Ukelele and electric guitars are amazing instruments too"
40803,"For a beginner, I always suggest either a piano or an acoustic guitar. Both instruments are fairly easy to learn the basics and can play multiple octaves and chords. Not all instruments can do this so learning music is limited. 
An acoustic guitar or a cheap keyboard can both be inexpensive too. Guitar is probably slightly more portable but piano, in my opinion, is easier to begin."
40804,I've never seen one but I know some women like when you play the clitoris.
40805,I've played some nice cuntry songs on the clitar.
40806,This was far from the worst comment.
40807,Whatever you can play well.  Women are not impressed by an instrument - they're impressed by skill.
40808,"I agree completely.  Furthermore, play for the love of music, not for anything else.  If I see a girl absorbed in her music when she plays it, it's way more attractive than watching a girl playing music to try and be impressive.

Also, finding joy in music can be as fulfilling, if not moreso, than impressing people or winning people over.  Consider it not only a gift to others but an invaluable gift to yourself.  

Sorry for the rant, I just love music."
40809,"True, that."
40810,"Piano is the other panty dropper, next to the guitar."
40811,"All I can say is that if a guy told me he plays a [theremin](http://en.wikipedia.org/wiki/Theremin) as a hobby, I would *definitely* want to get to know him better."
40812,"If his choice of instrument says anything about him, he's surely a master of hoverhand."
40813,WooOOoOoOOOOOOoOooOoooOOo!!!
40814,Saw Nick Urata use it at a DeVotchKa concert.  Was awesome
40815,"This is not true. I knew a man who was incredibly strange and played a theremin he built himself. He also had many other hobbies. 

You would not want to know him better.

I will not add more detail about who he was because he probably has a reddit account and goes on frequently."
40816,I dont get it.
40817,Bagpipes!
40818,"Violin, especially if you wear shirts that show off your biceps. ;)"
40819,"Nah, cello is way hotter."
40820,Oh yeah? Whatchu doin' later?
40821,"i wish this worked in high school. sadly, not so much."
40822,I learned a little violin and the women all loved it. I don't even play that well they were just impressed that I own one.
40823,harmonica. also known as the mouth organ.
40824,But I'd rather go for the Big Cash Prize!
40825,WHAT TIME IS IT SHADOW STEVEN?!?!?!
40826,Ocarina.
40827,"Came into this thread hoping some people would say piano. A lot less than I expected, but still some nonetheless. There's still hope!"
40828,"Yourself.

Seriously, throat-singing should work. It is exotic, and different techniques require you to exercise your tongue, or learn to suppress a gag reflex. So it works no matter what the opposite sex is."
40829,[/thread](http://www.youtube.com/watch?v=7zZainT9v6Q)
41377,Skin Flute
40831,"*Bass*.  Oh yeah babe, the *bass*."
40832,Bitches love it when I slap that shit.
40834,This is so true. I speak from experience.
40835,learn 3 chords in guitar...that shit is lay sauce
40836,http://www.youtube.com/watch?v=F5QCs3PnQBc
40837,"DRUMS! they're not portable, i know, but hey! at least it's a reason to invite a girl over (;"
40838,I answer almost the same without looking to the other answers *-*
40839,EXACTLY!
40840,Organ... everyone loves it when their organ is well played!
40841,A tromboner.
40842,Anything made out of a [vegetable](http://www.reddit.com/r/Music/comments/al481/ill_see_your_broccoli_ocarina_and_raise_you_a/)
40843,"Bongos, and then demonstrate by playing her bongos for her."
40844,I like where this is going
41053,Ukulele.
40846,[Israel Kamakawiwoʻole](http://www.youtube.com/watch?v=V1bFr2SWP1I) got all the ass.
40847,"Depends on who you're trying to impress. The average girl will obviously fall for the guitar, but you could also pull out a saxophone. It's easy to learn and you can jazz those panties off.

If you want to impress nerdy music girls, you'll have to learn a much harder instrument. French Horn is the hardest you can get, but you will impress the ladies with your skills.

Avoid instruments like the sac-butt and double-reed instruments. Trombones look silly and everyone who plays a double-reed instrument looks constipated the whole time."
40848,[Jazz flute](http://www.youtube.com/watch?v=jmw-440ZGuo)
40849,something exotic like a [balalaika.](http://www.youtube.com/watch?v=oaacRadQEZw&list=FLfAuVO1U6rq4mBg_Y_Is5Sg&index=92) Its like a guitar but awesomer.
40850,Saxophones and cellos are sexy.
40851,Saxaphone.
40852,"Banjo. No seriously, the banjo. It's open tuned so it's not too terribly hard to become decent at and....seriously, bitches love the banjo."
40853,The vagina.
40854,Financial
40855,"Violin.
For sure."
40856,"Guitar, piano, ukulele, and violin are the top of the list. Possibly the cello. Points for saxophone. Harmonica can be good. Anything you can sing along to will automatically win: even if you personally don't sing along to it, *she* can. Cello and violin are harder to sing along to, though not impossible. Hence piano, guitar, and ukulele being your best bets. Brass or woodwind is bad because you have to contort your face to play and will look weird trying to make eye contact with something in your mouth, which puts harmonica and saxophone on shaky ground.

Girls love it because music is very emotional and romance is very emotional and guys are not always the most eloquent at expressing their emotions: music is a great way of expressing how you feel or at least *suggesting* or *hinting* at how you feel without having to say anything specific. It makes whatever positive emotions she's feeling towards you seem elevated and elegant, in the same way that writing her a good love poem would, but in a more familiar medium. So it encourages emotions in her and suggests that you have some good ones too, while also displaying the fact that you are skilled at something. Pantydropping ensues.

And yes, for the record, I'm a girl. None of the guys I've dated could sing or play instruments. You have no idea how depressing this is, because I love to sing and took lessons for years. At least my current boyfriend loves musicals, but despite knowing *Phantom* and *Evita* and such by heart, he can't stay on key, which makes singing duets awkward for me."
40857,"Likewise - I'm a semi-professional musician, and none of the people I've dated were at all musical.  One of them dabbled a bit with the recorder, but that's about it.  

I dream of meeting someone to play four-hand piano duets with..."
40858,[PANArt Hang](http://youtube.com/watch?v=WhqLVKh0xU4)
40859,Stand below her balcony with a [lute](http://www.youtube.com/watch?v=A-1jLwkIZMw).
40860,"I've street performed with the sax before, and I got almost as many phone numbers as dollars."
40861,[The saxophone](http://www.youtube.com/watch?v=izGwDsrQ1eQ) has been historically proven to enhance sex appeal.
40862,The Oboe. Holy shit the oboe.
40863,It sounds like a duck if you don't know how to play it though.
40864,And arguably if you do know.
40865,"The tuba.

Bitches love the tuba."
40866,"Kazoo, bitches love kazoos."
40867,I play the clarinet.... draws in all the boys!  :/ .......
40868,"Male harmonica, female trumpet."
40869,I asked this question to my lady friends and the majority (AKA 5) said piano.
40870,Guitar
40871,"If you're a guy - Guitar. (Piano for some more refined ladies)
If you're a girl - The Skin Flute. Works every time."
40872,sax-a-ma-phone
40873,The harp. Sexiest instrument ever.
40874,"Well, considering you're a tool for wanting to learn an instrument *solely* to get laid, I'd say a [fence](http://www.youtube.com/watch?v=Pad1mgEAYbo)."
40875,Panpipes
40876,piano... but be highly skilled or risk looking foolish
40877,http://www.explosm.net/comics/897/ Relevant
40878,"Piano. It can be sexy, funny, emotive and anything in between. It shows good finger dexterity. And it's a classic without being a acoustic guitar."
40879,"If your a guy, the Bongos and if your a girl, the flute:)"
40880,I learned the banjo and for some reason all my Fiancee's friend's toddler age children LOVE it. When we have company if they bring their kids the parents always ask me to play for their kids. For some reason Cripple Creek is irresistible for them and they start dancing and follow me around like I'm the pied piper of the Ozarks.
40881,"Well of course guitar would be your best guess, but I think that you can impress 'em with a saxaphone too.

[For example...](http://www.youtube.com/watch?v=GaoLU6zKaws)"
40882,Try the Skin Flute.
40883,Guitar.
40884,"Drums, not portable but well I find it really appealing.
If you have a nice singing/not singing voice it almost can erase the fact that you're no attractive."
40885,"I wont answer as a woman, but as a man, whether or not you are a man or woman, playing the piano well with eloquence and grace is almost a complete turn on for me."
40886,the motherfucking [optigan](http://www.optigan.com/images/37003.gif)
40887,"Lol from your post I can already tell  you that regardless of what you play, you'll seem like a douche trying to impress women"
40888,"Wow bro, nice"
40890,That's just unnecessary dude
40892,">Suck my *cockle*

FTFY"
40893,"Another vote for the uke for me.  It's important to remember that almost every instrument doesn't really have a skill ceiling though, don't be discouraged if one instrument is easier than another."
40895,"Came here to say the Uke.
It had a lovely sound, is cheap, and easy to start
A little hard to tune tough, I guess it’s related to the small size of the fretboard"
40896,Does a jaw harp or a kazoo have a skill ceiling?
40897,"For the kazoo at least, I'd say no since it's a voice modulator, meaning that generally the better you are at singing the better you are at kazooing. So really the skill ceiling for kazoos is the same as the one for singing."
40898,bro
40899,"Every instrument has its challenges. Piano?  Sure, it makes a sound when you play it easily but ten fingers at a time doing different things?  Not easy. Trumpet? Easy fingers, hard embouchure. 

Every instrument will be a different challenge for different people. 

Except saxophone. That’s always easy. Until you have to play French music. Then it’s extraordinarily difficult."
40900,*Swears in Tableaux De Provence
40901,"Arguable on classical saxophone. The meta on what sounds good is so in dispute with how to handle the conical bore that there are relatively few players who have an indisputably good tone. There are plenty of good players below that level for sure, it’s just not as uniform as the tone would be for something like more established instruments like piano or even clarinet (cylindrical bore).

Tl;dr easy entry into a plateau leagues below a high ceiling with an exorbitantly steep slope"
40902,"Am I missing a joke here? 
Since when is saxophone easy?"
40903,"I play 4 different instruments and by far the easiest to pick up for me was sax. The embouchure doesn't need to be extremely tight and the fingerings are very intuitive. The thing is, it's still not easy, even after 2 years I still can't play on the instrument quickly."
40904,"Neat. I am a guitar player and within the last month or so a friend lent me his old tenor sax from the 30’s. I’ve always wanted to play and since having been lent this sax have had the chance to finally do so. 
I agree with you on the fingering being intuitive but I also have guitar player finger limberness.(that’s a mouthful!) 
On the topic of embouchure, I do understand what you mean in comparison to something like a trumpet, but I wonder if sax requiring a more specific/light embouchure actually makes it more difficult to somebody with no training on a wind instrument. 

After about two hours or less depending on when I last played, my lips are shot and can’t keep tension on the mouthpiece/reed well. Fingering the keys and working through scales isn’t too difficult I admit but getting the altissimo notes and other certain sharps/flats is a PITA for sure. 

In my first week I was goofing off with Alabama and Afro Blue(notes, *NOT* speed) and the Hot Dog song(Mickey Mouse, for my son). 

I really enjoy putting on other records and just blowing along with them. Especially Rahsaan Roland Kirk; he’s not as hard bop as Trane or Parker and is easier to groove with at times I think.

Edit: what other three instruments do you play? Interesting!"
40905,"I second the Sax being the easiest of the 5 or so instruments I play. The biggest reason is that it's monophonic, and unlike brass instruments, you don't have the concept of registers. One fingering, one note.

Really surprised more people aren't mentioning how much easier it is to learn an instrument that can only play one note at a time."
40906,"But it’s not necessarily easier, as there are other issues like embouchure that chordal instruments don’t have."
40907,big recorder lmao
40908,.....clarinet?
40909,"Easiest to reach ""marry had a little lamb"" level? Yeah maybe piano. Easiest to reach skill required to play songs that others will think you're absolutely insane despite practicing only for 3 weeks?   


The irish tin whistle.   


I played drums, piano, electric and acoustic guitar as well as sang, but when I picked up the whistle I couldn't believe it myself how quickly I improved. The first few days will be rough but give it 2-3 weeks I guarantee you, you'll feel like a monster. 

[This song](https://www.youtube.com/watch?v=4YMDZSO285w&ab_channel=MichaelEskin) I had down in full tempo in about 10 days of practicing 1-2 hours daily. It's a very fun instrument, though a bit limited in its range and expression."
40910,"> had down in full tempo

Well, depends what you mean by ""had down"".  There's a lot more to Irish music than the right notes in the right order."
40911,"I second this—Irish whistle music is really fun to play, sounds impressive, and is relatively easy to get to an intermediate level in!"
40912,"Piano is super-easy, you just push the buttons (keys) no embature, no calluses, no fretless fingerboard or bow technique to learn before you can get a decent sound out of it. Just push the buttons.

Of course it isn't easy to master, but the road from start to ""mary had a little lamb"" is pretty short."
40913,"The easy part of playing the piano is also the hard part of piano playing. Technically, there are only two things you can do to control the sound: that single moment of pushing the key down to start the note and that other single moment of letting the damper fall to stop the same note. That’s it. In between those two moments, the note decays on its own without any of your control. So, all forms of musicality must be simulated via those two means alone.

That’s when piano becomes difficult to master."
40914,Difficult to master for sure. I am no where close. It's a beautiful instrument.
40915,Not only that. The speed AND the acceleration of your finger plays a big role in the resulting sound.
40916,And the pedalling. It can be tricky at times
40917,"Mmm, well.  As a mental model it certainly works, but as physics, it's nonsense.  The only thing the string cares about is how hard the hammer hits it."
40918,Embouchure.
40919,"Um, bro... sure"
40920,"Yes and no. While you can make sounds by just pushing on the keys, playing with proper technique (posture, lack of tension, force originating from one's arm rather than fingers, etc.) can be tricky for some people to grasp.

In my opinion, the difficult part is handling all of the information being thrown your way. The notes (so many voices!), dynamics, rhythm, phrasing - sight reading some pieces still gives me a headache, and I've been playing for 14 years.

That said, if your goal is to start making music as quickly as possible regardless of musical complexity, piano is about as easy as it gets. Plus it's great for learning theory!"
40921,"All you have to do is push the buttons at the right time. It’s literally just gaming


/s"
40923,"I will always upvote Better Off Dead.    


It's a simple ethos, but it's mine."
40924,"I've been putting off rewatching this movie for weeks, and I don't know why."
40925,"Yeah right. That remembers me of something! What was it. Oh yeah! It was:  ""ALL YOU HAD TO DO WAS FOLLOW THE DAMN TRAIN CJ!"""
40926,Piano is also great from a theory perspective. Everything is laid out in front of you in order.
40927,"I think the road from the start to Mary had a little lamb is doable in a couple hours for ALL Instruments.
From my experience, the easiest instrument is the one the student is most interested in. 
I’m a music teacher"
40928,"Nobody wants to hear a single line melody on the piano, and some doozer playing Mary had a little lamb will still sound way worse than someone with skill."
40929,Bagpipes. You only need to learn that one song they play.
40930,"Guitar isn't as bad as you'd think with the dexterity.  Once you get the hang of barre chords things start moving along.  

I like the guitar because you can learn shapes.  Like, if you look at a g major barre chord vs an a major barre chord (both rooted on the low 6th string), you'll notice the shape of your fingers is the exact same, you've just moved the ""major"" shape to a different fret.  Because of this, you can get pretty far on the guitar with minimal music theory knowledge. 

However, as others have said, it depends on your goal.  If the goal is to learn music theory, guitar is pretty rough until it clicks.  Learning the fretboard is a real bastard, fingering jazz chords and sweeping arpeggios gets really technical and challenging.  

But if you're just trying to learn a few songs and casually play here and there, its very approachable and there are so many resources online like tabs (which are a huge no no if theory is the focus) and YouTube tutorials.  Id say the availability of online resources is probably more prominent for the guitar than for any other instrument."
40931,"Oh boi, classical guitarists are gonna get triggered reading the first few paragraphs"
40932,"Haha I know, and I agree with them that sight reading and learning all of the notes is how you're going to master the instrument.   But they have to meet me in the middle and acknowledge that for some people, hell, most people, that stuff sucks to learn, its work."
40933,"Why are tabs a no no If theory is the focus? I'm sorta in the stage of ""ive learned all the open and barre chords on guitar and now I want to branch into more theory stuff"" on guitar, and I use tabs pretty often, so Im just wondering."
40934,"I can go on and on about this lol ill try and real it in.  Tabs show you how, but not why.  They enable you to learn songs without knowing things like what notes you're playing, what key you are in, or possibly without even understanding what I mean by ""key"".  

Over time, your guitar playing skills out-develop your overall understanding of what's going on, which is fine its not like this is some sort of established rule.  But if you're looking to take the next step particularly in a theory direction, then you need to start looking at tabs as cheating.  Sometimes you gotta cheat, dont get me wrong, but you get the idea.    

Now I'm no demon studio guitarist over here, but I can hold my own improvise-wise and I like to come up with my own progressions and riffs.  When I do that sort of stuff I'm thinking about things like rhythm, scales, key, what I just played, what I'm about to play... EVERYTHING, but certainly not the fret numbers.  

If you're looking for suggestions, id say wrap your head around what a key is.  If you enjoy sight reading, run with that, but I do not.  What helped me was I took one key signature: G major.  That's my key.  Learn that key.  learn the notes, learn where they are on the guitar, and then learn what chords go with those notes.  Id be happy to talk you through that, but only if you are interested."
40935,"I'll echo what the other poster said. You're at the point where you're trying to learn how certain patterns work: which chords go together, which sets of notes sound good together, how to reproduce a certain sound in your head on the guitar fretboard. Those patterns have to do with the actual notes – C#, Ab, G, etc. – not fret numbers. The fret numbers do of course correspond to those notes, but in standard tuning, that correspondence can be irregular, and you're not going to easily grasp it just by looking at tabs.

To give you an idea of what the next steps might look like for you – you have a chord progression, say E - C#m - Amaj7 - Bsus4 - B. You need to figure out a melody to play while the other instruments are playing that chord progression. Maybe it's a solo, maybe you're just trying to repeat a vocal melody, maybe you're coming up with a riff. If you're just thinking about fret numbers, it's a guessing game. But if you're thinking in terms of notes instead of fret numbers, it's easier. You'll recognize that these chords all use notes from the E major scale (E-F#-G#-A-B-C#-D#); in other words, you're in the key of E. You'll know where the E note is in various places on your fretboard (for example, 3rd string, 9th fret or 5th string, 7th fret). From there, you'll learn the intervals between different notes (i.e. distance in pitch), so instead of thinking of every note individually, you'll be thinking more in terms of a starting anchor point and other notes in relation to this anchor. You'll see what notes are in each chord (for example, Amaj7 is A-C#-E-G#) and think of those in the context of the key.

Needless to say, tabs don't really help you make sense of this stuff. I'll use them for beginning students (especially younger ones) because learning the physical aspects of the guitar is hard enough. But I try to steer away from them as soon as possible."
40936,"Middle school band director here.  I teach 5-8th grade US.  In my experience the EASIEST wind instrument to learn is the saxophone.  

Consider the following if you please:

1) The first octave follows a very logical finger sequence of adding or taking away one button at a time.  This allows for some simple melody duplication without much training.

2) The “closed” hole keys take out the dexterity problem that flutes, clarinets, oboes, and bassoons tend to struggle with early on.  AKA button-mash-a-phones. 

3) There is little effort needed to blow a consistent tone.  Even a loose, unfocused, embouchure can achieve a characteristic tone (depending on what music you like to emulate)

4) the second octave is “only one button away.” Considering that the octave key does not change register, leaving the fingering structure unchanged, the range of songs you can copy by ear just doubled.  

There are a lot of excellent comments here.  And I agree with those of you who find the piano to be the easiest but, only if you’re only playing with one hand.  I can’t fathom trying to learn the piano seriously without teaching two hands within the first few weeks, and that’s where some of my “less than focused” students really begin to struggle.  In my experience, the saxophone students RARELY struggle and I have to constantly feed them harder material to keep up their practice momentum."
40937,"Saxophone was my fist instrument in grade school, followed by guitar and I recently picked up violin.  The saxophone was BY FAR the easiest of the three, it allowed me to learn to read music without getting frustrated and introduced me to improvisation, which translated beautifully to my understanding of guitar.  The hardest part of the saxophone was the neck strain from the cheap ass strap that came with the thing."
40938,"The hardest for me was the lip pain.

Reading is the easiest on sax as it is generally 1 to 1 and no counterpoint.  

But a person with no experience can play something on the guitar faster than on sax.

They all have different learning curves."
40939,"As a sax player who has also picked up bass, guitar, drums, keys, flute, clarinet, trumpet.... yep. Easiest to get going on, but takes a while to get polished (like anything else)."
40940,"Agreed, but as a sax player it takes longer to actually sound good compared to flutes or clarinets. Easier to play faster and more technical stuff, but harder to sound good doing it."
40941,"I'm not sure I agree. I'd generally rather listen to a saxophonist who's been playing for a year than a flutist is a clarinetist who's been playing for the same amount of time. Flutes and clarinets sound so airy and unfocussed until they reach quite a high level. Saxophones sound clear, strong and steady, even with minimal experience."
40942,"Sax sounds terrible, out of tune, reedy, and has so many overtones. It sounds like a car honking.

Flute has no tone, and is physically demanding and you hear it in the child’s air stream.

I would rather hear the flute.

Violin in the beginning though is rough."
40943,Im just learning saxophone now and it has taken me over 5 days to find an embouchure that would allow me to MAYBE play all of the notes properly. I still haven't figured out that damned octave key and why it doesnt work when i play a G. Meanwhile on the guitar I could nearly instantly play enough chords to have played most popular music.
40944,"The higher you go, the more force you gotta give to the blowing, with cold focused air (instead of a warmer air when blowing lower notes). Gotta harden those abs when blowing !"
40945,Yeah im working on getting an instructor to help me out. A difficult task in these troubling times!
40946,"yeap definitely, but it's a good action, to help out a jobless musician to have some money ! Good luck with your training !"
40947,"As someone who has never played a wind/blown instrument, this is encouraging"
40948,"This depends on what your after to be honest.. 

If your taking notes outta the equation then percussion is straight forward and just requires some rhythm training (which is pretty instinctual anyway and with experience on other instruments you would have developed some good internal rhythms). 

If its learning theory and visualizing what your playing then piano is golden with its straightforward layout and easy feel on the fingers. Getting into advance piano playing is a whole other thing from playing the basics though and sight reading can be harder as your reading 2 clefs instead of one. 

Then there is the feel of an instrument. I grew up playing guitar as my first instrument so connecting with the feel of strings is more natural for me then playing a woodwind. 

Guitar is poorly laid out and isnt ideal for theoretical development, it's all technique which takes years to develop (especially when you want to learn more then your typical cover band rock). Jazz chords take alot longer to learn on guitar then piano. 

Classical strings dont have any note indicators or frets which leads to the problem you mentioned above. The layout of these instruments is much friendlier though. 

Woodwinds and brass take alot of breath and mouth/breathing techniques which all take alot of time to master. 

If you stick to actual wooden flutes then it's not too challenging as they are limited to one scale/key, but you still need the breathing technique and your stuck to 1 scale per flute. 

Harps are very light to play. The strings are tuned to a scale which keeps everything diatonic (unless you tune them otherwise) and are very delicate on the fingers (unlike guitars) but they are very expensive instruments $$$ 


My dream instrument is to get a good cello one day as I find the tone and frequencies balance my body out and relieve stress instantly. 

I wouldn't go for what's easiest, I would be looking for which one you are happy to invest the most time playing since they will all take a good amount of time to learn. 

If your at the point where you know the note positions on a cello board, you have come a pretty substantial way and can improve on this much more rapidly now. But if the interest in this instrument is passing, then you can always get a few extra and diversify 

:)"
40949,"I wanna say percussion is not just rhythmic training lol it’s a very wide range of instruments that all require different techniques. Drum set, snare drum, mallet keyboards, and timpani are all just as difficult to master as any given string or wind instrument. Shit even tamborine has advanced techniques that you can’t just do without training. And if you’re a percussionist you have to master all of them lol"
40950,"Percussion involves a lot of techniques, different instruments, and proper training that you don't just serendipitously stumble upon, but honestly, it _does_ take less time to become a percussion player in a very reputable symphonic orchestra, than it takes to become a string instrumentalist in one. Ideally, violinists for example start as early as possible, way before they are teenagers, if the point is to become a serious professional one. A percussionist can start later and still end up working in a reputable orchestra. Less casual pursuits are a different thing and it doesn't mean that people can't become _good_ by starting later, but you can truly compare the difficulty levels and _required training_ by looking at a reputable classical orchestra where the competition is tough and you can't just create new symphony orchestras out of whim if you don't qualify to join existing ones, like you could do with bands."
40951,"I know nothing about symphonic/classical percussion, so I do wonder how hard the repertoire is  for that as compared to other styles/genres of drumming. I guess in the symphonic world, I think of people playing a single percussion instrument more than a kit of multiple things at once. And there’s less syncopation than you would generally have for jazz, funk, or Latin percussion. So I wonder if the real difficult percussion stuff is found outside of the orchestra world.

I could be way off base, of course. It’s just that the first image that comes to mind of a percussionist in a symphonic orchestra is someone banging a gong, and that can’t be *too* hard."
40952,"As someone who has played orchestral percussion, it has its own set of challenges.  I think it’s easy to take snare and bass parts for granted, but there is a huge level of technique that will separate a professional from an amateur.  Timpani is an instrument that has its own set of challenges, between being tunable and requiring a different striking technique than other percussion instruments.  Then there’s mallets, which usually aren’t too involved in a lot of classical music, but there is a lot more that goes into it than notes and rhythms.  There is a lot of exacting work on technique done by percussionists.

I think concert percussion seem easy, and I myself have often taken it for granted, saying things like “it’s just concert music”.  However, like any instrument, there’s virtually a limitless skill cap, and there’s a lot of minute corrections and techniques that can be trained.  A classical percussionist is doing a lot more than playing rhythms at the correct volume.  They’re watching their stick heights, playing zones, choosing appropriate sticks/mallets, and a lot of other things that many people won’t notice.  Many, if not most, can play at accurate tempos from memory; for example, if you want me to play 112bpm, I can with no count, and it won’t be 111 or 113.  A classical percussionist is playing their pieces as perfectly as possible.  But that pretty much any professional orchestra musician though"
40953,"Interesting. I play mostly in the rock world but am influenced a lot by folk and Brazilian music, and I play with a drummer who is very well-versed in Brazilian percussion, so I've been able to see what separates good drummers from bad ones. Part of it for him is the technique, as you state: he's an expert at getting different sounds by using different sticks, different parts of the drum, etc. Part of it is that he's a master at so many things, able to play not just a drum set but all different types of hand drums, shakers, tambourines, etc., often multiple things at the same time.

> Many, if not most, can play at accurate tempos from memory; for example, if you want me to play 112bpm, I can with no count, and it won’t be 111 or 113.

Interesting. How do people train and develop this skill?"
40954,I have my masters in percussion performance.  I always just tell people that our instruments are easy to play but hard to master.  :)
