idx,text
60660,"Started Schitt's Creek about a month ago based on a Reddit recommendation, I just hadn't gotten around to it. Can't believe I missed out for so long."
60661,"I missed it for a while too until my daughter literally sat down and made me watch it, I was hooked!!!"
60662,Friday night dinner
60663,I find this hysterically funny. Great British sitcom
60664,"The good place

Season 3 is coming on Tuesday so great binge before season 4 begins :)"
60665,Episodes
60666,That would be like watching life from 13 on all over again but I still watch all marathons when I see it
60667,Schitt’s Creek
60672,Brooklyn 99
60669,"Archer, Archer & more Archer"
60671,"[The Office](https://www.contenthunt.io/title/70136120) 

[Always Sunny](https://www.contenthunt.io/title/70136141) 

[Parks and Rec](https://www.contenthunt.io/title/70143842) 


Check out this list of Sitcoms on Netflix for more suggestions

[https://www.contenthunt.io/search?genreid=3903](https://www.contenthunt.io/search?genreid=3903)"
60673,"Brooklyn 99

The IT Crowd 

superstore (this is Hulu but def worth mentioning)"
60674,I very much enjoyed Superstore!
60675,"1- Brooklyn Nine-Nine

2- Brooklyn Nine-Nine

3- Brooklyn Nine-Nine

4- Brooklyn Nine-Nine

5- Brooklyn Nine-Nine

Edit: Terry Loves Yogurt."
60676,American vandal
60677,Teenage bounty hunters
61032,Peep Show
60679,13 reasons why
60680,"Tom Segura’s Disgraceful is my all time favorite. Any of John Mullaneys (but the kid rock one was my least fave), all Bill Burr, Anthony Jeselnik (idk how to spell) Thoughts & Prayers, and the first Joe Rogan one"
60681,Tom segura pretty much everything is my favorite.  Him and bill burr are what I’ve been watching the most lately.
60682,"I like Disgraceful the most though but all of his are good! 

I forgot to also mention Jim Jefferies and Dave Chapelle!!"
60683,"Agreed. Chappelle, Burr, and Segura are in a class of their own right now. Mulaney isn't too far behind either."
60684,I think you spelled jeselnik correctly
60686,John Mulaney
60687,"""Mother fucker is that how you write songs? One word at a time and with verbal abuse"""
60688,"If you like John Mullaney, but have only seen his Netflix specials, he has an album called The Top Part that I believe was never filmed. It’s where salt and pepper diner comes from and it’s fucking hilarious."
60689,The King Solomon story is fucking hilarious
60690,YOU HAVE PASSED MY TEST
60692,YEAH.
60693,....No
60694,Diet Coke!
60695,"Really? No one mentioned Adam sandlers new stand up, 100% FRESH?? It was fucking hilarious"
60696,Amen.  Easy his best work in the last 20years. It’s like 90’s Sandler is back.
60697,The astroturfing probably turned some people off to it.
60698,I was surprised I enjoyed it.
60699,"Neil Brennan three mics

It's stand up and more. If you aren't interested in mental health it might not be for you but otherwise, like if you struggle with depression, it's amazing."
60700,"Great show, one of the best I've seen."
60701,Jim Gaffigan’s Mr. Universe! Actually all of the ones on Netflix right now is super fun!
60702,I would also add that Jim is clean comedy. Hilarious and clean. Hard to pull off.
60703,That's why I love Jim Gaffigan. Pussy and fart jokes get old quick.
60704,"I think it definitely takes a different kind of skill to make clean comedy work. Anyone can make a story about sex or shit or farting or whatever funny, but to tell a joke with none of those elements and still have it be funny is, as you said, definitely hard to pull off. DOn't get me wrong, I love the raunchiest of comedians, and I don't think what they do is easy in the least, but I do have a certain respect for the former, especially because I don't think I could do it."
60705,Jim is so great!! HotttttttPOCKets!
60706,James Acaster
60707,"YES. He is so clever, and I love how everything he mentions is useful and comes back later on."
60708,I had never heard of this guy and those stand up specials are fucking hilarious.
60709,Those four sets are so hilarious and unique in there way they all tie together!
60710,No one has commented Dave Chappelle yet? I loved his new standup.
60711,Bird Revelation is my all time favorite set.
60712,"I agree.  I want to add Neal Brennan. I discovered him on ""comedians in cars drinking coffee"".   He was a  co-creator of Chappelle show.  He has some good stand up on Netflix with shades of Dave Chappelle type comedy."
60713,Three Mics was phenomenal
60714,"James Acaster.

He had a multi-part special, each part is it's own thing so just jump into the first 

Definitely the funniest specials I have seen in years."
60715,"1. John Mulany: Come Back Kid

2. Anthony Jeselnik: Thoughts and Prayers

3. Bert Kreischer: Secret Time

4. Tom Segura Disgraceful

That's my top ranking right now I think.

Edit: I wanted to add to the list that Chelsea Peretti's: One of the Greats is pretty amazing too. It definitely isn't going to be for everyone, but if you like her style of humor in Brooklyn 99 it's definitely worth a watch. I liked it quite a bit. I might put that at number 5.

I haven't seen the new Chris Rock one or the new Adam Sandler one yet. The Ron White one was awful in my opinion. 

Bill Burr and Joe Rogan are high up on my list to watch soon, but the problem I have always had with both of them is I often don't get where they are being ""funny"". I like them both quite a bit, but to me It kinda just feels like they get up and say things that make sense. This is definitely more true with Joe Rogan.

Edit 2: I am watching Joe Rogan's Triggered right now."
60716,"The new Rogan special is the best I've ever seen him have. The jokes are more fleshed out and coherent, in his others they felt like incomplete premises sometimes."
60717,"I thought the same thing, he had awesome stage presence in this one as well."
60718,Burnt Crisper is a down syndrome comic but you will hardly be able to tell because you will be so focused on his weight and light-hearted racist comedy.
60719,"I don't think I ever laugh as much as whenever I finally ""get"" the Burnt Chrysler jokes I read on reddit."
60720,His obesity is only matched by his racism. Hoamanought.
60721,"This - Bert Kreischer: Secret Time, funniest thing I've seen in a long time"
60722,"Agreed with all of these for sure, but IMO New in Town >>> Come Back Kid when it comes to John’s work."
60723,"I agree with that too. I was just saying New In Town is produced by Comedy Central rather than Netflix. Comeback Kid and Kid Gorgeous were both Netflix produced.

I was not 100% sure if New in Town had been removed from Netflix."
60724,The Adam sandler one is pretty corny
60725,"He's washed up, but probably doesn't care because $$$."
60726,Ok i will check all. Thanks
60727,"I think all of them except Jesslenik have one or two other specials also on Netflix and they all seem to be pretty consistent too. 

John Mulany for example did New in Town which is probably his best, but it was shot for Comedy Central not Netflix, it might still be on Netflix, and if it is I would start with that one. Comeback Kid is his second, and it is really close in terms of how good it is. Kid Gorgeous at Radio City is his newest Netflix special and it's definitely still contender for the best on Netflix, just not as good as the other two. 

I just only wanted to list one of each comedian and say what I thought was their best Netflix special."
60728,Tom Segura for sure! “Bikes!”
60730,"This managed to straddle the line between hilarious and deeply touching, definitely one of the best on there. Patton Oswalt's latest special had a similar thing going for it too."
60731,"I saw Patton Oswalt’s Latest special live, during the taping. I was way in the back, and right in front of me was a father and son who I think had lost their own wife/mother, because during the second half of the set the boy started crying and the father was rubbing his back. By the end they were laughing their asses off and gave a standing ovation. Felt very lucky to be privy to that moment."
60732,Almost forgot about this one. Probably one of the best shows I've ever seen. Great recommendation.
60733,"My taste trends towards the mentally ill haha so Bo Burnham (I've watched Make Happy soooo many times) and Maria Bamford are top favs. And ""Nanette"" by Hannah Gadsby is barely stradling the line of stand up comedy but I loved it. 

On a less downer note, seconding John Mulaney, and Mike Birbiglia is the man."
60734,If you dig the mentally ill you've gotta check out doug stanhope.
60735,"This is best comment, all of these people are fucking awesome. I wouldnt recommend nanette if youre trying to lighten the mood, but it is some high ass art"
60736,Nanette was incredible but it's the only time I watched a stand up comedy special and legit bawled.
60737,"Yes, exactly. I like a good cathartic cry though. I would consider it a one woman show/monologue and not a stand up special honestly. But I think by positioning it as stand up, she was able to place it in front of audiences that wouldn't see it typically. She's a very intelligent performer and I'm quite interested to see where she goes from here."
60738,"I know that Bo's comedy is an acquired taste for some people, but I really love both his Netflix specials."
60739,Is he though? Is he an acquired taste?
60740,"Yes. Some people are really put off by him, including myself"
60741,Daniel sloss
60742,I watched this last night. The second part was pretty profound
60743,I had to scroll too far to find this
60744,Check out Ryan Hamilton - Happy Face
60745,"Easily my favorite. Ever since Dane Cook saturation of the 2000's, I feel edgy, shock comedy just doesn't do it for me. Comedians that can bring the humor while still being something I can recommend to friends, family, and co-workers without worrying about ""that one part"" every skit seems to have is a relief."
60746,I was also going to suggest Happy Face. So good. It's a nice change of pace from all the other ones listed (although the other ones are really good too)!
60747,His phrasing and look really reminds me of Seinfield
60748,I'm surprised no one mentioned Chris D'Elia. His stand-up and podcast are hilarious.
60749,"I loved his first one, his second one felt like a let down. 
 
After watching him absolutely *carry* ""Whitney"" (anybody who watched it remembers the reaction he had to her putting his jeans through the washing machine.) I KNOW those eyebrows are capable of So. Much. More."
60750,Nate Bargatze
60751,"Does Nate have a special on Netflix besides on ""the stand-ups"""
60752,He’s filming his special tonight!
60753,Oh man that’s exciting to hear! Loved his part on the stand ups.
60754,He’s also the first comedian on the brad paisley’s comedy rodeo. Another hilarious set.
60755,"Oh yeah, that one too"
60756,Love this guy
60757,Bill Burr and Tom Segura. All stand up specials available for both of these guys are great.
60767,Thank u.
60759,"To Burr and Segura, I would also add Segura's wife Christina P.

 John Mulaney is amazing. 

Burt Kreischer's special is filthy and hilarious.

And, of course, Dave Chappelle!

Edit: everyone already said those."
60760,"Gary Gulman is the best, but Nate is a hidden gem"
60761,Bo Burnham
60762,Anything Bill Burr
60764,New season soon!
60766,November 30. There's a trailer kicking around on YouTube.
60768,Theo Von's most recent special. I forget the name but that dude is hilarious.
60769,"Yeah i love that guy. I have seen him on ""this is not happening"" cc."
60770,Ali Wong.
60771,"Her first one, Baby Cobra, is one of the best sets I’ve ever seen."
60772,"""There's nothing more empowering, as an Asian women, than having a white guy eat my pussy."""
60773,She is viciously funny!!
60774,Second this!
60775,"""Nanette"" by Hannah Gadsby. Not strictly standup but so amazing."
60776,"So powerful, blew me away."
60777,I was hoping someone had recommended this. Shook me deep
60778,"Bert Bert Bert Kreischer is funny as fuck! His older special is funnier than the new one, but the new one is REALLY funny."
60779,John Mulaney. All of his. They’re all the best.
60780,Marc Maron's latest is hysterical.
60781,"I love Marc Maron, but I do feel like you've gotta be a middle-aged pissed off pissed on former addict with chips all over your anatomy to resist the magnetic force he exerts to keep people away.b 
 
Like I said, I love Marc Maron."
60782,"As a middle aged, pissed off, former addict myself, that stings just a little bit. :)"
60783,James Acaster. His four specials are incredible. Outstanding eye for humour and entertainment.
60784,Mo Amer was a delightful surprise
60785,Aaaaagreed!!!!
60786,Dimitri Martin. His newest show literally had me laughing out loud for at least 70% of it. But all his shows are hilarious.
60787,Thank u kind replier.
60788,Ali Wong is absolutely hilarious. I also laughed my ass off when watching Jim Jefferies.
60789,Tom segura
60790,Ron White - If you quit listening I’ll shut up.
60791,"Did you like his newest one? I dunno if I just wasn’t in the right mood or what but his newest just didn’t seem funny like his older stuff. To be fair, I’ve been sick the past few days so maybe that had something to do with it. So someone please tell me if it’s good and it was just me. If so I’ll watch again. I only made it about 1/3 of the way through I think and then turned it off. I loved his older stuff though."
60792,I had never seen him before this one. I'd like to see his older stuff though.
60793,Tig Notaro’s Happy to be Here and Neal Brennan’s 3 Mics are both great. I also like Joe Rogan. He is smart.
60794,"I'm a Mark Maron fan boi, so yeah."
60795,"My favorite is Mike Birbiglia. He has three, and they're all good, but my favorite is the middle one, My Girlfriend's Boyfriend. It is hard to explain, but his show is more than an average stand up act. In fact, Mike has a one man show opening on Broadway this month. He's special.

Ali Wong's are also great, especially Baby Cobra. It's very dirty though, so probably dont watch with Grandma.

If Grandma won't leave, show Ryan Hamilton. He's a real sleeper, I've never met anyone who has seen his show, but his one Netflix show is really hilarious, and totally clean.

Also Chapelle, Burr, Mullaney, Jim Jeffries, Dmitri Martin, Kevin Hart. Also the new Adam Sandberg is great."
60796,Mike birbiglia!
60797,Any bill burr is fantastic.
60799,James acaster - Repertoire
60800,I adore Gary Gulman and didn’t know he had a special on Netflix. This is wonderful news.
60801,Thank u for your effort.
60802,also thank mr skeltal for good bones and calcium[^*](https://www.reddit.com/r/tmsbmeta/)
60803,"Would it have been easier to list who you don't recommend, if anyone?"
60804,"Norm Macdonald: Hitler's Dog, Gossip & Trickery  is my recent favorite."
60805,Apparently Adam Sandler?
60806,"The sandman had me crying laughing and just plain in tears about Chris.  Loved this nostalgia shot, super smooth all the way down."
60807,The Chris song came outta nowhere and fucked me up good
60808,"In such a way that I felt so safe crying with him. Seriously, felt like I was home for a minute or two."
60809,It made me laugh and it made me cry
60810,"Yes. Very good mix of stand up and his music, I enjoyed it a great deal."
60811,Agreed. It was way better than I expected it to be. Definitely worth the watch
60812,"I haven't watched his newest one, but I have seen quite a few positive reviews."
60813,I thought it was cornball.
60814,"That's, kinda Sandler's take, hes a goofball, plain and simple. It's entirely entertaining, great watch."
60815,"Ali Wong. 

I’m not American so the stand up specials from America tend to be underwhelming (cultural differences I guess) even if they’re from people whose other work I enjoy (looking at you, Donald Glover). 

I deadass couldn’t stop laughing at Ali Wong’s specials! I hope she makes another one, and hopefully gets her own show soon."
60816,"I feel the same about a lot of American standup... I’m forever hopeful so I have quite a few sitting in my “Continue Watching” because I turn them off after 15 minutes. 

Ali Wong is so refreshing though! I like Dimitri Martin too"
60817,Michelle Wolf
60818,"Gary Gulman, Norm Macdonald, Todd Barry 👍"
60819,"Louis CK, Bill Burr, John Mulaney, Dave Chappelle. 

Neil Brennans special is good too."
60820,"Seconding these. The ck ones are now a few years old but all of them (except the last one) were hysterical. Chapelle has 4, two are hits and two are softer (imo i like 1 and 4). Mulaney is pretty good. Haven't seen burr or brennan."
60821,Todd Barry! I can’t believe he hasn’t come up yet. Absolutely hilarious
60822,Confirmed Kills by Iliza Shlesinger
60823,Trevor Noah: afraid of the dark was good. A lot of great names have been thrown out here but I feel like people should check out Trevor.
60824,Noah is horrible
60825,"if you’re not opposed to reading subtitles, Sofia Niño de Rivera currently has two specials up and they’re hilarious!"
60826,I have never seen any standup with subs but i will give it a try. Thanks
60827,Lots of good recommendations here. Also wanted to add chris rock tambourine and Chelsea peretti's standup it's low key super amazing and avant garde.
60828,"Any Tom Segura, Bert kreischer: secret time, any body Burnham, any bill Burr, Ron white has a new one that's really good."
60829,its on you tube Patrice Oneal elephant in the room!
60830,Daniel Sloss has some pretty good stand ups but his jigsaw special really is a heavy hitter.
60831,Best one is Dave chapele and Chris Rock
60832,Adam Sandler
60833,"Kathleen Madigan (Again) 
 
That's the name of the special. 
 
You will not regret it. Most of this special is about her journey (along with Lewis Black) to entertain at the USO in in 2008 and it's *fucking hilarious*. If she doesn't make you laugh, you might want to go get checked out."
60834,"Dave Chappelle, easily. He’s got two or three and they’re all hilarious. I’d also recommend Neil Brennan’s Three Mics special. He used to write for the Chapelle Show and his stuff is really funny and high key deep."
60835,"1. Dave Chappelle
2. Jimmy Carr
3. Jim Jeffries"
60836,"Cant believe I had to scroll this far to see Dave. His new stand up has raised the bar for comedian's, seriously amazing."
60837,John Mulaney and Patton Oswalt. I’m sure Reddit will jump down my throat but bill burr is only funny if you love tired jokes as much as you hate women.
60838,Chappelle
60839,Joe rogans new one was pretty good
60840,"Did it get better? I turned it off after 10 minutes. Didn't find his son getting assaulted by ""Harvina"" to be funny at all."
60841,"He's a homophobic dudebro asshat. It was on in the background at a friend's house, and I heard way too much."
60842,I got through about 20 minutes. Haha. The next 10 minutes aren't any better.
60843,"I wanna mention one that's never really talked about:

Hari Kondabolu. ""Warn Your Relatives"" is fucking hilarious from start to finish. 


I really dig Iliza Schlessinger. She's unconventional and more than a bit weird but I love it. 

Bo Burnham's ""Make Happy"" is incredible.

Mike Birbiglia's ""My Girlfriend's Boyfriend"" is a beautiful story with a lot of laughs.

Marc Maron ""Too Real""

Aaaaanything with Patton Oswalt will be hilarious."
60844,Joe Rogans new special is hilarious!!!
60845,That’s good news!
60846,Bo burnham. Easy
60847,"No sense of history, people?? The answer clearly is Richard Pryor"
60848,"Every special by each of these men is fantastic: John Mulaney, Bill Burr, Tom Segura, & Dave Chapelle.

Also, not necessarily a stand up, but Seinfeld’s “Comedians in Cars Getting Coffee” also has some great humor as well!!!"
60849,"Pretty good timing with this thread for me, need a laugh."
60850,Daniel Sloss - Live Shows. Not for the super religious and easily offended though. 😬👍
60851,Ron White is pretty fuckin' great.
60852,Hannah Gatsby:Nanette is ze besttt! Ali Wong and Hasan Minhaj too
60853,BERT BERT BERT!
60854,adam sandler’s new one was hilarious but i wouldn’t say it’s traditional stand up but i was dying the whole time
60855,Rory Scovel is hilariously crazy. Very unique style..he is nsfw just fyi
60856,I’m surprised I haven’t seen “The Honeymoon Special” by Moshe Kasher and Natasha Leggero.  It’s fantastic.
60857,“Russell Howard : Recalibrate” is really funny and worth watching.
60858,Bert Chrystler's Secret Time
60859,Adam Sandler 100% fresh
60860,"Secret Time. Never saw that comedian before, and the start is only mildly ok. It just gets funnier. Watched a few times."
60861,Joe Rogans was good
60862,Hannah Gadsbey Nannette
60863,I cant believe I didnt see anyone reply RON WHITE new 1
60864,"Thoughts and Prayers - Anthony Jeselnik

Not family friendly at all.  It might be the most offensive stand up I've seen in a long time.   But it's funny because it's clever.   His delivery and timing are impressive."
60865,No offense with Theo Von. That guy is a lunatic but in a good way.
60866,Best will be subjective but I love me some jo koy.
60867,Jo koy was really good.
60868,Ari Shaffir! He's a total asshole but somehow still charming.
60869,Bert kreischer is my favorite atm but i know that you said Netflix but if you have HBO then you should check out peter Holmes special it is so funny and I went Into it not expecting much and was super surprised in a good way
60870,Probably Unpopular Opinion: Bert Kreischer
60871,Ricky Gervais: Humanity
60872,"Dude, yes!  Friggin brilliant."
60873,Adam Sandler: 100% Fresh
60874,I'm on board with this and am in no way an Adam Sandler fan. I never though he'd illicit an emotional response from me. Fucker. Gave it 4/5
60875,What the fuck is wrong with you people. In order it’s Dave Chappelles specials 1-4 then who ever else.
60876,Adam Sanders is great
60878,Peep show is perfect at times and very odd and not to my liking at times. But the parts that were funny were so poignant or grating at the same time that they were true comedy gold. So unique.
60879,I second this! No other show has made me laugh more than Peep Show.
60880,Bob's Burgers. I have watched all 4 seasons about 4 times now and I still laugh at every joke.
60881,Parks and Recreation. I loved it from start to finish. Totally recommend.
60882,"Took me a few episodes to get into it, but holy hell am I glad I kept watching. Great series."
60883,Every time I get a cold or flu I watch entire seasons of this :) is fucking hilarious
60885,The Increasingly Poor Decisions of Todd Margaret.
60886,Now there's one I haven't heard of. What sort of humor?
60887,Really terribly inappropriate humor.
60888,It's terrible. Really poorly written. Avoid.
60889,Why do you think it's poorly written?
60890,"I think the overall show is poor. The writing is the most jarring element.

David Cross is a good but not great comedian. His best role as an actor was Tobias in Arrested Development, which was written for him.

Shaun Pye who co-writes with him (you might know him as the insufferable 'Greg' from Extras) is also not in the elite bracket of comedy writers. He had written for TV before, but I think mainly panel shows (Buzzcocks etc.).

TV comedy writing is about three things: an emotional anchor for the audience (someone relatable we can root for), a lens through which we see the absurd (it could be through the eyes of the everyman, or it could be something else), and jokes about the absurd.

Simplest example in modernity is The Office. Tim is the everyman we root for. He is also the lens through which we see the absurd: Gareth, David, et al. The Office's jokes aren't scripted and delivered with split-second timing a la Seinfeld; they're just David or Gareth being David or Gareth, and then Tim reacts.

Seinfeld is a good example. We can all relate to Jerry, and we root for George. The absurd is whatever Seinfeld chooses to pick apart: condiments, low fat yoghurt, the mail. And the jokes are overt, scripted, honed to perfection, and we get them rapidly.

If you watch TIDOTM it just doesn't feel professionally made. The pacing and editing is poor, and the actors aren't protected by good writing. There's no heart to it. It's got shades of the absurd (why would this man ever be trusted to go and do this job? Why would he surround himself with these people?), but unlike e.g. The Mighty Boosh, it doesn't embrace that wholly and seems to try to place itself somewhere between a traditional sitcom, mockumentary and surrealism. It just doesn't work as a concept.

Finally there's the title. It just about makes sense, but 'increasingly poor' is clumsy, and 'The Increasingly Poor Decisions of Todd Margaret' falls into a category of quasi-Goth absurdist humour that to me is as jarring as those 'accessible' post-rock bands which cropped up in the early 2000s and had brackets in their song names like ""Jeffrey watches the world burn (around him, a songbird sings)"". Like ""Rhod Gilbert and the Cat That Looks like Nicholas Lyndhurst"" or ""Greg Davies: Firing Cheeseballs at a Dog"".

I watched the whole thing because I like David Cross and have a sort of morbid fascination with Shaun Pye (insofar as I've never seen anyone with a face so perfectly smug), but it's just *bad*."
60891,"I would argue that by the end of the series Todd Margaret is the everyman the viewer can relate to. However, during most of the series, Alice is truly the everyman. She is trying to make her own place in the world and this bumbling fool screws her over consistently while trying to actually help. 

Spoilers below, I guess.

[The lens through which we see the absurd is clearly Alice. Todd has no concept of social norms. We can see this in the first episode during the breakup. Clearly Stephanie didn't think they were dating. It was a one night stand. But Todd has no roots in reality. 

Quite a bit of the first season is Todd having no comprehension of English society. Consider the parade, when Todd gets dressed up in Union Flag clothes and shoes his ""patriotism"" while all hopped up on thunder muscle during what should be a somber day. Or when he tells Alice that he lives in the houses of Parliament. He really has no clue and this becomes the comedy. You can see how cringey this is for Alice. She knows that nobody actually lives in Parliament, but Todd just goes as far as he can to keep up with his lies.

As far as the writing is concerned, I think that it's intelligently written. There isn't just the absurdist slapstick, there is another layer of humor that you may not have understood. For instance, when Todd's father comes and is forced to pretend he is a ghost. Will Arnet's character is scared of ghosts and Spike Jonze says, ""I don't understand how you could be afraid of ghosts, while they are superior athletes they lack the brain power of lighter peoples"" or something to that effect. Ghosts being a less common epithet for blacks. That's something less informed or less intelligent viewers might not pick up on, but at the time is actually really funny. You don't expect the nerdy little guy to be blatantly racist, not having shown this in any way before.

I think the pacing and overall editing are pretty on point. Something terrible happens to Todd or because of Todd every episode, and it never really slows down. The viewer is left in the dark about several sub plots until they pay off. A perfect example is John Hamm playing the Butler. You see him for several episodes and until he asks to leave to resume filming on Mad Men, you think he is just playing a part.

Now, as for the title, The Increasingly Poor Decisions of Todd Margaret sums up the show pretty well. Just when you think that he can't dig himself a bigger hole, he does. He tries to show Alice that he is a good person and gets Alice her dream job, but in order to convince the chef to hire her he says that Alice is mentally handicapped and terminally ill. As if one of those things wasn't enough, or bad enough.](/spoiler)

I understand if you don't like the show, it may not be for everyone. But to tell people that it's awful and to avoid it is a bit extreme. #s"
60892,"Archer, hands down. Takes a little to get invested, but once you're in, there's no getting out. Danger Zone"
60893,"It's not for everyone, but here's one vote for Bojack Horseman."
60894,Cant wait for second season
60895,"YES. Second season starts this week, I cannot wait."
60896,"Honestly if you're thinking about watching this show you need to commit to watching the entire first season. The final about 5 episodes are amazing, but they're set up by the episodes prior. Also, make sure you have someone you can talk after finishing it because it gets very deep emotionally."
60897,Yeah I personally just couldn't get into it. I watched like five episodes. Laughed like once. Wasn't for me.
60898,"Honestly it took a really long time for me to get into it. Like, ""why the hell am I still bothering to watch this"" long. But BAM it finally clicked and I was in love and then... Very depressed. It gets too real, man."
60900,Nightman!
60901,Dayman!
60902,Ah-ah AHHHHH
60903,Milk steak with the side of your finest raw jellybeans!
60904,"the only prob with Always Sunny is that the first two seasons aren't funny but you kinda need them to understand the rest of the show.

but if you understand the character dynamic then seasons 3 and onward are the funniest shit you'll ever see"
60905,Season one and two are great....
60906,Season 1 and 2 are some of the best... If anything it lulls in season 6-8.
60907,"i disagree, i've seen the show way out of order on Comedy Central alot, but last week i got netflix and started watching it from the beggining and im up to season 4.  i think seasons 1 and 2 are boring"
60908,"Well it's definitely subjective. I just commented because I didn't want someone to read that and think they should skip those seasons or something, because plenty of people like them."
60909,They develop the characters a bit more as the show goes on. Mostly they just keep pushing the characters into the extremes. But the first 2 seasons are fine if you understand that.
60910,In my opinion the show hasn't peaked yet. It's only gotten better and better.
60911,"I totally agree. Season 9 was one of the most perfect TV seasons I've ever watched, and 10 was also one of their best. It's amazing they can still keep it so fresh a decade later."
60913,I'm about six episodes in and I haven't really gotten that 'gotta watch more' feeling yet. But I hear it's common to not be in love with it right away...true for you or was it pretty instant?
60915,And then you realize that you just blue yourself.
60916,You should get yourself a tape recorder
60917,It's hands down the funniest series.
60918,You'll laugh your arm off
60920,"The IT Crowd.  Assuming it's still on there, that is--I haven't checked in a while."
60921,I don't know if I have ever watched a series quicker than the IT Crowd. Have you tried turning it off and on again?
60922,Several times!
60923,Yeah I saw it was on there relatively recently.
60924,"Ah, good.  Hope they don't drop that one."
60925,I really like your glasses.
60926,BETTER THAN YO MOMMAS GLASSES (or something to that effect haven't watched in a while)
60927,"I'm sorry, they're not for sale."
60928,They're not for sale!
60929,"Literally started it this afternoon.  Funny, funny, funny."
60931,It's so short though. It ended right as I was really getting into it.
60932,"I know.  It was the same way for me.  And IIRC, the last seasons were shorter than the earlier ones...THAT was frustrating."
60934,"This.

It's basically Dilbert for smart people."
60935,"The Office.

Particularly Seasons 2-7"
60936,1-4 in my opinion. 4 is pushing it though...
60937,"I feel like the odd one out because I loved all 9 seasons. Of course without Michael the show wasn't as good, but I thought it was still very good. The only episodes I didn't like were the ones with Will Ferrell."
60938,Deangelo Jerimitrius Vickers
60940,I have tried so hard to get into this show but I can't.
60941,Unbreakable Kimmy Schmidt
60942,Yes! So glad there's going to be another season.
60943,I wonder if it'll expand on the whole Titus-having-a-wife thing
60944,"Unnnnnbreakable can't lie, it's a miracle!"
60945,"*they alive, damnit, it's a miracle!"
60946,Wait really?? Oops I've had it wrong this whole time!
60947,Personally thought it was really boring. It seemed like it was trying too hard.
60948,"Danger 5 is pretty damn funny, despite being short."
60949,"The first season was great. The second, not so much."
60950,"Malcolm in the Middle.

It was okay back in the day, but we binge watched it and man, it's really very well done."
60951,The League
60952,"I waited so long to watch this because I give zero shits about football, but it's hilarious and football is barely peripheral to the storylines."
60953,Oh man absolutely. I just watched the entire series this week and I can't wait for season 7. Almost every episode had me in tears.
60954,Archer. Or Red Dwarf in a totally different way.
60955,Archer is honestly the greatest show period.
60956,"Red Dwarf was taken down. I about cried when I found that out, my number one favorite show for sure!"
60957,Ohhhhh nooooo!
60958,"Never seen red dwarf. Is the different way clever, or how do you mean?"
60959,I guess I'd call it innocent. It's a British comedy that made fun of science fiction tropes and it started in the late 80's on a non-existent budget. It's relies heavily on the few characters in the show for its comedy. It can be clever but it's also consistently very silly in a way that I only see in British comedy. It never takes itself seriously and I love it for that.
60960,Sounds great. Thanks for elaborating.
60961,"Red Dwarf TL:DR

After an explosion/disaster, Lister is the only (living) human. Rimmer (now deceased) is a hologram, proving that death is no longer a career impediment. The ships cat mutated to human form but still thinks like a cat mostly. The AI computer is very sarcastic."
60962,Thanks for the explanation effort!
60963,I've been watching a lot of Brooklyn nine nine.
60964,"I was expecting something much cheesier from Andy Samburg, but I was happily surprised with everyone's performances, especially Terry Crews. Very funny.

I second it!"
60965,Red vs blue.
60967,Bloody murder! Bloody murder!
60968,Did you ever wonder  why we're here?
60969,I personally love The Inbetweeners.
60970,I haven't heard of this one til now. What do you love about it?
60971,"I just recommended it to you, please watch it. It is fucking hilarious. There are 2 movies out and more are coming. The show is not that long but it is comedy gold."
60972,Will do. Doctor's orders!
60973,Yes!!!!!!!
60974,Its huge in the UK. Its a show set in a secondary school in England. 4 different personalities become friends and they do stereotypical teenage shit.  It's 5am where I am. I probably didnt sell it very well!
60975,"Haha, that's alright. Thanks for the explanation. I'll have to check it out"
60976,3rd Rock From the Sun. It's my all-time favourite comedy series that I've rewatched multiple times and still find funny.
60977,I would reccomend Blue Mountain State if you are into American Pie type comedy
60978,The InBetweeners.
