idx,text
57217,"I know some of the brands have flavor packets added to them to add uniformity no matter where the water source was.  


Most bottled water is a massive marketing ploy though.  More and more studies find that tap water, on average, contains less contaminants than the bottled water you get off the shelf.  It comes down to oversight.  There are VERY few people overseeing the bottled water industry, as in like, less than 5 in the U.S.... and it isn't even their main job (don't recall the source on that claim)."
57218,Microplastics is also a common occurrence and cause for worry in plastic bottled water.
57219,"Correct.  However, I've seen multiple reports of it being found in many municipal tap water samples as well."
57220,"I currently reside in an Asian country. We don't have potable tap water so we usually rely on water purifiers and bottled water. I'll be moving to North America in a few months and carried out my research on drinking water. The tap water might have traces of microplastics, but storing them in plastic bottles can further increase the concentration of the same.

I saw a CBS Canada documentary sometime back in which they picked popular bottled water brands and ran tests. They found that majority of them consisted varying quantities of micro plastics in them.

Also, the people who prefer de-mineralized water, I'd suggest getting a TDS meter, the device is fairly cheap and it helps detect the Total Distribution of Solids (TDS) in a water source. Having worked in the water purification industry in the past, a TDS concentration of 70-120 is safe for human consumption as water with 0 TDS does not contain the minerals that you should be getting from your drinking water.

The distilled water (0 TDS) is more suited for refilling inverter batteries as it prevents corrosion. Drinking this water can lead to mineral deficiencies which can lead to various ailments. 

To summarize, micro plastics are everywhere, we can try to reduce our exposure as much as possible for better health."
57221,"Random, but Zac Efron’s new series on Netflix discusses the differences in water minerals, etc in the 2nd episode. Might want to check it out."
57222,"Quality is a tricky word. Do you mean purity or something like chemical tuning? The clearest vs the best tasting? Harder or softer? Acidity? Is it quality alone or also price to volume?

They do have different “flavors”, the taste of the special blend of minerals added. Some folks prefer the taste of some over others.

Acidity is generally not a significant factor. High pH (low acidity) water doesn’t affect body pH with a single exception of stomach acidity. High pH might help you a tiny bit if you have acid reflux or indigestion but the same effect could be achieved with a Tums or Rolland.

There is a minimum standard of purity for bottled water in the USA. All waters should easily be better than or on par with the most drinkable of tap waters. 

I’ll give you my direct option: 

>Find a water that is reasonable price per quantity as well as an enjoyable flavor. The banding itself doesn’t matter, it’s more about enjoying what you like. My preference is on a larger quantity then price then higher pH. 

My go to was this $2 1.5l high pH with a dark blue and green label, can’t remember the name. It had a slightly dead taste to it, refreshing if cold but effetely neutral when room temp. Otherwise, it wasn’t noteworthy outside of being one of the cheapest price to amount ratios in a (large) bottle size at the high end supermarket I used to work at. 

Was it overpriced? Yes. At something like 4.50 per gallon, it was expensive. Was it something I enjoyed? Yes, I prefer my water that way. Did I do it all the time? Hell no, I might get it once a week, when I needed a small pick-me-up at work.

At that point, the water becomes like any other drink: enjoyment or entertainment. It’s no longer just about guzzling sustenance."
57223,"Am I the only person who doesn't like water? Especially out the tap, but all water genuinely is an unpleasant experience unless I'm really thirsty"
57224,What do you drink regularly if not water?
57225,Mostly squash but sometimes fizzy stuff. I don't drink alcohol
57226,"the purest water possible is distilled, and it tastes horrible. 

it all depends on which water tastes the best to you.  personally i really like french water like evian and vittel.  i can't tell the difference between most expensive brands like voss or fiji and tap water.  but french water has a really distinct flavor/mouthfeel.  luckily i found the local grocery store near me has a generic mineral water that tastes just like evian and is waaay cheaper."
57227,"Watch this episode of the ymh podcast with a water sommelier. It's funny and informative!

https://youtu.be/9tiZEyH8CZ8

You will have to skip in close to the end I think for when he arrives."
57228,"Worked Food & Beverage industry for 30’years.  Have run bottled water lines with spring, mineral, sparkling and flat.  Some pumped out of ground.  Most is tap water sent through RO and mineral added back for regional taste or just left filtered.  Bottlers more concerned about cost of caps and bottles.  The water is almost an afterthought.  It’s all H2O."
57229,Nestle drains the aquifers of many cities. It is literally just tap water in a bottle. Source: lived next to a Nestle bottling plant that drained our aquifers and put us in water shortage.
57230,"Typically the only difference people can notice is whether the water is carbonated or not.  Penn & Teller demonstrated this:  https://www.youtube.com/watch?v=YFKT4jvN4OE  

I once ordered a microwave-convection oven from Amazon and got 48 tiny bottles of Deer Park water instead:  https://i.imgur.com/HmCYKSj.jpg  

Provided your municipal tap water is decent and not Flint, Michigan quality, it's cleaner than bottled water and is much more strictly regulated.  If you want to bother bottled water snobs, tell them that it contains 1,000 times as much bacteria as tap does.  However that bacteria is a harmless type.  

Generally bottled water is sold as either drinking water, purified water, or mineral-free water.  Most bottled drinking water is purified with activated carbon and then sent through a reverse-osmosis filter.  If that's all that's done, then it can be a substitute for distilled water, but drinking water generally gets mineral added to it because pure water actually tastes bad.  Some bottled drinking water is just municipal tap.  Purified water can be tap sent through activated carbon, and I don't see any purpose to it, which may be why the Krogers around here discontinued it.  Mineral-free water is either treated with reverse osmosis or steam distillation.  

If drinking water is advertised as coming from a mountain spring, it probably does.  I used to live near an Arrowhead water processing plant that was in the middle of a residential area, and tanker trucks would go in and out, and often they'd have a sign on back asking for sources of water.  Arrowhead sold both municipal tap water and mountain spring water."
57231,"The fresh water from the river 500feet from my house taste the best. :D 

Who buys water! ha hah

You guys buy bottled water with fluoride witch is bad for you lol"
57234,Sink water at 3 am
57235,why does water taste so much better at night
57236,"Idk but, it's the coldest at 3am"
57237,Tap™
57502,Evian
57239,Well water.
57240,"Volvic.

Fight me."
57241,SmartWater
57242,Alright let’s address the elephant in the room no one wants to defend bottled water....... but if I’m at the store and I gotta just grab one I almost always go for Aquafina or VOSS if it’s available (and yes I just buy it because of the fancy bottle and that it’s from Norway) but sort of that I just grab whatever is cheapest.
57243,Spring
57479,Dasani
57245,"Sink

Bottled water is all the same and a huge waste of resources. Environmental catastrophe."
57246,"Most bottled water is lower quality than what comes out of your tap. Fiji is full of microbes and has noticably higher amounts of **mother fucking arsenic** than most other bottled water brands.

I highly recommend doing some Google-Fu and reasearching bottled water brands, and what's actually in them.

As for cleaning up your tap, I recommend a PUR water filter that you can attach to your faucet.

Also, you'll save a lot more money using the tap."
57247,"This great advice, couldn’t say it any better.. unless you are going to be cupping coffee must coffee enthusiasts simply use a filter like PUR or Brita, if I’m not mistaken one of the championship Aeropress winners used a brita filter AUS maybe?"
57248,"Buy an RO, best investment into my coffee ever."
57249,"If you get an RO filter, don't forget to add minerals back in."
57251,"Ha, it's not because of health I say this, it's because coffee tastes better with those minerals."
57253,"You could disagree, but science proves it.

RO water lacks the minerals that help carry flavour through. 

Prof. Chris Hendon and Maxwell Collonna-Dashwood even wrote a whole book based in their research on the interactions of minerals in water and which flavours they bring. [Here’s a short summary of their book](https://pubs.acs.org/doi/pdf/10.1021/jf501687c)

As a professional cupper, I can vouch that. Even [SCA Cupping Protocols and Golden Cup Standard](https://sca.coffee/research/coffee-standards) call for water with some minerals in them. 

You may enjoy flat tasting coffee, that’s definitely to each of their own. But you’re not giving your coffee a chance to shine either by not allowing their flavours to come through."
57254,"That's true, my coffee is much less bitter, but I wouldn't say it's flat."
57255,RO water tastes significantly worse for coffee than simple carbon filters.
57256,What is (an)  RO?
57258,"Fluoride is really good for the teeth, I can't why someone will want to avoid it! (even chlorine in those levels is perfectly fine)"
57259,I mean technically everything in the right dose is fine.
57260,"Yeah, and companies follow the right rules when making water."
57262,"Shocking news, water is a chemical! 

Be careful of the H2O....

On a side note a find tap water to taste better than both bottles and RO water (RO tastes the worse)"
57263,"Weird as it sounds, you could go to a third wave shop in LA and ask them to refill like a 500ml or 1L water bottle with water (or hot water if you have an insulated bottle like a hydro flask), I do it whenever I go get coffee for home brewing. Granted, I don't drink or make coffee every day so it's a more practical solution for me. Pretty much every third wave shop has filtered water and they've never had a problem with me asking for hot water. (I get espresso or something beforehand though)"
57264,"getting distilled water and adding third wave water packets is a good solution. ""Third wave water"" is a mineral packet that you add to distilled water to get an optimal mix of minerals for brewing."
57265,Gallon jugs of distilled water from the grocery store plus Third Wave will do the trick
57266,"From purely environmental standpoint, please consider another approach.

Consider something that either uses a reusable container or no container at all.

Water bottles are an amazingly huge portion of pollution, and recycling programs are not enough to counteract this."
57267,"Here's info on bottled water and how they fall in regard to ideal brewing:

 [https://coffeeadastra.com/2018/12/16/water-for-coffee-extraction/](https://coffeeadastra.com/2018/12/16/water-for-coffee-extraction/) 

Then go to the sidebar and click on 'Bottled Water Spreadsheet'

It links to a Google Doc. I didn't want to post that directly as you wouldn't know where it's going.

The better option would be a gallon of distilled + baking soda & epsom salt or Third Wave Water if you're lazy. The link I posted says much more if you're interested."
57268,"Hard water tends to be pretty varied in which minerals it contains, but is pretty much always better than soft water. This is because compounds like magnesium are ""sticky"", and are better at extracting flavours from your beans. However if your hard water contains too much bicarbonate the result can be bitter.

&#x200B;

You'll get a much stronger flavor from the same beans if you use high-magnesium ""hard water"" in place of distilled or softened water. If in doubt what water to use contact the roaster of the coffee you use and ask them what water they test with. Most will use mains water, so that's normally a safe bet, but otherwise just get a water filter jug that adds magnesium and you're good to go!

&#x200B;

On that note, **this makes most bottled water BAD**. Bottled water is naturally soft, thanks to low levels of calcium and magnesium. Unfortunately for your coffee this means they're not well positioned to extract well.

&#x200B;

\---------------------------------------------------------------------------------------

&#x200B;

This isn't pseudo science either. Chris Hendon, an MIT chemist, teamed up with with baristas Lesley and Maxcell Colonna-Dashwood (who [won](http://sprudge.com/maxwell-colonna-dashwood-wins-2015-united-kingdom-barista-championship-72361.html) the 2015 UK Barista Championship) to specifically test what kind of water to use in coffee. Hendon handled computer analysis whilst the baristas tested the premise in the real world making coffee. They ended up publishing their research in the [Journal of Agricultural and Food Chemistry](http://pubs.acs.org/doi/abs/10.1021/jf501687c)

This team-up went on to come 5th in the [World Barista Championship](http://www.worldbaristachampionship.org/). So it's probably safe to assume they know what they're talking about."
57269,"And if the bottled water isn’t soft, it usually has waaaay too much bicarbonate."
57270,You know bottled water comes from a local water supply? Pepsico isnt selling water from an island in the pacific. They are producing plastic bottles to sell.
57271,"Any filtered spring water is good.  I wouldn't use distilled.  I'd also avoid Dasani.

You can also use Third Wave Water."
57272,arrowhead and crystal geyser are in the ideal range of gh and kh.
57273,"Arrowhead and Crystal Geyser are two of the worst bottled water brands you can buy.

Both have an acidic pH level, and contain drastically higher amounts of fluoride than even what the FDA recommends is safe and healthy."
57274,"depends where you're getting it from i guess.  https://www.oralanswers.com/bottled-water-fluoride/

but all those are currently below fda limits of 0.8ppm or mg/L.  

acidity doesn't hurt you, just look at all carbonated beverages.  

the amount of fluorine that's ""safe"" is also up for debate as well.  it's one of those things that we just don't know too much about.  the only thing we can say with a certainly is that ""too much"" is bad for you, but we don't know what ""too much"" is."
57275,"> acidity doesn't hurt you, just look at all carbonated beverages.

That's satire, right?

I won't say that one comment discredits everything you've said and presented, but Jesus fucking Christ man. You don't happen to work for one of the soda corporations, do you?"
57276,"if you're such a worry wort, you should just stop drinking everything except for perfectly ph neutral distilled water without any added compounds.  oh wait, you'd DIE if you did that.  because you NEED minerals in order to live.  so stop being such a worry wart.  ph 3 vs ph7 isn't going to kill you.  neither is a 0.6ppm vs a 0.1ppm water that contains fluorine.  at this point, we don't have enough knowledge to say that drinking acidic water every day is going to kill you faster vs a ph neutral water.  and the same goes for drinking water that has higher ppm of this or that.  with your mindset, you probably shouldn't even be drinking coffee.  because some research somewhere has shown drinking coffee is bad.  just like i'm sure you've seen some research somewhere that says a higher ppm of this or that is bad for you, which has got you all tangled up in a rut."
57277,"You don’t need minerals in water to survive, that’s a myth. No tap water has a heavy enough concentration of any necessary micronutrient that it would impact your health."
57278,"yes, you don't need minerals in water to survive, if you can get it from elsewhere.  but because of dumb people in america and poor diets.  the government put it upon itself to reinforce everything with minerals and nutrients so people wouldn't die.  and yes, no tap water or bottled water has a heavy enough concentration of anything that can kill you.  unless you live in flint michigan.  then you might actually die from their tap water.  but not because the water was bad.  but because of the chemical processes that happened between the water and the pipes that caused it to be bad.  

that's the point i'm trying to drive across to this other guy.  this other guy is all in a hissy fit because i recommended arrowhead and crystal geyser which is too acidic and has too much fluorine so it's bad for you."
57279,">  because you NEED minerals in order to live. 

God forbid I ever eat or drink anything, other than pure water.

> at this point, we don't have enough knowledge to say that drinking acidic water every day is going to kill you faster vs a ph neutral water.

No, there's a lot of evidence that says acidic substances are worse for than neutral substances. Shit, what was that called? Oh yeah, chemistry.

> and the same goes for drinking water that has higher ppm of this or that.

Well, so far we've only talked about fluoride. What about everything else? Please provide a complete and absolute list of what is in [bottled drinking water brand of your choice]. Your next challenge is to write a paper about why bad things are bad for you **WHILE CLIMBING THE AGGRO CRAG!!!**

> with your mindset, you probably shouldn't even be drinking coffee.

See, now you're just jumping to asinine conclusions because you can't comprehend that tap water is better than bottled water in most cases.

> because some research somewhere has shown drinking coffee is bad.

What about all the research that has shown drinking coffee is good? Oh! Oh! Remember when they used to say that cigarettes were good for you?

> just like i'm sure you've seen some research somewhere that says a higher ppm of this or that is bad for you, which has got you all tangled up in a rut.

No, it's pretty clear that higher percentages of harmful things are worse for you than lower percentages or none at all.

You know, I really wish there was a class where they could teach common sense, because you're in need of it, and you would probably need to retake it three or four times.

Look, I can see that you're a very uneducated, bland, ""man's"" man, with little to no common sense or critical thinking skills. You're not a student. You probably have a very specific job where you only do one thing, or you're a basic, run-of-the-mill pencil pusher. You're easily replaceable. You make a decent salary, but are ultimately a slave to your job, because you still pay rent. You lack the time, ability, and will to think outside the box. You might even work in a building with cubicles, literally working inside of a box. The first 20 minutes of *Office Space* is an accurate portrayal of your life. I'm sure you go out and ""do things"", but you aren't fulfilled.

So I dare you to try and *think* for once. Do you really think that you can change my mind, with all the evidence against you?

If you are incapable of doing that, or you just don't want to, the only thing I ask of you, is to please capitalize your sentences."
57280,"lets just say that if you lived in cali, you'd be the type of person afraid to out in public because of all the warnings about getting cancer that is everywhere because of prop 65.  

i never said that stuff in excess wasn't bad for you.  but i'm not worried about drinking acidic water or having non zero ppm for minerals and chemicals.  

i'm mean sure, cocacola can rust a nail, but so what?  the human body isn't a nail.  so don't fall for this fallacy."
57281,">lets just say that if you lived in cali, you'd be the type of person afraid to out in public because of all the warnings about getting cancer that is everywhere because of prop 65.

Oh, I was just talking about this the other day! It's funny because CA puts that warning on literally **everything**, so people just ignore it instead of actually being worried about the things that do cause cancer, like asbestos, lead, common carcinogens like fossil fuels, and even sunlight! Too much sunlight, that is.

Born in Napa, lived in Navato, San Fran, and San Diego by the way. Catch a wave and check out my sweet tan sometime.

>i never said that stuff in excess wasn't bad for you.

You kind of did.

> but i'm not worried about drinking acidic water or having non zero ppm for minerals and chemicals.

You should. Just a little at least.

>i'm mean sure, cocacola can rust a nail, but so what?  the human body isn't a nail.  so don't fall for this fallacy.

So diabetes, bone decalcification, tooth enamel wear, carbonic acid build up, and being a fat piece of shit don't worry you?

Thanks for proving all my points.

Anyway, you're the kind of person who is so absolutely enamored in the philosophy of ""this is the way we've always done it"", that you can't see that you've been doing it wrong the whole time.

You can't even capitalize your sentences.

There's no helping you. Goodbye."
57282,"jeez, lets just have more government regulations.  including what time you can go to bed and wake up.  because getting too little or too much sleep is also bad for you.  or how about we make the government ban all junk food.  because that's way worse for you.  lets shut down all wifi and communcations because radiations yo.  and eggs, good for you, then bad for you, good for you again, oh nope, bad for you.  and now good for you again.  just ban them."
57283,"You would do well working for Ingsoc.

Tell me, what is 2 + 2?"
57284,"You’re saying a lot of idiotic and inaccurate things, and have a terrible attitude about it, calm down.

Mildly acidic water is not as bad as you’re making it out to be. Our stomach acid is way lower in pH, and our blood has plenty of buffers to neutralize any potential change in pH caused by that water. 

By your logic we should stop eating pretty much all fruits. Apples are between 3-5pH so we should stop eating those, huh? Blueberries should probably eradicated from the earth for their deadly pH of 3, right? Smh"
57285,"> You’re saying a lot of idiotic and inaccurate things, and have a terrible attitude about it, calm down.

Why does everyone on the internet assume that people are stark raving mad and yelling about things? Also, all of these things are based on scientific fact, and proven to be true, so... u wat m8?

> Mildly acidic water is not as bad as you’re making it out to be. Our stomach acid is way lower in pH, and our blood has plenty of buffers to neutralize any potential change in pH caused by that water.

Are you saying that stomach acid and human blood are safe to drink in the same quantities as water? Because they're absolutely not. They're not equivalents, and will not be treated as such.

> By your logic we should stop eating pretty much all fruits.

No, you're misinterpreting the data.

> Apples are between 3-5pH so we should stop eating those, huh?

Hot diggity dog, look at that misinterpretation.

> Blueberries should probably eradicated from the earth for their deadly pH of 3, right? Smh

Holy Jesus fucking titballs Christ! Why have we not eradicated blueberries yet! They're killing our population at an exponential rate and spelling absolute doom for mankind!

Oh wait. They're not.

Because these are the same exact arguments that corporations (look at me being a social justice warrior with all my buzzwords and silly haircuts) use in defense of bottled water. These are the same exact arguments that they use to convince people like you that all the crap they put into bottled water is okay.

> Sulfuric acid is in our stomachs

That doesn't mean that it's safe to consume.

> pH levels of apples are more acidic than water

Yeah, they're apples, not water.

> Blueberries have high acidity

Again, blueberries aren't water.

Your entire argument in favor for bottled water is being entirely based on things that are not bottled water.

Let's ignore that water part for just a second. How safe is that plastic? (it's not)"
57286,Dasani and Nestle both taste like they were infused with hints of assorted lunch meats
57287,I'm just now finding out everyone and their mother hates Dasani.
57288,"Yes but strangely not brothers or cousins. A strange phenomenon indeed…

Edit: this was playful banter. It is not an insult… read it again!"
57290,Haha I must not have taste buds never tasted bad to me.
57291,"It's never bothered me either, but Aquafina actively makes me gag because it tastes stale to me."
57292,Aquafina is awful! Tastes like chlorine minus the water
57293,"Yes! Even when it is ice cold and ostensibly fresh, it is still disgusting!"
57294,Aquafina tastes weak
57295,"THIS. Aquafina tastes like metal, chlorine, and wet dog. ICK!"
57296,Dasani is so gross.
57297,"""taste the dryness of 1000 suns"""
57298,"I get physically sick if I drink Dasani. Idk what they did to that water, but my body rejects it anytime I drink it."
57299,Pretty sure Dasani is Chicago tap water
57300,"Nestlé water actually tastes pretty good, but how it was obtained makes me not want it. Dasani and Aquafina are straight garbage though."
57301,go to hell nestle
57302,"This reminds me of a story about Dasani.

In August 2019 (almost exactly two years ago), my sister passed away. We opted to cremate her, so the funeral home got her dressed for us to see her one more time.

My other sister, my aunt (my mom was in jail at the time) and I all went to the viewing. When we saw her, it was unreal, almost literally. The funeral home didn't ask for any pictures of her so they dressed her in a way they thought we would like: curly hair, bronzer, makeup, black dress. My sister was a red headed, pale freckle faced hippie. It looked absolutely nothing like her, and we were upset about that, but more importantly we needed to grieve.

As we're crying and holding one another, the funeral director decided to hand us Dasani water. Not sure why she decided at that point to hand out water. It was the worst water I had ever tasted, and really put the cherry on top of the whole experience.

We ended up being comped the rest of our bill for the service, and the funeral director had been fired for unrelated reasons."
57303,I'm sorry for your loss.
57304,They released Dasani in the uk and after a week it got cancelled immediately because someone found out that it was just filtered tap water the people of the uk were not happy
57305,"Surprisingly, it *wasn't* the headlines (which were a few weeks after launch) that it was tap water that screwed them. (I guess it's not *that* surprising, though, since they were pretty open about it.) It was the bromate contamination."
57306,"It wasn't just that it was filtered tap water. Apparently the filtration process Dasani used in the UK actually added a carcinogen (retailers pulled all Dasani from their shelves after the uproar). It also didn't help that when launching the product in the UK, they used the strapline 'Bottled Spunk' (I shit you not). American readers will have to ask a friendly Brit what that means (it's not a good word) - it's certainly not something you'd normally expect to find in your water!

Basically, the UK launch of Dasani was the finest ever example of how not to launch a new product. Naughty Coca Cola."
57307,Spunk means the same thing in the US as it does in Britain.
57308,Yes I remember that from a video from Tom Scott
57309,"Add aquafina, pretty sure this brand and dasani are Mlt public water system with even more  treatment to be sure it would taste even more like sewer."
57310,All bottled water tastes like plastic
57311,"Dasani puts salt in their water to literally make you thirsty. Its right in the ingredients on the fuckin bottle. No shame, and extremely rude to consumers."
57312,Um Shane Dawson isn't a reliable source for nutrition information lol
57313,Nestle is also Poland spring (amazing) and many others
57314,"Dasani, nestle, aquafina"
57316,There is no other answer.  Fuck Nestle.
57317,/r/FuckNestle
57319,why
57320,"Here is a good reddit thread about it

https://www.reddit.com/r/OutOfTheLoop/comments/885bk9/why\_is\_nestle\_considered\_a\_bad\_company/"
57321,"I know why Nestle is a bad company, but the person I replied to linked the subreddit r/girlspooping. I just wanted to know why tf someone would be interested in that"
57322,"R34 man. If it exists there's porn of it, and Rule 35, if there is none, it will be made. Nothing is safe, unfortunately."
57323,"Wait, isn’t this the one that tastes like sink water?"
57324,"I was stuck in an airport once and as the hours passed I started reading the fine print on... basically everything. My water bottle, and I'm pretty sure it was the nestle water, said it was purified water from the public water supply of Allentown, PA"
57325,"I forget the name of the documentary now, I saw it years ago, but it's about bottled water and Nestle. They just go to different cities/towns and bottle their water then leave."
57326,"I believe they also did that with Flint, Michigan"
57327,All nestle waters are pretty much sink water
57328,"specifically, [these](https://www.nestle-watersna.com/) and [these](https://en.wikipedia.org/wiki/BlueTriton_Brands). basically, you're fucked."
57329,I honestly didn’t even know nestle did water until that whole thing happened. I’ve always known them for chocolate
57330,Which brand of nestle? There are so many of them
57331,all of them
57332,"Every time I drink Nestle, I always get sick. I know there’s no possible correlation, but it’s happened enough times that I have a special kind of hate for Nestle."
57333,It tastes like watery milk to me. I don't even know how it's possible
57334,"Dasani cuz of taste, nestle because it’s an asshole company"
57335,"Nestle brands as several keep cropping up - [https://preview.redd.it/t7k5r018b6761.jpg?width=960&crop=smart&auto=webp&s=06f78f490d40d46fde70f5bfc2f8908c77b78b29](https://preview.redd.it/t7k5r018b6761.jpg?width=960&crop=smart&auto=webp&s=06f78f490d40d46fde70f5bfc2f8908c77b78b29)

[https://preview.redd.it/fw250qux78c31.png?width=640&crop=smart&auto=webp&s=86bb0b85712d8f394aa1b780fb90fa221e294b7f](https://preview.redd.it/fw250qux78c31.png?width=640&crop=smart&auto=webp&s=86bb0b85712d8f394aa1b780fb90fa221e294b7f)"
57336,Dasani taught me that water can taste bad. *Real* bad.
57338,There is no way a totally well adjusted person choses Dasani as a water substitute.
57340,Out of curiosity (it doesn't exist in my country) how much does a 0.5 liter bottle cost?
57341,$1.68 US but it tastes like dog shit
57342,"Jesus Christ what a fucking scam, why do people even buy it?


Follow up question: how is the tap water in the us? Is it drinkable? Here in Finland the tap water actually tastes really good, so I've never really bought bottled water, is it different over there?"
57343,"Every city pretty much has their own aquifer or source for water. So a lot of cities have fantastic water, but a lot of places have really awful water. The city I'm in, the water is *okay.* One city east, the water is fantastic. Two cities north, I have literally seen it come out of the tap still brown."
57344,dasani
57345,I don't really like Arrowhead or Crystal Geyser
57346,"Arrowhead is Nestle too, Fuck Nestle."
57347,"I'm with you there on taste.  

So many hate on Dasani.  I've no problems with it.

Funny how people are so different."
57348,Crystal Geyser is fine
57349,"Arrowhead for flavor, nestle for principal... and flavor"
57350,fyi Nestle own Arrowhead too.
57351,"Yep, there are a bunch of regional brands they own. Poland Springs is another I believe. You can tell its one of theirs by the packaging and logo design."
57353,Dasani tastes like it came out of a south Florida ditch.
57354,When you’re thirsty you’re thirsty thi
57355,"Nestle is bad because of the company. But for real, Dasani water tastes a lot worse than Nestle."
57356,What did the company Nestle do? A lot of people seem to dislike them but I've never actually had an explanation why.
57357,"Take your pick

https://www.zmescience.com/science/nestle-company-pollution-children/"
57358,Dasani and nestle
57359,Dasani. It was good like early 2000s but fuck it’s gone down hill since then
57360,Yeah in early 2000s they had it at school and I really liked it but it's not the same anymore
57361,All of them. We should not need bottled water
57432,All of them
57363,Seriously. Get a camelbak and a brita.
57364,Was about to reply this too. Imagine paying for bottled water. I only drink it when I get it for free from an event or something. I prefer a simple reusable bottle not because I’m some uwu environmentalist type but because I just like getting water without paying for it.
57365,I like that schools and colleges now have dispensers for filtered water so you can refill your thermos containers. Plastic water bottles should be outlawed.
57366,Svedka
57367,"Welcome, Comrade!"
57368,Nestle and deer park water
57369,Deer park is Nestle too.
57370,"Ah, that explains it"
57371,It’s owned by Nestle.
57372,Fuck nestle
57373,Nalgene. For some reason they always come empty...
57374,Fiji and Evian have high ph and I hate them.
57375,Arrowhead. It’s like licking a fucking rock
57501,Life Water
57377,Yes its so overpriced!
57378,Arrowhead. It's Arizona dirt water. Packaging looks like Ozarka. It most assuredly was not.
57379,Both Nestlé brands.
57380,"All of them

Get a reusable water bottle"
57381,Great Value
57382,But it’s such a great value!
57383,"Evian, tastes like it was dipped from someone’s pool."
57384,It feels like it leaves a film on my mouth.
57385,Yes!! How can they make water taste chalky?! So gross!
57386,I believe the flavor you're thinking is dishwater.  Evian is french for dish water.
57387,Evian is naive spelled backwards.
57388,"ooooh, I think that's the one that's absolutely disgusting. I had forgotten the name of it but that sounds familiar. There is one bottled water that I legit just could not drink it tasted so bad."
57389,Wow I cant believe people taste differences in bottle water... all water kind of seems the same to me so I mostly just use the tap.
57390,"I’ve grown up with well water and honestly can’t stand tap water that comes from the city, although this definitely varies in different locations. Because of the treatment it usually tastes chemical-ish to me. Bottled water is more hit or miss though."
57391,Ik right? Water is water. Unless its costs $8 per liter.
57392,I rarely buy it so have no idea. Why are you all buying bottled water FFS?
57393,Arrowhead is the worst hands down
57396,Honestly all bottled water tastes fine. Dasani and Nestle are bottled plastic resin and you won't change my mind.
57397,Dasani hands down. Why do they add salt as an ingredient in their water???
57398,"Bottled water is all terrible.  If you live in a place where tap water is safe, get a filter for your hone and fill  your own reusable bottles.  

Most bottle water is just filtered tap water anyway. Single use plastic bottles are a terrible waste and trucking all that heavy water all over just makes it worse.  

If your tap water sucks, at least use those big refillable 5 gallon jugs."
57400,Arrowhead. It tastes like they pay people to fart in every bottle the very moment before its sealed.
57401,"Nestlé - Pure Life

I read the back and it’s literally water from our local public water supply. After that I decided nestle is bullshit. Their borrowing from our public water supply and selling it back to us at a mark up"
57402,"All of them. Get a berkey filter, or figure out a cheap diy alternative. Not a Brita. And get a nice bottle."
57403,What's wrong with Brita?
57404,"Echoing the same as everyone else but yeah Dasani since it tastes like vaguely salty water that had a penny marinating in the bottom of the bottle, nestle tastes like you left it in the car for too long and the company is literally run by demons."
57405,"Fiji, fuck the Resnicks."
57406,Ice Mountain actually makes me sick. Not like a “ew that’s gross” kinda way. Like it actually jacks up my stomach for a day or two.
57407,Nestle tastes like eating a bag of salty snacks.
57408,"Obviously fuck Nestle. Dasani tastes metallic.

But my honorable mention goes to Fiji water. It has this really odd aftertaste that I can't really pinpoint. Plastic maybe?"
57409,Anything by Nestle
57410,Anything Nestle owned.
57411,"I worked for “big water”

Taste- Dasani
Ethics- Nestle"
57412,"Dasani. You cannot say otherwise, it's Dasani."
57413,Anyone says anything other than Dasani is simply not from this planet
57414,All of them. Get a water filter + a reusable bottle 🌍
57415,Nestle because not only are they assholes but they poison my water
57416,Dasani. Tastes like cigarette ash.
57417,In korea we have this thing called arisu which is literally tap water. They are the main suppliers of school waters and have a long reputatiob of insect infected waters
57418,Bud light.
57419,"anything by nestle, those fuckers"
57420,"Somehow no one has said it so I will, Crisp & Clear, the pepsi version of dasani is somehow worse than dasani"
57421,"I already has been pointed out how bad everything Nestle is, but I don't think it has been pointed enough.

Fuck Nestle!"
57422,Budweiser
57423,Smart Water can go to hell
57424,"I. Fucking. HATE. FIJI WATER.  
Everyone's like ohhhh its minerally its soooo healthy for you mm best water yes I ONLY DRINK FIJI WATER how dare u even get any other water and  


Its absolutely disgusting.  
I grew up in the midwest. Tap water was basically undrinkable in some areas. I went to a summer camp (International Music Camp at the border of US and Canada) and had some water from a fountain because I was super thirsty and immediately spit it out and went and paid for water instead (The next time I attended that camp I brought a gallon of my home tap water with me).  
My home tap water wasnt even that much better. Chemically-chlorine tasting.  
Moved to Oregon, nice tap water, doesnt taste like death most places.  
My dad bought a case of Fiji water for a road trip we went on to visit my Grandparents and I cracked one open because I was thirsty and I immediately thought I was going to barf. Sour to holy hell, overly mineralized, borderline salty, tasted like death.  
Thought I just had a bad one. Took a drink from my brother's Fiji water because it'd been in the cooler and was cold.  
Slightly more palatable but still disgusting.  


Fiji water SUCKS I dont care if its fancy and good for you it's overpriced and it tastes bad."
57425,"All of them?!  Jeez people, stop with the plastic."
57426,"if you've ever travelled outside of US/Europe, you would know that bottled water is the only source of clean drinking water in many countries. just saying."
57427,Laughs in Flint.
57428,"Well... Flint, Michigan is basically a 3rd world country, so analogy holds up :D"
57429,BBQ burnt ends
57430,Bud light
57431,Bud Light
57433,Smart water
57434,"This cat says Aquafina …

https://fb.watch/79QYiZx90B/"
57435,"Its gotta be Fiji, shit is literally sink water"
57436,Bottled water as a product is the dumbest thing in the world.
57437,"This is going to sound pretentious as hell but I don’t buy bottled water but my parents do have a service that basically consists of one dude who I think it’s a graduate student at brown that does the side hustle where if people pay him a certain amount he will come to their house in bottled and bottle the well water they have as well as just packing up and shipping at random places so my parents every month or so have this guy come to the house and bottle a few hundred bottles A bunch of bottles of the well water we have from the property and then they mail it to us so that we can still drink the water from our house because it’s really good water like comparable I would say the well water from my parents property test about as good as New York water and that’s saying something.

&#x200B;

So yeah it’s a little ridiculous but we don’t buy well why we don’t buy bottled water but we do bottle our well water. Period. Lol"
57438,Holy fuck please use more periods
57439,Aquafina
57440,Kirkland is terrible
57441,"There's is ok, plus it's really cheap so I can always store a couple of 40 packs in my car to hand out to homeless people at intersections while going to and from work"
57442,Agreed. Surprised this isn’t higher.  Kirkland is even more unbearable than Dasani. Weird because I thought I didn’t mind Kirkland a while back.
57443,"Fiji. All bottled water tastes like plastic, and Fiji is the most expensive one I know"
57444,Dasani/Aquafina
57445,"There's a great Michael McIntyre skit on this.

&#x200B;

Pump can go to hell, by the way."
57446,"It's by far the most popular one where I'm from and it's not necessarily a ""cheap"" brand, but Poland Spring is kinda gross."
57447,(Nestle)
57448,God damn those bastards are everywhere
57449,Rain Barrel
57450,"Nestle, Dasani, Crystal Geyser 🤮"
57451,"Dasani, I would rather drink Toilet water"
57452,I think it's the same source...
57453,It's tap water with added crap.
57454,Liquid crap
57455,"Whichever costs the most, they’re all a rip off"
57456,"Fuck Nestle.


I don't like Desani, either. But absolutely fuck Nestle."
57457,Nestle in general sucks but Dasani just has a horrible taste to it
57458,Voss horrible taste
57460,"Bottled Water:


In this category the drinkers had the greatest patience with the top performers but at the other end of the scale couldn't stand Seltzer Water at all, and thought of it as a dumb"
57461,Crystal Geyser. This stuff makes my GERD worse. Plus it tastes bad.
57462,"nestle, total boycott on for life."
57463,Pure life is gross
57464,Evian and Aquafina
57465,"Can we talk about how trash Deer Park is tho, straight tap water bruh"
57466,"The expensive ones. Wtf is premium water? It’s water! If it’s filtered, it’s good"
57467,"Nestle has this strange taste which I find the worst, Dasani has this interesting bitter taste which I'd rather prefer since it tastes unique but I know that it's going to be mentioned as the worst brand in the comments haha."
57469,crystal geyser tastes weird
57470,"Life water, today I was at some store in my city I'm buying bottled water. Well as I looked to see what the options are I see it the very overpriced $8 bottle if Life Water and next to it a bottle of water the same size for like $2. Heh?"
57471,I thought I was the only one who hated how Dasani tastes until I read this thread
57472,"crystal geyser, ice mountain and nestle. hands down, undebatable worst water"
57473,"For taste alone arrowhead. I sware to god I would rather drink old truck stop mop water that ben left out in a bathroom for 3 weeks. Then to drink arrowhead water.

Grate value water is the best, most people sleep on it and yall missing out on it."
57474,"I would say Dasani because it tastes like metal, but nestle is just a shitty company and I’ll take metal over giving them any of my money"
57475,Donkey's Delite.
57476,Nestle and subsidiaries
57477,"Whatever fucking kind I have at my house right now, tastes like rocks"
57478,nestle
57480,Dasani tastes like drinking Dr. Pepper out of a lifestraw
57481,What's that miracle water that some famous person started. It was basically just water filtered over diamonds. They said the water absorbed the minerals of the diamonds. It sold for a ridiculous price too.
57482,I believe it’s called diamond water. i saw it being sold at Burlington today for a little over $3.
57483,Evian tastes like dish soap.
57484,Dasani and deer park
57485,tap
57486,^
57487,tfw when you're from a third world country and can't drink tap.
57488,"Essentia  Alkaline Water homie, it’s got that fire 9.5 PH along with a silky-smooth taste and extra electrolytes for hydration."
57489,"Fresh ice cold water from a fountain on top of a mountain. If you don‘t have that, evian is my go-to.

Edit: just don‘t buy any nestlé water, also fuck fiji water."
57490,"Woah, woah - Fiji has one of the highest TDS content for a bottled water that's easily available nation wide"
57491,"Tbh I have no idea what TDS content means but I dislike fiji water because transport and distribution in the US is such a long way and produces a lot of pollution, plus it‘s just too expensive.

Evian is perfect for me because I live in switzerland and it‘s source is on the french border to lake geneva, literally just around the corner compared to fiji. I mean I‘m drinking tap water 95% of the time, but I like to minimize my carbon footprint, especially if it‘s as easy as investing 15 minutes into water research."
57492,"Well, TDS is total disolved solids ... like the mineral-ieness of your mineral water, for a while there I was into the differences in that. Like Fiji, for example, happens to be higher in silica so it has a real smooth feeling. But i did a quick Google search since it's been a while, and Evian actually has a higher TDS level than Fiji, though bot sure of the mineral breakdown"
57493,"I like sparkling water, tastes like static noise"
57494,None of those single use plastics
57495,"That wasn't my question homie. That's for visual purposes. I would've at least appreciated a suggestion, but it's cool."
57496,I don't drink any of them because it's terrible for the environment and my suggestion would be that you don't as well 🙂
57497,I typically use biodegradable products to reduce pollution and recyclable material 😁
57498,The biggest one
57499,I don't know if you have it abroad but in france Volvic is the best water i've ever tasted
57500,"Evian, shit's gonna turn you upside down because of good it is"
57503,IMO Fiji but its expensive so otherwise just Dasani
57504,Dasani tastes like shit tho
57505,Dasani tastes like battery acid
57506,Battery acid tastes good tho?
57507,"Dasani  and Aquafina are Coke and Pepsi.

Anything but those. May as well just drink tap water.

Fiji is my favorite."
57508,Crazy Water from Mineral Wells Tx
57509,"A Swedish brand called ramlösa, ofcourse in a glass bottle. Easily the best water!"
57510,"There ist a music channel that tasted different waters to find out wich one is the best.

here is the link:
[Taste the best water.](https://youtu.be/b08ejKMIMho)"
57511,Room temperature Tap if you can get it.
57512,If you're near a whole foods market they should have a water dispenser with alkaline water...mine does and it's delish
57513,corporation pop
57514,Icelandic glacial water
57515,"Every water. To a true hydrohomie, we cherish all water. I rememver back when I was a small hydrling, I asked my hydrodad, “father, what is the best water?”  He responded with a sentence that changed my life. “All water is precious son. I remember when the Soda tribe took your mother, I almost turned away from the hydration, but then, I saw him. The true hydrohomie. He came down from the clouds and handed me a bottle of water unlike any I have seen before. He told me to take it with me wherever I go. That bottle has the power to turn into any water possible.” 10 months later, he died in a Soda tribe attack. As I held him in my arms, he handed me the bottle and said “son, take this to remember me”. And then he died. So I say again, all water is precious."
57517,real hydrohomies don't drink bottled water.
57518,Eska
57519,"Volvic, by far. It has a slightly sweet taste to it which I like. Then again, it’s different for everyone."
57520,blk water
57521,P O L A N D S P R I N G S
57522,Frickin wawa. There bottles just crush in the perfect way that gets the optimal flow of h2o into your mouth
57523,Whatever’s cheapest. Tastes like money
57524,So a reusable bottle filled from the tap? You can almost taste the savings.
57525,Exactly. True hydrohomies never buy bottled water except when absolutely necessary
57526,Still water : Volvic.  Sparkling water: Perrier (San Pellegrino a close second).
57527,"Indonesian here. Any brand, except for amidis, that damned water was taken straight from the deepest abyss of tartarus."
57528,I prefer tap but I don’t care that much
57530,^gatoooorrrade ^*gatoooraaade*
57531,"1. YSL Y EdP (monster performance) 
2. Tom Ford Tabacco Vanille (girls love the sweet dry down) 
3. Tom Ford Ombré Leather (bad boy stuff. Insane performance)
4. Tom Ford Tuscan Leather (more bad boy stuff. Insane performance) 
5. Dior Homme Parfum (most compliments when in a club)"
57532,"1.  Creed Millesime Imperial 
2.  YSL La Nuit de L'Homme
3.  Guerlain L'Homme
4.  Chanel Platinum Egoiste 
5.  Bleu de Chanel

Honorable mention: Dior Homme Sport (which I hate, but women love it)

Note, I own and wear a ton of Niche, but my list of most complimented is mainly designer.  Also Aventus is not listed nor Baccarat Rouge and I wear both often.  Designer fragrances brings the most compliments over Niche in my opinion."
57533,No compliments yet...
57534,I don't get a lot of compliments but if I'm going out or to work I use 2 maybe 3 sprays max however I've had a lot of people ask me what I'm wearing when I've had Bee by Zoologist on.
57535,"Royal Mayfair 

Gucci Pour Homme II

Both by the same dude. He has good taste but doesn’t wear any fragrance himself."
57536,"See the thing with Acqua Di Gio Profumo when I sprayed it on my skin coming from a retailer, I really liked the initial smell. I've thought of buying it on the spot but I decided to see how it performs for a day first. But after a few hours in, the smell kind of got invading that it started to get obnoxious for me, it felt like I was having a headache. But then again, I sampled a lot of perfumes that day, so maybe my nose got fucked up. Haha. Maybe I should try it on a decant first"
57537,I get a compliment here and there for various scents. My most complimented? Prada Luna Ross’s Sport. I wear it more often now because of this although it’s not one of MY favorites.
57538,"For me the top 5 most complimented fragrances in order from my collection so far are: 

1. Armani Privé Bleu Turquoise 

2. Byredo Mojave Ghost

3. Le Labo Another 13 and I only had this for a month

4. Bvlgari Tygar

5. MFK Aqua Celestia 

Every time I wear any of them, there’s always at least one compliment."
57539,"tygar is the bomb! 

I was at my local supermarket/post office and had just paid for my groceries, then I went over to the post office section which is ~3 meters further away. 30 seconds later a woman was about to pay for her stuff, when she asked the cashier: ""is it you who smell so amazing?"", cashier said ""no, can't possibly be me"", she said ""oh, it just smells soooo heavenly in here!!! are you sure it's not you?"", he rplied with ""haha, nope, I don't have a fragrance on"", then she just said ""oh, well it smells fantastic here"". my mother was standing behind her and could tell it was my fragrance. I could not smell anyone elses fragrance and it was just us 4 in the store, haha. I had just sprayed it on before leaving the house and I guess the sillage was strong. the performance is really good on it"
