idx,text
68659,"Not all of them were written in the 21st century, but Iain M Banks's Culture books stack up with any sci fi I've read.

Anathem by Neal Stephenson.  I see Seveneves and Snowcrash below, but Anathem was vastly better than either in my opinion.

The Martian by Andy Weir.  It has it's critics and I get where they're coming from especially after Artemis, but I couldn't put it down until I'd finished it so it must have something going for it."
68660,"> The Martian by Andy Weir. It has it's critics and I get where they're coming from especially after Artemis, but I couldn't put it down until I'd finished it so it must have something going for it.

Honestly, the biggest thing that *The Martian* has going against it for any sort of attention or award in the industry is that it was self-published. That's why you can find dozens of articles from NPR reviewers and editors talking about *Artemis*, but only two mentions of *The Martian* ever even existing as a book."
68661,It existed as a web novel before that.  He'd do a chapter at a time and post them up.  I heard about the book because of the movie though.
68662,"+1 for the Culture stuff, though yes the better ones IMHO were pre-2k"
68663,"I purchased The Martian as a Kindle daily deal before there was even a mention of a movie. I sat on it and didn't read it.
When they announced the movie, I ended up reading it in one day."
68664,"Blindsight by Peter Watts is the one i liked the most from post 2000. Maybe Embassytown by China Mieville, but i dont see it becoming a future classic"
68665,"Blindsight was fantastic. Mind blowing shit

Echopraxia didn't do much for me."
68666,"Yeah. I felt like echopraxia was better written in a lot of ways, but it definitely didn’t carry the philosophical weight blindsight did."
68667,I'll second Blindsight.
68668,"These are the ones I keep going back to:

Blindsight by Peter Watts

Anathem by Neal Stephenson

Poseidon's Children series by Alastair Reynolds

Spin by Robert Charles Wilson

Neptune's Brood by Charles Stross

Flood/Ark by Stephen Baxter"
68669,"Looks like I’ve got a reading list seeing as I loved anathem and blindsight.

Ever read embassytown? Good stuff."
68670,"The Three Body Problem trilogy has been the standout in recent years for me. Also I think Alastair Reynolds Revelation Space books are up there, despite my annoyances with them. I loved early and mid-period Neal Stephenson (especially Snowcrash, Cryptonomicon, and Anathem) but I found his later stuff disappointing."
68671,"Revelation space is EXACTLY what I love about hard sci-fi and space opera. I've read pretty much everything Reynolds has written. The Three Body Problem trilogy is next on my list of books to read. I think Niven's Ringworld/known space universe is worth a mention too (the five Fleet of Worlds novels only, as the rest is older than 18 years)"
68672,i love the RS setting and the societies that emerge from it. i just think that the books concentrate too much on the minutiae of things and cover the bigger plot points almost as afterthoughts. Absolution Gap is a good example of that.
68673,"Yea, the ending was.... not good."
68674,I loved the first half of seveneves.
68675,After the disaster that was Reamde I gave up on NS. Plenty of books to get through before trusting him again :-\
68676,I liked the biginning premise of Reade but it just kept getting more and more crazy with the main characters personally tracking down the hackers accross the world.
68677,"Yeah wow rarely have I ever gone from ""this book is great!"" to ""nope. not one more page"" than in SevenEves"
68678,"The Diamond Age started out conceptually amazing, was good for 60-75% of the book, then sort of drunkenly stumbled to a mumbly conclusion I thought.  Did anyone else feel that way or is it just me?"
68679,yeah i thought the potential was huge but it never quite got there. maybe i'll just have to go in again...
68680,"If I didn't really dig the first Three Body Problem book, does that just mean I'm not as into it as so many seem to be, or does it get better after the first book?"
68681,"The second book is very different, and much better, even though I really liked the first one."
68682,"Without raising your expectations unduly, i would say... keep going. For me it just kept getting better and stranger, and the scale and concept just expands and expands and expands..."
68683,"Then the third book expands even more, thoroughly enjoyable."
68684,The Three Body Problem is one of the best sci-fis and novel that I’ve read in YEARS.
68685,"Personally I would say The Three Body Problem and its squeals are an easy choice here.  If the Amazon adaptation takes off it has the potential to be massive in the west and even more massive considering the size of the Chinese market.


Neal Stephenson should probably be considered in general but (much like you list Philip K Dick) he might be known more generally rather than for a specific work.  The standout is technically outside your scope but Snowcrash is a book about internet memes in an MMO written in in 1992.  


The Martian also deserves consideration, its not often hard SF like that gets so popular in mainstream culture.


Ready Player One will probably be in the discussion but doesn't deserve it at all."
68686,Definitely agree with the Three Body Problem
68687,"I bought the Three Body Problem through one of those ""blind date with a book"" things, where it's wrapped in brown paper and they only give you a small description. I don't read a ton of sci fi, so I'm hoping I enjoy it!"
68688,"The Three Body Problem's characters were so wooden. Ye Wenjie and the other male main character have decent character build up, but everyone else feels like a set piece."
68689,Agreed. Ready player one was suuuuuuuper predictable.
68690,"You read my mind! I was just thinking of what I could read in this genre that would take me away like PKD and Dune, or Ender's Game, etc. These are some good recommendations to go on, and I'll be looking into them for sure!

For you, OP, I would recommend the Silo Trilogy by Hugh Howey. A great post-apocalyptic world with lots of intriguing writing. Happy hunting!"
68691,I really liked the entire series of Enders Game! -_-; had to buy them all cause I couldn't put them down and the library did have them.
68692,Children of Time
68693,"First book I read to get back into reading, Amazing read"
68694,">Dont listen to the audiobook anybody, you will hate it."
68695,I really enjoy The Expanse series by James SA Corey. I find it difficult to mention any one of the books in the same breath as Dune but the series as a whole is large in scope and is defintely in my top 5 Sci fi sagas
68696,"Annihilation (not the other two though)

Under the Skin

How to Live Safely in a Science Fictional Universe"
68697,Wooahh.... i agree the second was tough to get into but really comes together in the end but really sets up the third for what I thought was really good.
68698,I’ve heard that but think I didn’t give the third enough of a chance after the second. I might just have to reread 🤔
68699,"The Imperial Radch trilogy by Ann Leckie, but mostly the first book, Ancillary Justice. Truly original vision of AI, biotech, gender issues, cloning.

Also Yoon Ha Lee's Machineries of Empire. An idiosyncratic technology base unlike anything else out there. 

James SA Corey's The Expanse, for the sheer breadth and range of their vision. There's very little in the first book that hints at where we are now in the seventh (? I forget), but each step on the way progressed clearly from what came before and led to the next."
68700,Ann Leckie is awesome.
68701,">Machineries of Empire

Couldnt get into it. Such weird shit (not in a good way) like how infantry formations use the calendar to get special bonuses and shit???"
68702,Red Rising by Pierce Brown?
68703,Love to see another howler represent
68704,"Personally I think Peter F Hamilton's books are really up there, more on the Dune side of things than the PKD side of things though. The Void trilogy and The Night's Dawn Trilogy are excellent (though I think the latter may have bridged the 20th and 21st centuries)."
68705,"Reading Judas Unchained right now. I have a love/hate relationship with this book. Some plot threads and characters are fascinating - MorningLightMountain, Paula Myo, Ozzie - while others are torture to get through. There's so much extraneous detail to wade through. I'm not opposed to epic-length novels, but not when 40% is padding."
68706,"hamilton is good, def good do without so many useless/boring sideplots though."
68707,"I really enjoyed the Quantum Thief series.  It's a bit hard to get your head around at first but that's part of understanding the mystery the main character is facing so you understand that too in retrospect as things progress.

Scalzi's Old Man's War is also quite good.  Redshirts is good but very snarky and third wall."
68708,The Quantum Thief series is so underrated. I second this.
68709,"ok i just gave up on it, maybe it was the narrator. i don't know. it didn't grab me."
68710,"It is hard going until you start figuring out what some of the concept words mean, but once you get a glimpse of what's going on it really takes off.

The problem is that what's going on is at first really confusing both to the reader and the main character, because there are major gaps in both his and our knowledge of the world and plotline... which works to help us understand the problem the main character is dealing with but is also kind of unpleasant for both us and him until it starts getting untangled a bit."
68711,i don't think that was it - i'm pretty used to being dropped into contextless situations in books. i really think it might have been the narrator. heh.
68712,murder bot series should be on the list.
68713,the Madd Addam trilogy by Margaret Atwood.
68714,"The Fortunate Fall by Raphael Carter

It actually came out in 1994 but it was under read because of its difficulty. I read it last year and I feel like it could be written any year before 2020 and still feel a bit too futuristic."
68715,"Idk what really defines sci fi entirely but id like to think a top three personally would be some pretty significant titles. They all are more or less focused on war and humanity but id say *The Forever war, Starship Troopers,* as well as *I-Robot* would be significant additions to any list. Aside from that some guilty pleasures of mine are The ender books both main story and the shadow spin offs and this awesome pick up of *Terms of Enlistment*"
68716,Only one of those is 21st century
68717,"Ya know what. True, let me come back to this."
68718,New York 2140
68719,"**The three body problem I-III** by Liu Cixin

Part II *Hunters in a dark forest* is probably the most disturbingly haunting take on the fermi paradox I’ve ever read. I can’t imagine a future in which Liu Cixin books are not conciderd  Sci-fi genre classics. (except for a future in which China rules the World and Liu Cixin got ""vanished"")"
68720,"Idk if others would agree, but a personal favorite of mine is the [Alex Benedict series](https://www.goodreads.com/series/42152-alex-benedict).

It's about an antiques dealer 10,000 years in the future (really more like a tomb raider), who hunts for famous lost spacecraft/tech. Basically a series of detective novels in an interstellar setting.

Each one is its own story, but they do reference each other so probably best to start with A Talent for War. I started with Polaris though, and was fine."
68721,"Ann Leckie's Imperial Radch trilogy

Ada Palmer's Terra Ignota"
68722,"I read Seven Eves because it was on Bill Gates' list. It was good, although I would have liked more detail in places, and I heard it stacked up well."
68723,"Also really enjoyed First Contract by Greg Costikyan. Very smart and very funny. A must-read for anyone starting their own business, haha."
68724,all our wrong todays was pretty fantastic
68725,"Blindsight by Peter Watts - excellent first contact novel with truly alien aliens and disturbing implications about the nature of consciousness.

Windup Girl by Paolo Bacigalupi - The 'science' part could have been better when it comes to energy sources, but on the whole it's a vivid and haunting image of a broken world after an ecological catastrophe. His short stories are great too, especially ""People of Sand and Slag"""
68726,"William Gibson's 21st century work is largely conceptually toned down from his earlier, better known cyberpunk novels (Neuromancer et al) but his recent book The Peripheral is science fiction of the rarest sort: a  grounded, thoughtful time travel story that features no less than two intriguing and eerily plausible apocalyptic futures (suck on that, Hunger Games).

Gibsons world building is spare and organic: he lets dialogue and action fill in the gaps rather than relying on narrative infodumps, and the story goes from bizarre and incomprehensible in the opening pages to an interdimensional epic that reimagines contemporary proxy warfare fought by superpowers as a chess game played by futuristic oligarchs.  

Apparently Amazon is adapting The Peripheral into a series, so read it now and be that irritating dude who won't shut up about how much better the book was.  

Also read Gibsons other recent stuff.  Not sci fi per se, but tight, well-imagined light futurism (I guess) - I think he captures something of post-9/11 America that no other writer (ime) quite manages.  

Another rec: China Mieville is (rightly) better known for his fantasy work, but I enjoyed the hell out of The City and The City and feel like it qualifies as science fiction - no aliens or cloning, but Mieville takes a contemporary issue and extrapolates it out in an interesting, high concept direction.  Worth checking out."
68727,"**William Gibson wrote ""Neuromancer"" - with its cyberspace, hacking (and counter-intrustion systems), A.I., and all sorts of other shit, in 1984. The World Wide Web was initiated in 1989... 5 years AFTER...**"
68728,Borne is absolutely insane and crazy but really easy read..... just check any sense of reality at the door
68729,"I'd put in for _The Long Earth_ myself. I've tried _The Long War_ with no success, but I love the ideas in _The Long Earth_."
68730,"* Three Body Problem
* Anathem
* The Martian
* Area X Trilogy
* Revelation Space
* 11/22/63
* Stories of Your Life and Others
* Station Eleven
* Infinite Jest (more a crossover but I'll count it)"
68731,The Imperial Radch trilogy by Ann Leckie.
68732,I really enjoyed the Three body problem trilogy and the red rising trilogy. Red rising is like game of thrones in space and the three body problem has been spoken on here enough so you get the gist
68733,Bobiverse books for me.
68734,"- The Space Between Worlds by Micaiah Johnson (Just finished. LOVED it!!!)

- The Broken Earth trilogy by N. K. Jemisin

(I'd always recommend The Giants series by James P. Hogan -- first title is Inherit the Stars -- but it doesn't meet the criteria, having been first published in 1970.)

- Another vote for Three Body Problem by Cixin Liu"
68735,The Name of the Wind by Patrick Rothfuss.
68736,It's great but not sure it's science fiction.
68737,fair assessment; more fantasy.
68738,"I totally fail to understand why people like Orson Scott Card's books.  Ready Player One?  Really?

Taking ONLY from the lists below I'd pick:

1. A Canticle for Liebowitz
2. Foundation
3. The Martian Chronicles
4. Neuromancer
5. Hitchhiker's Guide to the Galaxy
6. Ubik
7. Solaris
8. A Scanner Darkly
9. Dune
10. Brave New World

As much as I love 1984 I really wouldn't consider that book science fiction.  To me the genius of that book is that it's always happening somewhere in the world, every day."
68739,"I think it's definitely science fiction because it's depicting a world in the future compared to when Orwell wrote it, and it's a cautionary tale about totalitarianism. Especially the part about controlling language. That is more true today than ever."
68740,"I'd define science fiction more as stories in which scientific concepts are central to the narrative.  In this sense 1984 isn't science fiction.  Speculative fiction, sure, but not science fiction."
68742,"Wow. Someone else that thinks Enders Game is terrible. I know it's sacrilege to say that book sucks in the SF community. But, I read it after I learned about Orson Scott Card's hatred for homosexuals, and his participation in programs that try to ""de-gay"" people. (Btw there a lot of super gay scenes in the book). Author's evangelical views aside, the book alone is insanely overrated. Maybe if I read it when I was 12, I'd hold it dear to my heart like so many SF fans do. Guess I missed my window.

Sorry. That's just my asshole opinion. I was just glad to see I'm not the only one who thought it was awful."
68743,"Sounds like we had similar experiences.  I read Ender's after hearing about his position on evolution.  I try to approach every book with an open mind, and not confuse the author with whatever he/she has written, but even so it was hard to get past his comments on scientific topics and see the book for what it really was.  I think I mostly succeeded, but just the same Ender's isn't very good."
68744,"A Canticle for Liebowitz,  Ender's Game, The Forever War, Old Man's War, Ingathering, the Book of the People, Foundation,  Dune, The Moon is a Harsh Mistress,  the Martian Chronicles."
68745,"I like both hard science fiction, provocative sci-fi and some of the great classics, so here's my list: **Dune**, **1984**, **Neuromancer**, **Ender's Game**, **The Time Machine**, **Fahrenheit 451**, **Stranger in a Strange Land**, **Snow Crash**, **Slaughterhouse 5** and **A Wrinkle in Time**. I'd add **Frankenstein** due to its profound brilliance and depth, but is it science fiction?

Here's a second list too; non-English language sci-fi that's also excellent: **20,000 Leagues Under the Sea**, **All You Need is Kill**, **The Three-Body Problem**, **Battle Royale**, **The Windup Girl** and **Solaris**."
68746,"Frankenstein is definitely science fiction, one of the earliest if not the first science fiction novel so it doesn't fit quite cleanly in our modern standards of sci-fi, as it sits on the birthing point of a genre."
68747,"I definitely consider Frankenstein Science Fiction. It’s kind of a Gothic SF novel which is something you don’t see very often. But I also agree about 20,000 Leagues. I love that book!"
68748,"I'm pretty sure ""The Windup Girl"" was written in English.  And that ""The Three-Body Problem"" is terrible.  Otherwise, great list."
68749,"I must agree about the Three Body Problem. It was the driest, monotonous SF I've ever read. But that's just like...my opinion, man."
68750,"Oops, you're correct about ""The Windup Girl"", though I could have sworn somewhere I saw it as being translated from the original Italian. Oh well. And your opinion of ""The Three-Body Problem""? Okay, we'll have to agree to disagree about that one."
68751,"* Futurological Congress. Stanislaw Lem.

* Ijon Tichy stories. Stanislaw Lem.

* Cyberiad. Stanislaw Lem.

* Sirens of Titan. Kurt Vonnegut.

* The Stars -- My Destination. Alfred Bester.

* Ubik. Philipp Dik.

* Hyperion. Dan Simmons.

* Gallegher stories. Henry Kuttner.

* All Flesh is Grass. Clifford Simak.

* Ring around the Sun. Clifford Simak."
68752,"This is the kind of list I could have put together. Excellent choices and so nice to see Ijon Tichy on there - us *mucilids* should stick together!  Incidentally I recently read G K Chesterton's book ""The Man Who was Thursday"" and discovered it had the same theme (and surprise) as the 11th Voyage from the Star Diaries.

One day I intend to test my theory that every single book by Clifford D Simak has a dog in it."
68753,"Dune, Dune Messiah, 1984, Brave New World, i robot, neuromancer, starship troopers, hitchhikers guide to the Galaxy and probably something from Philip K dick, maybe his collected short stories? Do Android's dream of electric sheep is really more interesting as a compliment to Blade runner than an amazing novel IMO."
68754,"Great list! I would add Foundation, slaughterhouse 5 and probably a jules verne in there."
68755,"Also worthy of consideration : Day of the Triffids or The Midwich Cuckoos by John Wyndham.

Something from Brian Aldiss also, but it's been awhile since I've read something from him. Not sure which of his works would be most appropriate.

Ringworld by Larry Niven another one."
68756,"In no particular order:

* Robots - Empire - Foundation by Asimov (I know that's more than one but it's a continuous story starting with iRobot)
* Brave New World by Huxley
* Number of the Best by Heinlein
* The Man Who Japed by Philip K Dick
* 1984 by Orwell
* Fahrenheit 451 by Bradbury
* Dune by Herbert (Just the books written by him)
* Green Town Series by Bradbury
* Mars Series by Kim Stanley Robinson
* Left Hand of Darkness by Ursula K LeGuin"
68757,"Her Smoke Rose Up Forever -- short story collection, James Tiptree Jr

Always Coming Home -- Ursula Le Guin

The Dispossessed -- Ursula Le Guin

Woman On The Edge Of Time -- Marge Piercy

Broken Earth trilogy -- N K Jemisin (impossible to choose just one novel out of the three)

The Man In The High Castle -- Philip K Dick

Warrior's Apprentice -- Lois McMaster Bujold

Forever War -- Joe Haldeman

Red Mars -- Kim Stanley Robinson

The Steerswoman's Road -- Rosemary Kirstein

But really you could just choose ten books by Ursula Le Guin, including her short story collections, and it'd be a great list."
68758,Yessss Red Mars!!!
68759,"Altered carbon, neuromancer, snow crash, ready player 1, I robot, a scanner darkly, starship troopers, consider phlebas, protector/world of ptaavs (couldn’t call this one), desolation road. In no particular order."
68760,"Mine, in no particular order:

Ender's Game

1984

I Robot

Hitchhiker's Guide to the Galaxy

Neuromancer

Starship Troopers

Altered Carbon

Player of Games

Hyperion

Pandora's Star

I personally find Dune to be in the 'Star Wars' category of science fiction. Aka fantasy. So wont include it. The 'science' in Dune is more political/cultural than tech.

Foundation gets a nod, but its a bit dense for the average reader.

I feel like Sirens of Titan deserves an honorable mention just for being...different.

There are so many more great books, but I just went with the ones that are most memorable to me. Michael Crichton also never makes these lists but is one of the few authors I have read exhaustively."
68761,"There are so many great books on this list. I just don't see how ""Ender's Game"" is ranked above every single one of them..."
68762,"Many of the ones who've read it did so in their youth.
The nostalgia factor might have had something to do with the rankings."
68763,"I read a great many of those books in my youth. I still don't see Ender's game rising to the level of several of those other books. Ender's game builds up to one big twist plot-wise. The characters are relatively underdeveloped. 

I think several other books give broader visions of the future or humanity or the mind. Many of them are stunning especially if you consider them in their time of publication. 

I loved Enders Game but it just didn't take me where Heinlen, Asimov, Pournelle, and several other did. Or Simmons, Vinge, Banks, or Scalzi did afterwards."
68764,"I've always thought of it as a kid's book, even when I was a kid.
And reading ""The Forever War"" right after ""Ender's Game"" further sedimented that fact in my mind.

So, I couldn't really give you any further insight."
68765,"> further sedimented that fact in my mind

I'm going to start using this phrase. Unlike something being cemented almost instantly in ones mind, sedimented is a gradual accumulation of confidence in a given opinion."
68766,"Yeah, I'm surprised to see Neuromancer in the top 20.  

It was probably better in the 80's when it first came out, but it has aged *horribly*."
68767,"Because its a hot item right now both debate-wise and with the upcoming movie and scandal around the author's personal beliefs. So it is shown on the top of an old list on the front page.

EDIT: They ranked it above *Dune*. That pisses me off royal."
68768,*Ender's Game* has ranked at or near the top of SF lists for a long time. It's not a recent phenomenon.
68769,"Oh without a doubt, but its usually close to and not on top of, and its been #1 on a few lists recently."
68770,"I guess it's just popular. It's a good book, but best of all time? Not even close."
68771,Hell no. For me that will either be Foundation or Dune.
68772,"This looks like a ""most popular"" list."
68773,"People like Mary Sue stories, especially young people."
68774,"It's a great book, but I agree it's probably not the best up there. I'd probably put Forever War, Childhood's End or Rendezvous with Rama above it."
68775,"The top 3 are the same, though not in order, from the PrintSF list someone provided below, it's not that farfetched."
68776,It's just that I don't agree with it at all...
68777,I like how  Ender's Shadow is on the list.
68778,It is a total mystery
68780,I've seen this list a few times throughout the years when shopping for new books. This is not recent at all; it's at least a few years old.
68781,"This list has been around at least a few years, although the url has changed.  It used to be austranet something or other, but that stopped working a while back.  *Ender's Game* is just an extremely popular book for some reason."
68782,You can't beat [PrintSF's Top 100](http://bookstui.blogspot.com/2013/06/printsfs-top-100-sf-novels-survey-date.html)! :)
68783,"Hmm, I think I found my reading list. I've already read 22 of the top 25, and I'm just starting the Culture series, but it'll give me a post-culture-series direction to go :-)"
68784,I envy you for being able to read the Culture series for the first time. :D
68785,"Partway through player of games right now.  :-)  

In the spirit of reciprocity, check out Vinge's ""A Fire Upon the Deep"" and Bujold's Vorkosigan novels if you haven't already."
68786,"Splendid! I have not, but now I will!"
68787,"Hyperion was so good, but I feel like the sequels somehow detracted from it."
68788,"I agree that Hyperion was amazing and the others were run-of-the-mill... That said, I enjoyed all four."
68789,"Dan Simmons also wrote *The Terror*, which isn't quite Sci-Fi but was just as good as Hyperion, IMO."
68790,"I like that list better, The Moon is a Harsh Mistress is by far Heinlein's best."
68791,"> PrintSF's Top 100

Hyperion is listed as #4, and Hyperion Cantos is listed as #28.  So is Book 1 alone 4th, and Book 1-4 as a series ranked 28th?"
68792,"There are definitely a few data compilation errors there. I'll try to clean it up if I can. Perhaps you'd be interested in the raw data, [here it is](https://docs.google.com/spreadsheet/ccc?key=0AvrSMrZ-fr5pdDNsdDBJU0ptVmRORWhtUFd5SUtnOXc&usp=sharing) in spreadsheet format."
68793,"Also, most of the multi-book series only get one line while the *Ender's* books each get their own. The first two, at least, are a pair."
68794,OK! So it's a bit of a mess. It's like homemade cookies you know. Sometime they look a bit lopsided but they are full of natural goodness! :D
68795,New sun and snow crash below neuromancer... heresy!
68796,replying to keep track of the link.
68797,"This list is still just very popular, not ""top"".  Better than the OP list though, for sure."
68798,"There is no perfect list unless we each compile our own.     
The best thing about this PrintSF list is that it's *our* list. Sure the most popular books are all there, Dune, Ender and whatnot, we are only human!"
68799,"Strange of the top 30, I have read 26 of them, but there are a few that not only have I not read, I have never heard of them. Which seems really odd. I guess I should? 
Where to start? Gene Wolfe, Alfred Bester, Alastair Reynolds or Iain M. Banks?"
68800,"Well, Bester's *The Stars My Destination* is quite short so that makes for a quick start (great book!). Of the others four Reynolds is my personal favorite (though I like *House Of Suns* better than Rev Space, and it's a standalone)."
68801,"Why are Lord of the rings, and A song of fire and ice on that list?"
68802,Speculative Fiction includes fantasy and science fiction.
68803,"Ahhh, thanks."
68804,"When we started the poll quite a few fantasy titles were submitted and we didn't want to alienate the people who want to include those. It is a ""speculative fiction"" list but slanted toward science fiction (as PrintSF tend to be)."
68805,"Fantasy quite often turns into Science Fiction as well, the lines blur a lot. Dragonriders of Pern is a good example of that."
68806,I still think this flow chart for the [NPR Top 100 Science Fiction & Fantasy Books](http://imgur.com/gdhMg.jpg) is my favorite way to pick out books.
68807,"I tried that, but I've read 90+, and the ones I missed were intentional :-("
68808,"The OP's list isn't bad, it's just got some controversial choices... try starting there."
68809,"And [here](http://www.sfsignal.com/archives/2011/09/flowchart_for_navigating_nprs_top_100_sff_books/) is the original, for anybody wanting to avoid eye cancer from jpeg artifacts galore."
68810,"You can tell this list wasn't compiled by Sci Fi readers. Far too many books that are average but have name recognition. Do androids dream of electric sheep always makes it on these lists but at best it's an average book, it only makes it because Blade Runner was ""based"" on it (yes those are air quotes)

It's like when you see Gullivers Travels on a list if children's books. They remembered the cartoon but never read the book

Enders Games was a great short story but expanding it to a novel didn't improve it"
68811,"This list is pretty terrible. The survey is designed so nobody will be able to actually vote for books they want (esurvey pro is awful). Besides that, it is weighted heavily for the early era sci-fi, as well as being just a web survey of an obscure site.

1. Books in 2010-2012  = 10
2. Books in 2000-2009 = 69
3. Books in 1990 - 1999 = 68
4. Books in 1980-1989 = 53
5. Books before 1980 = 200"
68812,"What are you talking about?

Books 1980 or after: 53 + 68 + 69 + 10 = 200

Books prior to 1980: 200"
68813,"Think of it less as a definitive list of the best books in the order of greatness, and more of just a list of great books. We could argue all night about the order of the list, but I don't think it's debatable that pretty much every book on this list is awesome and worth reading. Great place to come if you're thinking ""what's the next scifi book I should read?"""
68814,">Think of it less as a definitive list of the best books in the order of greatness, and more of just a list of great books.

That was pretty much my impression too.

Seeing Ender's Game at #1 set a poor tone for it, and then I scanned down the list and saw a bunch of shallowly predictable choices.  But as I kept going... The Stars My Destination, A Canticle for Liebowitz, The Man in the High Castle, Player of Games, Hyperion, Eon, The Forever War, Way Station, many, many more...

It's pretty much a list of 100 great books - it just seems sort of randomly ordered."
68815,"They do label it as a list of the ""top 100 sci-fi books"". Not ""a list of 100 sci-fi books"". So it is very fair to attack the list for not being the ""top"" of sci-fi literature."
68816,"I found this list a few months ago and started just going down it, checking out books from the library.  I was very proud that I had already read 7/10 of the top 10."
68817,Before I found Reddit this was my go-to list.
68818,"I suspect a lot of the votes that make up their data were cast long ago.  Also, there is a limited selection from which you can choose.

On the other hand, I'm just relieved there's no J.K. Rowling or Suzanne Collins."
68819,I though sirens of Titan was a superior book to slaughterhouse 5. I guess slaughterhouse is more famous though.
68820,A children's book is number one?
68821,That's like calling a Song of Ice and Fire a children's book just because some of the main characters are kids.
68822,"I don't know if you meant to use ASoIaF as your example because his name is ""WeDoNotSow"" (Greyjoy house motto), but it was amusing to me either way."
68823,its not a children's book. Its a book which has the main character out to be a child.
68824,"Sorry. A ""Young Adult"" book is number one. Happy?"
68825,1984 is on the list and most of us are forced to read it in grade 9 or 10. Doesn't make it Young Adult.
68826,The problem is: how many of these authors have degrees in physics or mathematics? I prefer that emphasis is placed on the science aspect of science fiction.
68827,Why is slaughterhouse 5 considered science fiction?
68829,"Ahem.

**WHY IS SLAUGHTERHOUSE 5 CONSIDERED SCIENCE FICTION?**"
68830,"the alien abduction was pretty much just a plot device, he could have been abducted by the mafia or Atlantis."
68831,Time travel dood.
68832,"but it was science, it was magic(or hallucinations)"
68833,If you want to have a super literal interpretation of what is sci-fi and what isn't then go for it dude. Most people are going to ignore you though.
68834,"I like the sound of Vagabonds, haven't heard about it before now."
68835,The description makes it sound a lot like The Dispossessed
68836,"It's a lot like the introspective parts of Alex's story from the Expanse (specifically, around Nemesis Games) and Death's End, but with more commentary/critique about how we perceive the world and what shapes those perceptions."
68837,I can vouch that it's quite good. It's on the long side but it's absolutely worth it.
68838,Anyone read *The Salvage Crew* by Yudhanjaya Wijeratne? Seems interesting.
68839,"I absolutely loved it. It was such an unexpected treat that hit all the buttons. 

I posted a non-spoiler review here and the author responded!


https://www.reddit.com/r/scifi/comments/k3op9d/the_salvage_crew_by_yudhanjaya_wijeratne/ 

""Chop wood, carry water"""
68840,"Oh cool, thanks for sharing."
68841,Well that review made it my next Audible pickup.
68842,It looks to be a very under the radar pick compared to the rest of the list (all the rest of which I have heard and/or are showing up on other top lists). I looked it up and it appears to be $3 on the US kindle store right now.
68843,"My guess is the fact that Nathan Fillion read it as his first audiobook might have something to do with it. Not saying it isn't good, haven't read it. Just figure that helps it get attention."
68844,"Fillion was great in the audiobook, but the post processing isn't great and it appears Audible sped up the narration. There's no way Fillion talks that quickly normally. Playing it at .85x made it sound faaaar better."
68845,"the best sci-fi and fantasy books of 2020, according to this subreddit:
- hyperion
- blindsight
- foundation
- a fire upon the deep
- three-body problem
- hyperion
- iain m banks
- altered carbon
- hyperion"
68846,And the expanse series
68847,You're looking for humorous Utopian SF? Have you heard about *Blindsight*?
68848,Don’t forget Hyperion!
68849,"ah, cripes! almost forgot. thank you kind stranger."
68850,Missing Alastair Reynolds but good list nonetheless.
68851,"I'm glad to see Hyperion. Hyperion isn't mentioned enough on this subject.

Hyperion."
68852,"Hyperion, Yes! Please everyone read it OK? NOW!"
68853,"If we're including fantasy, Sanderson's Stormlight books outta be on that list."
68854,"Good christ, of everything on that list this one is getting me the most.  Fantasy?  Stormlight.  Scifi?  Stormlight.  Epic?  Stormlight.  Grimdark?  Stormlight.  

I swear I could ask for a recommendation and put ""please no mormon authors"" and get recommended stormlight just because why not"
68855,"You'd probably get a response like this:

""Brandon Sanderson is a Mormon. However, I highly recommend his books. You should definitely read..."""
68856,"Oh my god I *know*.  Probably within the first five responses.  

Responses like that are actively pushing people away from book subreddits."
68857,"Agreed. And it's making me really depressed. But I found a way to keep my mind off such things to ease the frustration.

There's this great series of books called the Stormlight Archive, which I highly suggest you read if you ever want to take your mind off things and escape for a while. It's an epic, high-fantasy..."
68858,"Oh man, I'll read that right after I finish rereading my favorite sci-fi space epic Hyperion!"
68859,"Eh in that case asking for that would be stupid. So it's reasonable to say "" if you can get over your predujidce here is ..."""
68860,Can I get a prince of nothing
68861,"I swear I want to dig it up, but I once saw that recommended in a threat where one of the criteria was ""interesting philosophical fantasy"" but also ""please no sexism""."
68862,"Top tier philosophy coupled with overt sexism. 

Which I dont think he should be apologetic for.  It's a dark world and sexism is a dark thing"
68863,"I sometimes wonder with that series where the line is between ""discussing sexism"" and ""being sexist"".  That series most certainly toes it.  Not only are women treated in a sexist manner, but every single one more-or-less lives up to that expectation, being easily manipulated, weak, and rarely actually accomplish anything in the narrative.  

There's something called the lamp test, where you ask ""would this narrative be functionally identical if you replaced the women with sexy women-shaped lamps"" and in the case of Prince of Nothing as long as you gave the lamps appropriately shaped orifices to be raped, I'm not sure it'd make a big difference.

I find that one a hard recommend sometimes, because it really is on that line."
68864,"Very well said.  On reflection, I have to agree completely.

I've argued about this topic several times with friends and have always been dismissive of the sexism, but that argument penetrated. Will carry it forward."
68865,"I'm just going to put my recommendation for the for the Darkover series by Marion Zimmer Bradley right here, since it sounds like you might appreciate it, and I don't see it recommended yet. Look it up and see if it might interest you."
68866,"* iain m banks

We’re going to need to boot up the backup."
68867,"If you liked Hyperion you should read Hyperion, it's great."
68868,This is actually a really good list. I’ve enjoyed all of these books except I’ve never read a fire upon the deep. Somehow I’ve never even heard of it. Just picked it up. Thanks for the recommendation:)
68870,"Piranesi sounds good, what are your opinions, sadly I didnt get into Johnathan strange and mr norrel it felt.....not sure if dry is the word but overly explainy. At least the beginning bits that I just couldnt get past)"
68871,I really liked piranesi. Thought provoking and well written. Avoids some of the pitfalls of dr strange. Also quite short
68872,"It's good. I liked JS&MN a lot more but if those early chapters are what turned you off, *Piranesi* ought to be a lot more approachable. It doesn't explain much but then plot/mystery is fairly telegraphed, though that's not really the book's attraction. It's a slight novel in some regards but a very elegant examination of some interesting ideas (memory, identity, acculturation, Plato's theory of forms) and written in a lovely unique voice."
68873,"It took me a few chapters to get into the flow, but after that I really liked it. A thoughtful exploration of humanity in loneliness."
68874,"I found it to be a real page turner. It's a fascinating world, very philosophical, and a quick read. Highly recommended!"
68875,"I read this one recently, I quite enjoyed the prose and I also felt that the world that it built was very beautiful and interesting. So I liked it, but I also don't consider it a knockout recommend. After the pluses that I listed as negatives I found it extremely plot-lite. Can't think of any other way to put it than to say that very little actually happens in it. Much of the interesting change in the characters or the interesting events happen (in my mind) before the events of the novel so it all just feels rather flat and low stakes."
68876,"Your negative sounds like the textbook definition of ""literary"" SF, so some people may see that as a bonus."
68877,"i loved it, no notes really. i also really liked Jonathan Strange and Mr Norrell, despite the dry first third, but Piranesi is much faster moving and grabbed me instantly"
68878,"Haha, this is certainly a very Polygon list. There are some good books in there though - and several of them aren't nearly as heavy-handed in their social critique as these entries would have you believe. The Only Good Indians would be my pick of the bunch, but Vagabonds and The Salvage Crew both look interesting."
68879,"I was a touch puzzled. I didn't think I was completely out of touch with modern science fiction but I recognised very few names let alone books on that list.

I was more familiar with the runners up

There's definitely some  titles on that list to add to my reading schedule."
68880,"Really? The Space Between Worlds has been getting a ton of buzz as has Mexican Gothic. I'd heard of The Once and Future Witches (and Harrow's other novel was nominated for the 2020 Hugos), Kowol has won a Hugo for a similar sounding book, and I don't think I need to mention Kim Stanley Robinson or NK Jemisin. 

This sub is a very bad barometer for modern SF, and while it isn't outright hostile it shares a lot of tastes with the various Puppies movements, in my experience."
68881,This sub shares a lot of tastes with the varies puppy things?that seems surprising as there was a thread asking for Conservative Sci-fi recommendations and the response was basically you can't have conservative sci-fi (even though whenever a magic realism or more fantasy work is touted people point out the sub is actually speculative fiction)
68882,"Look at who the Puppies actually nominated: Neil Stephenson, Alistair Reynolds, Orson Scott Card, Brandon Sanderson, China Mieville.

There’s nothing wrong with liking these authors, I do myself, and most of those authors were outspoken against the Puppies. But there’s also no denying that there’s heavy overlap between this subs recommendations and that list. Like I said in another comment, if you were to write down this sub’s top 20 recommended authors and show that list to a Puppy they wouldn’t find much to object to. 

This sub doesn’t branch out much."
68883,"I hadn't realized they nominated China Meiville, that's sort of funny considering he is actually a proper leftist as far as I know not liberal left etc.
This place does always recommend the same things I agree but to temper that complaint look at the way Jesmin has dominated the recent Hugo awards, I see more interesting answers when the question is more specific.
I am probably not the right person for this argument anyway as I have found it harder to find new authors I like since maybe 2010, noticed the decline in the Gardiner Dozios yearly anthology I religiously bought"
68884,"> I hadn't realized they nominated China Meiville, 

That's because it never happened. The other poster was mistaken. They never nominated Neal Stephenson or Alastair Reynolds either."
68885,"[Here’s the 2016 Sad Puppies list where Reynolds is nominated for his novella Slow Bullets](http://file770.com/sad-puppies-4-list/), [here’s the 2016 Rabid Puppies list that includes Seveneves](http://file770.com/2016-rabid-puppies-picks/), and 
 [here’s the Rabid Puppies 2017 list where Mieville is picked for his novella Census Taker](http://file770.com/rabid-puppies-2017-arrives/)."
68886,"Come to think of it, they probably picked Seveneves because there is a caricature of Hilary Clinton in it."
68887,I think a lot of these picks were “least objectionable” and not “best ever.”
68888,"My mistake, I thought you were talking about the Sad Puppies only and I thought they withdrew Reynolds's work from the lost after he asked them, but apparently they didn't.

But framing it as ""look at who the Puppies actually nominated, it's very similar to the popular stuff on this board"" is quite misleading - the Puppy leaders picked a few popular works from popular authors which already had a good chance of making it so they can pretend the point of the exercise wasn't to nominate works by the buddies of the organizers (or themselves in some cases) and some utterly mediocre works notable only for the politics of their authors. I don't see people on this sub recommending the likes of Larry Correia, Brad Torgersen and John C. Wright much. There is no ""heavy overlap"". The idea of the Puppy campaign was never to nominate the stuff the participants in the slate liked best, it was to piss off the ""SJWs"" and ""Libtards"" as much as possible and to promote Torgersen, Correia, Vox Dei and their friends."
68889,"According to [this blog post](http://file770.com/measuring-the-rabid-puppies-effect-on-the-2017-hugo-ballot/), China Mieville's ""This Census-taker"" was on the 2017 Rabid Puppies slate.  [This one](http://file770.com/measuring-the-rabid-puppies-slates-impact-on-the-final-hugo-ballot/comment-page-3/) shows that Stephenson's SevenEves was on Rabid Puppies 2016.  EDIT: reading more carefully, SevenEves was on the Sad Puppies list as well.

I do think some of the discussion about these books is a bit misleading, because as I understand it (I'd dropped out of SF book reading when the worst of this was going on) part of the Puppy strategy was to include ""hostages"" that were respectable books by authors who'd want nothing to do with the Puppies, in order to make the slates look more respectable than if they just contained the ""genuine"" Puppy works e.g. the stuff associated with VD, BT & co."
68890,"Where did the Puppies actually say they nominated those authors?

I'm looking at the Hugo nomination stats for that period (2013-2016, http://www.thehugoawards.org/content/pdf/20$NUMHugoStatistics.pdf) and I'm seeing very little evidence that those authors were the ones the Sad/Rabid types were spamming the nominations process with."
68891,I linked several of their slates in [this comment here](https://www.reddit.com/r/printSF/comments/kv6sr3/the_best_scifi_and_fantasy_books_of_2020/gj1031l/?utm_source=share&utm_medium=ios_app&utm_name=iossmf&context=3) that cover them listing all those authors.
68892,"An alternative explanation is simply that they are good authors who don't take strong socio-political stances, not that they push right-wing agendas.

I tend to agree that this sub tends to be a bit too narrow (and I feel like it used to be a bit broader, maybe it was the death of the 'what have you read this month' threads that makes me feel like that) but that doesn't mean the readers here only read those books or have some ideological aversion to other books."
68893,"[Those threads aren't dead](https://old.reddit.com/r/printSF/comments/kodwij/month_of_december_wrapup_and_optional_2020/) although it does feel like they slide down the front page more rapidly than a lot of others that (obviously IMHO) are less interesting.  Perhaps because they get relatively low numbers of comments or upvotes, and the default Reddit display algorithm pushes them down as a consequence?"
68894,"Ah thanks, I'll have to go to the actual sub occassionally and do my bit by commenting I guess"
68895,"I swear if you people contaminate EVEN THIS SUBREDDIT with your disgusting american politics and racial wars and culture wars I'll just quit reddit outright. After 10 years on this site it's just not worth it anymore. 

How do we, normal people, explain to you maniacs that we don't even google the author let alone check their race and ethnicity before reading their book? How do I explain to you that we REALLY don't care what you do in your country? 

Like either talk about books or buzz off with your bullshit... instead of writing 10 comments you could've been constructive and written a review of those books and promoted them ,if you feel they aren't talked about enough.

I can't imagine the arrogance thinking that an international audience knows or cares about your nonsense obscure  issues..."
68896,Don't let the door....
68897,"I'm gonna just be honest, i really hope you take it that way, i have no interest in an argument or ideological shenanigans. 

I want a good book, i don't care, at all, about the characteristics of the author. A lot of places/people do, they will explicitly say they are recommending a book because it's written by a certain characteristic or has a certain characteristic represented within. I can't then trust those reviews. Instead of thinking 'oh cool a new book by a really well reviewed young author' i have to consider if it's an ideological choice. I don't even necessarily begrudge those people their right to choose and promote things that agree with their worldview. i Just don't have any interest in sharing it and if it negatively affects the quality of the book i might buy and read, i don't want any part of it. 

I'm just someone who likes Sci Fi, my knowledge of awards is the stickers that get printed on the books for the most part and i'm not even American. I had to google what the Puppies movement was and it feels like a wilful mischaracterisation of this sub to be honest."
68898,what is the puppies movement? I Googled it too and every result I get  is literally about puppies (dogs).
68899,Here you go. [A quick summary of the puppies debacle as it stood in 2015](https://www.vox.com/2015/4/26/8495415/hugos-sad-puppies-controversy).
68900,This whole thing is just super weird.
68901,This is the modern way
68902,"It’s sort of hard to explain briefly, but it was a major controversy around the Hugo Awards a while ago. If you google ‘sad puppies’ and ‘Hugo Awards’ you should be able to find more! 

The tl;dr is that a bunch of white men got really pissy that an increased number of women and BIPOC authors were being nominated, so they tried to brigade the awards with votes for white men (and a select few white women)."
68903,It's basically the alt-right trying to take over the Hugos a number of years ago.
68904,"I'm in a similar situation.  I have my slate of authors I really enjoy.  I actually got into a sort of a bubble where I return to those authors or go back to classics.  When I came across a review that focused more on the author's characteristics than the work, I mentally put that author into my ""do not read; life is too short for this"" bucket.  However, when I started buying supporting membership for Worldcon, just to get access to the nominated works, I was very pleasantly surprised with some of the works.  The nominations are definitely skewed towards authors I would normally not consider reading (partly because of reviews of their works that spend more time on their race, gender and sexual orientation than the quality of their books), but thanks to them I discovered writers like Jemisin, Kowal, Chambers and McGuire, whose works I largely enjoy.  I also discovered plenty of nominees whom I'll ignore in the future, but that's the price I'm willing to pay."
68905,"Seriously, it's hard to even find good reviews a lot of the time because many will spend longer talking about the author and their political / social opinions than the freaking book

I don't care if the Author is a genderfluid brony cosplaying as cat irl, or if they said there are only two genders. Flat out, don't care. I want to know if the book is good, you can completely hide every single thing about the real life author if you want, I flat out don't care

It's shocking how many people can't separate the creator and the creation, and judge an entire book based off the author irl"
68906,"I *think* it was 2018, but one of the big announcement articles for an award like the Hugos and what books had won was all about the gender of the winners and how great it was that women were crushing men at last. It was so devoted to this, in fact, that not a single entry about the winners actually talked about the books that won.

Several failed to even *name the winning book*. But there was plenty about oppression!

There was a minimum bar there, and they missed it."
68907,"> i don't care, at all, about the characteristics of the author.

It sounds like you care a lot, because I hadn't seen this brought up in this thread or in the article.

It reads like a rant that came out of nowhere."
68908,This thread is full of people very vehemently telling me how little they care.
68909,"I'm with you, I'm here for the stories and I absolutely encourage diversity because that leads to more interersting variety of stories. It's difficult to imagine a book like The Stars Are Legion being written by a man for instance."
68910,"I've never gotten the impression that this sub was bigoted in any way and I say this as a Filipino-American. 

I agree with you that this sub does have a certain provinciality; I'm also a member of my local science fiction association and the taste is quite different. I've brought up Tom Sweterlitsch and Greg Egan with them and not many people had read them. I learned of both here, and I'm quite happy with that."
68911,"I should be clearer about that, sorry. I don’t mean this sub is bigoted; that’s what I meant by “not outright hostile.” Just that if you were to list the types of books that this sub recommends over and over again and show that list to a member of the Puppies movement then the latter would find little to object to. This sub tends to stick to straight white male authors that write stories that don’t (or only tangentially) touch on modern politics, with the exception of two or three women that have gone leagues above and beyond many of the male authors. 

You’ll see Ursula Le Guin or Octavia Butler, but you never see a woman of the same caliber as, say, Dennis Taylor, whose Bobiverse books are recommended all the time."
68912,"I can see that. This sub definitely tends more to the inheritors of Clarke and Asimov than any of the more modern explicitly political authors like, say, Jemisin (although this sub does like Kim Stanley Robinson a lot who can be very obviously political)."
68913,"Jemisin writes almost exclusively fantasy and this sub, despite what the rules say, is almost exclusively about science fiction. And also, there are a bunch of extremely popular male fantasy writers who get discussed here much less often than Jemisin."
68914,"Yeah, if you were to ask me the buzziest books in SF, it’d be books like The Space Between Worlds, or Gideon the 9th (that book was *everywhere* this year) but those sorts of books never show up on this sub."
68915,"I don’t really agree. I’ve seen Gideon mentioned a few times, but one of the subs most popular authors is Becky Chambers and she has her books recommended all the time. 

Yeah, it’s a bit more heavily weighted towards straight white dudes but I think that’s more a reflection on the fact they they have historically put out much more work."
68916,"> Gideon the 9th

I think I've seen it mentioned here once or twice - I do see it a fair bit in /r/booksuggestions and /r/suggestmeabook but those have different crowds.

Going from the Hugos, which seem to be more what you're talking about, I do see *A Memory Called Empire* pretty often here."
68917,"I hadn't come across either of them because I'm not terribly well connected to the scene, largely relying on seeing something reviewed in the guardian; recommended by amazon or someone else commenting about it. 

So my question is ""where are you finding all this buzz about books?"". One of the issues I find with GoodReads when looking for recommendations is filtering out all the YA and YA pretending not to be YA

I've bought both because they do look good."
68918,"TORs email list (which I’m only on for the free ebooks, admittedly) as well as a couple of podcasts, and then of course the Hugo award nominees every year. These tend to come with short reviews that can filter out the stealth-YA, which I completely agree suck, and if you find decent book podcasts the reviewers are typically knowledgeable enough to mention if a book seems aimed towards YA."
68919,"I have just got the new tor book edited by Charlie Jane Anders. I've only read a few stories from it and they're very good so far.

Unfortunately I'm not enjoying the story by the editor very much so far but I'm interested to see where they are going with it."
68920,"> This sub tends to stick to straight white male authors that write stories that don’t (or only tangentially) touch on modern politics, with the exception of two or three women that have gone leagues above and beyond many of the male authors. 

Probably because this sub is Print sci-fi, not print social and political opinions????? 

I highly, highly, highly, highly doubt the overwhelming vast majority of this sub would actively *avoid* or *prefer* a book written by either gender. People come here and just say ""I want a good book about aliens and first contact, anything cool come out recently?"" and then get recommendations based on that. 

I for one, absolutely do not care about who the author is IRL or what random stance they hold on any social, religious, or political topic. 100%, do not care. You could put a piece of tape over the authors name on the book, and never tell me a single thing about the author besides what other books they've written (so I can find or avoid them if I like their writing style) and I'm golden

It's honestly annoying how many books try to use their book to push an agenda one way or another. Bro, I don't care that you are an enlightened atheist, STFU and stop wasting pages with your thinly veiled anti-religious soap box and get back to describing the space battle between intergalactic fleets. 

I read books for enjoyment, not to get preached at by someone cramming their own personal views down my throat even if I completely agree with their views"
68921,What's a polygon list?
68923,"Yeah, that I understand ;) I was wondering what it ""means""? Is it a valid list or biased list?"
68924,"I think what they’re saying is that polygon has a reputation for being very liberal. They focus a lot on LGBT and BIPOC representation. That’s certainly not a bad thing, but that’s their bias."
68925,"Yeah, this is sort of what I meant u/gilfred - they have a heavy focus on the sociopolitical side of things, and you'll notice they've highlighted books in this list that thematically reflect real world circumstances more strongly than most.

Whether that's a good or a bad thing will depend on the person, of course, but they're known for it."
68926,"It's also perhaps worth noting that the author of this list is [a regular contributor to Tor.com](https://www.tor.com/author/andrew-liptak/) (publisher of 3 of the titles recommended in the main list in that article, plus another 2 if you include the parent/sibling Tor Books line), and [has a non-fiction book about cosplay coming out from Saga Press this year](https://www.andrewliptak.com/blog/cosplay-book-saga-press-science-fiction-star-wars-costuming-announcement) (publisher of 3 of the books in the main list).

This isn't intended as a Puppyish or GG-esque ""ethics in book recommendations"" conspiracy theory; rather, I think it's fair to say that we all have our own bubbles and interests, and both Tor.com and Saga Press are pretty progressive (or whatever term you prefer) - the senior editor of Tor.com was reported [in an interview](https://sffdirect.com/report-science-fiction-convention-ytterbium-eastercon-2019#fifth) as saying ""Tor.com Publishing is pretty left wing anyway.""

*(EDIT 'cos Reddit crapped out on me before I finished)* As such, the make-up of the list isn't that surprising, in the same way you'd expect a set of recommendations from, say [an academic who's also an SF writer, writing in a left-ish British newspaper](https://www.theguardian.com/books/2020/nov/28/best-science-fiction-and-fantasy-books-of-2020) to come up with a fairly different list based on their biases/interests/cultural background."
68927,"Yeah, that what I wanted to validate. It may be an unpopular opinion but I always wonder why Ann Leckie got so many awards, I thought it might be because of how she writes about genders. The trilogy is good but that many awards...?"
68928,"I can't take Polygon seriously, just based on how badly they reviewed both The Last of Us and The Last of Us Part II.  The first one can kind of be explained by the fact that Polygon was being funded by Microsoft, but the 2nd one was just indefensible."
68929,"Not a bad list. I haven't read all of them, but the only one I might question is Burn-In, a very pedestrian thriller.

My own tastes run more towards SF than Fantasy, and there are some very good SF novels you won't find on the Polygon list.

A totally biased and highly subjective list of Best SF novels for 2020:

1. **Little Eyes** by Samanta Schweblin
2. **Axiom’s End** by Lindsay Ellis
3. **Network Effect** by Martha Wells **\***
4. **Nucleation** by Kimberley Unger
5. **Doors of Eden** Adrian Tchaikovsky
6. **Dead Lies Dreaming** by Charles Stross
7. **Beasts of Lake Oph** by Tom Toner
8. **88 Names** by Matt Ruff **\***
9. **Nophek Gloss** by Essa Hansen
10. **Anthropocene Rag** by Alex Irvine
11. **Attack Surface** by Cory Doctorow **\***
12. **Noumenon Ultra** by Marina J. Lostetter
13. **Hench** by Natalie Walschots
14. **Mother Code** by Carole Stivers
15. **Hella** by David Gerrold
16. **Agency** by William Gibson **\***
17. **Black Sun** by Rebecca Roanhorse **\***
18. **The Oppenheimer Alternative** by Robert Sawyer
19. **Critical Point** by S. L. Huang
20. **House of Styx** by Derek Kunsken
21. **Providence** by Max Barry **\***

Note: An asterisk (**\***) indicates books that also appear on the Polygon main list or ""Runners up"" list."
68930,The only good indians was awful awful  awful
68931,Care to expand? The wife and I enjoy horror so I was thinking of picking it up. Seems to be pretty well regarded for a horror book.
68932,"I don't really read/like horror, but I didn't think it was ""awful awful awful"". Was a quite decent read."
68933,"The plot comes so far out of left field, wastes your time and at the end , you're scratching your head. 

I don't want to post spoilers.  But even for a horror there were moments where I was like , wtf ?"
68934,"It wasn’t awful but definitely did not live up to all the hype. At first it was really hard to understand what was going on. Eventually the plot started to make sense but, as others said, goes in a weird direction. Hard to explain without spoilers. 

Also, the worst part for me was the author’s prose. It was hard to read, not smooth or easy to read."
68935,"I just finished it, and I'll say that while I didn't think it was awful - I did finish it, after all - it did not live up to its hype. I don't consider it a waste of my time, but the author could have taken his idea to some way more interesting places."
68936,"I know it missed the year by a bit, but I wish Hyperion were on this list."
68937,Le epic troll
68938,"*\*tips fedora\**

M'lady..."
68939,Is there a different Hyperion than the one from 1989?
68940,I wish!!
68941,can anybody that read The City We Became say how it stacks up against her other work?
68942,"I didn't love it, but I also didn't get to far into it before quitting."
68943,"I'd say it was a lot more whimsical, and honestly fun than the Broken Earth Trilogy. The overwhelming oppressive atmosphere isn't there in the same way. Easily one of the best books I tread this year.

I would recommend getting the audiobook. The performance is absolutely riveting, and there is since some design that actually adds to the story."
68944,"Only other work I've read by her is Broken Earth -- like another commenter says, this has a lighter attitude.

TCWB felt (to me) very lyrical. I found the prose style to be descriptive, emotionally evocative and insightful. She handles dialogue a bit more like Scalzi (fast-paced, a bit witty, but still with a brisk sense of sharpness fitting to a story about NYC).

The characters didn't just feel real, they felt lived in (when they needed to). 

BUT! There is social commentary (I mean, it's a science fiction book and social commentary is the whole purpose of the genre) and some find that to be not what they are looking for. Lots of thought about gentrification, lots of thought about identity and what it means to be your authentic self (with some of the layers that come with that for folks in different identities)."
68945,"I think you’re very apt at describing things, for sure.

I’m strongly against your assertion that social commentary is the purpose of the genre, though."
68946,It’s very fun but my least favorite of her work (I also generally prefer epic fantasy to urban fantasy though so not unexpected). I’d probably have enjoyed it more if I was more familiar with New York though it still works without that familiarity.
68947,"Weird that Abercrombie didn't even get a mention. I'm halfway through Trouble, and it's good so far."
68948,i see no Rhythm of War here
68949,Polygon. When clickbait and boring political commentary collide
68950,"Anathem by Neal Stephenson, Solaris by Stanislaw Lem, and Dispossessed by Ursula Le Guin."
68951,The Dispossessed is GREAT. Ursula is required reading.
68952,"a mote in gods eye, foundation, starship troopers"
68953,"1. Foundation by Isaac Asimov 
2. Little Heroes by Norman Spinrad
3. Lord of Light by Roger Zelazny"
68954,"Loved “Lord of Light”, have always liked Zelazny"
68955,Damn that was a good book . Quite original too .
68956,"The stars my destination
Childhood's End
Martian Time-Slip"
68957,I’m currently reading Childhood’s End!
68958,Enjoy!!!
68959,The stars my destination was so good. Such a great adventure to read.
68960,"Absolutely, it's also incredible how it doesn't really date itself.  It's written in what, 1952? The Demolished Man is also a great book by the same author."
68961,"Nice list but I'm surprised about Martian Time-slip, as far as Dick books go it's fine but I'm not even sure I'd put it in my top 3 ""PKD books where the MC loses their mind"""
68962,"1. Hyperion
2. Forever War
3. Annihilation"
68963,Forever war is good! Really like the way it tells how meaningless war is.
