idx,text
12601,"When I was around 17 my room was a disaster. My mom always wanted it clean but I never would really get around to it. The night before mother's day I got home from work and just started cleaning my room. It took hours. When I was done I stuck a note on my door that said ""Happy Freaking Mother's day"" and went to bed. When I woke up the next afternoon my mom was so happy. Almost 20 years later she still has the note framed on her dresser."
12602,Thats adorable.  Good job!
12603,I would cry.  Seriously.  I can't see any floor in one of my kids' rooms.
12604,"I am the mom of a slob. I pick my battles, and his room is not one of the them I choose to engage. He has to pick up after himself everywhere else in the house, but my only rules for his room are: must have a path from the door to the bed (fire safety), and NO FOOD in the room.

If he's lost something because the room is too dirty, Not My Problem. (If it's something critically important like his glucose meter that's lost, I charge a $5 finder's fee/take a favorite item that he can buy back from me later.) If he is embarrassed to bring friends into his room, Not My Problem."
12606,"I did the same thing! My mom always yelled at me for it so for her birthday or some holiday I can't remember now I spent all night spotlessly cleaning it, vacuumed, everything. When she came home I told her her gift was in my room. She almost fainted haha"
12607,"Better yet, clean the house without me even asking. While I sleep in. And wake up to fresh coffee made."
12608,Well step one is that you gotta stop waking up before 6
12609,Fuck you kid. I used to be able to sleep till noon. Then I had you and you never slept and always woke up before dawn. Now I’m writing this at 5am and will take great joy in waking you up for school.
12610,Do mums really enjoy waking up their kids? are you purposely doing it the shittiest way to torture me?
12611,It’s payback for all the times we woke them up by crying as loud as possible.
12612,Yup. I try to be as positively cheerful as possible. “Good morning sunshine!”
12613,"Hi, Dad here, I have to wake up at 430 so I can have coffee before my wife wakes up at 5 so she can have coffee so I can answer her questions before the child wakes up so that she can answer her questions... fuck."
12614,"And do the dishes. And the laundry.

Just make sure you do it while she's not around, otherwise she'll say you're doing it wrong and take over."
12615,"Ugh, I hate that. I'M TRYING TO BE NICE, WHAT DO YOU MEAN THE TOWELS ALL MUST BE FOLDED WITH THE TAGS FACING THE INSIDE? And then she goes and re-folds all of them."
12616,"I mean, when you wash dishes I still find food in the cupboard."
12617,But it's your house. I already cleaned mine.
12618,That's why it's a gift.
12619,They won't do it right
12620,I want that more than any present lol
12621,"Agreed! That's what I ask for every year.

This year I asked for a clean house and a dash cam (because I commute a lot) and we'll see which is under the tree."
12622,"A massage. Just a nice, long, relaxing massage maybe with added chocolates, and leave me tf alone for the day and I'm good. 1 of 3 is fine with me. All 3 is a mega super bonus +100 

It's on my wish list at least, I'm usually good with anything."
12623,"""Leave me alone"" and ""don't make me cook"" are two of my favorite presents."
12624,"A massage or a spa treatment, a gift certificate to their favorite store, and a bottle of their favorite wine. It's what my wife wants from the kids every year, and they're all grown now."
12625,We gifted my partners mother a massage coupon for her birthday and it's lying around for half a year already :/
12626,"I got gifted a massage gift card. Problem is I have extreme anxiety about strangers touching me. I ended up regifting the card because just thinking about using it stressed me out.

I made sure the person who got it talked about wanting to get a massage."
12627,"> I ended up regifting the card because just thinking about using it stressed me out.

ya know whats good for relieving stress? A massage."
12628,Ok. You made me actually chuckle out loud.
12629,Fuck massages this one wants whisky!
12630,"It’s only a good gift if the person receiving it is the type of person who gets massages. If she’s never gotten a massage, she won’t start because you got her a gift certificate. Same thing with manicures and other stuff. Some women are into it, others are not."
12631,I wonder why some people don't get this!?? Every time I see my mom she asks me why I don't get my nails professionally done. I say because I like them fine as they are (I keep them neat and not too long). Plus I don't want to be infected by a dirty tool. Everyone I know who does the mani/pedis has a fungus problem with their nails; they try so hard to fix the problem but just end up covering with nail polish. Ew.
12632,I get my mom wine and chocolates every year. The quality of the wine and chocolate vary depending on my economic situation and I've asked her if she wanted something different but she seems to really like this.
12633,"One dose of Ambien and 24 uninterrupted hours. 

If that's not an option, fancy bath stuff and weekly 20 minute increments to enjoy them in private."
12634,"You should go back to school and become a successful lawyer or doctor, like your brother."
12635,But he still has 100 k debt because of school D:
12636,Just get a summer job and pay it off
12637,Buy a house while you're at it
12638,Get married with our family doctor's daughter while you're at it!
12640,But home is 600 km away from where my mother lives...?
12641,You heard them
12643,"Something you honestly thought hard about that let’s me know you absolutely appreciate me. Something that makes me forget the 3rd pair of glasses you broke, the hated meals you didn’t want to eat, the hours spent driving you everywhere, the extra loads of laundry I did b/c you can’t hang a towel back up in the bathroom, the lack of sleep b/c you had a bad dream, the lack of sleep b/c I worry about you, the clothes that don’t fit b/c you’re growing up so fast, the baby smell you lost years ago, the hugs freely given in public, the quick glimpse you used to always give me when getting on the bus, how easily your tiny hand fit into mine every single time we went anywhere, the feel of your warm breath on my chest when I fed you at 330am, the tackling cuddles you gave me every time I sat on the coach, the endless terrible drawings of the whole family surrounded by hearts and rainbows, the exuberance you had when regaling every single detail of your day to me, the falling asleep with your fingers tangled in my hair when you “braided” it, the jam hand prints all over the kitchen counter, the chocolate goatee you always seemed to have, the way the word mama fell so easily out of your mouth...  so, maybe just give me all those things and your time to me so it won’t hurt so much when I think about all that stuff that slipped away so fast. 

Edit: just wow. Thanks for reading this and caring about it. I know it’s a bit off point, but it just started  pouring out of me when I was responding and it meant enough to me that I continued with posting it. 
So, for the nitpickers: just you. My real joy at Christmas is seeing my kids reaction to what I got them. The hugs, the thank yous, the happy surprised faces, the I love yous are what makes me most happy at Christmas! Linger at the table, hug your mom for no reason, sit next to her on the couch, put your head on her shoulder and just be there."
12644,That made me cry even more!!  I'm going down to help with my grandbabies on Thursday.  My daughter is having surgery so she won't be able to hoick their 18 lb 7 month old hulk baby around for a few days.  The 3 yo just wants cuddles and daddy just can't deal with both at the same time lol.
12645,"> the clothes that don’t fit b/c you’re growing up so fast

My mom never had to worry about that, because I am a manlet.  My nephew just had his first birthday and I can't wait for his hand-me-downs."
12646,Sooo...an Amazon gift card?
12647,"Right, thanks mom, that really takes the pressure off.  Now I know exactly what to get you for Christmas."
12649,I'm a first-time mom of a 3 month old daughter and I'm now crying at my desk. I haven't even experienced most of these things yet and I'm already sad about losing them one day.
12650,My friend almost dramatically died in the cold without a jacket and begged me to get his mom a waffle maker for Christmas.
12651,I can't help  but think there's more to that story.
12652,"I got this.... friend is too poor to even buy a jacket.  Hence why he almost froze.

But... rather than ask for a jacket (because of course main dude would buy his own friend a gift) friend wants him to buy his mother a waffle maker instead.

Because he loves his mama and can't afford to buy her a gift on his own!

Transferable power of gifts."
12653,"As someone who unexpectedly got laid off, and is out of work for the 1st time since i was 14. Not being able to get my family a good Christmas is the hardest thing. I was expecting to load them up as I got a $7 raise going to my new job."
12654,"Check out r/SantasLittleHelpers


(I think I typed it correctly)


Situations like yours are one of the reasons the sub exists.  Nice bunch of people who like playing Santa. And many of the recipients return to pay it forward when their finances are in better shape, so don't feel bad about asking for help."
12655,"Yeah like why couldn't the friend buy the waffle maker for his own mom 

Was the op some kind of waffle maker dealer"
12656,"I think we got part A of the story. And I think we got part Z of the story. I think parts B through Y would provide context that would make everything make sense.

Either that or op is a surrealist beat poet."
12657,"No, no. It's simple.

""My friend was stuck out in the cold without a jacket and he thought he was going to die so he called me to ask, in the event of his death, that I buy his mom a waffle maker."""
12658,"""Tell my mother....in-in the event of my death... *cough cough cough* in the event of my death that she...gets a....a wafflemaker. In addition.... to that she *cough cough* ^(uggggh I can't feel my legs...) she... gets...

#a boot to the head"
12659,*AND ANOTHER FOR JENNY AND THE WIMP*
12660,"Master, I would like to learn to boot some head as well."
12661,"Or, far more likely:

Op and his friend were outside walking to point b from point a. Friend forgot his coat. Dramatically, friend said he wouldn't make it and to buy his mom a waffle maker.

They did make it because it really wasn't that bad."
12662,"> I think we got part A of the story. And I think we got part Z of the story. I think parts B through Y would provide context that would make everything make sense.

How do I immortalize a Reddit quote?"
12663,"Its that he's very little and now he walks around outside with a hot waffle maker on to keep warm. He has terrible, terrible burns and smells of poorly prepared toast but he isn't hypothermic at least."
12664,"I don't want jewelry or anything for the house. No kitchen appliance. I love the hot water dispenser I got last year but that is used by the family.

I want something fun. Something just for me. Seriously check my amazon wish list. I've been throwing shit on there all year.

Maybe that No Face phone case or a bow with some arrows so I can start doing archery. Maybe a gift card to the local yarn shop. 

But whatever it is I want it to be strictly for me and not for the family."
12665,"So, a vacuum? No one else is going to use it anyway..."
12666,I really hate how right you are about this...
12667,"Like, whiskey!"
12668,Nope. I get my own fucking whiskey.
12669,"My mom plays Xbox games, so I'm getting her Wolfenstein II."
12670,Does she tell noobs that she fucked their mums?
12671,"It's 2017, so yes?"
12672,I take my mum shopping one day - since I dont give her any time during the year I figured its a double gift to take her out as well as get her presents.
12673,As a mum I would love that.
12674,A full day of uninterrupted me time followed by dinner with my BFFs (you're not invited)
12675,You mean *WE’RE NOT BFFS?!??*
12676,"Seriously. My 4-year-old would be devastated if I told her she's not my BFF; she says I'm hers everyday. Then again, pretty much everyone is her BFF, so there's that."
12677,Maybe your 4-year-old is just really popular.
12678,"But, I want to come too D:"
12679,"*Just stay the hell out of mischief, even just for a while!*

Have some mercy and don't give us moms anything more to worry about. It's exhausting. Please - we love you.

Sincerely,

Nerve-wracked mothers of teens"
12680,"> don't give us moms anything more to worry about.

In my experience, if we actively give you nothing to worry about, you just freak yourselves out thinking we're hiding something from you.

You react worse to peace and quiet than you do to mayhem and madness; just saying :P"
12681,"can confirm, am peaceful and my mom is driving herself nuts trying to figure out what I'm doing wrong"
12682,An immoral platypus that shits 100$ every 5 minutes
12683,He's immoral? Oh god where's he getting the money?!
12684,more importantly does he not account for inflation? And what about changes to the bills? What if they add another security watermark?
12685,I be been spending too much time on r/AskReddit...
12687,"Lady, I can't give you your foot back.  I tried finding a hobo with the same size foot as you to get you a ""donor"" foot, but the hobos are all dudes."
12688,"You know, that uncomfortableness might be a Yo-kai's fault, right?"
12689,"Might be kind of a shock but moms are.....people. With all kinds of different interests and hobbies and preferences. 

What does your mom enjoy? What does she do for fun? What kinds of things are she excited about when she buys them? What does she comment about wanting or needing but puts off because she's taking care of other people first?"
12690,"My mom just watches tv and shops at Marshall's.

As I was writing this, I realized that I should get her a Marshall's gift certificate.  Thanks, stranger."
12691,hitachi magic wand
12692,I didn't know you liked magic mom
12693,"I work for Hitachi, and this sadly does not appear in our wholegoods books."
12694,I found the other day that they are now being manufactured by another company under contract and are not officially Hitachi branded anymore. Perhaps to escape the brand association with glorious pornography.
12695,"Oh god, fuck yes. Best gift my husband ever got me."
12696,"Ah yes magic wand, same one Michael Scott used for Magic Camp."
12697,Who doesn't like [karaoke] (https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT8Gscck6md8IhKxgjjp67un7cza6kOfuXKaDdlmcSij06ixQrA)?
12698,I'm making my mum a photo-calendar and sewing her a heating pad filled with cherry seeds.
12699,"Every year my now 30 year old daughter writes me a letter.  These letters are a chronicle of our lives together  (I was a single mom).  Three years ago my daughter became a mom and that letter is a cherished, frequently read (I'm tearing up just thinking about it) reminder of the struggles and joys of those early years.  She know my heart.

You don't fully appreciate what your parents went through until you become a parent yourself.  My daughter, son-in-law and grandkids are my greatest joy. 

Write that letter.  Get her a little trinket to go along with it.  We do stocking stuffers...little goodies that we normally wouldn't buy for ourselves."
12700,"Not a mother, but... maybe take her out to a nice restaurant where it's just the two of you, so you can have a good meal and nice conversation. I think that parents of grown children often want more one-on-one time, because that becomes pretty scarce once we grow up."
12701,"I'm a mom and I much prefer time spent together rather than a regular gift. Dinner is nice, but so is a cool show... And this time of year there's always some sort of holiday music or play. It's just nice to be out with the people you love."
12702,"New mom here and dreading Christmas. Please just get something is actually for her. Bath stuff, wine, book, chocolates. Don't get her something that is for being a mom that is what mothers day is for."
12703,"I'm gonna temper the recommendation of the bath stuff for your average mom. I'm 29 and I have yet to get through a Christmas without at least 2 bath items coming my way. Unless a person's mom is ALL ABOUT BATH STUFF (in which case hit up Lush), go easy on the bath stuff. 

And if a person simply MUST give in to the temptation to give a woman bath items, at least try to think about their smell palate. Woody vs fruity vs gourmand etc. Don't just whip into Bath and Body Works and grab the sparkliest stinkiest thing in sight; think about it a little bit."
12704,"And PLEASE don't give bath items if you don't know whether they can actually use them. There are exactly two brands of body wash I can use without feeling like my skin is on fire, and lotion is hit or miss. If they have sensitive skin or they're allergy-prone, go for something else."
12705,"Actually, this is my rule for ALL holidays for mothers. Why does everyone always forget that moms are people too? Nobody (usually) gets dads kid-related gifts.

I especially do this for baby showers. Good god, the baby gets 9000 things they don't need, I think mom would appreciate a pedicure at a time when she can't even reach her own feet."
12706,"A slightly nicer version of something I already own. Like slightly more cushy slippers than the ones I wear every morning. Or simply a new set of the identical ones. The drugstore glasses on a chain, if they're dull and scratched you could buy the same ones new. If I like cats you can donate in my name to the local shelter. 

I'm a human being. I'm alive on the planet. I may be self sufficient but I'm not an inscrutable Other. Chocolates will do if I'm not bummed about weight gain. Movie tickets that I can use when I feel like it. A gift card for a store I already enjoy shopping at. Like Target or Nordstrom Rack. An experience I'd never buy for myself because it's extravagant but would enjoy, like a helicopter tour of San Francisco. 

You could smash the patriarchy. I'd love that. You don't even need to wrap it. Just bring it up casually at the breakfast table. ""Hey Mom, I talked my company into providing parental leave for either parent. Are there any more English Muffins?"" I'd bust out the Marmalade and the Kerry Gold just for that. 

Happy Holidays, remember to love yourselves as I've loved you. And if your actual Mom was crappy, remember to love yourself as your favorite TV Mom would have."
12707,I just gotta smash the patriarchy and I get Kerry Gold? Hold my beer...
12708,Well gawd damn that was wholesome.
12709,"I'd like an ox. One of those for people who need one, I get a picture of some happy fucker with an ox, and the knowledge that my kid cares.

Edit: Since this post I spoke to my inlaws, and we all agreed to give animals for Christmas this year. A bunch of families are happy for widely different reasons. No more Christmas shopping vs yay livestock!"
12710,"Here's what u/HammeredHeretic is taking about:

""Heifer International is working to eradicate poverty by shipping animals, along with agricultural and values-based training, to families in need around the world as a means of providing self-sufficiency. Recipients must agree to “pass on the gift” by sharing animal offspring, as well as the skills and knowledge gained with other impoverished families.""

https://www.heifer.org/

They send you pictures of happy families lovingly holding their brand new chickens. You never knew you wanted that until now."
12711,"Two years ago, my stepsons (were 13 and 15) ordered me a cashemere sweater in baby blue with hearts all over it.  I love hearts, blue, and cashmere.

I love the sweater so much that I only wear it to bed as a snuggly sleeper. I can't stand the thought of getting food or drink on it so I don't risk it by wearing to special occasions. The boys asked about it once and I explained my reasoning to them, and they hugged me because they truly understood my message. 

I am 5 months pregnant and I will probably wear it at the hospital to keep me warm."
12713,"Time.   

I want us to sit around playing games (board games or video games- it doesn't matter which) and eat too much food and reminisce and laugh.  Laugh until our sides hurt.  I just want you to spend time with me.  Greatest gift ever.

But if you insist that I have something to unwrap then make me something.  I saved all your best artwork from grade school.  I keep my keys in that clay bowl you made and the small clay chicken that I thought was a dinosaur... well, I turned that one into a magnet for the fridge you know :)  I miss getting those things.   Make me another craft or ornament for the tree.  Draw me a picture that I can hang on the fridge or in my office or use as a bookmark even.  Make me a key ring so I'll think of you every time I reach for them.  I don't care if you're not super artistic.   I don't care if the item doesn't look like it belongs in fancy a catalog or an art gallery.

Don't bother spending money to buy me a key ring or an ornament- unless it's super special and has meaning - if it's linked to a a memory that's okay.   Because gift giving isn't about spending money.  It's about saying I remember you and I love you."
12714,"Personal shit. A couple years ago I gave my mom a polaroid I had enlarged and put in a regifted frame. Her and I when I was like 3, standing on a small hill covered by leaves in a forest. I had the original up in my apartment and she commented on it. Bought her nice jewelry in her style, that she does wear and like, but the most compliments are about that $5 picture."
12715,"A letter thanking us for all the work we have done for you over the years. Maybe telling is what you’ve learned from us, or what you love about us. 

If you have a good mom that is."
12716,"""Another grandchild!""

Fuck no.  I'm done.  No more little booger eaters in my house.  Start bugging my sister about that now, please keep reminding her that she's not even in a relationship right now because I know she loves that."
12717,"My mother is grateful, if I decide to spend additional days in my hometown on christmas. The gift from my side can be a very small one, but should I spend more time with my mom, she's the happiest person on earth."
12718,Let us sleep in late one morning
12719,Time alone.
12720,"I want a couple of days to go somewhere by myself, and when I come back, I want the house to be clean."
12721,Nothing.  Just come home ready to bake cookies and spend time with me.
12722,"I've asked for skincare stuff from clinique. Or quality nail polish. I book all my beauty treatments online so vouchers for that are good. I'm not into specific 'spa days' or treatment vouchers because I'm really very particular about where I go.

I like anything to do with my hobbies (D&D, reading and video games), so fill with your parents hobby of choice.

Last year I got my Mum a Netflix subscription (she complained there was nothing on it, but watched >100hrs in a month so go figure). My son got her a voucher for a restaurant and we took her out for a meal all together. 

My son is pretty young and last year was the first year he picked me out a gift, and honestly it was the best thing ever. I have a horrible allergic reaction to the earrings he picked but you can pry them out my cold dead hands if you think I'm ever giving them up. When I'm sad I open them up and look at them to make me happy :) Just give it some thoughtfullness and tell them about it and they'll love it!"
12723,"I'm also horribly allergic to most earrings but my bf got me those silicone thingies that are like sleeves for the earring, called flutees. They prevent the metal from touching the skin and I can wear my jewelry again!"
12724,Last year at Thanksgiving my mom broke her favorite cooking bowl. It was this big yellow one from the 70s. After that I found the same model on amazon and got that for her. So it seems you just need to put in some thought.
12725,"My mom is always happy with gift cards to that one restaurant that's a little too nice to be spending your own budget money on but not so nice that it's uncomfortable. You know, those mid-nice places. That way she can treat herself a couple times throughout the year with her husband or friends guilt-free. 

She's also a flower/gardening nut and our local florists are at my best guess dead inside so I'm flirting with the Bloomsy Box, but I think that will be next year. I'm getting my parents an Echo to scream at and while they're getting used to it I want no more water-filled items near it on the table than necessary."
12726,"1.) LITERALLY just complete ONE list of things that I beg you to do, that I can't do myself, without acting like you just moved a mountain.

2.) A really nice set of sheets

3.) A really nice vacum that WORKS"
12727,"I know it sounds like a cliche, but make something. Doesn't have to be super-elaborate or expensive. Last year I made a framed collage of all the bands, movies, TV shows etc that she's passed on to me over the years. All it cost was an Ikea frame, some nice photo paper and a little bit of time, and I think it's the most positive reaction I've ever had for a gift."
12728,"Hey. Well how about a portrait? Like commission an artist to make a portrait of you and your mom. Or heck go for the entire family. It's always good to have a reminder of how far you've come, looking at your kids and feeling proud and satisfied.
Lemme know if you need help in finding a cheap option to get this done beautifully."
12729,My kids are toddlers sooo this would most likely fall on my husband but I love to make cookies so maybe a cookie scoop? They're so efficient but I would never be able to justify spending $6+ to get myself one.
12730,"I have a 20 yr old in college, and he has no money. So a lovely card with a handwritten note saying he appreciates me, and listing some reasons why would be all I want. And maybe cook me breakfast. 

What's better than that?"
12731,"As a 21 year old in college, this is nice to hear! I love talking to my mom on the phone, and hate when I get so busy that I don't get to call her a few times a week."
12732,"As a 21 yo in college, this is nice to hear. I don't like talking to mom much on the phone, but I do hate it when I don't get to call her much because it makes me feel like a dick. The idea above is certainly a good one."
12733,I like that.  I'm 48 but I bet Mom would still like a card like that.
12734,"A professional massage.  I've been so stressed chasing after the kids, it would be really helpful.  Also, a nice meal with my family... Thai or Vietnamese would be perfect."
12735,"That sounds like a wonderful idea, any idea where to rent Thai or Vietnamese families?"
12736,I've heard Thailand and Vietnam have a good supply.
12737,Factory direct. Cut out the middleman.
12738,"My kids are now 21 and 23.  I ask for the same thing every year.  Don't argue, clean the house without being asked, and make me breakfast.  Still waiting to get that gift."
12739,"When I read through that quickly, I thought it said clean the house without being naked. 

Yeah."
12740,And that *does* seem like a reasonable request.  Especially for Mother's Day.
12742,God it would be nice to pee in peace once in a while.
12743,"I'm totally fine peeing with the door open, but trying to poop with someone whining to me about books and kitties and juice is a little above my sphincter's skill set."
12744,"Agh. I always try 'where the kitty kitty?' Because once in a while she'll go looking for him and I can pretend I'm alone for forty seconds. But usually she just stands there, stacking Mickey and Minnie books in my lap and poking my upper thigh and saying 'butt.'"
12745,"Haha, that is hilarious. Mine toddled into the bathroom earlier (while I was doing my business) with a very yogurty face, and proceeded to pretend-bite my legs. I'm going to pretend that Yogurt Legs During Poop is a fancy spa treatment."
12746,"UGH they get their yogurt face *everywhere.* Its like an action movie, a race against time- will I make it to the wipes and back to her face before she rubs her mouth all over the cat?"
12747,No. No you will not.
12748,My daughter is a 12 year old smart ass. I would like one day without her sassing back at me. That is all.
12749,">12 year old

Yeah that ain't happening."
12750,"Not for the next 8 years. But after that, you have a shot."
12751,"""They're not really people at that age anyway."" - Lucky Louie

**edit:** [Found the link. I horribly misquoted it, but the essence is there.](http://www.youtube.com/watch?v=9GmlrvQL2_8&feature=youtu.be&t=5m39s)"
12752,"This advice is too late for you but maybe it'll help others.

I used to like pointing out patterns to my kids.  Weather patterns, how mud cracks when it dries, solar system, numbers, ...anything.

When my daughter was about 8 I talked to her about puberty and how it's one of the patterns in life.  I went on to explain to her that, along with physical changes, she should expect emotional changes as well.  That most kids go through this pattern and she should recognize now that, as she gets older, she may get mad at us for no apparent reason.  I told her that, that will be okay, that those feelings will pass as she gets older.  That we will love her when this happens.

She looked up at me and said ""Don't worry dad, I promise to remember this and will try not to get too moody.""

It worked.  She's now 18 and has been a wonderful teenager."
12753,"My kids were upset they were so mad at me. ""Mom, sometimes I feel like I just hate you and then I feel so terrible!""  I explained it was their job to separate from me and form their own personalities, so that feeling was normal. If they didn't hate me sometimes I'd worry about them.

Solved their problem, not mine. They were still little poops, but I knew it would pass. Just keep being a good model for them."
12754,Poops always pass.  One way or another.
12755,"This is an extremely important thing to say. When I was young I adored my father. I wanted to do everything with him, and be just like him. One day in the car he told me ""In a few years you're not going to want to be seen around me. I know it's gonna happen but that's okay, I'll know you love me"". I was pretty much like, ""Thats never gonna happen dad"". Then I became a teenager and would come home and go in my room and shut my door and that was that.
Then right before I turned 16 my father was murdered. No special last words to him letting him know how much I cared.
Because he said what he said when I was younger, I have no regrets. He knew I loved him and I know he loved me."
12756,Thank you for sharing this.  I need to go talk to my 11-year-old now.
12757,"I wish I had had a conversation like that with my mom. She died when I was 19, right when we were starting to get along better. I really miss her and wish we had gotten to talk more."
12758,Holy crap you won parenting. Im about to have my first kid and I was just planning on locking him in a basement from 12 to 19.
12760,"My fiance says we aren't having girls. I'm pretty sure that's just challenging the universe, and we'll end up with 4 girls. His reply is that if we do have girls, they aren't leaving the house until they're 30... I think he is terrified of a daughter encountering the teenage version of himself."
12761,"Yeah, my family had an unbroken chain of 3 sons for kids, going back 4 generations. I didn't even pick any girl names out. Now my older brother and I both have beautiful baby girls......

For kid #2, I now won't pick out any boy names and am calling it a she.

Edit: ALso yes, my little brother did indeed shout ""Combo Breaker"" at the birth of the first daughter."
12762,">Also yes, my little brother did indeed shout ""Combo Breaker"" at the birth of the first daughter.

Awwwwwww."
12763,This sounds like it had less to do with the whole pattern deal and more with the fact that you seem involved in her life.
12764,"Don't be silly, even involved parents get jerky teenagers sometimes."
12765,"56-year-old mother of four here.  When they were little (I had four within five years - yes, including twins) I wanted time alone without them on that ONE day per year.  There were years when I couldn't even pee alone.  Now that they're adults, I want all four of them together at home with us whenever possible. Perspective is a strange and wonderful thing."
12766,Judging from this thread there seems to be a great entrepreneurial opportunity in urinary catheters for young mothers.
12767,"For the last several years, my daughter and I developed sort of a tradition. We'd wake up, she'd make breakfast, then we'd drive to Encinitas, picking up strawberries along the way to Quail Botanical Gardens, where we'd spend a few hours just wandering around and enjoying the chocolate (they do a small chocolate festival there on Mother's Day), and the plants, and the various gardens. Then we would head home and have dinner and watch a movie. Simple, but so lovely. Unfortunately, my transmission went out on my car so we'll have to forgo that tradition this year, but she's already planning her alternative. 

Other than that, what I want more than anything is for my daughter and I to be able to go out to Minnesota to see *my* mom, whom we both miss a great deal!

Just wanted to add: I understand all the moms in this thread wanting a ""day off"" from the rigors of small children. Raising kids is exhausting. I personally don't think I would enjoy that myself, though. I enjoyed a day of no housework, sure, but spending the day with my kids was always the very best part of Mother's Day for me."
12768,">Unfortunately, my transmission went out on my car so we'll have to forgo that tradition this year, but she's already planning her alternative.

renting a car for a day is pretty cheap."
12769,"Sadly, medical issues have the majority of our funds tied up at the moment, but we've been thinking of trying re-arranging some things to do just that."
12770,"I think a delayed Mother's Day is in order.  It sounds like a wonderful tradition you two have and, except for the chocolate (though you can bring your own), there is no reason not to have a delayed celebration."
12771,"I collect the cards my daughter has given me over the years. I want another card, and to be left alone for a few hours to brew and drink beer. If anyone is in Eastern Massachusetts, Stone Zoo is free for moms on Mother's Day. I'll be the drunk one flipping off the monkeys."
12772,You're fucking awesome.
12773,"Free, you say? My mom and mom-inlaw are too far away to visit; after the obligatory phone calls maybe  I can also get my husband to shut up by finally going to the Stone Zoo with him."
12774,A nap.  I just want a fucking nap.
12775,"I'm very late to this thread but here it goes. Two years ago I had an epiphany about Mother's Day. 

As a single mom to two young boys there's no one else to show them how to give me anything, no chance at a break, etc. It's always been a sore point for me. 

Then two years ago on Mother's Day I woke up... All moody an irritated, checked reddit and a woman posted a poem that had me in tears. It was written from the perspective of her twins... Twins that were dead and how she was still a mom even though they weren't there. I cried so hard, woke up my sons and snuggled them close. 

Mother's Day is no longer about celebrating me.... It's now about  celebrating how lucky I am to be a Mom. How much I love my sons and what a joy it is to have them in my life. 

All I want for mother's day is to spend time with my children. There are too many mothers who don't get that simple pleasure any more."
12776,"My son wrote me a letter that talked about some of our funny memories together, some of our difficult times and how we made them through them and why he thought I was an awesome Mom. It cost him zero dollars, but it was so thoughtful I know he put some time into it. (If you do this one don't rush it or she'll know. We *always* know.) He said he enjoyed writing it because of the walk down memory lane as he was writing.

An SO could also do this as could younger kids with some help."
12777,"This is what I do - but then my mom is Captain Awesome incarnate and I try to put a bit of special effort in - (Me and my brothers, 6 of us, organize this together)

1. Breakfast in bed.
2. No responsibilities that day. Everybody handles their own shit. If they can't, come to me.
3. Big bag of stuff she likes. Viennese truffles, fresh flowers for her room (she really likes flowers), big ass bottle of malibu. Etc.
4. Favorite take away for dinner. 
5. We all get her something for her garden too. And we all pitch in for a few hours."
12778,"I love the term Take Away. When you're used to ""carryout"" it sounds so classy."
12779,i prefer the combination:  Take Out.
12780,"Whoa, don't get all Carried Away now."
12782,"Is ""were not drunk"" an acceptable fill-in?"
12783,"It took a second, but wow... that comment hits pretty hard."
12784,"Aw. Come here!

*******hugs*******"
12785,"Everyone on reddit simultaneously: ""SHIT, when is Mother's Day this year???"""
12786,"So when is Mother's Day again? I mean I know, just want to make sure you do."
12787,The 12th. Which is a Sunday.
12788,It's always on Sunday. Every year.
12789,Holy fuck its not the 17th?! My brother is an asshole
12790,"Never fear, Wikipedia to the rescue.

  Assuming USA, 12th of May.

  It was March 10th here in the UK.

http://en.wikipedia.org/wiki/Mother's_Day#Dates_around_the_world"
12791,"To my high school/college age step kids. Just acknowledge me. I don't want any gifts or flowers. I know my place. I know I'm not your mom.  I just want your time and I want you to talk to me and be kind to me. I want you to show me that even though I have only been married to your dad for 7 years, that you appreciate me. I'm the one that reminds your dad it's your birthday. I'm the one that reminds your dad to call you. I'm the one that says, ""let's give Jennifer/Will $50 before they go back home, even though we pay $1000/month in child support and all other expenses for Will, and expenses for Jennifer even though she is now a college graduate and makes more money than I do. I don't just contribute money. I contribute moral support and love. I worry about you like my own children. Just hug me and kiss me on the cheek and say thank you. 

Edit: Thank you kind Reddit stranger from a strange land who brought forth gold."
12792,"This is very moving.  Wish you the best of luck, and hope your kids appreciate you! =)"
12793,"Yes, they are sweet kids. The irony is that I raised them with very little. They are so sweet, humble, giving and loving. My step kids have been raised with every luxury and never wanted for anything and the difference is palpable. It's all good- I'm very excited for ALL of their futures because I know that even if I don't always get acknowledged, I still had a hand in it."
12794,"As a college-aged daughter of a dad who has been in a relationship with a potential ""step-mom"" for over a year now and lives with her, at what time did it not feel weird getting acknowledged as a potential parental figure? 
I'm 20 years old, she will never be my mother, but she's with my dad and she is someone's mother and she treats us well. What do I do for her?"
12795,"Maybe acknowledge that you appreciate her for what she does for your dad? My stepmom never once tried to replace my mom, even in small instances in public when people assumed she was, she always politely corrected the assumption. I loved that and I let her know I appreciated that.  Likewise, I let her know how much it meant to me that she was with my dad- he was in a bad place after my parents divorce and she got him out of it. That meant so much to me, and it wasn't something my own mother, or myself and my sister could do. 

She isn't a replacement, she isn't your mother, but she could be a good friend and ally. What would you do for a friend?


(I realize not everyone had such a stellar relationship with step parents, and some people are assholes.)"
12796,"Don't obsess that ""she never be your mother"". She's one of your parents and she probably makes your Dad happy. Giving her anything on Mother's Day would probably make her feel really good. I'm speaking as a step-child, my relationship with all my parents was so much better when I let go and let them be parents."
12797,"My step mom has been in my life since I was 9 after my dad divorced my mom. Now I am 21 years old and I probably have a closer relationship with her than with my dad. She's always there for me and caring for me whereas my dad is... well a dad. Recently, the company I was interviewing with had a screw up and went MIA for a week and a half and she was the one who'd call once every few days to ask me about the progress and reassure me that everything is going to be fine.
Last Christmas I gave her a Christmas card telling how much I love her as much as a real mother and all that mushy stuff from the depths of my heart. She told me it made her cry so I guess that's good... right? 

I guess all I'm trying to say is that your step-kids definitely know how much you care for them and love them. They might not talk to you about it because it's really awkward but they love you just as much as you love them. And you'd never know, they might just surprise you this mother's day :)"
12798,Going to give my stepdad a call now...
12799,This post has brought out an unexpected level of feels... I'm okay with that.
12800,Thank you (:
12801,"I have 2 teenage stepsons and an infant.

For Mother's Day, I'd really like my kids to show in their own little way that they think of me as an individual that loves them instead of a maid/chauffeur/chef/babysitter.

I'd like a day off from cooking/cleaning/taxi service. 

I'd like a meal centered on things that I like to eat instead of a meal centered on avoiding the foods that my kids turn their nose up at.  I love mushrooms and haven't cooked any in the last 5 years.

I'd like to have some time where we sit down and enjoy each other's company.  We can do this at meal time, as long as there's no name calling, intimidating, or condescending remarks between the teenage boys.  Or a board/card game.  Or just sitting on the couch chatting.  Or a trip to the park.  

I'd love a thoughtful gift.  This could be a letter, a hand made something, or something store bought.  I'd like something tangible to keep as a touchstone to remind myself of the mutual love that is the foundation of our relationship during the weeks/months when it feels like the only conversation my kids want to have with me is ""What's for dinner?""

EDIT: 
Who would have thought mushrooms would be so controversial?  To be fair, my kids don't ""turn their noses up"" at food any more.  They've become generally respectful, thoughtful young men (as long as their not dealing with *each other*, but show me teenage brothers that are loving and caring to each other -*amiright?*)  They each have their own way of dealing with food they hate - like broccoli.  My youngest will put it off until the end of dinner and drown it in Ranch.  The oldest will eat it first, followed by a big bite of his favorite part of the dinner - as a reward for biting the bullet on the broccoli.  These are silent, unobtrusive rituals that have crept into our dinner routine that they think go unnoticed.  I, in turn, don't call them out on it because they're trying to be polite and respectful, and try to only make one dish that I know they'll hate per night.  Since the nutritional value of broccoli >> mushrooms, they've fallen out of rotation, and off the menu all together. 

I'll have to make some next week.  All I need now is a good recipe."
12802,I hope you get all these things. And since the stepsons are teenagers I say screw them and start throwing mushrooms in everything. They're big enough to pick them out if it bothers them!
12803,"All I want for Mother's day is to sleep until 10 am (I'm usually up at 5), sushi for dinner, and a bubble bath"
12804,My kiddo just turned three so I'm not expecting anything. I would really just like a nap and for someone else to cook dinner. Haha
12805,"Ditto. Mom of a 3 year old and 1 year old. Just no chores for one day, please."
12806,"I have an eighteen month old. I'd like my husband take me to breakfast and then both of them leave the house for many hours. It's been so long since I've been in the house alone. I want to clean it really well, and then nap in my bed ALONE."
12807,"Not a mom, but I am certain the answer is a shitty drawing and a macaroni necklace.  It has to be, I've been getting my mom that for 35 years and she always says how it's the only thing she wanted."
12808,"Every other year I like to throw in a curveball and put glitter on them bitches, she never sees it coming!"
12809,"On the contrary, I bet she can see it coming from several miles away.  Damn hobby herpes!"
12810,Bitches love glitter. Good choice.
12811,"my mom had the macaroni art card that i made for her, on the fridge for years until the fridge was replaced and the new front was non-ferrous 

i made this card when i was 20 while wasted drunk and at work with nothing better to do 


tl;dr moms love macaroni art"
12812,F'n non-ferrous fridge fronts.
12813,Why would that even be a thing? What the hell is a fridge for if you can't stick magnets to it? WHY WOULD SOMEONE CREATE THAT?
12814,"Just spend some time with me. It tears me up that my kids don't think of me as a friend and barely even talk to me. My son just comes home from school and goes straight to his room, my daughter comes home from school and barely talks to me and just sits there texting. I want to be a part of their lives but they just shut me out. For mother's day I'd just like them to open up to me a little and spend some time with me. I don't know if it's because I'm a horrible parent or what, I don't know what went wrong."
12815,"My mother is constantly telling me that I ""shut her out"" and that she ""just wants to be part of my life.""  The problem is, every time she calls or I visit, she ends up nagging me or treating me like a child. (I'm 28.) Plus she constantly brings up subjects she knows we disagree on.

This has generally led to me dreading talking to her / seeing her, because if I'm around her for more than 10 minutes it virtually guarantees that she'll bring up something we strongly disagree about. Religion, politics, etc etc.

Then, this leads to us either having an argument about said topic, or me just withdrawing and not saying anything at all in order to avoid the argument in the first place.  This is why I try to avoid talking to her now at all.

The few times that I've been with her and we've managed to avoid the topics we disagree on, things go ok.

In any case - my advice to you:  Treat your kids like close friends now. They are also adults and can think for themselves. Avoid topics you know you disagree about. Keep any nagging to a minimum.  Don't be passive aggressive about anything. If my mom followed this advice, I'd see her a lot more often."
12816,"Heh, I had this exchange with my father once. ""how come you never talk to me?"" ""because you never let me ta-"" ""oh COME ON!"""
12817,"First you're ""my mommy"", then you become ""oh that's just my mom"". Shortly you're ""uhg...mom"",  and at some point, in their teens you become a piece of furniture.  You will become ""hey mom"", then ""mom, what do you think"".  Eventually you will hear your own voice and thoughts coming straight out of their mouths and you're "" this..is my MOM""."
12818,"I'm 26 and definitely went through a ""my mom is lame and i don't want to talk to her"" phase. now that i'm older i can't believe what a great mom she was/is. we talk all the time.  don't worry, they'll grow out of it."
12820,"From reading this post + comments, it seems best gift would be a time machine that makes kids skip puberty"
12821,I think a time machine would be the worst gift ever. They would just go back in time and never create us. Now that they *know*.
12822,But then there would be no one to give them a time machine
12823,"I take my mom out for brunch at a nice place every year for her birthday and momday. Sometimes I buy her flowers, and if she's out of town I clean her house. A couple years ago I hijacked her desktop and laptop and made backgrounds from MS Paint that said ""My mommy is the smartest lady"" and ""My mommy is the best!"" She hasn't changed them.
Mom's are great once we kids stop being shits all the time."
12824,everyday your mom is tortured by the mspaint background but she cant figure out how to change it and doesnt want to hurt your feelings by asking you.
12825,"""When I was a boy of 14, my father was so ignorant I could hardly stand to have the old man around. But when I got to be 21, I was astonished at how much the old man had learned in seven years."" 

--Mark Twain"
12826,"I just teared up a little. Right now I'm a combination ""that's my *mom*"" in that tone and ""ugh *mahm*!!""

I can't wait to just be mom again."
12827,"My mom went through a big rough patch when i was between 11 and 17. honestly, i was a little shit.  i'm 23 now and she is seriously my best friend.  not a day goes by that we don't talk on the phone and she knows pretty much everything. don't worry someday you'll get there ;)"
12828,"There's a massive amount of ""growing up"" that happens between the ages of 15-20. Once I was a few years into adulthood, I started appreciating just how great my parents were. Now that I have kids, I'm astounded they accomplished what they did."
12829,"At age 17 my mom drained the college savings my grandmother left me for a tit job an tummy tuck. Soon after she left the family for a guy 10 years older than her, in the messiest way possible that nearly led my dad to suicide. A year after she tentatively came back (after getting scammed for nearly everything she had and having nowhere to go) 

Its been a year since, I'm not really sure what my standing is with her. Its... awkward"
12830,I think you should get her a toaster.
12831,"Actually, get her a vacuum.  She's got a lot of cleaning up to do."
12832,I think you should throw that toaster in while she's taking a bath.
12833,....we'll call that plan B.
12834,"Kids generally go through three stages of interest/like with their parents.

1. As children. They'll love you to pieces and show it.

2. As teenagers. They'll ignore, dislike, and generally treat you pretty callously. Teenagers do this to most people in general, so you're not getting special treatment here really.

3. As adults. Assuming you're not a monster(Some parents are. Just adding the disclaimer for accuracy.), they'll start being far more thoughtful and considerate of you again, and more open about their love for you."
12835,Lets hope they don't think I'm a monster then!
12836,"It's actually pretty easy to not be a monster. Setting aside the rebellion most teens go through, just ask yourself some questions.

1) Do you take them seriously when they try to go to you with problems?

2) Do you make them feel like they are loved and accepted for who they are?

3) Do you treat them fairly?

4) Do you set reasonable rules, explain the reasons for them, and apply them equitably? (expansion of 3)

If you can honestly answer yes to all four questions, you're probably doing ok and once they get past the teenage years you'll be fine."
12837,"When I was a teen, my mom once got off the phone with my older sister and told me, ""It seems like she only calls when she needs something."" 

That stuck with me and now I always call up just to chat. I haven't ""needed"" help from them in decades."
12838,"From my experience, this gets better then worse then better. At 18 I was so at odds with my mother we had to communicate through letters for a few weeks. Within a couple years I had to accept myself as an adult before I could begin my adult relationship with her. It was pretty good for awhile, but then I moved out and the pace of life started to catch up. Meanwhile my mother slowed down, stopped watching TV shows, stopped watching movies, and we just didn't have as much in common to talk about. And as my life gets busier, she is retired, but still complains I don't go see her enough, even though she never drops by my house either. It's really not bad, definitely better than at 18 lol. So it will probably get better. You've done almost all you can as a parent, now the children have to accept their adult roles and you have to adjust to seeing them as somewhat more of an equal before you guys can really connect again (obviously a generality). 

Tl:dr probably gets better after a few months or years."
12839,">I had to accept myself as an adult before I could begin my adult relationship with her.

This is exactly it. Kids are kids, and they need time to blossom into adults. Until then you're an adult talking to a kid, and kids hate that - even if and especially if you are their parent. Some mature faster than others but someday they will understand what a Mother does."
12840,I don't have any money (broke student) and have been a horrible son (ex heroin addict 2 years sober) would you like it if you had a kid like me just send you a letter saying thanks for everything?
12841,Do this. It will be appreciated.
12842,If you mean it.
12843,"They're teenagers. That's normal. You didn't do anything wrong. If anything, that's good because in their minds you're not interfering with the shit they want to do.

Edit: /u/A_Bigger_Douche pointed out that it's ""a normal part of child development which leads to the creation of their own independent identity."""
12844,"How old are your kids? If my experiences are any indicator, this is completely normal behavior for teenagers. Personally, I pretty much wanted nothing to do with my mom when I was a teen. Its not that I didn't love her or that she wasn't a good parent, I just wanted to be left alone to do my own thing. 

Now that I'm older and moved out of the house I spend more time with her than I ever did as a teen. I enjoy going out and spending the day with my mom. I call and talk to her and let her know what's going on with my life. I ask for advice on things and actually listen to what she has to say. Whenever I go back home I'll hang out with her and shoot the shit. 

I guess what I'm saying is, just be the best mother you can and give it some time. They'll come around. Teenagers are assholes (yes, *all* of them) and it takes some time to grow out of that. 

I think this quote sums up everything pretty damn good. Just amend it for mother or parents. 

>When I was a boy of 14, my father was so ignorant I could hardly stand to have the old man around. But when I got to be 21, I was astonished at how much the old man had learned in seven years."
12845,"It gets better.  You're probably not doing anything wrong.  When I was in high-school I was a real dick to my mom.  Everything she did was just to annoy me, rather just be left alone, etc. etc.  I'm 21 now and I talk to my mom all the time.  Calls, texts, emails when I'm not home ... actually spending time together when I am.  Nothing really changed, I just grew out of it.

Unfortunately the truth is that you probably won't get anything sincere out of them if they're at that age.  You might get some flowers or a card, but only because it was convenient to pick them up somewhere or someone helped them along.  When they say Happy Mother's Day it's more so that they know they should rather than that they want to.  Don't take it out on them, though ... it's only temporary.  In a few years mom won't be distracting them from the text message; the text messages will be distracting them from mom."
12846,"My mom's birthday is on Mother's Day. This year, I got her two autographed cookbooks by Ina Garten."
12847,the same book?
12848,Nice. It's thoughtful and a gift that keeps giving.
12849,"My SO will be receiving a massage, time off from having to watch the kid (I'm gonna play video games with him), a stiff drink, and copious amounts of oral sex. Maybe I'll get the child to help me make her breakfast in bed too."
12850,"""....copious amounts of oral sex.  Maybe I'll get the child to help..."" My brain was like OH GOD NO."
12851,"""make her breakfast in bed"" just took on a whole new meaning"
12852,"""Time to scramble the eggs."""
12853,I LIKE MY EGGS FERTILIZED
12854,I've said it before and I will say it again. You're a keeper.
12855,I hope you guys never break up. It would make Century Club even more awkward.
12856,If we split up I get reddit in the divorce.
12857,*I WANT JOINT CUSTODY!*
12858,You can have it every other weekend and certain holidays.
12859,How about a month or two during the summer?
12860,We'll see. If those reddit support checks come in regularly we might be able to work something out.
12861,Monthly karma payments.
12862,"No, I want money. Karma doesn't pay the bills."
12863,"The more I see you two, the more I realize you're the nicest people alive."
12864,"About a month ago, my dog caught the cord on my laptop. It knocked off and broke half of the keys. I can't get them back on. I am currently typing with the squishy rubber parts that were under the keys. I would love a pad or new laptop."
12865,"See it's this kind of practicality that actually helps. Of course this is situational this year, but in general, it's nice to have something to purchase and wrap."
12866,"No one will see this or care but I felt like saying it anyways:

My mom cut out several years ago and shes long given up trying to have a relationship with me. Being the only girl out of 6 children, my dad didn't really know what to do with me at the time, a brass 14 year old with a short temper.  But he sat there through every dramatic break up, hair-brained scheme, and vain attempt at normality I've endured.  

I always call my dad on Mother's Day to thank him for being the best mom he could be for me.  I often take 20 mins out of my day and reflect on our time together, trade a few jokes, or share a teary eyed remark.  While he still may not fully understand the inner workings of my brain, he certainly tries.  He helped pick out my prom dress, offers dating advice, and never judges me for bad decisions.

Acknowledge your ""mom"" on Mother's Day.  Doesn't matter how poor your are, you can still afford a heartfelt conversation with that person."
12867,"http://i.imgur.com/u3ev9xx.jpg

This. We want this."
12868,Just a day off
12869,"Hi! Since my husband is a redditor and hasn't actually asked what I want...here's my list. I do a list so whatever actually happens is a bit of a surprise; I'm not the type to actually ask and expect to get all of it...hat seems greedy. Anyway. 

A day (weekend would be even better) without having to change diapers.

Not having to do any of my daily chores (although cooking is one of my favorite hobbies so I still want to do that) BUT still have a clean house None of this ""dont worry about the housework today dear, it'll be there for you tomorrow"" garbage. Lol

Help my daughter make me a card or a homemade present. She's not old enough to do anything herself (19 months) but helpin her make a macaroni necklace and crayon-decorated card for me would absolutely make my year. 

As for purchaseable gifts:

Scrapbooking supplies (specifically stamps and ink pads). Get your woman something that is related to her hobby outside of parenting! (And maybe provide her with some alone time to use it)

Also, a case of my favorite ale or a bottle of my favorite wine is always a good idea. 

Flowers and chocolate are generally acceptable, but I personally prefer gifts that are reusable or contain alcohol. 

Oh, and lots of hugs and kisses."
12870,"I asked my mom what she wanted and her only reply was ""sweat pant"" she to simple and that's awesome"
12871,Just one?
12872,I think you inherited her English.
12873,Was thinking this as I submitted it. I no English well.
12874,"Mom here...two kids, 5 & 7...husband.  Here is a list...very specific because you asked.  Bottom line is that we want YOU to think about US and what we like to do.

1.  Some time alone.  Take the kids out of the house and let me just relax.  Don't ask me where to take them/what to feed them/what they should wear...just.go.
2.  I garden.  I would love some nice gardening gloves, a gift card for a great garden center.  What are her hobbies?  Accessorize her hobby.
3.  A picnic somewhere beautiful.  Pack a cooler/backpack with good cheese and crackers, good wine and chocolate and lunches for the kids...throw in a blanket and a little vase and pick me a flower along the way.
4.  Write me a letter telling me what you love about me and why you think I'm a good mother.
5.  Cook me dinner - try to remember what I like/don't like.  Shop and clean up yourself.  It's not a present when I have to clean it all up the next day.
6.  I miss my friends...arrange a girls night for me, find and book a babysitter, make reservations, make sure my friends are free.
7.  Don't say stuff like, ""it's a made up holiday..."" unless you are thoughtful and do stuff for me all year.
8.  Send MY mom and YOUR mom some flowers.

TL/DR:  Be thoughtful

EDIT:  Oh My - Gold x2 - amazing!  I want to make clear that this is a list of suggestions/options - was IN NO WAY intended to be a 'you must do ALL of this'.  Pick one - or two, if you want, depending on what your Mom/Spouse is into.  Keep in mind, regarding #8, that women tend to do the shopping for their husband's Mom, as well as their own.  For Mother's Day I do something for my MIL, my own Mom, and I remind/suggest stuff for my brother to do for his wife and our Mom (at his request).  If you are married and want to do something for the Mother of your children, doing something nice for HER mom says that you appreciate that she raised the woman you love and you are grateful.  It is a sweet thing to do. Also, I know it seems counter-intuitive that for Mom's day, many of us just want some time to ourselves - but being a Mom means being on call all the time.  Mom's of toddlers can't shower or poop in peace.  They never have an uninterrupted meal, they hear every cough in the night, the demands are relentless.  Just a few uninterrupted hours when you're not 'on-call' is heaven.  And for the sake of the universe - if you know a single Mom, or Dad, consider doing something sweet for them."
12875,I like to send my mom flowers at work so she can brag about how great her son is. I think she enjoys lording her giant arrangement over the other mothers.  ... we're kind of bad people?
12876,There are few things better than having the delivery person come in and say your name. Instant blushing.
12877,"my mother is a florist, so she might have to make her own gift if I did that."
12878,"I'm saving the shit out of this on the possibility that in ten to fifteen years, I have kids and am still married to their mother."
12879,"> I have kids and **am still married to their mother.**


So optimistic."
12880,"I mean, I'm not going through the effort of organizing a fancy picnic for my possibly ex-wife."
12881,You have some very healthy relationships ahead of you
12882,"my dad always helped me and my sister on mother's day even though he hasn't been married to my mom for a long time. despite what reddit says, you don't have to hate your ex-wife. there are plenty of amicable divorces out in the world."
12884,"This.  This.  My husband thinks it's a holiday I should spend with the family and the only thing I want is time alone.  I'm not an asshole, I love my daughter, but the best Mother's Day I ever had was when he let me go to the movies alone and he took care of her."
12885,"Lets just rename it to ""Jesus would you get the hell away from me for like 10 minutes"" day"
12886,"Every day is ""Jesus would you get the hell away from me for like 10 minutes"" day when you have toddlers."
12887,"Yes! Last year when I said I wanted time alone or to not have to do anything I heard, ""So for Mother's Day you don't want to be a mom?"""
12888,"Yes. That's exactly right. Mother's Day is supposed to be about recognizing all the crap that we deal with 364 days of the year. The best way to recognize that is to get rid of it for us, if only or a day."
12889,And worker's holiday is celebrated by not working.
12890,Is it so wrong to want a day without my daughter?  I'm a stay at home mom of a hyper 2 yr old. My husband went on a business trip and it was just the two of us for a week. By the end she was getting on my nerves. I love my daughter but is it so wrong to want a day to myself?
12891,"Definitely not, especially if you stay at home with her ALL the time! I work and I still need time away sometimes."
12892,"I really, really, really want my husband to watch Sharktopus with me and buy me some liquor so I can drink heavily, then not make fun of me for having a hang over the next day."
12893,"I just want silence. No kid, no hubby, no dog, no phone, no computer, no homework, no work. Just me, a steaming cup of coffee, a blanket, and a new book to read. Then I want to read it. All day. No interruptions or needs. I just want to not be needed for a day..."
12894,"A day off.

Source:  Mother of 2 1/2 and 1 year old."
12895,"My mother is the mom of me (29) and my brother (32) who lives at home, does no chores, pay no bills and as I found out during a very long and frank convo with her a couple months ago, is a gigantic source of stress for her and my father. She told me that some days she ""just wants to get away."" She shared this with other moms at her job and they all agreed with her, but their children are much younger. So I've decided to take her out for a getaway. Get her the hell out of the house for a day of whatever she wants just so she doesn't have to clean up after 2 grown men. She's very excited."
12896,">a day of whatever she wants just so she doesn't have to clean up after 2 grown men. She's very excited.

This is pretty sad. Maybe you need to have a chat with your brother and father about not taking advantage of her and acting like the grown-ass men that they are."
12897,"Actually this came up in our talk too. It seems she doesn't have the strength to ask my brother to get his shit together and when she finds it, my dad won't back her up. He's miserable too, but they both feel bad because they think that they did something wrong while raising him. I'm much less sympathetic and I kind of think my brother is taking advantage. I mentioned that I could have a frank talk with him telling him to get his shit together and she didn't say no. She actually seemed kind of excited, but I could tell she felt guilty about that. My mother's said that she doesn't mind cleaning up after my dad when she has to. She knew she was a slob when she married him, plus he does help out a lot, he's just not as meticulous as she'd like. With my brother, he's truly like a child. She has to beg him to clean up after himself or for help paying a bill."
12898,I would definitely talk to your brother. That could be the best mothers day present of all.
12899,And half an hour to soak in the tub.
12900,I'd say just a shower in silence would be nice. It seems like whenever I'm in the shower someone is having a meltdown.
12901,"I have a two year old. I've been saying this since I was pregnant and no one has gifted this to me yet- I need a massage, badly. I also haven't had a hair cut in almost two years and I never have the luxury of painting my nails. I guess I'm in need of a ""spa day"". I'm praying."
12902,I want a garden gnome.
12903,http://i.imgur.com/abAZ0dI.png
12904,I want a new pair of Chuck Taylors. Or a spa. Or something with my boys' birthstones. Probably the Chucks.
12905,"Chucks with birthstones.  Got it.  

""Honey, where's the Bedazzler?"""
12906,"I am a mother with a 6 year old child, a job, and volunteer responsibilities.  What I really want is some time alone.

I want a night (one full 24 hours) in a hotel room by. my. self.  It doesn't have to be super expensive.  Just clean and comfortable.  I want to be there all night long.  I want food delivered, I want my kindle, and I want a glass of wine.  I do not want to speak to another living soul for the entire night, and I do not want anyone to talk to me.  I do not want to see little fingers poking under the bathroom door while I'm taking a shit.  I do not want to get to the most suspenseful part of my book, only to be interrupted because someone wants a glass of milk/tie their shoes/can't find their lucky pillow.  I want to walk around completely naked without someone commenting on my flab or pubes or the zit on my back.  I want to wake up without a tiny little face inches away from my own, or a foot in my face, or a 65 pound dog jumping on my stomach.

In short, I want to be alone.  In absolute peace and quiet.

Edit:  Also, for gods fucking sake... The last thing I want to do is spend time with YOUR mother.  She's got both her kids out of the house, all day fucking long to do whatever she wants, and gets a full nights rest every night.  She's not in the trenches, and therefore... she doesn't get what she wants."
12907,"Peace and quiet. Whether that means hubby taking the baby out for a while, or getting me a massage/haircut/pedicure/etc. something where I can hear my own thoughts for once."
12908,"mother of a 2 year old here..I'd just like a few hours to be totally and completely alone. Most of the time I don't even get to be in the bathroom for myself, so some alone time would be great!"
12909,Something made with my kids' hand/footprints. Sentimental. A nice thank you for keeping them alive. I don't need anything that costs money. I just want to feel appreciated.
12910,"I have to get Mothers day gifts for my wife, cause my kids are 3 and due in July.

I have my ""remembery stuff"" list, kept in a cloud based storage area, into which I paste everything and anything that my wife says she likes or wants.

That way, when a gift getting opportunity arises, I check out the list, which ranges from little £10 gifts to major things, pick something which fits the budget, something she wanted a year or so ago, and has forgotten all about, and get her that.

Boom. Gift is something she likes. Gift is something she has forgotten she wants. Gift is something i've remembered she wants. Everyone is a winner!"
12912,It sounds like your bf could use a healthy dose of grow the fuck up.
