idx,text
43934,Well this if you pass your test first time.
43935,In which universe is a motorcycle license under 100 dollars?
43936,Some states in the US.
43937,Wow. That's impressive. How does the instructor even get paid for so little?
43938,"In America, the DMV workers are often local government employees.  They get paid by taxes."
43941,"A ww2 era mosin nagant or an old single shot scattergun? If you felt like taking up hunting that is. A mosin might run you a *teensy* bit more but not hugely if you know where to look. 

What are you into? 

Alternatively, an [antique khukri from india](http://www.ima-usa.com/original-nepalese-gurkha-kukri-bhojpure-fighting-knife-unmarked.html)  

Maybe a special tool/kit that can help you do some DIY projects? 

Also, someone suggested charity earlier, this charity is badass. If that's your thing. It lets you empower people in underdeveloped countries by giving them goats,water buffalo, chickens and stuff like that for self sufficiency. [check out heifer international](http://www.heifer.org/gift-catalog/animals-nutrition/gift-of-a-sheep-donation.html?msource=KIK3K13000070&utm_source=bing&utm_medium=cpc&utm_campaign=Bing-Sitelinks&utm_term=heifer%20international&utm_content=Bing-Sitelinks)"
43942,A PS2 and accompanying Ace Combat games. Ohohoh yes.
43943,"You know how some things from your childhood just wind up etched on your brain?

*""I was just a child when the stars fell from the skies. But I remember how they built a cannon to destroy them, and in turn, how that cannon brought war upon us...*

The recent AC games are an embarrassment."
43944,Ace Combat 4 and 5 are the definition of my childhood. I get chills listening to the music in Megalith..
43945,10 hits of acid is probably your best bet in terms of coolness to price ratio
43947,"For $100 I bought my dad an introductory flight lesson through Groupon.  

He flew a single prop plane around for an hour with a certified instructor, who handled the takeoff, landing, and navigation, but my dad was behind the stick the rest of the time. He said it was one of the best gifts he had ever received. Cheers!  

Edit: It was also worth it just to see my mom freak out the whole time."
43948,a bottle of don julio and a bottle of bullet bourbon.
43949,"Or, 5+ gallons of skoals :)"
43950,A nicely stocked Arduino starter kit.
43951,A gram of coke
43952,"Got the coke, what now"
43953,Just do the coke and see what happens
43954,Alright. Drank the coke. Nothing is happening.
43955,You are suppose to snort it though...
43956,"OH GOD WHY IS IT BUBBLING IN MY NOSE  


JESUS IT BURNS"
43957,smell it really hard
43958,Go fast
43959,Does this coke smell funny to you?
43960,That must be some bitching coke!
43961,"Stuff for rolling your own premium cigars!

[For tools, you'll need:] (http://cigarrollingproducts.com/collections/all)

- A chaveta knife
- Cigar glue
- Cigar scissors
- Capping tool

And you'll need [tobacco leaves, in a blend kit like this.] (http://wholeleaftobacco.com/Whole-Leaf-Cigar-Blends_c30.htm) Probably enough for 50 or so cigars in there.

[Now you can learn to roll your own cigars!] (https://www.youtube.com/watch?v=H0hiu_Cv16I) My gf bought me all this for my birthday, and it was an awesome present and a really fun new hobby for me."
43962,Ill stick to Swishers and weed.
43963,"While yer hittin that bleezy, just imagine the blunt this muffucka could roll, and realize swisher is generic as fuck son."
43964,"Generic, but good. And does its job."
43965,Ice cream.
43966,Go bungee jumping!
43967,This fucking clock: http://www.thinkgeek.com/product/11bd/
43968,One cheap hooker.
43969,"Or 100 REALLY cheap hookers...well, 50 and a penicillin shot"
43970,A nice aquarium.
43971,I think $100 is a little optimistic for a *nice* aquarium!
43972,You could get a nice desktop 5 -10 gallon aquarium.
43973,On meh.com today there is one of those balls you control with your smartphone.  That looks pretty fun.
43974,You can buy a pretty decent violin for $70 and a mute so you can practice without pissing off the neighbors for $20. Decent enough to get you started.
43975,I think we have a winner. Excellent idea. I've always wanted to learn
43976,"Thanks! Same here, I've read some reviews about this one on Amazon for $67 and it seemed like a nice little starter to see if I'm interested in advancing."
43977,"Every month I spend $100 on myself. Tervis tumblers, Yeti Ramblers and a GSHOCK GD350 With the negative display have been my last 3 purchases."
43978,that gshock alone is like 150$
43979,Not if you steal it
43980,"Download it... And 3d print that shit. 

Not literally shit."
43981,$92 @ amazon. Run price checks. :)
43982,"I got the gshock mudman for like $75.

No regrets.  Great watch and money well spent"
43983,"By a forest pass, go hiking. Explore."
43984,"Raspberry Pi, wifi dongle, SD card, two USB controllers = retrogaming station for NES/SNES and anything earlier. But no XBox/N64; the Pi is too slow for that."
43985,Can you link me something for retro gaming nes please?
43986,"http://hyperkin.com/Retron5/

NES, Nintendo 64, more"
43987,"[Controller](http://amzn.com/B002YVD3KM)

[Emulators](http://www.emulator-zone.com/doc.php/nes/)

[ROMs](https://www.google.com/#q=nes+rom)"
43989,A pair of rings and a pullup bar. Ring moves are the tits.
43990,"Some items that fit in that price range:

[Molecular gastronomy kit](http://www.amazon.com/Molecule-R-Cuisine-R-EVOLUTION-R-Evolution-Kit/dp/B006M64H7S/ref=sr_1_1?ie=UTF8&qid=1420493599&sr=8-1&keywords=molecular+gastronomy+kit)

[Swedish Firesteel Knife](http://www.amazon.com/Tool-Logic-SL3-Tactical-Magnesium/dp/B0001WC6MW/ref=sr_1_2?ie=UTF8&qid=1420493680&sr=8-2&keywords=firesteel+knife)

[Miracle berry tablets](http://www.amazon.com/mberry-Miracle-Fruit-Tablets-10-Count/dp/B001LXYA5Q/ref=sr_1_1?ie=UTF8&qid=1420493748&sr=8-1&keywords=miracle+berries)

[Neon wand](http://www.amazon.com/Kinklab-handle-neon-wand-electrode/dp/B00BFN45Y8/ref=sr_1_2?ie=UTF8&qid=1420493833&sr=8-2&keywords=neon+wand)"
43991,"[RPG Maker VX Ace](http://www.rpgmakerweb.com/products/programs/rpg-maker-vx-ace) is $70, and allows you to make 90's JRPG games like Final Fantasy II.  Throw in $30 of resource packs and will give you countless hours of creative fun producing your own games."
43992,"Just a note--this is a great piece of software, but it goes on sale all the time, both on steam and in humble bundles. Unless you want it right now, it may be better to to wait."
43993,Pick a charity :~)
43994,YOU GET OUT OF HERE WITH YOUR ALTRUISTIC COOLNESS.
43995,"At no point will giving money to a charity be ""cool.""

Nice?  Sure.  But never ""cool.""  Giving gift money to charity is super square."
43997,But... but... Bill Gates is cool for it!!
43998,Could get a sweet DE razor. Cast Iron skillet? Bitchin cargo pants? 128GB usb3.0 stick? New mouse? Thermos!
43999,"#1, cargo pants are clothing so they're excluded...#2, they are the farthest thing from cool, so they're excluded"
44000,Cast Iron muthafuckin skillet!!
44001,"A 2DS and a game could fit neatly into $100 depending on the game. Alternatively, a used DS Lite ($50 max) and an R4 card ($10) for any games you want."
44002,"I bought a used 2DS, and then my boss bought one as well. Three more people have since gotten them and started bringing them to work. We take turns putting them all in a bag and walking around to catch people on streetpass.

Basically they are addictive and will take over your entire life, and the lives of everyone you know."
44003,+1 this. The quality of games on the DS is miles beyond most of the crap we get on mobile.
44004,Or spend it on underwear for homeless people.
44005,Buy some sick shades.
44006,Potato Gun (Spout Gun)
44007,"Knife
Flashlight
Portable bluetooth speaker
Day-trip
Concert tickets"
44008,Pot.
44009,It depends on whom you are buying it to.
44010,4 bean bag chairs on Walmart. Best way to chill with the bros and watch football
44011,Everyone should carry a swiss army knife.
44012,"Or alternative, depending on expected usage :D 

You can get a great knife for $100. 

/r/knifeclub"
44013,Those R/C helicopters you see all over the place these days are pretty cool.
44014,"This should cost about 100 bucks and is the coolest project I've seen this week:
https://www.youtube.com/watch?v=lSoWxG30rb0"
44015,"hey, i just clicked this and watched the whole thing and thanks. I want to make that mini foundry.  I was recently thinking about making a few cool fixtures for the back yard, like a forge, a teepee, and a shed.  this is a point in the right direction."
44016,A [quadrocopter with HD camera](http://www.dx.com/p/wltoys-v959-2-4g-radio-control-4-ch-quadcopter-r-c-aircraft-w-2-5-lcd-remote-controller-camera-221673) and [a set of batteries](http://www.dx.com/p/wltoys-kv959-0005-600mah-battery-component-1-to-5-cable-for-v959-v222-four-axis-aircraft-3-pcs-238737).
44017,UNICYCLE
44018,A bag of ice! amirite?!
44019,Dry Ice.
44020,"My friendship, for the low low price of $99.98."
44021,Some gocart laps
44022,"Scotch, then let the addiction form and watch as you become poor (aka, liquidating your assets)."
44023,A slab of [aerogel](https://en.wikipedia.org/wiki/Aerogel).
44024,/r/startwithabill
44025,"That $35 bidet from Amazon, and never use toilet paper again."
44026,Lava Lamp.
44027,"A bidet attachment for your toilet.  Luxe Bidet has some great models around 40 bucks. It sounds weird and feels weird at first. But i guarantee my asshole is cleaner than yours. Ladies love it. Definitely helps when you have the fire shits, also saves on paper consumption."
44028,"This is probably the best sub-$100 purchase I've ever made. It's substantially better than toilet paper, and still a lot better than wet wipes (which I see suggested very often in various threads).

I use so little toilet paper now. I buy a 12-pack...once a year? For two people.

**EDIT:** I'm getting a lot of questions about installing a bidet. If you're interested to know what needs to be done to install one, [take a look at this video.](https://www.youtube.com/watch?v=fhExm0UFxAw)"
44029,How easy is it to install?
44030,"Took me about 20 minutes to install, but it could be faster if you have better tools.  Turn off water.  Flush a few times to empty toilet.  

Remove seat, place bidet attachment, replace seat.  This step is the biggest nuisance, honestly, but could be easy if you have a second set of hands; bidet is weighted to one side, so you have to hold it up, hold seat in place, align everything and screw it in.  Fiddle for about 5 minutes to get the positioning of the seat right.

Unscrew hose where it joins tank of toilet to wall (carefully, as there may be water in it), attach it to t-junction that comes in the box.  Attach t-junction to new bidet attachment via. the extra hose that came in the box.  This seems like a pain in the ass when you're facing it, but in retrospect the seat was more of a pain.

Turn water back on.  Carefully test putting your weight on it - you may want bumpers to support the front of the seat, depending on how it all fits together and the dimensions of your toilet seat (the bidet attachment lifts up the back of the seat by about a quarter inch to a half inch).

Got the thing for something like $35, went through the above hassle, totally worth.  I know it's weird to talk about toilet stuff, but it's a huge quality of life thing.  End up using only two sheets of toilet paper to pat dry, every time.  If you can't appreciate that, then you're not human."
44031,"I've got 2 questions.

First of all, do you have to spread your asscheeks apart with your hands to make sure it's not just blasting your cheeks? Or is like a squat a good enough spread?

Second, what is the accuracy like? I feel like I would get blasted in a place  that isn't my asshole until I properly adjust and would end up with wet ass cheeks."
44032,"You're naturally spread if you're sitting on the toilet.  If you aren't, you've got bigger problems, and your cheeks could use a rinse anyway.  You may be thinking you need to get up, but you don't.  Just stay sitting, turn dial.

You will need to adjust, but it's more a lean forward, sit up thing, if you're not sitting lopsided.  Really isn't a problem even if the cheeks do get residual spray.  Pat dry."
44033,"I promise this question isn't a joke:

How do you not have shitty water being pushed into your nether regions, boy or girl? Since it sprays from the back, wouldn't it all just go forward? Also, doe it ever splash outside the toilet?"
44034,"Honestly can't say for sure, but I think it comes up at an angle.  It's shielded when the dial is set to 0, to protect the sprayer.  All I can say is when I pat dry and dry the cheeks, the toilet paper looks no dirtier than if I'd gotten it damp at the sink.  Never had anything go outside the toilet.  More focused than that.

That's probably the only complaint/warning.  The dial goes from 0 (off) to 1 (strong spray) to 2 (pressure washer/scalpel intensity) to 3, 4, 5 settings I don't dare to try.  It's very focused as a spray."
44035,A good pillow.
44036,Suggestions?
44037,"I bought a memory foam pillow for $20 about 2 years ago. It still has its spring and was stolen to my girlfriends side of the bed. 

Im gonna go buy another soon."
44038,Please update us as soon as that one is gone too.
44039,His girlfriend is going to end up with a memory foam pillow fort.
44041,"Seconded! My pillow's been around for a long time and I'm looking for a new one, but I have no idea which are overpriced gimmicks and which are quality. I'd love to hear anyone's opinions."
44042,"I got a good medical pillow two month ago but it cost more than $100.

Best pillow ever, I wouldn't take a penny back.

Edit: But I'm sure there are some pretty good pillows for less than $100"
44043,"I wasted so much money buying cheap pillows from Wal-Mart that went flat after a month. Then I bought a latex coconut pillow from Mattress Firm 2 years ago. 10/10 would buy that pillow again. 2 years later it's still perfect, although it doesn't smell like coconuts anymore."
44044,"As someone that's allergic to latex and hates the scent of coconuts, this sounds like my worst nightmare."
44045,I'm interested in how latex and coconuts get involved in a pillow. Neither of those things sound soft and comfy.
44046,"If you're in a relationship, a second blanket. It makes sleeping with someone so much more enjoyable."
44047,Ok I already have two blankets. Could a relationship cost under $100?
44048,"Per hour? Sure, but I wouldn't recommend it."
44049,"*Where?*

^^My ^^friend ^^wants ^^to ^^know..."
44050,Bless your heart.
44051,"I'm British and do this, but everyone thinks I'm super weird! The most common comment is 'well it wouldn't work for me, I like to snuggle sometimes when it's cold' it's a blanket, not the fucking Berlin wall, you can snuggle whenever you want ffs. 2 duvet master race for life."
44052,Rice cookers! Those things are awesome.
44053,"growing up in a Filipino household, I always figured a rice cooker was a common kitchen essential, like a microwave. Until I saw my friends' parents cooking rice on the stove top and was very confused."
44054,"Rice 8/10

Rice in rice cooker 10/10"
44055,Thank you for your suggestion.
44056,1800 thread count sheets. It's like putting heroin on your skin.
44057,1800 thread count for under $100??? Where do you live!????
44058,I lucked out at a Khol's store once. Found 1800 tc sheets missed marked for $19.99. I think they were suppose to be $119.99.
44059,"""It's like sleeping in lotion!"""
44060,"""IF THAT HAD BEEN A DRUG DEAL I WOULD'VE SHOT HOTEL LUXURY LINENS IN THE FACE!"""
44061,"296 ARE YOU SHITTING ME MAN.
296 is sand paper as far as i'm concerned.
[link](https://www.youtube.com/watch?v=2o1U2pWcR34)"
44062,"""I almost slept on that shit!"""
44063,As a hairy man beast with curly hair and super calloused hands and feet:  nope.  I just catch on everything.  I dig the cheap flannel.
44064,"I love high thread count sheets, but none of them come in pretty colors! I am on the hunt for some blueish/green sheets right now, and the highest I can find is like 400 thread count, which is utter shit."
44065,Buy the white ones and dye them yourself?
44066,I think that the thread count doesn't matter as much as the quality of the cotton the sheet is made of.
44067,All jokes comments aside I would say a dashcam for your car. It's not as expensive as they look and a quick google search showed they can cost 79.99. It's not likely but in case of an accident that isn't your fault its best to be prepared than out of money paying repair bills
44068,Plus you get to capture the silly stuff that happens outside Russia for a change.
44069,[Relevant](https://www.youtube.com/watch?v=xamGrall2wc)
44070,I was hoping for [this.](https://www.youtube.com/watch?v=BHJxIwvFIGY)
44071,I have found something amazing today
44072,"Been watching all of these videos, theses kids are crazy, people are pulling guns on them and they don't even stand back."
44073,"""I blowjobbed for it""..   Fucking lost it right there.  LOL."
44074,We need this in the US. It would be so rewarding to see asshole drivers publicly shamed.
44075,"I think I'm going to actually have to buy one of these.  

I was approaching a toll booth about a month ago, when a woman who was behind me in my lane sped around me, and then merged into my side.  The guy who had been behind her said I was the one who merged into her.  So now I have to cover my own repair and hers, just because some random dude climbed out of the woodwork and hadn't been paying attention to what was going on.

A dashcam seems like it could have prevent all of this."
44076,"It's a toll booth, it should have been covered in cameras.  Did they not pull that footage?"
44077,"I contacted the office in charge, and they told me that they don't have video cameras installed.  They take photos of license plates if you try to drive off without paying, and that's it."
44078,Have a lawyer contact them. I bet their story changes.
44079,"I got cited for a hit and run many years ago that I didn't commit, but since there was (old) damage to my car the cops decided to take the accusor's side. So I'm going to have to say this is a great idea for everyone.

FTR the judge threw out the case, but I still wasted time in court and money on lawyers."
44080,"How would a dash cam help you in this case? 

""It wasn't me, I don't have it on camera!"""
44081,"The accident must have occurred at a certain time and location, and if you can show that you didn't hit anyone at that time or place - or better yet, that someone else did - you're out of trouble."
44082,"A coworker of mine convinced me to look into buying one. He has two installed. The first one he has both a forward facing camera and a rear facing one. The second one he has installed has it facing towards him from the rearview mirror in the event anyone accuses him of talking on the phone or texting while driving. The second one also captures audio for the same purpose and just as a precautionary. Apparently, they are very easy to install as some just plug into your cig lighter and turn on as soon as the car is started and can take upwards of a 32gb micro SD. Definitely worth the investment."
44084,That's very true.
44085,tfw a dashcam is illegal in your country... for whatever fucking reason
44086,"Sadly in Germany, it is making the rounds in the courts that dashcam footage is not permissible as evidence.  

On the contrary. You may have someone take you to court for filming them without their consent.  They are really going full retard about privacy for the individual when it comes down to dashcams. I have one and record regardless. In a dodgy situation, just mentioning in court that you actually have the incident on camera, even though it isn't admissible, may just tip the balance."
44087,A slow cooker.
44088,"Definitely, I call mine my ""Magic Make everything tasty with no effort Machine"""
44089,You're wasting all your saved time on giving your items really long names.
44091,the best way to improve any meals you eat. you can put basically any cheap meat in there and it will turn out delicious. the best part is being able to throw a bunch of stuff in it before leaving for work and coming home 9 hours later to a fully cooked meal that requires no more prep that throwing it on a plate.
44092,"For drivers in the US, a AAA membership is only like $55. Even if your car runs great it's a good thing to have. Shit like running out of gas, or locking your keys in your car can happen all of the time. And they even come out for you when it isn't even *your car* . Like, if your buddy is giving you a ride and they get a flat, they'll come out and hook you up. I've called them for complete strangers before. And oh my god, in an accident they're a life saver.

They also have a bunch of other cool random benefits, like cheap hotel rooms, and all kinds of help with travel plans, and you can go there instead of the DMV for certain things like your registration. It's soooo much nicer than the DMV and takes like 10 minutes.  

I've also never in my life have felt ripped off, or like they offered something that they didn't deliver, or that it wasn't worth the money. I swear, for drivers it's the best $55 you can spend all year."
44093,Was having my battery changed literally at the time you were writing that. Can't recommend enough.
44094,An SSD.
44095,Go for one with at least 256GB.
44096,"I've made this mistake. Built my custom Desktop in Fall 2011, slapped a 60GB SSD as a last minute addition to the budget (~$1,000 originally) just to place the OS on. Everything was fine for awhile, but it just fits enough that each time I have an update that goes directly to [C:] with no way to specify my 2TB [E:] as the download location, I get all kinds of warnings about low disk space.

Little before Christmas I bought [PNY Optima SSD7SC240GOPT-RB 2.5"" 240GB SATA III Synchronous-Mode Internal Solid State Drive (SSD)] off Newegg and for Christmas received a second one. Now I just need some free time to learn how to clone my current drive and install the new SSD's (my buddy had free time one weekend and offered to put all the components together for me while I was out of town -- no idea how to hook this stuff up)."
44097,"Clonezilla is your best bet, I have used it before and has no flaws whatsoever."
44098,pc^master^race
44099,Condoms if you aren't ready to be a parent.
44100,$100 worth of condoms? Oh my.
44102,A humidifier! Gone are the days of waking up every day in the winter with a sore throat and a crackly voice.
44103,A cast iron pan
44104,Can you explain what the advantage is to a new cook? I read [this]( http://www.seriouseats.com/2014/11/the-truth-about-cast-iron.html) article about them and all I see is extra maintenance.
44105,Cast iron is very heavy and so it holds a lot of heat.  When you slap a piece of meat on a pan a lot of heat goes from the pan into the food and cools the pan until the burner can heat it up again.  With cast iron the pan doesn't cool as much since it has a lot of mass so you get a more even cooking experience.  Also you can put a cast iron pan in the oven so you can do things like a shepards pie all in one pan.  Plus the things are near indestructable and good for hitting burglars with.
44106,My fucking roommate washed my grandmother's cast iron skillet that she willed to me. Three generations of seasoning......gone...the damn thing was fucking glimmering.
44107,I didn't know you weren't supposed to wash them. How do you get the excess food crap off them after cooking?
44108,"~~You don't wash them with soap and water as that gets rid of the seasoning from the food you just cooked.~~
Turns out you can use some soap, just don't go in hard with the scrubbing.

Most of the time, you can just rinse under hot water and wipe (or ever so lightly scrub) to get rid of the burnt bits and other food particles.

You can also use salt and a light brush to get rid of the more stubborn bits."
44109,Or just line the bottom with Kosher salt and bake in a hot oven.  It will pull up all the 'wet shit.'  Then you can scrape any big nasty pieces off with a spat.  Then re-season with oil and towel.
44110,"I have to be honest, that sounds kind of nasty, and a bit high maintenance.  I'm not sure if I'd actually be able to tell the difference between food cooked in a seasoned cast iron skillet and food cooked in a brand new steel skillet, or between food cooked in a cast iron skillet with three generations of seasoning and food cooked in a cast iron skillet that's been seasoned recently with oil.  I have a small cast iron skillet (seasoned according to the manufacturer's directions) that I use rarely because it's so damned heavy and because it tends to heat unevenly, resulting in scorch marks that are difficult to remove."
44111,"If there's a lot of/burnt on food still left in it after cooking I usually run it under the hot tap and lightly use a wire scourer, gets the food off but doesn't remove the oil from the iron. It helps if you do this straight after you serve whatever you are cooking, as the hotter the pan is, the easier food will come off it."
44112,You can also fill it with water and boil the waste off. Works for me.
44113,"No offense, but you should probably let people know about special kitchen items like this and/or don't store it in a public area. Still a shame it happened though, sorry for your loss :("
44114,The ONE TIME roommates wanna do the dishes...
44115,Its not a loss its a chance to start anew and build a new patina for your children and your children's children.
44116,"I love my cast iron.  I read awhile back that the use of soap and water after use was fine (it was a 7 myths about cast iron debunked article...can't remember where, sorry).  I had always thought as you do but decided to throw caution to the wind and wash them.  
They're fine...still non stick and still cook fantastically."
44117,"Most people mistake a burnt to a crisp charcoal coating as good seasoning, rather than polymerized oils that keep that sheen and non stick surface."
44118,"I think [that was my article!](http://www.seriouseats.com/2014/11/the-truth-about-cast-iron.html)

Yes: you can wash a cast iron pan and it will not destroy the seasoning, the reason being that seasoning is polymerized oil (I.E. a plastic bonded to the surface of the pan), so surfactants like soap which will break down oil will not affect it. Just be sure to dry it carefully, heat it up, and rub it with a little oil to protect it after each use."
44119,"I bet it was /u/J_Kenji_Lopez-Alt

Pretty sure he says some soap and water will not destroy the chemically bonded seasoning. Just make sure and dry it properly."
44120,http://www.seriouseats.com/2014/11/the-truth-about-cast-iron.html
44121,Hand-washing a cast iron pan with three generations of seasoning isn't gonna do much to it. Washing machines are a bit different.
44122,"if you put *any* pots or pans in a washing machine, you're gonna have a bad time."
44123,An electric toothbrush. Never looking back!
44124,"Sonicare is the best. My dentist noticed. Like I went for a cleaning and she said ""your gums look great"" etc. 


Also my teeth feel dentist clean all the time. So good."
44125,Just got my first Sonicare last month.  There is a HUGE difference between it and any other electric toothbrush I've owned.  Definitely worth the extra money.
44126,My mixtape
44127,Shits hot
44128,Fire*
44129,i can only pay in fire emojis
44131,Running shoes :)
44132,"I would take this a step further and say marathon entry fee.  

Pick one that's 6 months to a year away, enter, then tell all your friends and family, let them laugh.  There's no better way to dig yourself out of a slump than to make yourself the protagonist of an underdog story."
44133,"Just started the couch to 5k program.

No where near a marathon but it is a start. 

So excited."
44134,"Seconded. Doesn't even have to be an expensive pair. Just get some trainers, go out, enjoy nature, get fit, enjoy life :)"
44135,"An ereader. Unlimited free books are out there, nerds, waiting for you to read them."
44136,"Hot volumes in *your* area!

(you must be willing to read trashy novellas at a moment's notice)"
44137,A memory foam mattress topper. Instantly makes your bed better.
44138,"This one is for traveling. My wife has a pack of face wipes or makeup remover wipes, whatever. Let me tell you, running one of those all over your face is instantly refreshing, physically and psychologically, after a grueling (there is no other kind) plane/bus ride. Everyone perks up after a wet wipe to the face, you'd think they had a shot of tequila or something."
44139,First aid kit
44140,"I agree, I really liked their latest album."
44141,Silver Lining is amazing!
44142,99 cans of silly string and a cowboy hat or sombrero from the dollar store. Prove me wrong
44143,A keyboard. Learn to play some of your favorite songs. You will be surprised at the benefits of playing music.
44144,"First thought was /r/mechanicalkeyboards .






They really do improve the quality of life for your hands though, and ears. Those clicking sounds.... Yummm."
44146,"If you're on Teamspeak, the radius is indefinite."
44147,I have one with blue mx switches. The clicks are like music to my ears. Not so much to people around me though.
44148,"Had to return my blue mx keys the same day I got it for a brown.
I went from ""this sounds awesome""
To ""holy hell shut up"" pretty quickly"
44149,Where can you get a decent keyboard for less than 100 $?
44150,"Open another tab, google it, select your shipping and youre good. You dont need a baby grand to play mad world. My definition of ""decent"" keyboard does, however, include touch sensitive keys. Its not impossible."
44151,Rechargeable fork. Never again be at dinner and have to go buy a new one.
44153,Please explain.
44155,I was shocked when I found this out as a child.
44156,I've been charging mine in the microwave. It's much faster.
44157,Waterpick.
44158,"For me, it was an air filter for my bedroom. I used to wake up with a stuffy, sore nose, but now I feel 10x better when I wake up."
44159,"One of those alarm clocks that turn a lamp gradually brighter, instead of waking you up by brute force. Because of that thing, I no longer hate mornings, so now I have spare hate for more deserving things, such as the corner of my nightstand. Good times."
44160,"Well for less than $100 you can get a gym membership, then all you need to do is use your self discipli- oh wait."
44161,"Less that $100? For a year? Where is that, and how shitty is the gym?"
44162,"Running shoes and outside.

**Edit: yes you can buy running shoes for less than $100 if you think otherwise you are getting scammed.**"
44163,"Hah, I can go a year for about 80 dollars; only because I'm a student though."
44165,"Any tips on fleshlight* buying? 

Edit: fixed. Damn autocorrect."
44166,This might be the most innocent thing I've read all day.
44167,"Oh, honey..."
44168,Oh no..
44169,Should we tell him?
44170,i think so
44171,"I got this, guys.

/u/sznelly31, your phone probably comes with a flashlight so you don't need to pay $100 for one."
44172,And how the hell would he stick his dick into it if he wanted to? Unless he has a skinny-ass smartphone sized cock I suppose.
44173,Thundercock
44175,"It's OP, sooo..."
44176,Make sure it's made with 100% *real* flesh.
44178,"Just to let you know that wasn't a typo.  Fleshlight is something entirely different.
Edit: fixed"
44179,"False.  My fleshlight's cost me much more than $100.  She always wants to eat out all the fucking time, not to mention jewelry at least twice a year."
44181,It arouses her.  ( ͡° ͜ʖ ͡°)
44182,A lot of beer.
44183,A lot pf whiskey.
44184,New pillows
44185,A decent fishing rod. Let your troubles float away down the river while stocking your freezer with natures bounty.
44186,"Got rod, now, if only I had a river."
44187,"A tent. Go get out there, enjoy nature"
44188,"It's not just the tent though, camping gear is pricy.

A good sleeping bag and ground mat are bare minimum unless you want to freeze your balls off."
44189,"Yes, I agree a 100% I bought a tent and split it up between 3 friends we each paid like 50 bucks and the summers are always amazing when we get to camp somewhere for a whole weekend."
44190,I tried going outside once. Didn't like it.
44191,"A massage. Relax, destress, and refocus. They're fantastic."
44192,Earplugs
44193,"Adult flushable wet wipes.  
Once you have a clean crack, you never go back."
44194,"Get a bidet. More effective, and far cheaper in the long run."
44195,Is this where we debate the non-flushable characteristics of flushable butt wipes?
44196,Water dude. Half to two-third of the world uses it for ass-cleaning.
44197,"I agree, I poop every morning but no matter how much I wipe it just doesn't come clean so that is why I poop and then shower every morning"
44198,He's talking about bidets.
44200,as long as you don't shove your nails in your asshole like a savage you'll be good
44201,PERIOD DOT COM
44202,"I swear, random phases on this subreddit practically go meta before they're even said"
44203,"If you like to cook, a good cast iron pan and a couple of good knives."
44204,"Creuset.

That shit will outlast your kids and theirs."
44205,A couple good books can really put you in a great mood.
44206,"A professional proof reader for my thesis. My thesis partner is severely dyslexic (grammar, spelling, structure of sentences/paragraphs), so I have to rewrite most of her stuff to make it legible. 

I don't want her to feel guilty about this because I know she's vulnerable about it, so I don't mention how long it takes or suggest getting professional proof reading. 

But sheesh. It takes about 1/3 of the time it took to write it originally, and that's not even good enough because I'm a foreigner and taught myself this language so I'm not 100%. Though she thinks I am. 

Edit: I *will* throw $100 after someone willing to proofread after I've tidied up. And buy you beer. And feel eternal gratitude. Catch: it's 100 pages, and in Danish."
44207,Healthy food
44208,LSD
44209,$100 can get you a 20 strip in some places.  It's amazing how cheap this stuff is.  If only it was more readily available.
44211,Yeesh.  That's unfortunate.  The price is definitely going to further increase due to the fact that no one is making it anymore.  We've essentially been running on Pickard's leftovers for the past 15 years.
44212,[for those wondering who he's talking about](http://en.m.wikipedia.org/wiki/William_Leonard_Pickard)
44213,"Nope, we've been converting HBWR seeds' LSA to LSD using thionyl chloride and diethylamine.

Edit: ""we"" as in chemists, not me"
44214,"Just going to highjack this for a moment and let anyone who is considering trying LSD know about nbomes:

https://www.erowid.org/chemicals/nbome/

These are chemicals often sold as LSD but can be fatal if taken in even normal, recreational doses. Everyone should invest in a test kit if they want to buy and use illegal substances:

http://www.eztest.com/product/ez-test-for-lsd-2/

EDIT: I have nothing against using nbomes if you know what you're getting and choose to take them, knowing the inherent risks. However the safety profile of 25i in particular is just whack, you could take 2 tabs and be fine one day and die the next time you take 1."
44215,Dark souls
44216,2 handles of Buffalo trace.
44217,"If you work outside during the winter, a Carhartt jacket. One of the best things to help keep you warm when outside for an extended period of time"
44218,"Used fridge.

You can now save the leftover pizza instead of learning to cook."
44219,"If you sit at your desk a lot a good chair will be a lifesaver.  

Edit: A decent chair costs more than 100$, you could get an average chair at ikea tho.

Edit2: There's space between a and lot now huray."
44220,"$100 will not buy a good chair. 

We are talking $500+"
44221,"Better yet, a standing desk. You can buy desks that transform from standing to sitting with the press of a button but those are more than $100."
44222,A raspberry pi.
44223,"I just ordered one.  I can't wait to get it, although I'm not sure what I'm going to do with it."
44224,I've had one for a couple years.  Still not sure what to do with it.
44225,"A Dremel rotary tool. You might not need it now but as the saying goes ""when you have a hammer, everything starts to look like a nail."""
44226,"Library Card, should cost $0 and can change your life if you use it."
44227,"""Having fun isn't hard when you've got a library card!"""
44228,"*Jekyll Jekyll Hyde, Jekyll Hyde, Hyde, Jekyll!*"
44229,Oh dear god. This took me back.
44231,[For those who don't know what this is](http://www.youtube.com/watch?v=BezT0aygaQ0)
44233,I'm glad people got the reference :D
44234,"House plants, if you are inside a lot."
44235,"Upvote for houseplants. I got about 10 and it makes a world of difference in the aesthetic and quality of your indoor living space. And for those who say they can't keep a houseplant alive, houseplant411.com will tell you everything you need to know about just about every type of plant.

Houseplants. Yes."
44236,"My mom got me a plant for my room, I thought it was a stupid idea. Worthless and a waste of money. I've had it in there for over a month now, it just makes everything calmer and nicer. Maybe I'm getting old, but I love it."
44237,Maybe I'm getting old but I just realised that I have no plants and I'd like some. Shit.
44238,">because you are inside a lot.

FTFY (These are Redditors you're talking to.)"
44239,"A slow cooker.  15-30 minutes of prep at 10 AM, a week's worth of meals at 5 PM."
44240,"I almost exclusively make my oatmeal (steel cut) in a slow cooker overnight now.

Also, pasta sauce- One large can each of crushed and diced tomatoes, one can of tomato paste, half an onion chopped, 4 cloves of garlic diced, ~7-10 medium basil leaves chopped, then some oregano and thyme (dried, as I don't have plants yet). Add water to preference. Set on low for 7-8 hours. Tasty sauce that lasts me like a week. For extra awesome, add some meatballs."
44241,"Wanna make that pasta even tastier? Cook your pasta in nearly seawater-salty water. When it's 2 minutes away from being done, throw it in a large skillet with about half to a cup of the pasta water (the starchy salty water helps the flavor and consistency A LOT) with the sauce. Heat on high and cook until the sauce has absorbed all the water (should do so pretty quickly). Then add a slice of butter to give the sauce restaurant-quality silkiness and a good handful of a subtle harder cheese (like grana padano or pecorino, or a combo of both) to act as a binder. 

It will be the best spaghetti you have ever had, and it adds less than 5 minutes to the cook time."
44242,I gained ten pounds just reading this thread.
44243,Nigella Lawson once quoted some Italian bloke as saying your pasta water should be salty as the Mediterranean. I've never looked back.
44244,TIL slow-cooked oatmeal is a thing. I'll be trying that soon.
44245,"You don't even really need the slow-cooker. Steel cut oats brought to a boil and just left on the stove overnight without heat will slowly absorb the water and be ready for re-heating. 

Four cups water to every cup oats.

I like mine with a teaspoon of brown sugar and a tablespoon of peanut butter per bowl just before eating."
44246,I use brown sugar and flax seed meal. Flax seed ads +1 health and a nutty taste which I like.
44248,Non-smoked pulled pork?  Heathen.
44249,"While I agree with you, I once baked pork shoulder in a roasting pan with some root beer. So good.."
44250,"While that sounds delicious, I have to say that your Username is especially apt."
44251,"Is it just me, or is it a little unsettling to leave food heating in an appliance all day when you're not there to keep an eye on it?"
44252,you get over it by the second time you come home and are greeted by a prepared hot meal that tastes as good as it smells... i just pretend casper the friendly ghost is my private chef.
44253,Or Casper the less than friendly arsonist
44254,Perhaps that's how he become a ghost...
44255,You'll think that until you come home after a long day to the most heavenly smell you've ever experienced.  All your fears will be assuaged.
