idx,text
13540,"Yeah, I need to read papers for my work and I often have deadlines as short as a couple of days. My experience is that, even if they're willing to take the time to send you the paper, one week is about the median email response time for academics."
13541,"Agreed, similar experience"
13542,"First time I saw it, good to know!"
13543,Spread the word!
13544,It is not really true.  I have scientific publications but for many journals I don't own the article and cannot give out electronic copies for free.
13545,"I recently needed an article published in 1939, the journal wanted $55 for a copy of it, and I'm pretty sure the author is long dead.  The fact that they can charge that for a digital copy of something already digitized from 80 years ago is nuts.  I went to a university computer lab and downloaded it for free since most universities have access contracts with most journals."
13546,"Even the comments here are full of useful information, wish I knew this sooner!"
13547,"I thank you for your upvote as this is a discovery. In return, here is a [relevant XKCD](https://xkcd.com/1053/)."
13548,Of course I find this out in my last semester of college.
13549,"Right there with you brother, right there with you."
68869,how dare you
13551,My first stop is always http://sci-hub.tw
13552,"Or [the arXiv](https://arxiv.org/) for maths/physics/astrophysics+

It's basically tradition in astrophysics to put your papers on the arXiv to be accessed for free."
13553,Anyone know an equivlent for business studies?
13554,"There isn't an equivalent to arXiv, but papers may well be deposited openly in institutional repositories."
13555,I'm going back to university soon and my uni had some good sources but I found better ones hidden behind pay walls
13556,Try the [Social Science Research Network](https://ssrn.com/en/)
13557,Sci-hub works surprisingly well for that.
13558,[bioRxiv](www.biorxiv.org) for anything biologically related
13559,That should have worked...
13560,The URL should start with http://
13561,"Ze has the new WSIWG activated that excapes [,],(,)"
13562,">[bioRxiv](http://www.biorxiv.org)

ftfy"
13564,I love this site. Saved my GF a bunch of money on her books.
13565,Bookmark `javascript:location.hostname += '.sci-hub.tw'` and click that bookmark if you're ever on a paywalled article page.
13566,"Don't forget us over at /r/scholar too :)

(if you can't find what you need there!)"
13567,Great link!!
13568,That site did me a fat fucking favor for my statistics project. Thanks for linking it.
13569,There's also a SciHub telegram bot which works extremely well - you send it the DOI link and it replies with the PDF file
13570,God bless your soul
13571,Is it illegal to go there? I’m assuming it is to host things but not view them. I’ve never been because I’m afraid.
13572,"I don't know about the specifics of the law, but I know realistically, you'll be completely fine."
13573,Bro it’s fine lmao... what’s anyone gonna do
13574,Aaron Swartz would like a word
13575,Thanks for bringing it up. Never forget.
13576,Downloading movies off bittorrent is only illegal because you also share it with other people by default. The act of downloading alone isn't going to cause any problems.
13577,"Published researcher reporting in. Please, for the love of God, do this. I don't care how many times this gets (x)(re)posted, it's important for people to know. I'd rather share the knowledge for free -- we all stand on the shoulders of giants."
13578,"do you know, is it legal for others to distribute the paper for free once they have it?

Any reason authors don't put their papers up on their own media? (or maybe they do)"
13579,"Not legal to publicly distribute, but you should be able to privately send it to others. At least in my field, it's very common for researchers to post some form of the article on their website (journals don't have copyright over the preprint version, which is basically the word doc we submit to them which they then copyedit and make prettier).

Tip I use all the time: search for a paper on Google Scholar. On the results page under each hit there is an 'All X versions' link. Click that and it will show you all the places the article is posted on the web, often will have several free PDFs."
13580,Researchgate.net is also pretty popular among scientists for this purpose. Requesting and sharing papers takes one click.
13581,"This site is great, usually get a reply pretty fast and the researchers are nice too! Recommended to everyone that asks for help on searching full papers and related ones."
13582,"This is such an important thing if you are going into any scientific field of study. I have coworkers who complain constantly about preliminary research and not being able to get the paper they want to read. I always tell them to just email the author, Researchgate is a great tool, and 9/10 times they get a response the same day with the article and a pleasant response from the author who is excited someone took interest in their work. Just send an email! It can’t hurt"
13583,Glad to see a mention of Researchgate. It's a pretty cool resource for scientists.
13584,**[Very relevant XKCD](https://xkcd.com/2025/)**
13585,Funny and sad.
13586,the explainxkcd on that one goes in depth about the thing.
13587,"Where can I find the explanation? I see it tagged with a bot in some subs but never looked around on my own for it

Edit: [nevermind ](http://www.explainxkcd.com/wiki/index.php/2025:_Peer_Review)"
13588,"You can simply add `explain` at the beginning of the address for any XKCD comic; for example, in this case you would go to: https://explainxkcd.com/2025/"
13589,There is a reason sites like sci-hub are so popular.
13590,Also if you go to University; most have an online database thats part of the library division that will give you access to millions of these articles and journals.
13591,Dont set up a server on your own to download too many of these though...
13592,We put all of the world’s science behind a paywall and we wonder why antivaxxers exist 🙄
13593,"I don't think anti-vaxxers, or any significant portion of people are reading scientific studies regardless of paywalls."
13594,"We don’t put all the worlds science behind paywalls, people just don’t care about information that doesn’t affirm their priors."
13595,"Ever heard of pubmed? If they wanted to learn, they would"
13596,That indexes the papers and links them to the journal page but doesn't give you access.
13597,"/r/Scholar 

http://libgen.io/

https://sci-hub.tw/

Or just Google-fu (limit search results to PDF's, always check Google Scholar first to see if there is a PDF/full article link already available etc.)

And you can find most things."
13598,The professors should tell it every student at the start of every lecture...
13599,Extremely annoying as I referenced Dr.Witteman in one of my university (college) assignments and had to use very minimal information because I didn’t want to pay to access the paper 😩
13600,"Another LPT is that many universities have subscriptions to several scientific journals. Typically, your library's website will have information or a search engine that you can use. If that fails, talking to a librarian can be super helpful. They can sometimes request specific journals or articles for you."
13601,"I might just be living in my own bubble here, but surely this is University studying 101 and not an LPT? I thought everyone who studied at university would know this pretty much within the first week or so."
13602,"Many people are told, many people quickly forget. Either because they weren’t paying attention in the first place, were told poorly, professors don’t check sources, or have poor research habits. 

At my university there was a mandatory portion in one of the courses going through library resources. The professor was *terrible* at explaining how JSTOR worked. They made it seem so complicated that a lot of kids simply didn’t want to bother with sifting through the results. 

Few of my classes required more than what you would find at the bottom of a Wiki page for sources. With a reaction like yours, you’re probably in the smaller percentage of students that actually need access to these documents to do their work properly so you’re savvy. 

Most don’t need, so most don’t care."
13603,The lecturer didn’t explain it well at all and I couldn’t figure it out so I used to go to the library to find books but sports therapy was very limited for study material.
13604,"""Let us publish you article! You'll get paid in exposure of course."""
13605,"Researchers alternative is not to get paid for the article, but to instead pay for the publishing."
13606,"**On Open Access Repositories:**

I've seen this on Reddit before, and it's not a bad idea, but I also feel it's largely impractical. Most researchers/university faculty are extremely busy and will have difficulty getting back to you. The more popular the article, the more difficult it becomes to respond to requests. I've seen some suggestions for looking at open repositories, and depending on your research field, you might have varying success.

[https://arxiv.org/](https://arxiv.org/) was one of the first open repositories and remains a great place to look for physics (and more) related pre-print (after peer review, before copy editing) articles.

[https://www.biorxiv.org/](https://www.biorxiv.org/) is a biology focused pre-print repository.

Any research funded by the NIH is required to be posted on PubMed Central ([https://www.ncbi.nlm.nih.gov/pmc/](https://www.ncbi.nlm.nih.gov/pmc/)), typically after a relatively short embargo period.

MLA Commons ([https://mla.hcommons.org/](https://mla.hcommons.org/)) can be a good source of humanities related Open Access materials.

[https://socopen.org/](https://socopen.org/) is an open repository for sociology paper.

Many universities also maintain institutional repositories that publish pre-print version of works.

Google Scholar will generally find every link to a particular article, including pre-print versions on open access repositories, so it's a very valuable tool for research. If Google Scholar takes you to a pay walled version of the article, go back check out some of the other results and see if there's a link to pre-print.

There are many more open repositories out there for various fields, unfortunately they're not always easy to find. A librarian may be able to assist you. All the above repositories are legal options and are generally copyright compliant.

&#x200B;

**About researchers:**

It's important to point out that researchers have a role to play here as well. It's researchers that are choosing to publish their works in journals that are behind pay walls. There are compelling reasons to do this. Getting published in a well known, high impact journal goes a long way to helping you get tenure and those journals tend to be well established non-open access journals. Even a researcher who believes strongly in disseminating knowledge widely for the betterment of humanity will have a hard time ignoring career considerations. No researcher would turn down an opportunity to get published in Nature for example. (It should be noted that Nature does allow for some limited open access publishing).

&#x200B;

**If you're a researcher, what can you do to help make your research more widely available?**

First, check what kind of open access publishing rights are associated with your journal of choice on SHERPA/RoMEO ([http://www.sherpa.ac.uk/romeo/index.php](http://www.sherpa.ac.uk/romeo/index.php)). [For example](http://www.sherpa.ac.uk/romeo/search.php?jtitle=nature&issn=0028-0836&zetocpub=Nature+Publishing+Group&romeopub=Nature+Publishing+Group&fIDnum=|&mode=simple&la=en&version=&source=journal&sourceid=4008), we can see that Nature allows the posting of a pre-print to some of the above mentioned repositories, as well as institutional repositories. Remember though, SHERPA/RoMEO is not authoritative and you should always check your publishing agreement.

Second, negotiate your publishing agreement (often called a ""Copyright Transfer Agreement"") with your publisher. These are not written in stone. Many university libraries have a Scholarly Communications departments or teams who may be able to offer you guidance on that. Even if a publishers insists on taking over the copyright, you should be able to negotiate to retain the right to publish your pre-print on an institutional or subject matter repository. Remember, if you sign your rights away, they're gone. Just because you wrote it doesn't mean you can do what you like with it. If you're not comfortable negotiating with a publisher, [SPARC ](https://sparcopen.org/)has an [addendum ](https://sparcopen.org/our-work/author-rights/)you can use to modify a publisher agreement to be more in your favor.

&#x200B;"
13607,"https://unpaywall.org/ is well supported in the industry too, and is a legal way of finding open access versions of papers."
13608,"Even better when your professor wrote the textbook for the course.

""I know it says there is a required textbook for this course, but don't bother. You'll notice the author is me, I will teach you everything."""
13609,Is this the same situation though? Do the textbook authors get 0% while 100% goes to the publisher? I would have thought probably not.
13610,"It's time for Po.et!

Check it out by yourself."
13611,Or simply use Sci-hub.
13613,They should be! That's how you get cited.
13614,"I see this argument every time this photo is posted, and as a researcher, I very much disagree. 

If the research is published, there is no reason to not share it. Publishing is sharing it with the scientific community, already, so it's not like the researchers are gonna try and keep it secret from you."
13615,"In the age of sci-hub, you don't need to email anybody"
13616,Is there something inherently wrong with supporting scientific journals? I'm asking because on the surface it seems like they are providing a good service but sometimes there is more below the surface.
13617,"Scientific journal publishing has the highest profit margins of any industry: nearly 50%. So the fee isn't about ""supporting scientific journals"". Think of it more as supporting the shareholders. Journals like PLOS manage to make all their content openly available while having high academic standards, so support them rather than a system which keeps academic work locked away."
13618,"Although there are many journal publishers that are for profit, there are still quite a few that are non-profit. I work for a single-title journal publisher and any profit we make at the end of the year is funneled back into the journal to make it better for both readers and authors. Just wanted to point out that not all journal publishers care just about profit :)"
13619,Absolutely- hence my giving PLOS as an example of the alternative.
13620,Do studies published in journals get more readers than those that aren’t?
13621,"PLOS, free to use, has up to date papers submitted by academics."
13622,But only papers that have been submitted to PLOS - and not to any other journal. There are quite a few other open access publishers.
13623,"Probably a stupid question but, hypothetically, could you offer to venmo the author or something just to help them make money? Or would that violate the terms of having a publisher?"
13624,"no, you cannot fund scientists that way. But you can support Science by putting value in the evidence it produces!"
13625,Another good trick if you can’t get it for free and it’s from somewhere odd.... copy paste the title into google. Sometimes you can find a PDF of the paper! When you click the direct file link it will bring up the PDF for free and you won’t have to pay 60 dollars for a week access.
13626,"But how would you know there's even a paper to read, much less ask for?"
13627,Usually you can see a one page preview of a paper and have to pay for full access. This post is addressing cases like that.
13628,As author you basically give your work for someone to make money out of it.
13629,"This is very true.  Things like ResearchGate are out there to help facilitate this, but their website kinda sucks in my opinion"
13630,Doesn't the copyright belong to the publisher?
13631,"I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:

- [/r/linky_links] [How to get a scientific paper for free - r\/Damnthatsinteresting](https://www.reddit.com/r/Linky_links/comments/9b0h82/how_to_get_a_scientific_paper_for_free/)

&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*"
13632,"Or get it on Sci-hub for free, like every academic I know."
13633,"Also, inter-library loans. Especially at universities. Not sure about others, but my school lets the public check out books, so they might allow academic journals too."
13634,Capitalism
13635,"https://openaccessbutton.org

http://arxiv.org"
13636,"Another thing most people don't know about: journals don't run free of cost. They have staff and other important expenses. Support them when you can, since they mostly run on soft money."
13637,"Yeah because that’s a practical way to spread knowledge to everybody... the fact that I need to pay to have a subscription to see scientific articles is an obstacle to me and everyone else like me when it comes to being an informed citizen. Then you have to be able to discern what is a good paper and what isn’t, and if you rely on using papers that have been cited the most, then you rely on the majority being right which isn’t always the case. So I guess I have to send an email to the author of every single paper I want to review personally. This is a neat trick but doesn’t solve the bigger issue here which is the fact that knowledge is hidden behind too many barriers for the average person to get through reasonably. We gotta find a better way"
13638,u/moomoothepanda
13639,"N00b, Google Scholar can often times find them for free. Even then, just go to a damn library or go to a university library sit outside and connect to their wifi."
13640,Why is this the case? Do authors just sell all the rights to the publishers...?
13641,"More that the authors give away the rights for free ;)

In part, this is because the publisher handles the actual publishing (printing, mostly).

In part, this is because to have a succesful career as a scientist, you need to publish in prestigeous journals. But these journals only publish you if you sign away your rights."
13642,No you are not allowed to send it for free. You usually get 50 free copies to share after that it’s paid. Source: scientist
13643,"I thought the thread is talking about electronic copies, not paper copies."
13644,Why not just make a free-to-view peer-run online publishing co?  I'm sure a kickstart will be more than ample to get a server running.
13645,"The career incentives for scientists are to get published in the most prestigious journals in their field, not just to publish somewhere online. That said, some communities have done pretty much what you said. The ArXiv has been going for decades: [https://en.wikipedia.org/wiki/ArXiv](https://en.wikipedia.org/wiki/ArXiv)"
13646,I’ve tried that. Once I got no response and the second time the e-mail address didn’t even exist so I got discouraged. I’ll probably won’t bother anymore since my university days are over
13647,"Just go to sci-hub and punch the paper's URL into the search bar.

Is it a violation of copyright law? Yes.

Did you pay to support that research through taxes funding those research grants? Also yes.

So don't feel bad. Fuck Elsevier, McGraw-Hill, and every other blood-sucking bunch of shitheads profiting off of public education."
13648,How would you cite it without access to the journal's specific page numbers?
13649,"You can google the paper title and author and it should link you to the journal where it's hosted. The file is still behind a paywall, but you can see the bibliographic reference still"
13650,"Also the author may have the same PDF you'd get through the paywall, with all the citation info included."
13651,the PDF and the citation are two different things. You can always download the citation (use software such as EndNote). just click on the citation button/symbol e.g. in google scholar
13652,Google Scholar
13653,"Typically the metadata is available elsewhere, either on the publisher page or at crossref."
13654,"Does this apply to just scientific journals, or other journals as well (such as history)?"
13655,Should they all set up Patreons then?
13656,"I've seen people use patreon to fund research before. It's not the most effective method, but even a long shot is a shot."
13657,Not to mention how much as author you have to pay to make your paper have open access
13658,Yeah but how do I find the email for those people?
13659,"The names of the authors, and contact details for the corresponding author, are usually with the abstract."
13660,I just feel like this is really important
13661,r/AskTwitter
13662,This works! I’ve done it at least 20 times throughtout my undergrad.
13663,Want to see the author who wrote this paper? That's gonna be $40
13664,Just commenting on this in case I need it
13665,"Have a look at The Internet's Own Boy: The Story of Aaron Swartz, pay close attention at 28 minutes."
13666,This is one of the reasons I gave up my dream of a career in academia. So much stress and hard work for free. Maybe when I retire or if I win the lottery I could afford to do research again...
13667,"Not only is this good for getting free articles, it helps you network too. You can also discuss with authors about their findings"
13668,"SciElo is a good one as well. It's a Brazilian site, but it is in english and you can find several english/spanish papers on there."
13669,My mind has been blown for the day.
13670,But then it’s a question of how long would they do this everytime?
13671,"Tried this a few weeks ago, was told ""Sorry, don't have an electronic copy"" ... was a bit disappointed :/"
13672,Can confirm. Even when you google something and everything but the abstract is behind a paywall. Just google and email the researcher(s).
13673,"When used to do my PhD, I'd have free access to all papers. In the working life, I found that it was much easier to just email the authors than go through the article purchasing process"
13674,"My university offers a service where they will find *any* published document in the world, free of charge.

Maybe your university offers something similar? At the very least, they should provide a library that has all the newest publications of respected journals in your field."
13675,r/lifeprotips
13676,"Trusting tweets to include the whole story is a foolhardy idea. Perhaps we can ask them directly for the paper, but how long will it take to reach me? What happens when 10,000 people ask them for papers? I'm having doubts they have the time and/or resources to become distributors at zero cost to them."
13677,Interesting!
13678,Nice repost. Even used the SAME fucking link.
13679,"Ha ha nice try, no one wants to read your dissertation on totalitarian dance"
13680,"Such a gross simplification of this process. This is one of those things that seem good on paper but is actually inefficient and inconvenient for everyone involved. 

This statement is for the average student writing a research paper or average joe looking for something to learn."
13681,/r/LifeProTips
13682,Or just use scihub through tor.
13683,I feel like this should be printed in large text in every library in the world.
13684,"That may well put them in breach of their contract with said publisher, FYI. So this won't always work."
13685,"If you wanna share your results just post them online. Everyone can see and review the results.

These ""scientific"" journals are just parasites that actually hold back progress."
13686,"For finding free, full-text research articles, [Google Scholar](https://scholar.google.com/) is your friend. Just type in whatever you're looking for, and voila - you've got thousands of hits of fascinating articles on your topic of interest. Most of the results will be citations only, but you'd be surprised how many returns will include pdf's for the whole article. Here's how to find them:

1. While still on Google Scholar, look at the line of small print in blue at the bottom of each search result listing. Many of the articles have a link to ""All 5 versions"" (or however many). Click that link and a page will come up showing all the places listing that article. Often one or more of those places will say PDF or html. Those are generally the free, full-text versions you want. 

2. If Google Scholar doesn't have full-text of the article you want, you might still be able to find it elsewhere. Copy a key part of the article's title onto your clipboard and go over to regular Google. Type in filetype:pdf then paste your title snippet. You can further narrow the results by putting quotation marks around the title. This will find any non-academic sites that might carry your article.

That's the fastest and easiest way I know to get a lot of free, full-text articles. There are plenty of other free databases as well, each carrying different amounts of full-text versions. Here's a listing of some of the free databases I've found. Most are oriented toward medicine and the social sciences, with several databases for the hard sciences as well. I found some of them through [Wikipedia's list of academic databases and search engines](https://en.wikipedia.org/wiki/List_of_academic_databases_and_search_engines). You can do web searches for free databases in your particular field to find others.

[PubMed Central](http://www.ncbi.nlm.nih.gov/pmc/) (Full text). This database from the U.S. National Institutes of Health has more than 2 million open access, full-text studies that relate to public health and policy issues. The more general PubMed database contains more than 20 million articles, but some of them have restricted access. Both databases are worth searching.

[PubMED](http://www.ncbi.nlm.nih.gov/pubmed). This is a free site for searching MEDLINE through the National Library of Medicine.

[MEDLINEplus Health Information](https://www.nlm.nih.gov/medlineplus/). This free site from the National Library of Medicine provides authoritative consumer health information, including searches of MEDLINE, ClinicalTrials.gov, and NIH research studies. They include full-text drug information, a medical encyclopedia, and the latest health news.

[BioMed Central](http://www.biomedcentral.com/) (Full text). Provides access to over 100 free peer-reviewed journals in all areas of biology and medicine.

[Science Direct](http://www.sciencedirect.com/science/jrnlallbooks/all/open-access) (Full text). They archive open access articles from 480 journals, covering chemistry, medicine, economics, engineering, and more.

[Public Library of Science (PLoS)](https://www.plos.org/) (Full text). The flagship journal of this open-access academic project, PLoS One, features original peer-reviewed research on science and medical topics; many studies have policy implications.

[Directory of Open Access Journals (DOAJ)](https://doaj.org/) (Full text). Open access journals provide free online access to all users. The DOAJ is a one-stop shop for searching open access journals around the world (except those published in India).

[Directory of Open Access Repositories (Open DOAR)](http://www.opendoar.org/) (Full text). This site, run by the University of Nottingham (U.K.), gives you access to a collection of open access databases from around the world and across disciplines.

[HighWire](http://highwire.stanford.edu/lists/freeart.dtl). A library and database project from Stanford University that provides full access to a huge collection of research, including the hard sciences and social sciences.

[OCLC World Catalog](https://www.worldcat.org/). The world’s largest library catalog – find books, etc. near you. WorldCat is the collective library catalog of thousands of libraries: “Over 1 billion items in more than 10,000 libraries world wide.” They also have a mobile app available.

[Social Science Research Network](http://ssrn.com/en/). This open-access database has hundreds of thousands of important, current papers, many of which are available for free download as PDFs. Many of the articles are “working papers,” meaning they are in process toward a final, published form.

[Microsoft Academic Search](http://academic.research.microsoft.com/). This evolving database has tools for seeing connections between researchers and their work. It provides a “profile” of many academics and charts how their findings have been cited.

[Mendeley](https://www.mendeley.com/). Mendeley is a free reference management program that requires creating an account to use. They provide access to a database of crowd-sourced selected studies from participating scholars around the world. You can join this project and curate your own selection of papers. Not all their papers are open access.

[Science.gov](http://www.science.gov/) (Full text). Provides a gateway to information resources at U.S. government science agencies. Includes selected web sites and databases of technical reports, journal articles, conference proceedings, and other published materials.

[Open CRS](https://www.loc.gov/item/lcwa00096523/). The Congressional Research Service (CRS), a branch of the Library of Congress, operates as a quasi-think tank that provides reliable, unbiased background on policy issues. Open CRS aggregates government reports as they come into the public domain.

[National Bureau of Economic Research](http://nber.org/). The NBER is a nonprofit research organization that publishes top scholarship in the economics discipline. Many important articles first appear in working paper form here, and much of the scholarship has a broad, public policy focus.

[RAND Corporation](http://www.rand.org/). Non-partisan think tank that produces a wealth of information on social science topics. Some of the studies are by leading scholars who partner with RAND.

[Pew Research Center](http://www.pewresearch.org/). This leading survey and research organization is famous for their polling on salient issues in the news. Fewer people know they also sponsor lots of original research and provide deep, analytical reports about the issues.

[Russell Sage Foundation](http://www.russellsage.org/publications). An organization that is tied into a large network of social science scholars across the United States. With a particular focus on issues of inequality, social mobility, race, class and related issues.

Happy hunting!"
13687,"This would be great to use in our (developing) wiki. If you get us some links and post them in this comment, we can include it. Great post!"
13688,You're welcome to it. I've updated the material and the links. I hope lots of people benefit from it.
13689,"Wow, a wiki! Really? Can you share anything with us?"
13690,"Yes! We have just added this u/psiprof 's post as the first entry. We are looking for more databases to add if there are any others out there. There is also any ongoing stickied thread for wiki content that we hope readers will add some more to. This was a great question, thanks for posting this thread!"
13691,Perfect answer! Thanks a lot!
13692,"Pubmed central, try a local library or maybe a college. If that doesn't work, try /r/scholar ."
13693,"Do you have any friends who are faculty/staff/students at a university? Maybe they'd let you use their library/journal access.

If you can sign up for researchgate.net or academia.edu, some people share research there. Otherwise, people will often share articles with you directly if you email them."
13694,Use the twitter hashtag #icanhazpdf
13695,"If you're doing this, be sure to include an email address and to delete the tweet as soon as you receive your PDF, to protect yourself and the person who sends it to you since they're violating copyright."
13696,Yeah there are a lot of online guides to using it
13697,"You can always try emailing the author and ask for it if all else fails. The email address is usually under ""author information,"" and I've never seen that info behind a paywall.

Authors also sometimes post all their publications on their personal website. So even if they don't list their email you may still be able to find them by googling their name and institution and look through their webpage(s).

Sometimes I bug my friends in academia for particular articles.

If you've ever written about science for a news website, sometimes you can use that to get press access. But the quality of press access varies dramatically between publishers and this really only works if you're an actual member of the press. (Most journos I know don't know press access is a thing though, weirdly.)

Otherwise /u/psiprof has a pretty comprehensive list."
13698,"If you have the resources, just enroll in your local community college (after checking the library to ensure that they have the subscriptions that you want). Then, if you don't want to take any classes, drop them the next day, before the semester even starts. You may lose a bit of money depending on the policies on course fees at that school, but you'll have a legitimate login for some pretty comprehensive databases. Also student discounts to movie theaters, etc."
13699,"Or just connect to their WiFi. Often times you just need to be connected to the WiFi to get access. If you have a login, most universities also have a VPN so you can access restricted content off campus. 

Consider asking a friend at university if they're willing to let you use their login (or just send them the link and ask them to download it for you)"
13700,"A message from the moderators:

Please do not post a top-level reply to this thread unless you are contributing a paper from the peer-reviewed literature. If possible, please link to a PDF of the article that can be downloaded by everyone, not just those with journal subscriptions.

Also, arXiv is not a peer reviewed source."
13701,I love the Mods here. I don't think you'd find something like this in any other subreddit. Keep up the great work around here.
13702,"In most cases due to the screwed up nature of scientific publishing these days (screwed up meaning useful science is put behind commercial paywalls instead of being provided with free access for all, on a subsidized basis if necessary) these two conditions you suggest are mutually exclusive."
13703,"[Hodgkin and Huxley's classic 1952 papers describing the action potential.](http://www.sfn.org/skins/main/pdf/HistoryofNeuroscience/hodgkin5.pdf)

To think that, completely ignorant of the membrane proteins involved, they were able to develop a quantitative model that *accurately corresponds to ion channel subunits discovered decades later* is just fucking beautiful."
13704,this isn't some novelty account. I love that paper so much.
13705,"This is so utterly and completely fucking awesome, it blows my mind every time I think about it."
13706,"Same here, although I get the feeling everyone else is staring at us & mumbling under their breath about how weird the Neuro people are."
13707,Not at all - the CS people are grateful for our shunting activation equations in neural network equations :).
13708,"Also in the 1951-1952 was Fatt and Katz. The idea that they could use a histogram to show that synapses send signals in a quantized fashion blows my mind. They didn't even know about vesicles.

I'd like to point out this page from SFN.
http://www.sfn.org/index.aspx?pagename=HistoryofNeuroscience_classicpapers"
13709,"I remember reading a chemistry journal in iambic pentameter... I have to go find it.

EDIT: Found it! http://pubs.acs.org/doi/abs/10.1021/jo00800a036 Bunnett, J. Kearley Jr, F. ""Comparative mobility of halogens in reactions of dihalobenzenes with potassium amide in ammonia"" J. Org. Chem. **1971.** *36.* pp.184-6  This is awesome, particularly footnote 2."
13710,"I have to present a paper, any paper i want, for a chemistry seminar for an undergraduate chemistry class. I think i just found the paper I am using. Thanks!"
13711,"[Why Most Published Research Findings Are False](http://www.plosmedicine.org/article/info:doi/10.1371/journal.pmed.0020124) by John P. A. Ioannidis.
Informative *and* open-source."
13712,"Ah, the most cited PLoS paper, if I'm not mistaken.

I've read this before, and while it makes an interesting claim, I've found it a bit confusing and wasn't totally convinced. Looking over it now, I think he gives a lot of criteria for when research findings are false, but he doesn't really show why those should apply to most published findings. Or did I not fully understand the paper?"
13713,"While I'm not claiming to be a statistical genius by any means, this paper - along with Cohen's [The Earth is Round (p < .05)](http://www.psych.yorku.ca/sp/Amer%20Psychologist%201994%20Cohen%20Earth%20is%20Round.pdf) - helped me understand the limitations of inferential statistics and subsequently to avoid poor formulation in statistical measurement and design. 

[This article](http://marginalrevolution.com/marginalrevolution/2005/09/why_most_publis.html) helped clear up some the Ioannidis argument for me."
13714,"I've read the article you linked to, and will read the paper later. At the moment, I'm still not convinced that Ioannidis' arguments are applicable to findings that don't primarily rely on statistical tests - as is often the case in biology. If you measure something, and see it, and validate it, what is the probability that it's still incorrect?"
13716,"Thank you for being a bad motherfucker. EDIT Shrodinger's [""What is Life""](http://whatislife.stanford.edu/LoCo_files/What-is-Life.pdf) talks about how physicists are working in a statistical world, even if they don't realize it."
13717,"Well, not really. If I recall correctly (it's been a while since I read the book) Schrodinger is really talking about statistical mechanics which, despite having the word statistics in the title, is not really related to the statistics dearsomething is talking about. The statistics dearsomething is talking about is more the statistical testing of hypothesis (p-values and null hypothesis and whatnot) which appears absolutely no where in statistical mechanics. Heck even statistical mechanics makes very little use of the field of statistics. As Wikipedia suggests, it would be better called probability mechanics since it uses more ideas from that but, even then, it is rather limited. Also, keep in mind his book was was written 70 years ago when interpretations were very different and nowadays most physicists understand the probabilistic nature of the universe. However that's a debate for another day for the subtleties involved.

This type of statistics more refers experimentalists going into the lab and doing statistical analysis on data to confirm or deny a hypothesis. Unfortunately my knowledge of this is about just above zero since it was briefly discussed when I took my horrible statistics classes (why is statistics always taught so poorly? This seems to be universal, much to my dismay!)"
13718,"Well, drawing a dividing line between the study of statistics and the application of probability is pretty nearly impossible. In practice statistics is often taken as this horrible little booklet of broken methods which are (slightly) better than nothing, but underneath that surface misinterpretation is an incredibly rich connection to statistical mechanics. It's in fact difficult to separate the two theoretically.

I haven't read Shrodinger's book, though, so I haven't a clue whether what he talks about is relevant."
13719,"What chemists/physicists/biologists are you talking about? If your p-value is 0 you must have a discontinuous power function. If it's really an exclusive set of hypotheses then you must have a power of 1 for the rejection region. I.e. a single observation completely refutes or supports any claim like this...

So... Anatomical papers concerned with an individual's bone structure? Chemists isolating rare and dangerous substances and making only obvious claims for narrative purposes?

Even in those papers I could imagine someone being interested in getting a second opinion thus reflecting a desire to improve n, even if it's difficult or weird in practice.

--- 

But yeah, dearsomething is totally right here."
13720,">If your p-value is 0 you must have a discontinuous power function. If it's really an exclusive set of hypotheses then you must have a power of 1 for the rejection region. I.e. a single observation completely refutes or supports any claim like this...

Yes. In those very, very, very exact cases where there is only 1 variable, your p is 0 or 1; in effect, something happens or it doesn't — but this is not how it's reported at all. I'm just putting it into p-value terminology.

>Even in those papers I could imagine someone being interested in getting a second opinion thus reflecting a desire to improve n, even if it's difficult or weird in practice.

And that's why replication is critical, though, science in general today is more concerned with novelty. Or replication-if-extended-with-some-novelty.

STATS!"
13721,"STATS! *high five*

I don't think you have enough asterisks earmuffing how particular the circumstances you described are."
13722,Posts like this one make coming to this subreddit worthwhile. Thanks!
13724,">helped me understand the limitations of inferential statistics

Do you mean, more specifically, inference from the Null Hypothesis Significance Testing approach? Inference statistics are OK. Almost all statistical conclusions *are inference* — even those Bayesian weirdos."
13725,Indeed I do. I am *definitely* not as hard-core in stats as I'd like to be.
13726,"Two pages into the Cohen paper and I've already learned so much. Granted, my field doesn't deal with statistical analysis all that often, so I'm not an expert, but this is a fantastic paper."
13727,Can someone please summarize this without the math language?  I have not been in a math classroom for 10 years and the variables and equations are escaping me.  I've been googling all day and I dont' want to spend an hour trying to get a 2 sentence summary out of this.
13728,"We just read this article in a class just below Master's level. I don't know what level you're teaching, but if you're teaching first years students (I don't know the appropriate term, I'm not American), you may like one with less heavy mathematics. I personally like [False-Positive Psychology: Undisclosed Flexibility in Data Collection and Analysis Allows Presenting Anything as Significant](http://papers.ssrn.com/sol3/Delivery.cfm/SSRN_ID1939912_code713472.pdf?abstractid=1850704&mirid=1) by J. P. Simmons, L. D. Nelson and U Simonsohn a lot too. Although this is mostly relevant for psychology, I feel it can be generalized to other field with little replication and lots of statistical tools, like genetic biology."
13729,To add to this: [The P-value Fallacy](http://www.annals.org/content/130/12/995.abstract)
13730,Agreed. That article and Goodman's [followup on the Bayes Factor](http://www.annals.org/content/130/12/1005.full.pdf+html) are what got me interested in investigating how Bayesian analysis can be used in traditional psychology studies.
13731,[Einstein's 1905 paper describing special relativity](http://www.fourmilab.ch/etexts/einstein/specrel/www/) is a remarkably easy read; efficient and graceful.
13732,His PhD thesis was like 15 pages long.
13733,"It was actually 25 pages long.

I found it:

http://www.scribd.com/doc/11460732/a-New-Determination-of-Molecular-Dimensions-2"
13734,Came here to say something about Einstein papers.  His one on the EPR paradox is equally simple to grasp for an undergrad in physics.
13735,[Link](http://prola.aps.org/pdf/PR/v47/i10/p777_1)
13736,"I read it for a paper my junior year and I also thought it was a great leg up when I took quantum afterwards, because it explained entanglement very nicely."
13737,Yeah.  Entanglement is a funny thing.  I never understood why you can write the wavefunctions in the way that you do if you know what I am talking about.  It just seems like cheating sometimes :)
13738,Do you know where I could find Thomas Young's double slit experiment paper?
13740,"While it's labeled under the ""duh, of course that's important"" category by most people, it really is a well written document that explains a good idea quite painlessly.

Here is another gem, where Einstein derives E=mc^2, ""[Does the inertia of a body depend upon its energy-content?](http://www.fourmilab.ch/etexts/einstein/E_mc2/e_mc2.pdf)""

It's extremely short too."
13741,"“If you can't explain it simply, you don't understand it well enough.” 

-Albert Einstein"
13742,"First paper that came to mind for me as well.  Not only is the paper critically important, but it can be understood by anyone at all by just following the simple logic.  It restructured the world of physics with what amounts essentially to a thought experiment and clear, elegant method."
13743,"This is my favorite study: [Effects of remote, retroactive intercessory prayer on outcomes in patients with bloodstream infection: randomised controlled trial.](http://www.ncbi.nlm.nih.gov/pubmed/11751349)

The most brilliant piece of understated satire I've ever read in a scientific journal."
13744,"My personal favourite on the humour paper front would have to be [this one](http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1311997/pdf/jaba00061-0143a.pdf). Interestingly, that work has inspired a few [follow-up](http://www.amsciepub.com/doi/abs/10.2466/pms.1983.57.2.566) [studies](http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2078566/pdf/jaba-40-04-773.pdf) confirming the results and a review [article](http://www.amsciepub.com/doi/abs/10.2466/pms.1984.59.1.158) on the topic. The reviewer and editor comments are gold."
13745,It'll take me a few days to read through all these... do you have a tl;dr for the hurried scientist?
13746,"A brilliant choice. What's more, you can purchase 24 hr access to the PDF of Olson's review article for only $32.00!"
13747,"The satirical paper published in British Medical Journal argues that parachutes are a potential scam, as nobody has performed proper controlled trials: http://www.cugc.org.uk/cms/files/Parachute_Info.pdf

Bonus points for naming falling to your death as ""gravitational challenge."""
13748,I don't have access to it... And I don't quite get it from the abstract.
13749,"[Here you go](http://www.ncbi.nlm.nih.gov/pmc/articles/PMC61047/?tool=pubmed)  

The key word is ""retroactive."""
13750,"Retroactive: the people died or didn't a full *six years* before they were assigned to the control or experimental groups and prayed over.  It's pretty clear that god knew which ones were going to be prayed for, and interceded in just some of their cases."
13751,"> **CONCLUSION:**  Remote, retroactive intercessory prayer said for a group is associated with a shorter stay in hospital and shorter duration of fever in patients with a bloodstream infection and should be considered for use in clinical practice.

Can someone summarize how this conclusion was reached?"
13752,"The study was done on the basis that we can't assume that time is linear, or that God performs miracles in linear time. Therefore, the hypothesis is that retroactively praying for patients, years after their initial infection and death/recovery, would reduce their mortality.

They randomly selected half of the cases and gave someone a list of their first names for a prayer to be made for them. Then they went and looked up the final result of each case, and found that the patients who received retroactive prayer had a better survival rate. Given the design of the experiment, which excluded all confounding variables, they concluded that retroactive prayer reduces mortality.

The paper is free to access, and pretty short."
13753,"> Mortality was 28.1% (475/1691) in the intervention group and 30.2% (514/1702) in the control group (P for difference=0.4)

Not knowing statistics, do you think this is enough of a difference to go beyond chance?"
13754,"It is not enough, as that sentence tells you. There is a 40% chance that the differences are due to chance. However, the next sentence, ""Length of stay in hospital and duration of fever were significantly shorter in the intervention group than in the control group (P=0.01 and P=0.04, respectively)"" tells you that the length of stay and fever duration were significantly shorter, with 1% and 4% chances of error respectively."
13755,"I would have to go with [The Hallmarks of Cancer](http://en.wikipedia.org/wiki/The_Hallmarks_of_Cancer).  (pdf [here](http://www.weizmann.ac.il/home/fedomany/Bioinfo05/lecture6_Hanahan.pdf)).

If you have ever wanted to know how cancer works, this is the paper for you.  The authors go step by step through 6 molecular characteristics that almost all cancers share, including what they are, how they arise, and what they do/how they lead to cancer."
13756,"Ah, interesting, we recently discussed this paper at work, but I haven't read it yet.

Have you read the 2010 update? Is that as good? (When in doubt, I try to go with the newer paper, in case previous findings have been refuted.)"
13757,"Yes, the new paper is good, but builds on the results of the first.  It adds several new characteristics, and refines their previous discussion of angiogenesis and biologic immortality.  Anyone wanting to read it can find it [here](http://pharmacology.ucsd.edu/graduate/courseinfo/Block5-RecReading-2011%20Weinberg%20Updated%20Review.pdf) (pdf).  I would suggest reading it after the first."
13758,This is a definite must read. Explains a lot about cancer and its mechanisms in an extremely concise manner. The update to this first paper is also very helpful. The link for that is floating around somewhere here.
13759,Claude Shannon's [A Mathematical Theory of Communication](http://cm.bell-labs.com/cm/ms/what/shannonday/shannon1948.pdf)
13760,"Or his monograph, which is identical but for one word: The title was changed to ""*The* mathematical theory of communication."""
13761,"Indeed, that is a great paper. I'd probably recommend [Communication in the presence of noise](http://www.stanford.edu/class/ee104/shannonpaper.pdf) as a first read, though.

The historical context around the ideas in Shannon's papers is really interesting, especially how many of the same ideas were developed in Russia and Germany nearly simultaneously. It's both a fascinating paper and an interesting historical artifact."
13762,"I'm utterly biased but short, to the point and revolutionary: [Woese's 1977 paper outlining the discovery of the archaea](http://www.ncbi.nlm.nih.gov/pmc/articles/PMC432104/?tool=pmcentrez) (not formally classified as a separate domain of life until [this paper](http://www.pnas.org/content/87/12/4576.full.pdf+html)) 

Apart from that I also love whole exchange around the development of understanding into vesicle trafficking and in particular Jim Rothman's papers (brilliant experiments, great results, somewhat incorrect conclusions) but probably requires to get into field a bit too much to be of use for this exercise. 

I also love almost anything by [Sean Nee](http://homepages.ed.ac.uk/snee/publications.htm) because he does good science, reports it concisely and clearly and is entirely irreverent (for an amusing, single page, incredibly accessible essay by him (not a paper) check out [the Great Chain of Being](http://homepages.ed.ac.uk/snee/chain.pdf).

Finally, for a wonderful example of scientific squabbling and missing each other's points there is [Trewavas' Green Plants as Intelligent Organisms](http://www.mediafire.com/?8d4p7dygrum1oaf), to which there was [this 33 prominent author backlash](http://blumwald.ucdavis.edu/publications/Alpi%202007.pdf) followed by Trewavas' [reply](http://www.linv.org/images/about_pdf/Trends%202007%20Trewavas.pdf)."
13763,"Francis Crick - Molecular Structure of Nucleic acids(DNA)
http://www.nature.com/nature/dna50/watsoncrick.pdf
Great paper, and very short!"
13764,"This also includes one of the greatest understatements of all time: 

> ""It has not escaped our notice that the specific pairing we have postulated immediately suggests a possible copying mechanism for the genetic material."""
13765,This is the last time Watson and Crick were modest about anything.
13766,"God, I know - I've read Watson's autobiography."
13767,"This is my favorite line in any historic paper I've read. I believe true genius is displayed in how forward thinking they would be. Before anyone could debate conservative vs despersive vs nonconservative, they already had the correct theory. Simply brilliant."
13768,"I first read their original paper a few months ago, and the professor commented on that sentence specifically. Hilarious understatement."
13769,"If you present this paper to your class, please talk about Rosalind Franklin, the woman who collected all the data for the paper and who did not choose to share it with the two men who won the Nobel Prize for interpreting it. You'll find her name mentioned in the acknowledgements of the paper. 


""Would Watson and Crick have been able to formulate their ingenious model without seeing Franklin's then unpublished data? Was Watson and Crick's unauthorized use of their competitor's data within the accepted rules of scientific practice? ""


Source:


http://www.nature.com/embor/journal/v4/n1/full/embor723.html"
13770,"Thanks for pointing that out. I remember reading about this ""snub"" before."
13771,"""The Double Helix"" is Watson's account of the discovery, and goes into their dealings with Franklin in a fair amount of detail.  Might be interesting to read for some perspective, if you decide to present this paper.  Or even if you don't, it's a compelling book.  I read it in an evening--couldn't put it down."
13772,"Watson was a huge asshole.  He said he'd never hire fat people, for example (let alone blacks) He was also pretty misogynistic.  It wouldn't surprise me if he would minimize her work in order to make himself look better."
13773,">Watson was a huge asshole.

Sounds like [Edison](http://www.youtube.com/watch?v=3gOR91oentQ&t=2m28s)."
13774,"A great read but, my god, that man is severely misogynistic! One of his main complaints about Franklin is that she was unattractive in his opinion and wasn't flirty. His book makes me respect Franklin even more because it shows the type of disrespect she had to deal with from men who were supposed to be her peers. I suppose it was the times, though. 

EDIT: The Dark Lady of DNA by Brenda Maddox is an excellent read and does a great job of showing the hostility Franklin had to deal with in her short life."
13776,This is also important. She would have been awarded the Nobel Prize if she was still alive. The reason she gets no credit is just as much due to her death as it is Watson and Crick.
13777,"~~Incorrect! That rule was put in place explicitly in 1974. Watson, Crick, and Wilkins won their Nobel in 1962.~~

Edit: So, as pointed out below, it has been noted that posthumous awards were possible before 1974, but not posthumous nominations."
13778,Incorrect!  Posthumous awards were never allowed.  The 1974 rule merely clarifies how recent a person's death can be before they become ineligible.
13779,"Which rule? The ""no dead people"" rule?"
13780,"Yep. [So says the Nobel prize's own page.](http://www.nobelprize.org/nobel_prizes/peace/shortfacts.html)

>There is one posthumous Nobel Peace Prize, to Dag Hammarskjöld in 1961. From 1974, the Statutes of the Nobel Foundation stipulate that a Prize cannot be awarded posthumously, unless death has occurred after the announcement of the Nobel Prize. Before 1974, the Nobel Prize was also awarded posthumously to Erik Axel Karlfeldt (Nobel Prize in Literature 1931)."
13781,"That doesn't mean she shouldn't have been mentioned in the paper, especially since she was still alive when it was published."
13782,"Let's not forget Erwin Chargaff, who felt snubbed as well. Paraphrased - it is late in the day when such pygmies cast such long shadows.

http://www.nytimes.com/2003/10/20/opinion/no-nobel-prize-for-whining.html?pagewanted=2&src=pm"
13783,"V v important, awful how little credit she gets."
13784,"And very understated, almost comically so, considering its vast implications for all of biology."
13785,"That is why I love it so much. I think Mark Twain had it right: ""If you've got something good to say, it shouldn't take you very long to say it"""
13786,That's hardly true :P
13788,"Now I'm no expert on DNA structure (I know more about proteins) but...

Wikipedia says :
>An important structural feature of RNA that distinguishes it from DNA is the presence of a hydroxyl group at the 2' position of the ribose sugar. The presence of this functional group causes the helix to adopt the A-form geometry rather than the B-form most commonly observed in DNA

And W&C made a model of *B-DNA* not A. So I think they had a point. Incidentally, the iconic double helix image in that paper was drawn by Crick's wife, Odile (http://en.wikipedia.org/wiki/Odile_Crick).

(oh, and I signed up to post this :)"
13789,"Watson recently gave a talk at CERN, during which he mentioned a mistake that he and Crick let slip in their paper.  I don't know much about biology, but I believe this was the mistake he mentioned.  You can watch a video of his talk [here](http://cdsweb.cern.ch/record/1380325).  

**edit:** He mentions the mistake at 37:50."
13790,"Thanks, that was interesting. A bit uncomfortable, given how much justification he felt he had to do about the 'data stealing' question. Clearly still defensive about it 50 years later!

He says at 38 mins in (IIRC) that the RNA thing was a mistake, and that it would only have been slightly different."
13792,"It's an _important_ paper. But I don't see how it's a great paper in-itself. By today's standards, it probably wouldn't get published, and for some good reasons: 

Crick and Watson weren't reporting any new experimental results, or any new theoretical results (such as some calculations from spectrscopic data), or even a detailed theory from which they made any predictions. It's just an opinion. In short, ""This is what we think the DNA molecule looks like"", based mainly on other people's unpublished results. Of course it's short and easy to read; it's basically a long ""discussion"" section of a paper, rather than an actual paper.

Today, at the very least they'd have to write a review or something to be able to state an opinion without evidence. You're not going to get a _Nature_ publication out of ""Other people's unpublished results suggest to us that it's like this""."
13793,"The Watson-Crick paper rests partly on plagiarism. They pretend not to have known about Rosalind Franklin's work. ""We were not aware of the results presented there"" is only true if you interpret it to mean ""we didn't read these papers themselves"". They were hugely influenced by X-ray no. 51 by Franklin, which Maurice Wilkins showed them. Also, they has some insights but were fudging around, and Wilkins helped them tremendously."
13794,"I don't think the idea that they stole or used data from Franklin is unknown. While I do think it's important that people are aware of this, that fact is not really relevant to the discussion at hand, which is about well written and concise papers."
13795,"They acknowledged Franklin's contribution in their paper thus:

""We have also been stimulated by a knowledge of the general nature of the unpublished experimental results of Dr. M. H. F. Wilkins, Dr. R. E. Franklin and their co-workers at Kings College London.""

Wilkins shared the Nobel with Watson and Crick, Franklin was dead, as has been pointed out."
13796,So well written and I love how brief it is! I wish papers were like that nowadays!
13797,[Computing Machinery and Intelligence](http://cogprints.org/499/1/turing.html) by Alan Turing. An easy and enjoyable read even for laymen.
13798,"HOW COULD I FORGET THIS? Turing's [Intelligent Machinery](http://www.alanturing.net/intelligent_machinery/) is super badass and also proposes neural networks, genetic algorithms and swarm intelligence *way before* anyone else."
13799,"While a good paper, we should keep in mind that modern AI researchers may not necessarily care about the answer to this question. Instead, many AI researchers have noted along the lines of Dijkstra's famous quote, ""The question of whether Machines Can Think... is about as relevant as the question of whether Submarines Can Swim."" Most AI research these days is less about passing the Turing test and more about doing useful computation in subfields."
13800,"This paper is one of the most misinterpreted papers in CS. Partly that is because of proliferation of summaries of it, partly because popular media has projected the ""Turing Test"" as a way to determine if computers ""think"". Each person in turn, uses his own definition of ""thinking"". Let me quote from the paper itself ;

> The original question, ""Can machines think?"" I believe to be too meaningless to deserve discussion. 

As you said, many modern researchers don't really care whether a machine is ""intelligent"" or not, but care about what it can do. Turing does explicitly talks about this at the end.

> We may hope that machines will eventually compete with men in all purely intellectual fields. But which are the best ones to start with? Even this is a difficult decision. Many people think that a very abstract activity, like the playing of chess, would be best. It can also be maintained that it is best to provide the machine with the best sense organs that money can buy, and then teach it to understand and speak English."
13801,"And along those lines, [A Symbolic Analysis of Relay and Switching Circuits, [Shannon, 1937]](http://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=3&ved=0CDEQFjAC&url=http%3A%2F%2Fdspace.mit.edu%2Fbitstream%2Fhandle%2F1721.1%2F11173%2F34541425.pdf&ei=cte5TpigD9G5tgfn0LmpBw&usg=AFQjCNGUOXHAvRtv7ezgLB-j5meb7lIRlw)."
13802,"I would prefer [A Mathematical Theory of Communication](http://cm.bell-labs.com/cm/ms/what/shannonday/paper.html).

[Edit: Of course this had to be mentioned below, duhh.]"
13803,"[The tragedy of the commons](http://www.sciencemag.org/content/162/3859/1243)

It's an interesting paper whose importance grows by the second."
13804,"I'm surprised this is so far down the thread, it's one of the most cited and influential papers of all time."
13805,"Kahneman & Tversky's prospect theory is great. Here is an easy to read (hard to accept) [review paper](http://webs.wofford.edu/pechwj/Choices,%20Values,%20and%20Frames.pdf).  They won the nobel prize in economics."
13806,Another great example in the field of economics is The Market for Lemons by George Akerlof on asymetric information.
13807,"More is Different - By Nobel prize winner Phil Anderson.

Many advisors make their prospective students read this paper before they are willing to take them on as RA's.  I still read this paper about once a year.  It helps me stay inspired as a scientist. 

http://robotics.cs.tamu.edu/dshell/cs689/papers/anderson72more_is_different.pdf"
13808,relevant [xkcd](http://xkcd.com/435/)
13809,"My goodness, that is a beautiful paper.  Thanks for that."
13810,"[Platt, ""Strong Inference,""](http://scholar.googleusercontent.com/scholar?q=cache:3f8TlWK12EIJ:scholar.google.com/+platt,+strong+inference&hl=en&as_sdt=0,33).  It's about doing science.  If you're ever going to go into research, it's a really good one to read.

I linked to an html version, but a pdf is readily available.

Also, [Why Snakes Have Forked Tongues](http://www.csus.edu/indiv/b/baxterj/bio160/readings/Schwenk%201994.pdf)  just because it's something we've all wondered, and it was a good paper."
13811,"BMJ ran this fabulous little work of satire a few years ago: http://www.bmj.com/content/327/7429/1459.abstract.

It's a literature review of the efficacy of parachutes and ends with a recommendation for randomized control trials or something fantastically short-sighted. The paper is structurally and methodologically solid. And it's a great warning against losing perspective while slavishly devoting oneself to format."
13812,"It's not quite a paper (though it has been cited 1000 times) as much as the edited transcript of a technical talk, but Purcell's [Life at Low Reynolds Number](http://www.damtp.cam.ac.uk/user/gold/pdfs/purcell.pdf) has spectactular breadth and clarity of content.  It is mandatory reading if you're interested in physics at the biological scale.  It was a tremendous pleasure to read and read again."
13813,"Seconding this. So far, it has been the one paper that I found actually interesting and engaging, instead of a boring slog. Fascinating stuff!"
13814,"This, or just about any [paper](http://prola.aps.org/abstract/PR/v94/i3/p630_1) by E.M. Purcell. He has Feynman-like qualities in the sense that he has the ability to describe difficult concepts very clearly, also in very technical papers."
13893,"Hey, friends, I just made a folder of these files for my own purposes, so I t thought I might share it. Here are all of the PDFs and replies for comments above 10 upvotes (at the time of posting). Hope that's okay, mods. 

http://www.megaupload.com/?d=4FM6JGKF"
13816,Aaaaaaaaaaand it's gone
13817,[How to Write a Scientific Paper](http://yjsy.nenu.edu.cn/downloads/jiao%27an/Writing%20a%20Paper.pdf) by Whitesides. It's a paper on how to write a paper. It's awesome.
13818,"Mendel's paper on inheritance.   Foundation for modern genetics.

http://www.esp.org/foundations/genetics/classical/gm-65-a.pdf"
13819,"My favorite is the one describing the famous Miller experiment:
^ Miller, Stanley L. (May 1953). ""Production of Amino Acids Under Possible Primitive Earth Conditions"" (PDF). Science 117 (3046): 528. doi:10.1126/science.117.3046.528. PMID 13056598.

Why? This was a deceptively simple experiment, using simple concepts and reagents and very basic (primitive?) analysis techniques (thin layer chromatography) which produced a groundbreaking result: key insights into how life began."
13820,"* [The Dieter's Paradox](http://www.myscp.org/pdf/short%20articles/JCPS_10-00088_180.pdf) — because people estimate that more food means less calories. Fascinating!

* Not a paper, but really insightful into a particular set of researchers: [Talking Nets: An Oral History of Neural Networks](http://www.amazon.com/Talking-Nets-History-Neural-Networks/dp/0262011670).

* [""How reliable are the results from functional magnetic resonance imaging?""](http://dx.doi.org/10.1111/j.1749-6632.2010.05446.x) - but I prefer [this version much more!](http://prefrontal.org/files/posters/Bennett-Salmon-2009.pdf). — it shows how *not* to do things in fMRI - with fish!

* And [Haxby's](http://www.sciencemag.org/cgi/content/abstract/293/5539/2425) classic 2001 paper — one of the *coolest* papers to show that there are specific parts of the brain that respond in specific ways to specific types of stimuli."
13821,The fMRI manuscript was finally published here: http://www.jsur.org/v1n1p1
13822,FINALLY. I know Bennet had some trouble getting it out there. That's really exciting.
13823,"Kurt Adelberger (astronomer) is the best writer of scientific papers I've come across. Ha manages to put popular-science-style exciting prose into professional research papers. An example here:

http://arxiv.org/abs/astro-ph/0401445

The first paragraph:

>As the photons from the microwave background stream towards earth they are gradually joined by other photons, first by those produced in the occasional recombinations of the intergalactic medium, later by those cast off from cooling H2 molecules, later still, after hundreds of millions of years, by increasing numbers from quasars and galaxies, by bremsstrahlung from the hot gas in galaxy groups and clusters, and finally, shortly before impact, by photons emitted by the Milky Way’s own gas and stars and dust. All reach the earth together. They provide a record of the history of the universe throughout its evolution, but it is a confused record. Two photons that simultaneously pierce the same pixel of a detector may have been emitted billions of years apart by regions of the universe that were in vastly different stages of evolution. One of the challenges in observational cosmology is to separate the layers of history that we on earth receive superposed."
13824,"Robert Sapolsky's ""Social Status in Health in Humans and Other Animals"" - concise, clear, AND interesting

http://www.jstor.org/pss/25064859"
13825,"I've put a lot of effort into finding good modern science writing for insiders.  Until this thread, my best single source of leads has been the Oxford Book of Modern Science Writing, edited by Dawkins.  But its mostly popular writing by insiders.   I can't say that I've read a post-1980 scientific paper that has made me think ""This is well-written.""  Something happened after the 50s.  



From cognitive science, 

* I second George Miller's magic number 7+-2 and Herbert Simon's Architecture of Complexity.  
Adding:
* Tolman (1948) ""Cognitive Maps in Rats and Men"" http://colinallen.dnsalias.org/Secure/1948-Tolman.pdf
* Shepard, R., & Metzler, J. (1971). Mental rotation of three-dimensional objects. Science, 171(3972), 701. http://www.cs.virginia.edu/~evans/cs1120-f09/ps/ps3/mental-rotation.pdf 



I also keep a collection of horrible sentences.   

* This is from the abstract of a paper on sentence comprehension: """"Arguments are made for autonomy of the lexical access process of a model of semantic context effects is offered."""" 
Swinney, D. (1979). Lexical access during sentence comprehension: (Re)consideration of context effects. Journal of verbal learning and verbal behavior, 18(6), 645–659.
* Here is another recent entry into the collection: 
http://enfascination.com/wiki/Weblog:A_snippet_from_my_collection_of_bad_science_writing
* And here is the worst I've seen:
""""A further - quite different - but potentially equally and in the long run probably even more important but also more debated stream of research is the recent combination of neuroscience with experimental and behavioral economics.""""
Riedl, A. (2009). Behavioral and Experimental Economics Can Inform Public Policy: Some Thoughts. CESIFO Working Papers, 1–37."
13826,Personally I really like [Strong Inference by Platt  from 1964](http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.152.2513&rep=rep1&type=pdf). (PDF download warning) It not only concisely and effectively outlines the reasons why we bother with the scientific method as opposed to observational research but also basically issued a massive 'fuck you' to every field outside of molecular biology and physics. It has some really great lines in it and it's criticisms are easy to follow and still relevant to all fields of science today.
13827,should have ctrl f'd!  I also suggested Platt.
13828,I always like [George Miller's *The Magical Number Seven (Plus or Minus Two)*.](http://cogprints.org/730/1/miller.html)
13829,[Fire and Mello RNAi paper](http://www.nature.com/nature/journal/v391/n6669/full/391806a0.html)  Not only is the paper a pleasure to read its importance can't be understated.  They were awarded the Nobel Prize 8 years later and this paper has been cited approximately 2x per day since publication.
13830,"Might I also suggest reading this as well, as it is quite relevant, and I believe that Waterhouse *et al.* made significant contributions to the field before Fire and Mellos paper. http://www.pnas.org/content/95/23/13959.full.pdf"
13831,[Nothing in Biology Makes Sense Except in the Light of Evolution](http://en.wikipedia.org/wiki/Nothing_in_Biology_Makes_Sense_Except_in_the_Light_of_Evolution) seems perfect for your class.
13832,"Edmund Gettier: ""Is Justified True Belief Knowledge?"" in Analysis, v. 23. Available at http://www.ditext.com/gettier/gettier.html
3 pages of earth shattering profoundness. Just when philosophers thought they were on the verge of actually solving a problem, along comes Gettier and nips that nonsense in the bud!"
13834,"Well, [this](http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1311997/pdf/jaba00061-0143a.pdf) might be even more concise, but for reasons I cannot quite fathom, it never won the author a Nobel Prize. Might have been a contender for an IgNobel Prize, though, if it hadn't been published too early.

There's also a follow-up [here](http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2078566/pdf/jaba-40-04-773.pdf); both have been on reddit before."
13835,"I tried accessing this paper, but was unable to find a version without restrictions. How can a paper from 1949 still not be freely available?"
13836,"Maybe ""old"" (2009) news now, but I found George Church's [MAGE paper](http://www.nature.com/nature/journal/v460/n7257/full/nature08187.html) a fascinating read when it came out."
13837,"[The Best of Nature](http://www.nature.com/nature/history/century.html) is a great place to look.  Surely journal article standards have changed, but there's something missing in contemporary articles."
13838,"One of my favorites: 

[Inhibition of Cell Division in Escherichia Coli by Electrolysis Products from a Platinum Electrode](http://www.nature.com/nature/journal/v205/n4972/abs/205698a0.html).

This is especially awesome since they started out with an incorrect hypothesis and still found an effect.  Through careful controls they determined the true nature of the novel and serendipitous discovery which became one of the first effective cancer treatments.  Its concise and well written as well.

Another more sobering choice might be:

Winstein, S. Bycycloheptadiene Dibromides. Journal of the American Chemical Society 83, 1516-1517 (1961).

What makes this article interesting is the warning at the end, a reminder that lab safety should be paramount even when working with presumably benign substances.

>There is no a priori reason  to believe that these 
particular  compounds  are more  dangerous  to man 
than  several  related   substances  widely  used  as 
industrial chemicals; however, of  the three labora- 
tory  workers who  have  used  the  dibromides  and 
bromohydrin, two later  developed similar 
pulmonary  disorders  which  contributed  to  their 
subsequent   deaths.   The   third   has   exhibited 
minor skin sensitivity reactions. 
>Although  we  are aware  of  no prior  toxicological 
history  of   these  compounds,  one  cannot  ignore 
the  possibility   of   an  insidious  long-term   effect 
unknown  to  medicine.    Until  further information 
is  obtained  from  toxicological  testing,  we  recom- 
mend  that  the  compounds  be  handled  only  with 
extreme  caution,  and  that  all  persons  concerned 
with their use be informed of  their possible danger- 
ous  propensities. 

>We would  appreciate any toxicological informa- 
tion on the above-mentioned or related compounds."
13839,"I really like Rodney Brooks' 1999 paper [Intelligence Without Representation](http://people.csail.mit.edu/brooks/papers/representation.pdf), one of the few papers I remember from when I was studying artificial intelligence. The paper argues against a dominant trend in AI at the time and for a radically different approach. His central rhetorical device --- comparing artificial intelligence to the study of artificial flight --- is an idea that has stuck with me ever since I read it."
13840,"Seymour Benzer's ""Fine structure of a genetic region in bacteriophage"" is da shiznit and a classic. 

http://www.ncbi.nlm.nih.gov/pmc/articles/PMC528093/"
13841,"The solution to one of the most famous mathematics problems of all time:

http://math.stanford.edu/~lekheng/flt/wiles.pdf

Fermat's Last Theorem."
13842,"[Linus Pauling - The Nature of the Chemical Bond](http://osulibrary.oregonstate.edu/specialcollections/coll/pauling/bond/papers/1931p.3.html)

I'm pretty sure it's the most cited paper in all of chemistry, and for good reason. It's a pretty easy read, and the concepts contained within are still very much relevant."
13843,"[The Market For Lemons](http://books.google.com/books?hl=en&lr=&id=hkaigWlUSsoC&oi=fnd&pg=PA201&dq=The+market+for+lemons&ots=7VwqleIJ7Q&sig=4K7gJlMue3po82ZLdCaGgLEuJy8#v=onepage&q=The%20market%20for%20lemons&f=false), by George Akerlof. Decades of people taking shots at the neoclassical economy building unsuccesfully, and this guy comes along with the simplest example and tears it down easily. He got a Nobel for it, too."
13844,"Gould and Lewontin's [Spandrel Paper](http://www.aaas.org/spp/dser/03_Areas/evolution/perspectives/Gould_Lewontin_1979.shtml) is generally considered to be one of the more important ones, whether or not you agree with it. It was presented to me as something I should be able to say I had read, by a professor who had taken to calling the authors ""The Harvard Commies""."
13845,[The importance of stupidity in scientific research](http://jcs.biologists.org/content/121/11/1771.full.pdf). Pretty self explanatory and a nice handout for a Biology class.
13846,"Although this is a one page essay, it's quite interesting and entertaining!"
13847,"This is one of the more jocular articles I've read:

[Effects of Sexual Activity on Beard Growth in Man](http://www.nature.com/nature/journal/v226/n5248/abs/226869a0.html)"
13848,"If you're looking for a more modern paper, [Takahashi and Yamanaka paper](http://www.ncbi.nlm.nih.gov/pubmed/16904174) on iPS cells  is a good one, especially if you want to teach methods/concepts used in current research. This is a paper that played a pivotal role in the stem cell field. Classic papers are good; methods and concepts are important to understand, can be demonstrated and largely accepted. The Yamanaka paper is a classic paper of a currently, still evolving, and (somewhat politically) controversial field. The series of studies presented in the paper are really tour-de-force experiments."
