idx,text
37569,Im curious why you chose KD over Busch Gardens?
37570,Coaster collection and the atmosphere while maybe not as great as Busch is still good
37571,I don’t see The Revenant ranking anywhere in that list so……thumbs down.
37572,8/10
37573,Beautiful.
37574,"My loose overall ranking looks something like this:

**Top tier:**

Avengers: Endgame

Thor: Ragnarok

Captain America: The Winter Soldier

Avengers: Infinity War

The Avengers


**Mid tier**


Thor

Captain America: The First Avenger

Iron Man

Iron Man 2

Captain America: Civil War

Doctor Strange

Ant-Man

Spider-Man: Far From Home

Guardians of the Galaxy

Black Panther

**Bottom tier**


Thor: The Dark World

Ant-Man and the Wasp

Iron Man 3

Spider-Man: Homecoming

Avengers: Age of Ultron

Guardians of the Galaxy Vol. 2

Captain Marvel




**Not seen:**

The Incredible Hulk

The order within each tier might not be completely static, but is probably more or less accurate."
37575,"It’s possible we’ve talked about this before, but since there wasn’t a thread about it fully, why is Homecoming in the bottom tier?"
37576,"Basically Homecoming to me is just mostly a forgettable film.  It's not *bad*, I just find that the *only* thing I even remember about it is that Michael Keaton is great in it.  

I liked Far From Home more than I thought I was going to, so maybe I'll go back and re-watch Homecoming again sometime.  It's one of the only ones I've seen only once."
37577,"1. Captain America: The Winter Soldier
2. Avengers: Infinity War
3. Avengers: Endgame
4. Black Panther
5. Guardians of the Galaxy Vol 2
6. The Avengers
7. Iron Man 3
8. Iron Man
9. Guardians of the Galaxy
10. Spider-Man: Homecoming
11. Captain America: Civil War
12. Thor: Ragnarok 
13. Captain America: The First Avenger
14. Avengers: Age of Ultron
15. Ant-Man and The Wasp 
16. Doctor Strange
17. Ant-Man
18. Thor 
19. Captain Marvel
20. The Incredible Hulk
21. Thor: The Dark World
22. Iron Man 2"
37578,"I’m sorry, but this is incorrect."
37579,"That's fine, I'm okay with being ""wrong""."
37580,And you’re quite good at it! Harrumph!!!
37581,"Here’s my list:

1. The Avengers - 8.5/10

2. Avengers: Endgame

3. Captain America: The Winter Soldier

4. Captain America: Civil War

5. Thor: Ragnarok - 8/10

6. Guardians of the Galaxy

7. Avengers: Infinity War

8. Spider-Man: Far From Home

9. Spider-Man: Homecoming

10. Iron Man - 7.5/10

11. Guardians of the Galaxy Vol. 2

12. Black Panther

13. Thor - 7/10

14. Captain America: The First Avenger

15. Iron Man 3

16. Captain Marvel

17. Ant-Man and the Wasp

18. Ant-Man

19. Doctor Strange

20. Thor: The Dark World 

21. Avengers: Age of Ultron

22. The Incredible Hulk - 6.5/10

23. Iron Man 2"
37582,"I'm not sure I have a strict numbered list, but I do have some tiers.

Top tier: *Guardians of the Galaxy*, *Iron Man*, *Captain America: The Winter Soldier*, *Iron Man 3*, *Thor: Ragnarok*

Mid tier: *Captain America: Civil War*, *Thor*, *Guardians of the Galaxy Vol. 2*, *Avengers*, *Avengers: Age of Ultron*, *Doctor Strange*, *Captain Marvel*, *Black Panther*

Bottom tier: *Ant-Man*, *Ant-Man & the Wasp*, *Avengers: Infinity War*, *Avengers: Endgame*, *Captain America: The First Avenger*, *Thor: The Dark World*, *Iron Man 2*

Haven't seen: *The Incredible Hulk*, *Spiderman: Homecoming* and *Far From Home*"
37583,"1. Captain America: The Winter Soldier - 8/10
2. Avengers: Endgame - 8/10
3. The Avengers - 8/10
4. Guardians of the Galaxy - 7/10
5. Avengers: Infinity War - 7/10
6. Guardians of the Galaxy Vol. 2 - 7/10
7. Thor: Ragnarok - 7/10
8. Captain America: Civil War - 6/10
9. Black Panther - 6/10
10. Captain America: The First Avenger - 6/10
11. Iron Man - 6/10
12. Spider-Man: Homecoming - 6/10
13. Iron Man 3 - 6/10
14. Doctor Strange - 6/10
15. Avengers: Age of Ultron - 5/10
16. Spider-Man: Far from Home - 5/10
17. Ant-Man - 5/10
18. Thor - 4/10
19. Ant-Man and the Wasp - 4/10
20. Iron Man 2 - 4/10
21. Captain Marvel - 4/10
22. The Incredible Hulk - 3/10
23. Thor: The Dark World - 3/10"
37584,why is captain america the first avenger always so high in these rankings? i find it so predictable and felt like i was watching thor 2 but with captain america as the main character
37585,Black panther was so refreshing.
37586,"I predict a particular group of people is gonna look at this list and get triggered by it (particularly the top pick).

But the list itself looks ok though. Doesn't match my own exactly, but not a lot of really egregious stuff. I'd rank Infinity War noticeably higher, Captain Marvel and Doctor Strange somewhat higher, and Iron Man 3 somewhat lower, but that's pretty much it. I like your points system, it paints a pretty clear picture of the critical consensus on the 23 films.

Just for kicks, here's my ranking: 

1. Avengers: Endgame 
2. Captain America: The Winter Soldier 
3. Avengers: Infinity War 
4. Black Panther 
5. Guardians of the Galaxy 
6. Marvel's The Avengers 
7. Thor: Ragnarok 
8. Captain America: Civil War 
9. Iron Man 
10. Spider-Man: Far From Home 
11. Spider-Man: Homecoming 
12. Captain Marvel 
13. Doctor Strange 
14. Guardians of the Galaxy Vol 2 
15. Captain America: The First Avenger 
16. Ant-Man and the Wasp 
17. Ant-Man 
18. Avengers: Age of Ultron 
19. Iron Man 3 
20. Thor 
21. Iron Man 2 
22. Thor: The Dark World 
23. The Incredible Hulk"
37587,"Sadly, yup. I kept telling people on this sub and on r/movies that they do not understand just how much the general audience loved Black Panther. My wife has no love for comic stuff like me and she went to see that movie 3 times. My mom, who probably never saw a superhero movie in her life, went to go see it twice. 

It’s a flawed movie, maybe not the best MCU flick by our standards, but the average person off the street loves it tremendously. I don’t even fully understand why it resonated so well with people from all races and countries, but it’s quite miraculous."
37588,"What I posted earlier

&#x200B;

&#x200B;

If I'm being honest.

&#x200B;

Infinity War is the blame for some of Black Panther's backlash.

&#x200B;

Both directly and indirectly. Seemed more time spent/resources to fix CGI on IW than BP. Also think story wise BP being the film before IW it forces them to have to tidy up everything at the end.

&#x200B;

However, also the fan reaction. People seeing critics and GA laud BP so much when 2018 was supposed to be the ""Year of Infinity War"" That was the movie that was supposed to be the highest domestic movie ever (at the time). That was the movie that was supposed to be nominated for several oscars. It was the culmination of everything and once the BP hype kept going and going it seemed pick started to nitpick the hell out of it.

&#x200B;

I'll also add that even though I think IW is just ""good"". Black Panther is partly the reason IW didn't score as well with critics. BP was so character focused, so theme heavy, etc. That all the Infinity War shenanigans just seemed less intimate and loud."
37589,"> I'll also add that even though I think IW is just ""good"". Black Panther is partly the reason IW didn't score as well with critics. BP was so character focused, so theme heavy, etc. That all the Infinity War shenanigans just seemed less intimate and loud

This is a really good point that I think a lot of MCU fans miss when comparing BP and IW."
37590,"> It’s a flawed movie

There’s really no reason to say this when every movie flawed. We all understand."
37591,"For some reason, I couldn't get into it at all watching it in the theater. When I watched it on Netflix on my phone while on the exercise bike, I enjoyed it through and through. That is one of the weirdest 180s I've ever done."
37592,"Yeah, Infinity War not being higher is the one that surprises me the most."
37593,Ant-Man and the Wasp ranking above Doctor Strange seems especially odd to me.
37594,"They're about equal for me, DS is good, but a little flawed with its story and pacing."
37595,"Infinity war should be a lot higher! 
I really liked homecoming and civil war, but how is it possible that critics consensus rank those higher than IW? Come on."
37596,"Infinity War is surely entertaining and works well as a Thanos movie. But if you look at it like an Avengers movie, it doesn't have much substantial development for the heroes. I love it and it is my second fav film, but I can see why critics didn't love it as much. 

It focussed mainly on action-spectacle. To give you an example by exaggeration, some of them saw it as a Transformers like movie in the MCU. It's also because the breakneck pace of the movie never allows it to delve deep into emotions - it's mainly thrills and shock factor."
37597,"Looking at the breakdown, Infinity War is weighed down by a 20 and a couple of 19's, which weigh down the Top 5 and Top 10 scores."
37598,Hulk getting underappreciated... Again...
37599,"I mean, I do think it is the worst MCU movie. Key point being in the MCU. 

I don't think it's a bad movie, but it is probably the most mediocre movie in the MCU even neglecting the casting change and all that."
37600,"Disagree that goes to Black Panther ,Thor 1 and 2"
37601,"Agreed for The Dark World which is more or less equal to The Incredible Hulk and perhaps the OG Thor. 

I find Black Panther to be the heaviest dramatically in the MCU so I disagree with that, but I respect your opinion."
37602,"At this point I think everyone is trolling about how they feel about AoU. Really, 20th? Also shoutout to those who predicted the comments lol"
37603,"I don't know if you're curious or just trying to be condescending. I have it on like 16 in my list. It's not a bad movie but it is the worst Avengers movie imo. Endgame made it retroactively better. It was trying to go bigger and better in a lot of stuff The Avengers did, but it didn't particularly land well for me. It wasn't as fresh and cramming bogged it down.

Ultron was okay. I still get chills when I see him in the teaser for the movie. But in it, he was a bit underwhelming. IDK if it's the jokes he made or what, he wasn't threatening at all. I felt nothing when Quicksilver died. He had no resonance and it felt like he was killed just to tick a sacrifice checklist. 

I can appreciate what Whedon was trying to go for with Hawkeye but I'm not a huge fan of it. I think I liked him more in the Avengers, mainly due to the iconic shots he took. Still his pep talk to Wanda was great. It was also Vision's best appearance. I liked his final convo with Ultron. The final battle itself had some cool scenes, but it wasn't that memorable for me. Most of the action in the movie was just okay. Hulk v Hulk-buster was great though. 

Banner and Nat's romance was so forced it ruined their characters in the movie for me. Their chemistry was so awkward. I get what he was going for but it still sucked imo. Cap brought a lot of nuance in the role and I like how it was all paid off! Thor was okay but the setup with him was jarring. AoU was me least favourite Tony Stark appearance. He was given stuff to work with, but he felt so tired in the role. His vision was paid off well but in execution it felt like it was taken out of a fanfic. 

That's the thing, the movie feels like how a fanboy would write it - too much being crammed so that none of it lands that well. It was trying hard to pull your emotional strings but failed for me. Another issue was the humour. The Whedon-ism was strong with this one. AoU and Vol 2 had the most forced humour imo. Unlike the original Avengers, which had some of the best banter. I was tired of the constant quips and wit in it.

Regardless I still like the movie, though I don't love it. And I'm glad you enjoy it. Sorry for the essay!"
37604,In the first viewing Age of Ultron I just walked out it was so fucking boring bro. Also I think it's the one of the worst MCU movies in my opinion
37605,How is it boring? I also doubt that 100% lol
37606,The movie is just uninteresting. There is so much wasted potential in this movie it's ridiculous.
37607,Okay so... like what? You make these general ass statements you can say about any movie and then dodge the question whenever I ask you to be specific. You did this in another thread a few days ago too
37608,Ultron is one of the best villains Marvel has but yet and still in this movie they have turn him into a fucking comedian and not a funny one. Also the pacing in this film is fucking horrible there's is too many sections in this film where the movie just stops in its tracks. Age of Ultron never flows fluently is it jumps around. Quicksilver one of the first  Avengers in the comics gets killed off before they even get a chance to flesh out his character so there is no meaning to his death because we the audience don't even get to understand the character. And last but not least Black Widow and the Hulk possibly the worst romance in the MCU. Who would ever thought Black Widow would want to fuck the Hulk. This movie is the worst Avengers movie by far and also one of the worst MCU movies in my opinion.
37609,">Ultron is one of the best villains Marvel has but yet and still in this movie they have turn him into a fucking comedian and not a funny one

Not even true. He quips like, what, 5 times in the movie? Y’all exaggerate how “funny” they made him to an ironically hilarious degree


>Also the pacing in this film is fucking horrible there's is too many sections in this film where the movie just stops in his tracks. Age of Ultron never flows fluently is it jumps around

Super general and non specific so all I can say is I disagree


>Quicksilver one of the first  Avengers in the comics gets killed off before they even get a chance to flesh out his character so there is no meaning to his death because we the audience don't even get to understand the character.

The MCU is not the comics. Quicksilver as a character is owed nothing. He played his role in the story. His death had meaning in that he played a hand in Ultron’s plan so per Hawkeye’s speech to Wanda, instead of holding his grudges or blaming himself he takes a stand and gives his life for something greater


 
>And last but not least Black Widow and the Hulk possibly the worst romance in the MCU. Who would ever thought Black Widow would want to fuck the Hulk

Lmfao of course “Black Widow wouldn’t fuck the Hulk!” is the most thinking you could do on the matter. Their relationship is firmly rooted in the film’s main theme and their characters. You know, the thing that makes stories good? They both come from pasts where their agencies were completely removed resulting in them becoming “monsters”. Their respective ways of coping with that attract them to one another. But knowing that would require engaging with the movie on a meaningful level lol"
37610,I'm glad you enjoyed the worst Avengers movie bro I'm happy for you😂😂😂
37611,"That would actually be Endgame, but I did enjoy it so you’re right there

But least I have something to say about the movie other than “it sucked”. Way to tackle my points lol. Never seen someone have such strong feelings about a movie and then have so much trouble talking about their problems with it"
37612,"Age of Ultron is poo poo

But yeah, I don’t like Age of Ultron either, but I like it better than The Avengers, Captain Marvel, and a lot of the Phase One films at least."
37613,I liked BP a lot but... first?
37614,Feige had it first as well.
37615,It’s not possible for everyone to agree on an order
37616,i thought black panther was solid but not the greatest
37617,"It’s got huge appeal with general audiences and scored insanely well on Cinemascore. For tons of people it was their first or only Marvel movie. We MCU fans have kinda been embarrassed by our riches, so it ranks lower among us. It was the Iron Man 2008 for this era."
37618,"Thats not the only reason.

Black Panther is the first MCU film to operate outside the inhouse style before it. Coogler brought in his own composer, DP, production designer, sound team. So it looks and feels unique to any other MCU. Its up to fans to determine what is ""better""

However, I the MCU fans grade it harsher because it doesn't do what MCU films typically are A+ at (action/CGI)

Also the nuanced story telling hit home for a lot of people. A lot under the surface."
37619,"> However, I the MCU fans grade it harsher because it doesn't do what MCU films typically are A+ at (action/CGI)

I mean it does them, just not as well as some. And that's mostly the big action piece at the end. I liked the club/car stuff and the waterfall fights."
37620,"IMO, Iron Man 2 is the best Iron Man film. I will defend it till im dead"
37621,Thank you! To me IM3 is by far the worst.
37623,Seems about right.
37624,"Interesting! Rankings are so subjective but it's always fun to see what other people choose.

I think Civil War is WAY too high, as is Guardians 2. Far From Home is way better than Homecoming; and Age of Ultron disappointed me at first but it grew on me upon repeat viewings, so I don't think it deserves to be quite so low. And Infinity War is too low, obviously.

This post inspired me to make my own list, which made me think really hard about which ones I want to re-watch, so now I know what I'm doing with my upcoming day off!

I came up with a ranking, but the actual rankings are less important than the categories I made:

1. Absolute Favorites: Winter Soldier, Black Panther, Ragnarok
2. I love these movies: Avengers, Far From Home, The First Avenger, Endgame, Infinity War, Iron Man, Guardians of the Galaxy, Captain Marvel
3. I like these movies: Iron Man 2, Thor, Age of Ultron, Iron Man 3, Homecoming
4. I do not like these movies (will probably not re-watch): Guardians 2, Civil War, The Dark World, Doctor Strange, Incredible Hulk"
37625,"The only egregious thing about this list is Iron Man 3 being so low. The most consistently underrated MCU film, I'd say. But that's okay, it reflects a widely shared sentiment, I guess.

But for the rest, yeah, it's about what you'd expect (okay, I'd have expected IW to be higher)."
37626,"People really hate BP but outside of MCU fanworld, it is considered one of the best Marvel movies to come out. I’m sorry that makes so many of you so uncomfortable, but I mean...let’s call a thing a thing.

Having said that, I am still absolutely obsessed with the first Avengers, so it would rank pretty high. Besides a few KEY scenes in AoU, I don’t give a damn about they movie. Thor 2 is just...ugh.

Ragnarok is awesome, IW/Endgame are great."
37627,"The “BP overrated” crowd might come out for this one, but overall this is a list I can get behind. I’d obviously shift a few things up and down but I feel like it gives a good general vibe of which ones are higher tier vs lower tier."
37628,"I’m honestly not getting all this opinion-hating on the fact that some, me included, think that BP is overrated. What’s wrong with sharing a thought? This sub is kind of for that.
And the fact that is a “crowd” of people saying that, must be for a reason, imo."
37629,"It's not just people thinking its overrated. A lot of people on this sub were actively bitter over Black Panther's success so they called it ""overrated"" and ""not that great"" in any discussion about the film.

People are entitled to their opinion of course but no other marvel movie gets this treatment, this sub generally appreciates all of them but was dreading BP getting nominated for Best Picture at the oscars."
37630,I thought it was great but also overrated. It’s certainly not the number one MCU movie for me.
37631,"Yeah it was blown out of proportion by critics. I just feel like a ton of people use “overrated” to mask what they mean, “bad”. 

It’s not my number one but number six for this franchise is still *really* good!"
37632,"I don’t think there is a bad MCU movie. Once you’ve seen Green Lantern, you can’t call the MCU bad."
37633,"Nah, I’m happy for the crew that got the nomination. A lot of work was put into it and I’m happy to see it was worth it.


List of random brutally honest opinions.
BP was overrated, the character is super cool, CGI was a massive let down in the final fight.

Doctor strange’s character is way better than the movie.

Captain Marvel movie is way better than the character.

Endgame sucked.

Ok, that last one was a lie."
37634,"I’m fine with someone thinking it’s overrated on an individual level. All the better if they have actual points of criticism they honestly want to talk about! But on a subreddit level sometimes it feels a little cult-like and like the only opinion you’re allowed to have. I don’t mean to shit on people who don’t like BP, I’m just beyond tired of talking about it. If BP, T’Challa, Killmonger, etc. come up in the comments of a thread about all the movies, it seems like people trip over themselves to be the first ones to say it was overrated.

It’s gotten to the point that whenever anything about the movie is praised at all, I’m prepping myself for a ton of negativity from others about it.  I get real Last Jedi vibes from it and it’s just draining and not fun to talk about anymore."
37635,Because for two years every post that praises it gets hit with a wall of comments like yours. We get it. When the majority of the comments in a thread is “this is overrated” it’s probably not that overrated.
37636,"> When the majority of the comments in a thread is “this is overrated” **it’s probably not that overrated**.

Did you drink something aged a thousand years in barrels built from the wreck of Grunhill's fleet?"
37637,"People feel like it was overrated by the critics, which is fair, then the backlash was so strong that it became underrated by the fans.

The BP Paradox: If the popular opinion is that something is overrated, is it still overrated?"
37638,Said it better than I did/could
37639,"How can something be overrated when any and every discussion about it devolves into a circlejerk about how overrated it is? Like I don’t get how you go into a comment section, see 75% of people saying “it wasn’t that good” and think the movie gets too much praise lol"
37640,"Most people whether or not they’re MCU fans acknowledge that the film is just ok/ typical MCU-fare, which would delegitimize the “overrated” claim, but..

when it came to the initial reactions and eventually awards season, that “overrated” meme got legitimized the moment it was nominated for Best Picture at the Oscars.

A lot of the other awards it was nominated for and actually won were deserved, but BP was lucky enough to have such a massive cultural significance that the Academy didn’t snub it like others in the genre for decades."
37641,"there are probably 10+ comments in this thread that are slight variations of “I think BP is overrated”, just upvote the ones you agree with instead of restating the same comment over and over, it adds nothing to the conversation. Someone else said this in a comment here, but whenever BP receives praise on this sub, it’s like ppl are tripping over themselves to be the first to say it’s overrated.  

There are likely several reasons why a “crowd” of people, especially MCU fans on this sub, were unhappy it received so much praise. Some ppl genuinely think it’s overrated, some ppl were upset it was praised so much by critics over IW that year, some ppl really had major issues with the 5 minute CGI fight between BP and Killmonger and that drags the whole movie down, and some people just didn’t like that a black superhero was suddenly getting so much praise/attention. I’m sure that last one doesn’t apply to you or anyone you know, but it’s a reality. Seeing a group of ppl trip over themselves to post essentially the same comment that BP (the most critically acclaimed MCU movie and the only one with a majority black cast) is overrated feels racially motivated at least in part."
37642,"I don’t wanna sound like a 13 year old on YouTube answering FiRsT CoMmeNt but in this case I was the first person in the whole thread to write BP is overrated, and I had no idea it was a “thing”. There was no crowd. Yet everyone just came charging through a hole in space while I was standing 300 feet below it."
37643,"Congrats, I guess you won the contest this time."
37644,"they're already here, copying and pasting the same comments they made in the previous 100 BP threads."
37645,"Infinity War is criminally low. Also, I’m convinced Slant used an otter and tiny basketball hoop to pick"
37646,"I’d put Captain Marvel a lot higher, and Guardians 2 a lot lower...but other than that it’s about right."
37647,"Interesting thing I noticed skimming the different sources:

There’s a very clear consensus on the bottom few movies - Thor TDW, Iron Man 2, Hulk. None of them appear over #17 on any list. 

But other than those three, every other movie is liked relatively well. Each of the other 20 movies rank in at least one source’s top 10. 8 movies rank #1, including the overall #12 Captain America TFA."
37648,I still don’t get why Collider put First Avenger as the best movie
37649,Because the first avenger is incredible
37650,"Huh. Seems pretty solid, with a few surprising individual results (I guess ScreenRant really didn't like Thor: Ragnarok) but overall reflects general sentiment.

I too am *shocked* that the one MCU movie nominated for Best Picture is also generally agreed to be one of the best MCU movies. Real shocker there. Just shocking."
37651,"I ran some numbers to check for biases and to compare aggregate rankings. The list holds up overall except in the top 4.

If you do a straight average it changes to:

Movie                                     Average Rank

Endgame                               4.93

GotG                                       5.23

Black Panther (tie)               5.46

Winter Soldier (tie)               5.46

&#x200B;

This changes slightly if you take out the highest and lowest rankings

Movie (high/low)                 Average

&#x200B;

Endgame (1/20)                    4.53 (who in their right mind puts EG 20th?!?!?)\*\*

GotG (1/13)                            5.11

Winter Soldier (1/16)            5.25

Black Panther (1/13)             5.35

&#x200B;

Captain America tFA and GotG swap places with averages if you take out the high/low and Iron Man 2 swaps with Thor:DW in both these scenarios. 

Everything else stays the same. 

regardless these are my top 4 in the MCU too (maybe not this order ;) Oh well just my 2 cents. 

&#x200B;

\*\*Actually slant's list is pretty FUBAR so perhaps we just run it without them...hmm....."
37652,"I think BP is overrated. Awesome character, meh movie."
37653,Ah there it is.
37654,Now we just need to see it repeated a hundred times...
37656,"This opinion is basically a meme on this sub and someone says it the second the movie is mentioned. Not saying it’s wrong or anything, but it’s just a certainty someone would say it."
37657,"I don’t see what’s so wrong with people saying this.

That “overrated” meme got legitimized the moment it was nominated for Best Picture.

Even judging it as a film by itself and not as an MCU fan, it’s pretty standard MCU-fare."
37658,"For me it’s the opposite, awesome movie but meh character. Probably spoiled by Christopher Priests interpretation of the character."
37659,"I concur, that movie is towards the bottom for me.  I’ve never had a desire to watch it again.  Not as bad as Thor 1 and 2. tho. Michael Jordan is a dope actor."
37660,"That many sites ranked Black Panther as their number 1 MCU film?  I mean it's a good one, but number 1?  It's pretty far down on my list, but it's a list of 20 of my favorite movies of all time ... so it's definitely not an insult, as I've that movie specifically around 10 times.  But I'd be embarrassed to admit how many times I've seen Avengers, WinterSoldier, CivilWar, InfinityWar, Endgame, and Guardians.  I really have no life these days.  ..."
37661,Kevin Feige has it as the number MCU film. Iger loved it as well.
37662,"Then why are they already talking about shifting the focus of the series to Shuri, if he loved the 1st one so much?"
37663,Feige also stated the women were his favorite part of the movie.
37664,"That's no excuse to take it away from Chadwick Boseman.  If he loved the women so much, do a Wakanda movie, or a Shuri movie.  Don't let the star of your new franchise hear you're already thinking about shifting focus to someone else."
37665,You got to stop believing in these rumors man. You know damn well Disney will not miss an opportunity to put Black Panther and storm in a movie together that is a billion dollar movie if done right and Disney is all about that money.
37666,"Well Fiege did say he was thinking about this, and Chadwick Boseman did express his distaste for the idea.  I doubt it'll come to pass, but I just think it's a weird thing to say.  It does brew good morale in your new franchise's star.

I'm pulling for that Storm idea though.  I hope you're right."
37667,Same here. A nightly routine and complete rewatch every couple of months
37668,"Yeah, especially since Disney+ made me not even have to put a Blu-ray in.  I also watch Deadpool 1 & 2 A LOT.  Funny thing is, I've always been much more into DC comics, but while I enjoy some of the DC films, there's really no comparison."
37669,"Here's my list, even though nobody could possibly care what I think.  It's just based on how much I enjoyed them, not a comment on the quality of each one.              
1. Avengers Infinity War                              
2. The Avengers                                    
3. Avengers Endgame                       
4. Captain America The Winter Soldier                    
5. Guardians of the Galaxy                         
6. Iron-Man                                      
7. Captain America Civil War                                  
8. Guardians of the Galaxy Vol. 2                           
9. Spider-Man Far From Home                             
10. Captain America The First Avenger                      
11. Thor Ragnarok                                 
12. Spider-Man Homecoming                                
13. Ant-Man                                                      
14. Avengers Age of Ultron                                     
15. Doctor Strange                                               
16. Iron-Man 3                                             
17. Thor                                                           
18. Black Panther                                                  
19. Captain Marvel                                            
20. Ant-Man & The Wasp                                          
21. Iron-Man 2                                                         
22. The Incredible Hulk                                                  
23. Thor The Dark World"
37670,"The biggest surprises for me is Thor 2 over Iron Man 2, and how low AoU is. The top-half seems about right, though."
37671,"Here's my list.  1, 2, 3 and 4 float around a lot, depending on which one I watched last:

Endgame, 

Winter Soldier, 

Civil War,

 Infinity War  

Iron Man, 

Guardians vol 1, 

Avengers, 

Black Panther, 

Thor Ragnarok, 

Thor, 

The First Avenger, 

Ant-Man, 

Spider Man Homecoming, 

Antman and the Wasp, 

Guardians vol 2, 

ultron, 

Iron Man 2, 

Captain Marvel, 

Dr. Strange, 

Thor 2, 

Iron Man 3, 

Hulk

I still need to watch far from home.  And the rankings are based on how much I enjoyed the movie while watching it, in the lead up to endgame last year."
37673,Waiting for mod approval. I'm a new user.
37674,"no i know, but where's the actual list you're talking about"
37675,"It's in now, my bad. Still new to all this, haha"
37676,I’d rearrange the order but the top 10 movies listed are spot on!
37677,"Age of Ultron and Infinity War are way too low. Honestly I think Black panther is a bit too high. Beyond that, not a bad list overall I guess. I'd rank things differently of course, but not too bad."
37678,"I think I’m the only one in the world who thinks Black Panther is not a great movie. 

It’s one of my least favorite with Captain Marvel. 
And of course The Incredible Hulk."
37679,"Here’s my ranking, based on interest.

1. Avengers: Endgame
2. Avengers: Infinity War
3. Avengers
4. Avengers: Age of Ultron
5. Captain America: Civil War
6. Thor: Ragnarok
7. Captain America: The Winter Soldier
8. Black Panther
9. Guardians of the Galaxy
10. Doctor Strange
11. Iron Man
12. Guardians of the Galaxy: Vol 2
13. Captain Marvel
14. Captain America
15. Thor
16. Spider-Man: Far From Home
17. Spider-Man: Homecoming
18. Thor: The Dark World
19. Iron Man 2
20. Iron Man 3
21. Antman and the Wasp
22. Antman
23. The Incredible Hulk"
37680,This is what you get when you let media sources be the judge
37681,Well this system sucks lol. Black Panther at 1 and Infinity War at 10 immediately threw me off.
37682,"Why do we care so much about this? Why do we so badly want to assign numbers to art? Do we think it justifies our opinions? Do we want a way to quantify them, to put them order, like sorting M&Ms into piles? 

All we do is devalue what we claim to value."
37683,"My list constantly changes but:

1. Infinity War
2. End Game
3. Civil War
4. Ragnarok 
5. Guardians of the Galaxy 
6. Far From Home
7. Black Panther
8. Winter Soldier
9. Iron Man
10. Avengers

Crazy to think we can do a top 10 list and more then half of the movies are left out."
37684,"1. Infinity War
2. Winter Soldier
3. Endgame
4. Iron Man 1
5. Ragnarok 
6. Civil War
7. Avengers 
8. GOTG Vol 1
9. Age of Ultron
10. Doctor Strange"
37685,"1. Avengers: Infinity War
2. Thor: Ragnarok
3. Guardians of the Galaxy 
4. Captain America: Civil War
5. Avengers: Endgame
6. Guardians of the Galaxy Vol. 2
7. Captain America: Winter Soldier
8. Black Panther
9. Spider-Man: Homecoming
10. Iron Man"
37686,Really good list
37687,"1. Avengers: Endgame 
2. Captain America: The Winter Soldier 
3. Avengers: Infinity War 
4. Black Panther 
5. Guardians of the Galaxy 
6. Marvel's The Avengers 
7. Thor: Ragnarok 
8. Captain America: Civil War 
9. Iron Man
10. Spider-Man: Far From Home"
37688,Black Panther too high
37689,"1. Infinity War
2. Thor: Ragnorak
3. Spider-Man: Homecoming
4. Spider-Man: Far from Home
5. Incredible Hulk
6. Captain America: Winter Soldier
7. Captain America: Civil War
8. End game
9. Avengers
10. Guardians of the Galaxy"
37690,"Imo I don't think Endgame gets anywhere near Infinity War, particularly on second viewing"
37691,"I’m not good at picking favorites in general, so I’m just going to focus on my least favorites.

Iron Man 3 honestly kinda hurt to sit through at points. There are plenty I liked about it, but it deviated way too much from the other two for me to get into it, and even the parts I liked honestly don’t fit the character super well. Thor the Dark World had a good first act in my opinion, but the rest was just incredibly boring and visually unappealing. The best part was easily Loki, and even then he probably shouldn’t have been there, given how bland and underdeveloped the villains were."
37692,"Best: *Avengers Endgame*

Worst: *Thor: The Dark World*

It doesn't really get better than *Endgame*. That was peak MCU.

*Thor: The Dark World* plain sucked. Like, does anybody remember anything from that movie?"
37693,"The Loki scenes were fun.

But yeah. Otherwise it's one of the handful of MCU films I never once felt the desire to revisit."
37694,"The film had some good comedy scenes, with back-and-forth between Thor and Loki, even Jane had a good moment or two in that regard. It was visually beautiful, and the main (musical) theme is brilliant.

Plot-wise, though... well. It's an important installment because of an Infinity Stone, but nothing I would like to watch again."
37695,"I just remember it sucked ass. And Jane talking about Malekith as if she had known who he is for years made no sense.

edit: typo"
37696,this is the correct answer.
37697,"best is still prob winter soldier with guardians 1 amd ragnarok not far behind

worst is iron man 2"
37698,"Best: Captain America: The Winter Soldier
Worst: Thor: The Dark World"
37699,"I think these two movies contrast each other really effectively around one point: neither main character has an arc, and it's brilliant in one and boring in the other.

The Russo's talked about how Winter Soldier was a hard movie to pitch because Steve doesn't really have an arc in it. He doesn't really change as a character, he reacts to his world changing around him. But holy shit does it change, every single act of the movie something radically changes about Steve's world. The movie hits the ground running in the opening scene and never stops until the end. So it works brilliantly.

In the Dark World, Thor doesn't really have an arc either. He doesn't really change, but his world doesn't really change either until literally like ***the last ten minutes of the movie***. They open with what is essentially the ending of a way more interesting Thor movie and then they just fart around for a while and throw in a status quo change at the very end, when the movie has no real time to explore it. So the whole thing just feels a bit useless."
37700,"Best: The Winter Soldier

Worst: The Incredible Hulk"
61721,I second this
37702,"Best - Infinity War

Worst - Probably Thor 2, but Ant-Man is my least favorite."
37703,Infinity War and Iron Man 3
37704,"Best : Avengers thor Ragnarok civil war endgame/infinity war
Worst: thor 2 Ant-Man 2 (louis was good) captain Marvel (i just don't like it personal opinion)"
37705,"Best: Avengers 1, Iron Man 1, Infinity War, Guardians of the Galaxy 1 \*and Thor: Ragnarok, that was brilliant, too

Worst: ehh, Thor: The Dark World, Captain Marvel"
37706,"Best- Infinity War or Civil War
Worst- Guardians 2 or Ironman 3"
37707,Guardians 2 is the worst?
37708,"I liked it a lot less than the first, but I would never call it a bad movie in a million years"
37709,Yea. Just wasn’t a fan
37710,"For me Winter Solider is probably my favorite, my worst is Captain Marvel. CA:WS still has some of my fav action and I just love the tone it has. Cap Marvel is just unforgivably bland imo."
37711,Worst. The first Hulk and Thor. Best. First Ironman and Guardians of the Galaxy.
37712,"Okay for me it's a tie with Infinity War, Endgame and CATWS for best. And worst I'm gonna say the 2003 Hulk with Eric Bana. I may get down voted for this comment but you said Marvel movie, not MCU film. Now me being a shithead aside, I think Iron Man 2 was my least favorite even though it was a decent film I just didn't enjoy it as much as the often mentioned Incredible Hulk and Thor: The Dark World"
37713,"Best (tie): 

Winter Soldier

Infinity War

Endgame

GOTG 1

So many good movies to choose from. It was hard not to put more solo films at the top but these are the ones I consider top teir. 


Worst:

Iron Man 3 

This movie could not exist and the MCU would essentially be unchanged. Contradicts a lot previous and subsequent character arc with Tony. Shits all over Mandarin character. This movie is a slap in the face to Iron Man fans. 

Worst Runnerup: 

Thor Dark World"
37714,Best: The Avengers Worst: Captain Marvel
37715,"Infinity War is best

worst? none ore ""bad"", but Captain Marvel is probably the most bland one"
37716,"Assuming this is exclusively MCU

Best - Guardians of the Galaxy Vol 2

Worst - Thor: Ragnarok

*Just in case people think I’m trolling, I’m not. This is my sincere opinion."
37717,"Best:  Infinity War

Worst:  Captain Marvel"
37718,"Best- Infinity War, Winter Soldier

Worst- Hulk (2003) and Captain Marvel"
37719,"Best: Infinity War, Thor: Ragnarok

Worst: Iron Man 3, Incredible Hulk

I’m a shameless TDW apologist so it’s nice not too see too much hate for it here."
37720,"Best: Infinity War

Worst: Endgame"
37721,"Why is Endgame the worst?

People shouldn’t be downvoting if this is a sincere take."
37722,"I mean, everyone’s entitled to their own opinions but… huh?

Even if you weren’t a fan of Endgame, I can’t see a possible universe where it’s lower than Thor 2, Hulk, or Ant Man 2? I guess it’s good to have hot takes every now and then, because that is certainly unpopular."
37723,I actually like The Incredible Hulk more than a lot of MCU movies and thought it was decent.
37724,[My personal MCU Rankings](https://i.imgur.com/YJKNfiM.jpg)
37725,"Best: CA:TWS
Worst. Between Iron Man 2 or Thor 2"
37726,Best: infinity war and Ant-man. Worst: iron man 2. My favorite even though I agree with criticisms of its quality: Endgame
37727,"Best - Captain America: The Winter Soldier

Worst - Iron Man 2"
37728,Worst Ant-Man. Best Endgame maybe.
37729,"Best: Infinity war. My expectations were high and the movie blew them. Seen it 3 times in theaters, I never do that.

Worst: Thor the dark world. Damaging for the characters. It is probably the only movie that accomplish nothing. (They gain the reality stone)"
37730,I feel like the best is Captain America: Winter Soldier because it’s literally the only MCU movie (currently) that focuses more on the movie itself rather than comedy. I don’t really have a worst MCU movie though
37731,"For me, it's a tie between Iron Man and Black Panther for best. Worst is Civil War."
37732,"Okay so I believe the top 3 best movies marvel has made is:

3: Ironman 1 is the best Ironman movie by far and was made before Disney bought marvel so it has its own feeling to it and kick started the mcu. And Robert Downey jr IS Ironman!  They took a B list character that people should hate get humbled and become the most poplar character there is in the mcu. 

2: the winter soldier really stands out as it is a much darker and grittier movie than the rest of the mcu and puts cap against a different threat that he can’t simply punch in the face. Also it’s the best written captain America movie of his trilogy.

1: Infinity war… it’s the peak of the mcu everything that has been built up for a decade pays off in one of the most enjoyable movie of all time its a love letter to the fans it gathered through the decade and every single character, every single moment is satisfying. With one of the best written villains ever that even has people question if he’s in the wrong. The pacing is brilliant it never misses a beat and I’m not a huge music guy but the score was incredible. When Thor made his Entrance scene the theater lost its mind and than a few minutes later it was dead silent as we watched our hero’s fail. they couldn’t even avenge their comrades as the villain escapes and sits back and watches the sun set. 
 
Each of these movies are at the top of their game.

Now everyone and their mother knows that the hulk movie and the dark world are the two worse (I would put captain marvel as the third worst, because of plot holes and retcons) so I’m going to skip those and do the top 3 most disappointing mcu films IMO.

3: age of Ultron. Okay now stop reading this and go watch the age of ultron trailer on YouTube. 3 2 1 okay now that you’ve watched the trailer (lol) you can see what I mean. Totally different vibes then the movie we ended up getting, I still get chills watching that trailer but instead we got a worst avenger movie that mostly just set up plot points for future movies. And they Barely made use of ultron. 

2: black panther. I had to watch this about 2 weeks after it came out and I fell for the hype after seeing the reviews. Black panther has always been one of the coolest hero’s to me as I was first introduced to him in earths mightiest hero’s and then civil war came and all his scenes blew me away. But his own movie is by far one of the most boring marvel movies I have ever seen. He was sidelined in his own movie, not only does the villain out shine BP (by a lot) but the side characters were more charismatic and entertaining. He gets his ass kicked the whole movie And then infinity war and endgame comes along and he’s a badass again and sadly we will never see him get another try because Chadwick passed away Rip. Also   Vibranium can apparently do anything and everything. So long story short the overly positive reviews made my expectations really high for a hero I really love so I was severely disappointed by a mediocre movie.

1: Endgame…you know it to be true. 
time travel works super weird in this movie and created plot holes (which I hate because this is supposed to be a consisted universe looking at you MS marvel) people keep coming up with ways how old cap ended up on the bench but really they are just coping. 
I thought caps decision to remain in the past was extremely selfish the word needs him especially with all the chaos caused by people returning. Then he steals another mans wife Peggy. And he’s leaves Bucky behind WTF he literally almost dies multiple time for him and fights his friends and governments just to leave him for some different timeline Peggy carter puss. (he should of chose Bucky for the shield) 
Fat Thor… what a fking joke. People say it’s okay cause they “relate” to him but they make him the butt of every joke and give him no respect. In reality they did it to nerf him cause he was too strong but they are totally okay with captain marvel being op because she’s a woman. don’t even try to argue her whole movie is about girl power. 
Speaking of which that super forced A-force scene was super cringe and totally took me out of the movie. And once they all gather together marvel just blasts through everything on her own so it was pointless. 
Yet again they disrespect Thor by having him give up his kingdom to a drunk that fled her duty (I liked valkyries character but it still needs pointed out.) sorry but this Thor is not worthy of the hammer.
The pacing was really bad like the middle was super boring and no action. 
The final battle was cute but had no stakes everyone ends up fine and dandy besides Ironman who kill himself. Like this is a war for the universe but no hero’s  die in battle wtf.
Hulk gets turned into a soy boi and never gets his rematch. Unpopular opinion but I liked that BW saves Hawkeye he had a family she had no one but him so it fit her character but then they don’t even give her a funeral lmao 
Last but not least they butchered thanos character I get this is a younger thanos but he’s just another generic marvel villain and I think they did that because to many people liked thanos in IW and you can’t have that.

TLDR: best Ironman, winter soldier, infinity war.
Worst hulk, the dark world, captain marvel
Most disappointing ultron, BP, endgame

Edit. Spelling but I’m sure I missed some lol"
37733,Disagree with Endgame but Black Panther is extremely overrated
37734,"Best: Avengers Infinity War 

Worst: Incredible Hulk and Avengers Endgame (for being the most disappointing experience I had in an MCU film)"
37735,"Best: Spider-Man: Far From Home

Worst: The Incredible Hulk"
37736,"Infinity war is the “best” but Endgame is my favorite.

Hulk is ass."
37737,"Best: The winter soldier, Guardians vol 1, Civil war

Worst: Iron man 2, Thor a dark world, hulk"
37738,"Infinity war is number one, Incredible Hulk last"
37739,"I can never pick between Infinity War and Endgame for best. Infinity War is a better film, but man: Endgame has so many amazing moments, I don't think I've ever enjoyed watching a movie in the cinema more. 

Worst is definitely Dark World. I've tried rewatching that movie like 5 times, each time lowering my expectations on entry and trying to give it a fresh shot. I never make it through. That shit sucks ass."
37740,"* Best: Captain America: The Winter Soldier, GOTG 1 & 2, Infinity War and Endgame.
* Worst: Iron Man 2 *(it’s a rushed mess of a script)*, The Incredible Hulk and Thor: The Dark Thor *(they’re both ehh)*.

…but it says a great deal about the consistency of the MCU that the “worst” films are still *eminently* watchable. There’s not a BvS or Green Lantern among them."
37741,I thought homecoming was a lot better than you did
37742,"Of the individual hero movies, its my favorite in the MCU."
37743,"I agree a lot of the other movies ranked I'm like ""meh its somewhere along there"" but with Homecoming I really enjoyed it and think its top 3. Its such a fun movie and I feel his personality comes out more than Captain America. I like the way its paced into funny teenager segments then cool action scenes which don't go too over the top or get too repetitive."
37744,"Wow, I do not like Ragnarok like you guys do."
37745,Same. I felt 90% the jokes fell flat especially in the first act. I felt the movie gets better after we see Mark Ruffalo as Bruce Banner. Which is sad because Hulk is my favorite Marvel Character. Also why eas his voice so weird in this movie. He sounded Hawaiin
37746,"1. It is very hard

2. To objectively compare

3. So many styles of movies

4. Weighted against personal preference

5. And any automated ranking

6. While broadly ""Correct""

7. Ultimately Feels

8. Dissatisfying as a Method of

9. Conveying How

10. I personally feel

11. About any given movie

12 or the entire series

13. And Debates on the 

14. ""objective"" Status

15. of any specific film

16. Only serves to Undermine

17. Appreciation for

18. The Larger Story

19. Told Across Many Chapters

20. As a Whole

21. Thor: The Dark World"
37747,"He didn't say anything about ranking the movies ""OBJECTIVELY"", the OP just was sharing his SUBJECTIVE opinion on the films and asking others to share their own SUBJECTIVE opinions as well."
37748,It’s a joke dude.
37749,Oh. My sarcasm detector appears to be broken this evening.
37750,The only correct answer lol
37751,"1. Avengers Infinity War

2. Avengers

3. Iron Man

4. Guardians 

5. Civil war

6. Black Panther 

7. Ragnarok

8. Cap 2- Winter Soldier

9. Spider-Man

10. Cap

11. Dr strange

12. Ant-Man

13. Captain Marvel

14. Ultron 

15. Iron man 3

16. Thor

17. Ant-Man 2

18. Guardians 2

19. Iron man 2

20. Hulk

21. Thor 2"
37752,Talos was the best part of Captain Marvel. Come on son
37753,"I mostly agree with your rankings - I'd definitely put Spiderman higher though.  My list:

1. CA Winter Soldier

2. Infinity War

3. CA Civil War

4. CA First Avenger 

5. Iron Man 

6. The Avengers 

7. Guardians of the Galaxy 

8. Black Panther

9. Thor Ragnarok

10. Doctor Strange 

11. Ant-Man

12. Spiderman Homecoming 

13. Ant-Man and the Wasp

14. Thor Dark World

15. Guardians of the Galaxy 2

16. Captain Marvel 

17. Incredible Hulk

18. Thor

19. Iron Man 2

20. Age of Ultron

21. Iron Man 3"
37754,"1 Infinity War

2 Civil War

3 Ragnarok

4 Guardians

5 Avengers

6 Homecoming

7 Winter Soldier

8-17 Essentially a ten-way tie that I'd have to nitpick to order

18 Iron Man 2

19 Age of Ultron

20 Dark World

21 Iron Man 3"
37755,"1. Endgame(I'm still super hyped and I love time travelling stories)
2. Guardians 2
3. Guardians
4. Homecoming
5. Dr. Strange
6. Ant Man
7. Iron Man
8. Infinity War
9. Ant Man and the Wasp
10. Civil War
11. Iron Man 2
12. Avengers
13. Winter Soldier
14. Thor (I don't get why people thinks his movies are boring)
15. Iron Man 3
16. Thor Dark World
17. Ragnarok
18. Black Phanter
19. Age of Ultron
20. Captain America, the first avenger (I liked some aspects of the movie but can't stand captain america as a character)
21. Captain Marvel

I didn't include Hulk since I never watched it (Netflix deleted it on my region the day before I decided to watch it XD)"
37756,"1: Endgame  
2: Guardians of the Galaxy Vol. 2  
3: Guardians of the Galaxy  
4: Infinity War  
5: Iron Man  
6: Thor Ragnarock  
7: The Avengers   
8: Black Panther  
9: Captain America: Civil War  
10: Captain America: The First Avenger  
10: Doctor Strange  
11: The Avengers: Age of Ultron  
12: Thor

The rest I either haven't seen or need to desperately re-watch."
37757,Almost all are 7/10 with a few exceptions being 5/10.
37758,"Spider-Man Homecoming needs to be way higher (top 5 or 6) and the first Captain America needs to be way lower.

Other than that, I have no major disagreements with this ranking."
37759,The first Cap is great.
37760,"I liked the first half.  I felt like it was just too over the top and unrealistic when it came to the battles, and the advanced technology the Nazis supposedly had at their disposal."
37761,"i found cap TFA a bit boring honestly, hated the character of cap until the russos upgraded him in winter soldier. i also cant believe homecoming is so low on here, its better than guardians 2 for sure."
37762,"1. Avengers: Infinity War
2. Spider-Man: Homecoming
3. Guardians of the Galaxy Vol. 2
4. Thor: Ragnarok
5. Captain America: The Winter Soldier
6. The Avengers
7. Doctor Strange
8. Guardians of the Galaxy
9. Captain America: The First Avenger
10. Iron Man
11. Captain America: Civil War
12. Black Panther
13. Ant-Man and the Wasp
14. Captain Marvel
15. The Incredible Hulk
16. Avengers: Age of Ultron
17. Iron Man 3
18. Thor
19. Ant-Man
20. Thor: The Dark World
21. Iron Man 2

That said every film I would say is net positive (though the last two are right on the line). I can elaborate if anyone wants me to."
37763,"I'd say Doctor Strange and Ant man and the wasp were both better than BP, but I do agree that Killmonger was arguable one of the best villains and more could have been done with that character."
37764,I agree with 1-10 tho
37765,"21: Thor: The Dark World

20: The Incredible Hulk

19: Thor

18: Iron Man 3

17: Doctor Strange

16: Captain America: The First Avenger

15: Iron Man 2

14: Guardians of the Galaxy

13: Avengers: Age of Ultron

12: Ant-Man

11: Ant-Man and the Wasp

Here is where they get *great* for me

10: Captain Marvel

9: Thor: Ragnarok

8: Guardians of the Galaxy Vol. 2

7: Iron Man

Here is where they get elite

6: Captain America: The Winter Soldier

5: Spider-Man: Homecoming

4: Black Panther

3: Avengers: Infinity War

2: The Avengers

1: Captain America: Civil War"
37766,"This is very difficult and the order will probably change tomorrow. 

&#x200B;

1. Captain America: The First Avenger

2. Captain America: Civil War

3. Guardians of the Galaxy Vol 2

4. Guardians of the Galaxy

5. Captain America: The Winter Soldier

6. Black Panther

7. Spider-Man: Homecoming

8. Iron Man 

9. Iron Man 3

10. Avengers: Infinity War

11. Thor Ragnarok

12. The Avengers

13. Doctor Strange

14. Captain Marvel

15. Ant-Man

16. Thor: The Dark World

17. The Incredible Hulk

18. Thor

19. Iron Man 2

20. Avengers: Age of Ultron"
37767,I rewatched Infinity War this week and it really sucks on additional viewing. So many stupid decisions by our characters.
37769,"Shit tier

All of them"
37770,"Hard to differentiate between the lower ones so I'll just do a top 10:

&#x200B;

1. Black Panther
2. Captain America: The Winter Soldier
3. Captain Marvel
4. Captain America: Civil War
5. Iron Man
6. Spiderman: Homecoming
7. Guardians of The Galaxy
8. Avengers: Infinity War
9. Thor: Ragnarok
10. Ant Man"
37771,I think Captain Marvel at 3 is pretty crazy. I love Brie Larson but it’s easily the worst phase 3 film.
37772,Ant Man and The Wasp was Phase Three. So was Doctor Strange.....
37773,Doctor Strange is one of the best mcu movies imo
37774,Imo ... I rank both higher than captain marvel
37775,And you're welcome to do that
37776,This list is basically a long line of “X was good but I didn’t like Y”
37777,"Guardians

Winter Solider

Civil War

Endgame

Avengers

Iron Man

Homecoming 

Ragnarok

Black Panther

Infinity War

Far From Home

Ant-Man

Guardians 2

Iron Man 3

Ant-Man and The Wasp

Dr. Strange

Thor

The First Avenger

Captain Marvel

Age of Ultron

The Incredible Hulk

Iron Man 2

Thor 2"
37778,"Of all the ones I've seen...

&#x200B;

Great:

Captain Marvel - A

Captain America: The First Avenger  - A

Guardians of the Galaxy Vol. 2 - A

Captain America: The Winter Soldier - A

&#x200B;

Really Good:

Black Panther - A- 

Avengers: Age of Ultron - B+

Ant-Man - B+

Guardians of the Galaxy - B+

&#x200B;

Decent:

Iron Man - B 

Captain America: Civil War - B-

&#x200B;

Meh:  
Thor - C 

&#x200B;

Mediocre:

Avengers: Infinity War - C-

&#x200B;

Bad: 

The Avengers - D+  
Iron Man 2 - D+

&#x200B;

Really Bad: 

Doctor Strange - D

Iron Man 3 - D

&#x200B;

Absolute Trash:

Spider-Man: Homecoming - F

The Incredible Hulk - F"
37779,are you serious?
37780,"Why should we attack someone for their opinion? Maybe it’s not popular, but it’s refreshing to see a different side."
37781,Yeah. Not really passionate about a lot of these and all but the top 4 (And maybe Black Panther) have serious potential to go down.
37782,nigga u stupid
37783,"Whatever, I'm not gonna die on a hill arguing my opinions on a franchise as largely mediocre as the MCU anyway."
37784,"Spider-Man Homecoming is an F but Age of Ultron is a B+? Wtf??

Captain Marvel is an A??!! Above Ciivl War Winter Soldier and Infinity War?!?! That was the most generic marvel movie in Phase 3"
37785,"Infinity War. 

The Empire Strikes Back of the MCU."
37786,What he said.
37787,it doesn't work
37788,Captain America The Winter Soldier
37789,"- Avengers Infinity War
- Captain America: Winter Soldier
- Captain America: Civil War
- Thor: Ragnarok
- Black Panther
- Guardians of the Galaxy
- Avengers: Endgame
- Iron Man

^ Are the the cream of the crop!"
37790,Endgame
37791,"Other than Endgame



Captain America: The First Avenger"
37792,Winter soldier was my personal favorite.
37793,Winter solider
37794,Captain America Winter Soldier
37795,"Thor: Ragnarok.

After that, I'd say Winter Soldier, Guardians 2, Avengers, and the first Thor movie."
37796,Gotg
37797,Guardians of the Galaxy 2 by a fucking MILE.
37798,"If I could choose other than Infinity war and Endgame. 

The best movie is ""The Avengers""."
37799,Thor 2 lol
37800,this link doesn't go anywhere for me. But I would say Iron Man 1.
37801,"Infinity War, followed closely by Winter Soldier, homecoming and the original Iron Man."
37802,Blade 2
37803,"Top 3:

1. Infinity War
2. Winter Solider
3. The Avengers 

Honorable mentions: Endgame, Iron Man 1, and Civil War"
37804,GotG for sure. It’s classic
37805,"A bit late to the party, but I’m happy to see many more votes for IW than EG. IW is just so good from start to finish and EG has its moments but it drags a bit at times."
37806,"My Top 5:

Winter Soldier
Infinity War
Iron Man
Captain America: the First Avenger
Ant-Man / Doctor Strange"
37807,Click the link to vote
37808,Your link isn't working
37809,"With so many high points, the one aspect of this movie that most stuck with me was Tony Leung as Wenwu. Damn, that guy can act. And he was deeply evil while also being complex and relatable, to an extent. The casting in this movie was all-around 10/10, but Tony especially gave us a villain we will never forget."
37810,Tony Leung was the soul of this movie so I don't know how the sequel is going to pan out. Hopefully they just add a lot more crazy stunts to make up for his absence.
37811,"Having watched the Accented Cinema Tony Leung video before watching Shang Chi, I could tell the stark difference in acting chops between Tony and Simu. 

Simu was very stoned faced in acting but Tony was able to express multiple emotions from just his facial expressions alone."
37812,Was hoping for a Shang-Chi movie long before its announcement. Walked in with high expectations but man that movie blew it out of the park. Fantastic
37814,"Most of the appeal, for me, was Simu Liu and Awkwafina. I want a D+ series of them hanging out. I could watch them all day."
37815,This is such a good idea
37816,you and I are very different
37817,"I really don't need a D+ series about Awkwafina constantly talking about her VAG. Now, I'll take a Jimmy Woo and Shang-Chi spy show."
37818,This I could get behind
37819,YOU GET IT.
37820,You realize Katy and Awkwafina are completely separate right? You must think Daniel Craig is actually a British secret service agent.
37821,Really cause both keep talking about their private parts. What's the difference. And what the hell does Daniel Craig's bond have to do with this.
37822,Awkwafina the Actress/Character and Katy from Shang Chi are two different things. Why would Katy talk about her Vag on a Disney Plus show? Learn to separate the character from the actor that portrays them.
37823,Whatever.
37824,You're welcome. Now you understand Awkwafina and Simu Liu did not actually ride a dragon and defeat mythical creatures in real life.
37825,"Gd, this is such a stupid fucking take. Just like how Hugh Jackman constantly talked about his musical background and broke out into song when he portrayed Wolverine, right?"
37826,Wow. People on this reddit can't take a damn joke.
37827,Omg I was just joking! Why can't you take a joke!!?????????
37828,"The last time I was this excited for an MCU film (that wasn't an Avengers film) was *Doctor Strange*, and that ended up being my #12 MCU film, so I learned a hard lesson. *Shang-Chi* just outclassed it in every way - the narrative, the villain, the foils, the humour, the imagination, the *heart*.

My only two gripes with *Shang-Chi* were minor, and they related to pacing and the under-development of Razorfist, particularly the missed opportunity to position him more explicitly against Shang-Chi as Wenwu's ""adopted"" son. Alternately, I quite enjoyed that the ""family"" aspect which elevated so much of the emotional complexity of this film (and particularly its villain) was contained within the four main roles of the family. 

So, my first gripe is forgivable and the second will likely be explored/developed in a sequel. I really can't complain too much at all.

Shang-Chi is my new #3."
37829,"Great movie, not ""hands down best Marvel movie"". I mean, Marvel as a whole has Logan, SM2, ITSV, CA:TWS, Civil War, Infinity War/EG, X-Men First Class, Days of future Past, Iron Man, etc lol. But good points you made!"
37830,"Yeah I should have been more specific, I meant in the MCU, even then still is my top 3 all time without a doubt."
37831,"Thats fair, and it’s your opinion which is 100% valid. The movie was damn good though"
37832,dude why do you have to say the names in shortforms I can't understand any ;(
37833,"Hahah sorry, It's just common acronyms for the films we use here.

* SM2 = Spider-Man 2
* ITSV = Into the Spider Verse
* CA:TWS = Captain America: The Winter Soldier
* EG = Endgame"
37834,"Shang-Chi is amazing and one of the top 5-6 Marvel movies for sure.

That said, it doesn't come remotely close to touching Infinity War or Civil War"
37835,"What do people like so much about Civil War? I think it's a fun movie, but not even close to the best Marvel movie. Shang-Chi is way better imo. Agree on Infinity War, though."
37836,"Reasons why I personally love Civil War and have it in my top 3:

\-Zemo is one of the best villains and actually succeeds in defeating the Avengers without ever needing to fight

\-The relationship between Steve, Bucky, and Tony is heartbreaking. You just want them all to get along because you care about all of them, but you understand why they can't

\-The fight scenes are magnificent (Lagos, Steve & Bucky in the apartment, the airport, Steve & Bucky vs Tony)

\-The movie had PERFECT introductions for both Black Panther and Spider-Man. Perfect casting, check. Perfect characterization, check. Perfect costumes, check. Could not have asked for better intros for these two characters into the universe.

\-The ""Civil War"" between Steve and Tony is twofold, on a personal front because Steve is shielding his friend who killed Tony's parents, as well as on an ideological front because of their different perspectives towards the Sokovia Accords. I just like how layered and nuanced their conflict is and it provides a believable reason why the team is so fractured by the end of the movie/when Infinity War starts. It also gives the viewer extremely valid reasons to support either Tony or Steve, there's no clear-cut ""right"" or ""wrong"" side, which would have robbed the movie of its pathos.

\-The movie does SO much heavy-lifting in terms of setting up future plot threads, but it all feels natural within the context of the story, not quite as ham-fisted as other projects like Age of Ultron. The fact that the movie can set so much stuff up while also feeling totally coherent/important in and of itself, while also balancing the most number of characters the MCU had seen (at the time) is so damn impressive to me. For example, the movie:

1. Establishes Peter Parker and his relationship with Iron Man, setting up Homecoming, Infinity War, and Endgame
2. Establishes T'Challa and how he ascends to the throne of Wakanda, setting up Black Panther
3. Establishes the begrudging camaraderie of Bucky & Sam, setting up Falcon and the Winter Soldier
4. Brings back Thunderbolt Ross and shows us his Raft, setting up the inevitable Thunderbolts team we'll see one day
5. Brings Ant-Man into the fold as an Avenger, setting up Endgame
6. Establishes the budding romance between Wanda and Vision, setting up Infinity War and WandaVision
7. Establishes the falling out between Tony and Steve, which means Earth doesn't have a unified team to defend it, setting up Infinity War/Endgame
8. Establishes that Thor and Hulk are both still missing from Earth, setting up Ragnarok

Just my two cents on the movie though :) If the Russos can work out a deal to return for Secret Wars, I'll be so incredibly happy!"
37837,"""The fight scenes are magnificent (Lagos, Steve & Bucky in the apartment, the airport, Steve & Bucky vs Tony)""

You're kidding right? No MCU hand-to-hand fight comes close to what was show in Shang-Chi, primarily because shaky-cam techniques and quick cuts have unfortunately become part of the norm, which really results from the lack of a martial arts background and inability by the producers to hire established fight choreographers. Simu Liu is now the only actor in the MCU with a martial arts background, which is why you could see a lot of the fighting."
37838,Where did I say the hand-to-hand fights in Civil War were better? I just listed a reason why I like Civil War so much
37839,"Apparently, you missed the top of my post, in which I directly took a part of your post about how you thought the fight scenes in Civil War were magnificent. People who are in awe of any hand-to-hand fight scene in the MCU clearly have missed out on Hong Kong films. Shang-Chi is literally the first and only entry in the MCU in which those fights came anywhere near that bar."
37842,"Lmao, nobody brought hostile here except you. Go back to r/painal you creep."
37843,You feel diferent than me and thats fine.
37844,"It’s definitely a top tier origin movie, but it wasn’t without big flaws in my opinion. I really liked the first two acts of the movie, they felt more grounded. It got a little crazy in the third act, but there were some great moments so it was forgivable. The way they killed Wenwu, one of the best villains in the MCU, was not forgivable. I couldn’t believe they did him like that. Also, the way Katy killed the soul sucker with just one arrow with one day of training did not make any sense. I feel like wandavision suffered a similar third act problem where they had an amazing, creative show and it devolved into a DBZ fight in the end. 

I did really like it though. Gonna probably see it again soon."
37845,"Katy didnt kill the soul sucker, she just wounded it. Shang-Chi definitely killed it

Also i liked Wenwus death personally, thought it was so amazing how much Tony Leung is able to say without words and just his expressions."
37846,"Agreed. It was like he was finally at peace after thousands of years of combat, destruction, paranoia, and grief. You can tell Wenwu had begun to resent his existence because he spent most of the back story and modern day oriented on the preservation of his family (and perhaps more importantly, its power) rather than to be a good father. He's forgotten how to love them, but remembers that he *should* love them. Of course, he believes he is a good father, but is so consumed by grief that he would rather train his children to be assassins than to give up the powers that make them a target to people who want to challenge the family (this is completely justified in the narrative because of his wife's death). 

You can see that the moment he realises his wife lives on in his son's abilities to control the rings, he knows two things. First, that his son is powerful and skilled enough to wield the rings and he can now finally rest. And two, that his son carries both the abilities his mother had and the abilities he himself had trained into him. It's said multiple times through the film that Shang-Chi (and just about everyone) is the product of all those who came before. Shang-Chi has finally achieved his potential. 

Wenwu sees this in his final moments and realises he has no need of the rings for himself, and so accepts death, after thousands of years, knowing that his wife lives on in his son and the rings are carried by his son who is worthy.

I would've loved to see more Wenwu and specifically Tony Leung as Wenwu, but it would have been selfish to have him stay alive. His story, one that spans thousands of years, is over, and he achieved what he wanted."
37847,That's what y'all say about every new mcu movie that comes out. Every single movie is the best mcu movie. Y'all need to choose
37848,"I think my wife, who is just a normal person who doesn't haunt marvel subreddits, said it best when she said, on our way out of theater, ""not only was that extremely cool \[like all other marvel movies\] but it was beautiful, too."" Agree with you about the high rewatchability factor. That was a heck of a ride. Some of my other favorite Marvel movies feel a little old hat by comparison."
37849,And can we talk about that beautiful score?! The music omg
37850,Lets all calm down now guys. It was a good movie but it wasn’t the best one made. Anyone else feel like a bunch of accounts were made to push this movie?
37851,"Thats why I said FOR ME , some people like me will have that feeling, that does not mean everybody is going to have the same opinion, and doesnt mean everybody is creating accounts just to push a movie , thats just dumb to say."
37852,Yea the acclaim this is getting is odd. I personally thought it was good and I'm sure some people could make a case for it being in their top ten but best ever? Did they forget about Infinity War and Winter Soldier? The hype will fade off and they'll come to their senses.
37853,It’s recency bias. Remember the praise Black Widow got on this subreddit when it came out? Eventually people will realize that there are some big flaws in this movie.
37854,I thought Black Widow was downright mediocre while I was sitting there watching it. Weird flick. Shang Chi was great though. What a ride.
37855,"it’s all up to the viewer, though. for me personally i didn’t like the winter soldier, plus i agree with op and shang-chi is my favorite. for you, that’s not the case. nothing makes your opinion more valid than others"
37856,"I think it may be the best origin movie for me. Though I did also love Dr. Strange, Iron Man, and Black Panther..

It doesn't beat out some other movies like Winter Soldier, Civil War, Infinity War and some others though"
37857,"The same kind of exuberance happened when Black Panther came out

gotta give it some time for people to calm down"
37858,"Honestly doesn’t it make more sense that now that they’re branching into different types of properties, it’s tapping into a segment that’s really into these new elements? You don’t have to reach for an explanation...I don’t get the purpose behind telling other people how to feel about something, people like different things"
37859,No. The third act was a poorly lit CGI mess like so many Marvel movies have. The family plot was strong enough by itself; there really was no need to put the soul eater stuff in there.
37860,No it isn't.
37861,It's my 3rd favorite MCU film after Infinity War and Iron Man!
37862,Best origin movie
37863,recency bias much. It was a fun movie but to say that it is immediately the best one is a bit strange.
37864,"Yeah, no.  Fun flick but not even top ten Marvel movie."
37865,"Yeah, no. It's at least top 5 for most people.

You're entitled to your opinion but it doesn't mean that you're right."
37866,"Idk where you got ""top 5 for most people"" lol, ofc this sub is gonna have it being rated really high, we're biased asf for any new movie/show that comes out, but I wouldn't wager that *Most people* have it top 5.

Loved the movie, it was fucking great, but when BW and TFatWS came out, a big collective of this sub was rating those as top-tier, best MCU projects ever. Time has definitely changed that and now most people wouldn't include those in top 15, even top 20 lol"
37867,Look around you.
37868,"Yeah, look around the MCU sub, where we all love and hype whatever is new? Haha, I said that this film is fucking great, and is definitely a banger. I loved it! But this sub DOES tend to put whatever is new and fresh as ""top 5"". As stated before, TFatWS was being praised as ""best of the MCU"" on here.  

And especially since the OP said ""Marvel movie"" and not ""MCU movie"", that could also include movies like Logan, Deadpool, Spider-Man 2, ITSV, DoFP, etc. and uhh... kinda hard to rank Shang-Chi among *Logan-*tier lol"
37869,"Who said anything about Reddit? You're really gonna die on this hill?

If you don't think it's a top 5 MCU film you're in the very small minority.

Accept it."
37870,"You said ""look around"" and yeah, we're on the Marvel Studios Sub. & What ""Hill"" am I dying on? Geez, why are you so upset by this? You are completely ignoring my point on us in this sub tending to hype things in being top-tier if they're new. 

 No, I don't think you are in a minority if you think this isn't top 5 MCU lol. I think it's fucking great, but I would bet that a majority of people in the long run wouldn't put this over IW, Endgame, Ragnarok, TWS, Civil War, Iron Man, BP, Homecoming or FFH..."
37871,"It has an 8 on IMDb, and even a 3.9 on Letterboxd. People really like this movie. Not sure why you're trying to deny this."
37872,"Uhhh am I denying it? I said, and I quote, ""Loved the movie, it was fucking great"". I just said that it's pretty damn common for people on here to put whatever is new as their ""top 5 MCU"" lol."
37873,"And I'm saying it's quite likely to be in a lot of people's top five, considering it's easily in the top five in terms of ratings. And this didn't happen with Black Widow, lol."
37874,"Ok, if you wanna be headstrong about it, go for it. All I'm saying is that people DO put whatever is new and shiny as the ""top"" for a bit. I can promise you that there were a lot of ""This is a top-tier MCU movie and it was incredible"" posts when Black Widow came out, that got tons and tons of upvotes and awards. 

Again, I think the movie kicked ass. It was great for the MCU, but look at my other replies to see if people, especially general audiences, would put this over the other great films we got. I could definitely agree on it being top 10, top 5 is just too optimistic for it."
37875,"I guess you're the one who's right and everyone else is wrong, huh? You're incredibly dense and arrogant.

""If I don't think the movie is top five, no one does. Now watch me ignore all the evidence that proves me wrong."""
