idx,text
36017,"high in salt, which you lose when you sweat too much, this is the premise behind gatorade... although it seems maybe too high in salt."
36018,Electrolytes!
36019,"While Im always down for a good stout; avg about 200 cals.

Vodka/water...flavor with your choice of Mio or whatever 0cal flavoring you choose.  Should be about 65cals per oz of vodka, so maybe 130 total if you order a double/tall."
36020,I have great workouts the day after having 6-8 beers. Carb loading.
36021,Bourbon mixed with bourbon.
36022,"came here to say that.

But keep it small, like no more than 2-3 ounces"
36035,weed
36024,"This doesn't answer your question, but have you ever considered just drinking less?

And like others have said, it's not the calories that kill your work out. Ask anyone who has been on a bulk. The more calories you take in, the more energy you'll have, especially from the night before. If you're drinking minutes before a workout, it makes sense that your workouts suck and you're stupid. It's the hangover/withdrawal from the alcohol that's killing your workouts. 

If you can't sacrifice the alcohol, here's a few things that are good for hangovers. Most important piece: foooooooood. A nice big breakfast. You might not want it, but you need it to get your energy back up and fix that twisting in your stomach. Also, gatorade. Gatorade is good for 2 things, fixing fevers/colds and fixing hangovers. It hydrates you quickly and goes down easily. Water is good, gatorade is better in these situations. And when I say gatorade, I don't mean the sugar free crap. Take the sugar. It'll help settle your stomach as long as you're not drinking more than a bottle. After your next night of drinking just drink a bottle of gatorade (or powerade, or pedialyte, or whatever the fuck advertises electrolytes) in the morning, or even before you go to sleep, with a nice big breakfast."
36025,Important to note that a 50/50 Gatorade/water mix is crucial for optimal use. Try it next time.
36026,"Learn to sip whiskey. It is a good skill to have, and if you drink water you are more likely to feel alright the next day."
36027,"> It is a good skill to have

lol"
36028,I view it as a bicep curl variant.
36029,You just need a really heavy glass so that every time you take a sip you do a curl.
36030,"Scotch neat or red wine.  You can't easily drink a lot of either, and that way you aren't flooding your system with sugar or a massive volume of liquid with beer."
36031,"> You can't easily drink a lot of either

That makes one of us."
36032,">You can't easily drink a lot of either

I beg to differ..."
36033,"Me being an Italian, I disagree with your red wine assumptions."
36034,"Tnation just had an interesting article on alcohol. Here it is.

http://www.t-nation.com/diet-fat-loss/lifters-guide-to-alcohol"
36036,"Half of the following is medically sound, half of it is my personal experience: 

Personal Experience:
 Its mostly the mixing of alcohol with a variety of other substances that tend to throw you're body for a loop. Energy drinks and alcohol (especially the cheap energy drinks) will really make you feel awful the next morning. That being said if you are into pre-workout stuff I wouldn't suggest taking it on a night you're going to go heavy on the alcohol. Your best bet to avoid the lazy feeling the next day is to drink only one kind of alcohol with the same light (or no) mix. Also stay awake for an hour or so after your last drink. No idea why this works so well for me but it seems to make a big difference not to have my last drink and go strait to bed. 

Medically Sound : 
Dont eat a big meal before drinking. If you drink on a relatively empty stomach you will get intoxicated much quicker and therefor require less alcohol to get you to whatever level on intoxication you want to be at. And of course less alcohol = less hungover. Eat at the end of the night (paramedics have told me peanut butter and banana sandwich is the best) and take a damn vitamin B."
36037,"Here's a [image](http://i.imgur.com/OmMZVnN.jpg) of healthiest alcohols. I'm not saying this is 100% accurate, but it's not terrible.

In case this isn't just about getting a buzz, I will recommend [session beers](http://www.beeradvocate.com/articles/653/). Session beers are good if you want low alcohol (and thus usually low calorie) beers that don't sacrifice flavor. more alcohol content = more calories, but b/c beer is a lot of carbs, liquor will probably be better bet if you JUST want to get buzzed. But liquor still has a ton of calories.

Personally, beer is my one main vice when it comes to fitness. I really like beer so I exercise but I enjoy beer a lot. A lot of higher alcohol beers may get you buzzed quicker and won't require 3+ beers to get the job done (like light beers). Try something like [chimay blue](http://www.ratebeer.com/beer/chimay-bleue-blue--grande-reserve/53/). Although it's 270 calories, at 9% abv, it's gonna get you buzzed faster.

TL;DR - if you want a buzz but don't want as many calories, try liquor, if you want to still drink beer, try a bigger beer (higher abv beer), it *may* get you buzzed faster for less calories. If you want flavor, drink a session beer."
36038,"Vodka, club soda,  piece of lemon, piece of lime. No hungover in the am"
36039,Smoke weed
36040,"That's my secret, I'm always hungover"
36041,Diet orange soda and clear rum.   Tastes like a push pop about 45 calories per drink.
36042,"Uhh, well the calories aren't what's gonna hurt your workout bud that would be the ""toxins"" in alcoholic drinks that make you hungover. Aside from the ethanol in alcoholic drinks that gets you drunk, there are other substances called congeners. These are byproducts of fermentation that give alcoholic drinks their flavor, and scientists think they also contribute to the feeling of being hungover (in addition to other factors like dehydration and loss of vitamins). Alcohols that contain less congeners are going to contribute less to a hangover, and are generally clear and of ""higher quality"". So, top shelf vodka for example, would be a good choice."
36043,Red wine
36044,Guinness.
36045,"Semi-honest answer: soda water, sugar-free cola, or SF energy drink with spirits. You can get vodka made from pure potatoes if you're concerned about gluten, but it's pricey.

Brutally honest answer: phenibut, benzos, and GHB."
36046,"This guy knows his shit:

http://bayesianbodybuilding.com/science-binge-drinking/"
36047,"How many of these alcoholic drinks are you planning on having? Do you like sugar-rush coolers? Are you drinking shite beer like coors or bud? Or decent ale that doesn't have preservatives? 

I can't see how a glass of wine with dinner or an ale after work is really that bad... though a six pack a day may undo your six pack.

Then again I have no idea about any of this. I'm just some guy with a keyboard."
36048,"I find Gin and sugar free tonic to have a good low in calorie/ taste balance. Throw some cucumber and fresh pepper in and you have yourself a good drink.

Unfortunately, I find that I'm signifigantly more likely to drink too much when I drink spirits as opposed to beer. The other + side is that you don't have to piss as much.

As far as your workout goes any alcohol in excess is going to hurt you. Why don't you save the piss ups for after big gym sessions?"
36049,"Vodka diet coke, or i'll go with Sailor Jerry's and diet coke. They both will kill your workout if you drink too much as what gets you is the hangover not the calories."
36050,"Inhale the vapours.

www.youtube.com/watch?v=AGAzNB2kFJE"
36051,"[The Truth About Alcohol, Fat Loss and Muscle Growth](http://www.leangains.com/2010/07/truth-about-alcohol-fat-loss-and-muscle.html)"
36052,burnett's.
36053,"I do Stoli soda with a splash (just a splash!) of cranberry.  A shot of stoli is only 96 cals, soda is 0, and a tiny splash is probably 10 cals or less.  It's like a Stoli soda but adds a little more flavor without a ton of sugar and extra cals.  If you're heavily drinking (as I am wont to do), drink tons and tons of water.  I feel fine in the morning for my workout."
36054,Vodka fresh lime and soda..
36055,"straight whiskey (and most liquors) supposedly doesn't have any net carbs.  While it still contains calories, straight liquor is going to have the lowest overhead in terms of drunkenness vs. fatness. 

So get yourself some decent bourbon and go for it."
36056,"I think a big part of the crappier workout the next day, for me at least, is that by drinking I released a bunch of endorphins and marginally threw off my brain chemistry and motivation. Any alcohol will put a damper on your workout. I find I always have much more productive workouts when I've been away from alcohol for a few days"
36057,">Is there any other kind of alcoholic drink that still gets you a good buzz but doesn't have so many calories and or hurt your work out the next day?

Vodka v/s Budweiser




6:12 ounce Budweisers is 869 Calories

That 870 calories is composed of:

63.6 grams Carbohydrates giving 254 calories

7.8 grams of Protein yielding 31 calories

83.52 grams of Alcohol yielding 584 calories


---

Vodka
6: 1.5 oz Vodka is 84 grams alcohol

84 grams of Alcohol yielding 588 calories


**TL;DR:**

6 x Budweiser: 869 Calories

6 x 1.5 oz Vodka: 588 Calories

Same alcohol content"
36058,"Moscow Mule but with diet ginger beer instead of the regular?

Vodka + Diet Ginger beer + Lime + copper cup and ice"
36059,Straight Jack Daniels only has like 60 calories. Take three and chase with water and you should be fine for < 200 calories.
36060,Vodka-water with lemon is the best you can hope for.
36061,"I get good tequila and just drink that chilled, maybe with some lime."
36062,"Vodka water lime, low cal and keeps you hydrated"
36063,"If you are concerned about the calories and fat gain, or are trying for fat loss, [here](http://www.leangains.com/2010/07/truth-about-alcohol-fat-loss-and-muscle.html) is a good workaround.  The whole science behind alcohol metabolism is explained, but for the method, just scroll down to ""How to lose fat or prevent fat gain when drinking.""  This is a nice cheat for nights you want to go heavy, or want to lose some water weight you may have been retaining."
36064,Try clear rum and fresh watermelon juice. Guaranteed no hangover.
36065,"vodka & water, with a splash of lemon or lime."
36066,What this guy says. Also mix it with G2 or Gatorade.
36067,Whiskey water
36068,"whiskey. best consumed before, during, and after workout."
36069,Loving the vodka waters with a squirt of mio.
36070,"my nig.. raspberry vodka, water, splash of lemonade..... lifesaver"
36071,"French 75.

1 oz gin, 3 oz champagne, half ounce of simple syrup & half ounce of lemon juice. You can garnish with a lemon twist."
36072,These are deadly and delicious. They are named after an artillery piece.
36073,Hydropneumatic recoil for the win!
36074,My favorite...never end up going to places fancy enough where I can order it though :(
36075,"Make it a special occasion at home, then.  It's on my list of Holiday favorites.

You know, holidays like Shrove Tuesday, Arbor Day, National Kung-Fu Appreciation Day..."
36076,Wednes Day
36077,Time to step up your bar game.
36078,"Definitely my favorite cocktail. Very classy, especially when correctly served In a champagne flute. After shaking and pouring then add the champagne, though. Another thing I like doing is to use less simple syrup, use a martini glass and coat the rim in sugar. Makes it lighter for me. Kinda loses the classy appeal, but gains a fun appeal. 
Edit: I accidentally a word"
36079,"close but no champagne, no syrup, no juice, no lemon"
36080,You're telling me
36081,YOUR TIME HAS COME
36082,One of my wife's and my favorite cocktails; we make them at home on those occasions we have an open bottle of champagne around.
36083,"Two very good classic cocktails no one has mentioned:

Aviation - gin, maraschino liqueur, creme de violette, and lemon juice.

Sidecar - cognac, Cointreau, and lemon juice."
36084,I've never had someone be unhappy when I made them their first Aviation.  I consider that drink the bridge to craft cocktail nerdiness.
36085,AMEN to the sidecar!! Several times I've ordered it at a bar and had to teach the bartender how to make it.
36086,Yes! Same here with teaching. The only difference with the recipe is that we use Brandy here in good ol' Wisconsin.
36087,im sure someone has mentioned it already but cognac is brandy
36088,"I've yet to find a Bartender who knows how to make an Aviation.  That is to say, they have never heard of it."
36089,"Yeah, I'm afraid to try and order anything i see in this thread at a bar, the bartender will probably just look at me funny and ask me to leave."
36090,"The Sazerac.

2 ounces Rye whiskey
Three dashes Peychaud's Bitters
One sugar cube or 1 tsp simple syrup
Splash of absinthe 

Garnish with a lemon twist."
36091,"I hate the black licorice taste of the absinthe, but I still get a Sazerac whenever I can because I like saying Sazerac. Sazerac."
36092,Sazerac.
36093,Drinking Sazeracs is what changed my mind on licorice. Now I'm a big fan.
36094,"The other great thing about the Sazerac is that when you bring the fixin's to a party, you fulfill the obligation to bring booze, but nobody wants to drink your booze.

Rye whiskey and absinthe? Who the fuck brings *that* to a party? Me, that's who."
36095,"Are you kidding? Maybe it's just a Canadian thing but rye is the go-to whiskey for everyone I know, and absinthe is almost never turned away."
36096,You're partying with the wrong people.
36097,Had my first one in New Orleans a couple of weeks ago. So good.
36098,How do you pronounce this>? (so I don't look like a moron when I order it)
36099,[Sasz-er-ack.](http://www.howjsay.com/index.php?word=sazerac)
36100,Wait... so its like an old fashion but with an extra ingredient and a lemon instead of orange?
36101,The Seven Seas: a splash of the first seven things the bartender sees.
36102,"In my day, we called that a suicide."
36103,The soda fountain at carls jr never saw it coming.
36104,"Holy shit, so that's where it came from.  Thats what we always called it as kids when we'd go up to a soda machine and get some of everything in our drinks.  Never knew why it was called that, but it makes more sense now."
36105,"We used to let people play ""Duck shots"" (I have NO idea where the name came from) but if there were three of you, you all got given a piece of ice and threw it at the back bar - which ever three bottles of liquor you hit - they went into your shot! Actually came up with some crackers!"
36106,The duck shooting carnival game.
36107,"We would pay the same game, but have our backs to the bar as we threw the ice.  We called it Ray Charles shots"
36108,"maybe because the bartender has to ""duck"" when they throw the ice"
36109,I imagine that crackers would make for a terrible cocktail.
36110,"""Swamp water"" from my neck of the woods."
36111,"There's a guy in my town who sits at the bar day and night. One night my friend and I asked him what drink to have, and he said ""The Rocky Mountain Bear Fucker"". Essentially the same idea, except I'm Canadian."
36112,"A Rocky Mountain bear fucker should be 151, Jack Daniels and tequila, never shaken.  A rabid Rocky Mountain bear fucker is a double."
36113,"Yep. That's how its always served to me as well... Except for a dash of Tabasco added in there :/ 

This is not a feel good drink..."
36114,"ah, i have the 649. Pick a drink, pour an ounce, then go six to the right, pour an ounce, go 4 to the left and pour an ounce and then 9 to the right and pour an once. Top it off with 7up or whatever."
36115,"Moscow Mule:

2 parts vodka


1 part lime juice

3 parts ginger beer or ginger ale (I choose vernors)

Serve in a copper mug if you can, but they are rare to come by as there are some state laws that prevent/limit the sale and purchase of copper mugs.

Edit: I should actually point out that this is the drink that made vodka popular in the USA. Back in the day, vodka had never been popular in the United States until Smirnoff began marketing a this drink to the businessman in the 1950s (think Don Draper). Although vodka really took off once more brands began making the liquor as well as the rise in martinis, it was the Moscow Mule that first put vodka on the map. 

You can find out more about the history of vodka here:http://www.tastings.com/spirits/vodka.html

And here is a Smirnoff Moscow Mule ad with [Woody Allen.](http://cf.badassdigest.com/_uploads/images/Woody%20Allen%20Smirnoff.jpg)"
36116,Why are there laws that prevent/limit the sale and purchase of copper mugs? Awesome drink by the way.
36117,"Every time that I have been to a bar that stopped serving them in copper mugs, it was because customers would take them home."
36118,"Reeds spicy ginger beer is great with this. The one with the red cap, does anyone actually drink the green cap one?"
36119,"**The Pickleback**

Sounds disgusting, tastes amazing, the most dangerous drink on the planet due to how fast and thoughtlessly they can be consumed.  I haven't been as drunk the night I was shown it since before they banned all the fun energydrink booze; **you have been warned**.

**•1 shot Jameson Whiskey** (or any whiskey)
**•1 shot kosher dill pickle brine** (that's the juice in the jar)
**Drink them, in that order.**  The brine shot is like a MrClean magic eraser for your tongue.  
(Don't mess up the order or use the wrong pickles, it will be gross!)
I always have to do one with the person I show them to, they always think it's a trick."
36120,"I first had a pickleback shot at some bar in Brooklyn that is whiskey and bacon themed. The shot glass was creatively folded bacon. God bless that place.

EDIT: Lots of people asking me what the place was called... I honestly don't know cause I was wasted and I'm not a local. If you ask enough hipsters in Williamsburg about the ""whiskey and bacon place"" I bet you'll find it though!"
36121,"A whiskey and bacon bar in Brooklyn? God, that must be the hipster equivalent of DisneyWorld."
36122,"Hipster Disneyworld is (or at least was until recently) The Woods, which is (was?) the bar hipsters went to with the intention of meeting someone and hooking up that night."
36123,"The Woods, Union Pool and Pine Box all fill that same niche."
36124,"I drank quite a few of these this summer.  I was drinking bourbon and the bar I was at had some wonderful homemade pickles and pickle juice.  They go down too easy.

EDIT: I accidentally a space"
36125,"Big at burning man, great way to get the morning hangover started into a morning drunk."
36126,Why would you want to rid yourself of the sweet sweet taste of Jamesons?
36127,Look who you're talking to: somebody who's taking shots of Jameson.  Of course they don't like the taste.
36128,"I was really hoping I'd see this here. I LOVE picklebacks, but no one has any idea what the fuck I'm talking about when I try to get it at a bar, and they stare at me like I'm insane.

So *so* delicious, but oh so dangerous."
36129,"If you're a terrible person, the Pink Panty Dropper:

* 1 case Keystone Light
* 1 handle Everclear
* 1 container powdered pink lemonade mix

Pour it all into a giant cooler and just mix the shit out of it with your hands because it won't matter anyway."
36130,"Every college party around 2006-2008... Always worked, usually everyone would puke though."
36131,"Burt Reynolds

Shot Glass

50% Spiced Rum

50% Butter ripple schnaaps."
36132,"If butter ripple is the same as butterscotch I just call this ""Maple Syrup"" and can confirm it is delicious."
36133,"What sounds more delicious? 

Maple Syrup?



Burt Reynolds?"
36134,Maple syrup on Burt Reynolds??
36135,You don't come across visionaries on Reddit often...
36136,"Gin and Squirt (the soda, not female ejaculation)."
36137,"Wondered why you had to explain that, then remembered where I am reading this..."
36138,"Sailor Jerry's spiced rum, cherry cola, and orange juice. It'll change you."
36139,I... I have all these things.  Guess I'll see you in AA!
36140,AA is for quitters
36141,"The after eight

Half shot of creme de menthe 
Shot of tia maria
Shot of amaretto
Topped with coke.


Tastes like mint chocolate"
36142,"I assume you mean cool, cold, refreshing Coca-Cola."
36144,I don't normally pay attention to usernames... But...*what*?
36145,I don't even think I have sweat glands there...
36146,Ah yes I did indeed mean delicious refreshing coca cola
36147,"I call it a Russian Lemonade.

Vodka. Ice. Lemons. Like a whole lemon cut up, but not squeezed. Let it slowly sink in. No sugar. Nothing else.

Mid-range Vodka works fine, don't use anything worse than Smirnoff. Make it very cold."
36148,"**Srirachaholic**

*Ingredients:*

* 1 oz. rum (light or dark, your choice; I recommend flor de caña extra dry for this one)

* ¾ oz. domaine de canton

* ½ oz. grand marnier

* ⅛ oz. sriracha

* ⅛ oz. honey

* fresh thai basil leaves (for mixing & garnish)

* lime wedges (for mixing & garnish)

*Directions:*

1. Add 2 basil leaves, sriracha, honey, domaine de canton, and a lime wedge into a mixing glass.

2. Muddle the basil and lime.

3. Add the rum and grand marnier

4. Add large ice cubes and shake vigorously.

5. Taste for balance.

6. Double-strain into a large tumbler over an extra-large cube of ice, garnish, and serve.

It's like drinking Thai food.

    Note: Can also be served as a wickedly delicious shot."
36149,that sounds delicious....i'll have to try it
36150,"I hope you enjoy it when you do!

Another spicy favorite:

**Bengali Gimlet**

*Cocktail recipe:*

* 1½ ounces Tanqueray Rangpur gin

* ½ ounce lime juice

* ½ ounce Curried nectar 

* 1 kaffir lime leaf

*Curried Nectar:*

* ¼ cup cumin

* ¼ cup coriander 

* ⅛ cup allspice

* 2 tablespoons black peppercorn

* 2 tablespoons white peppercorn 

* 1 tablespoon lightly chopped turmeric 

* 3 dried Thai chilis 

* 1½ cups water 

* 1¼ cups sugar 

*METHOD:*

*For the Curried Nectar:*

In a dry 2 quart sauce pan, toast cumin, coriander, allspice, black peppercorn, white peppercorn, tumeric, and Thai chilies. Add water and bring to a boil. Slowly add sugar, stirring as you go. Reduce heat and let simmer for 10 minutes. Remove from heat and strain ingredients. Let cool for approximately 1 hour before using. Makes approximately 2 cups curried nectar.

*For the Bengali Gimlet:*

Muddle Kaffir lime leaf with Curried Nectar in a mixing glass. Add ice, lime juice, and Tanqueray Rangpur gin. Shake heavily and strain into a chilled cocktail glass. Garnish with a paper thin lime wheel.

`source:` https://www.starchefs.com/cook/recipe/jonny-raglin/bengali-gimlet"
36151,"The Negroni.
Equal parts gin, campari, and sweet vermouth chilled and served up with an orange rind."
36152,You can also make a Boulevardier (pronounced bool-eh-vard-ee-AY in the French fashion) by replacing the gin with Bourbon. Although I prefer to replace the gin with rye whiskey myself. I just call it a rye negroni to avoid confusion.
36153,This and a Manhattan are the only two cocktails I'll order. Good stuff.
36154,"If you like a Manhattan then the Vieux Carre is right in your wheel house:

.75 oz rye whiskey
.75 oz sweet vermouth 
.75 oz cognac 
 Bar spoon Benedictine 
Two dashes peychaud's, two dashes angostura 

Stir and serve over ice in a rocks glass ..."
36155,"Flaming Dr Pepper:

8 oz. lite beer

1 shot Amaretto

splash of 151


Fill a shot glass with Amaretto, and float a bit of 151 on top.  Light shot on fire, drop into the beer, and chug.  Tastes like drinking a Dr. Pepper."
36156,"The Vieux Carre. A New Orleans Manhattan, essentially. An ounce each of rye whiskey (I like High West), sweet vermouth (Carpano is very good here, but you could also use Lillet), and cognac (I use Ansac for mixing). 2 dashes each peychauds and Angostura bitters, stirred and strained into a Benedictine-rinsed glass. Add a couple of rocks if you like, and garnish with a cherry or twist of orange. Or don't. Sip."
36157,Great cocktail.
36158,"Pimm's Cup!

2 oz. Pimm's No. 1
1/4 oz. fresh lemon juice
Ginger ale
Ice cubes
Garnish with a cucumber"
36159,"""Where are we on the chalice?"""
36161,"""Could you put the Pimm's cup in a...""

""Right on it sir!"""
36162,"Kind of off topic, but as a bar newbie, where the fuck can i learn a list of common drinks to order?  All these exotic ones are nice, but I just want some classics to get me started, haha."
36163,"well here are some cocktails, you need to try... don't order these at a dive, they will not be made well.

Gimlet- gin, lime, simple syrup (2,1,.5)

Negroni - Gin, Campari, sweet V (1,1,1)

Berlioni - gin, Dry Vermouth, Cynar (1.5,1,.75)

Bijou - gin, green chartreuse, sweet vermouth (1,1,1)

Corpse reviver 2 - gin, lemon, lillet blanc, combier (.75,.75,.75,.75) absinthe rinse

Bees Knees- gin, honey syrup, lemon (2,.75,.5)



Manhattan- Rye, Sweet vermouth (2,1) 2-3 Angostura bitters

Old Fashioned - Sugar, bitters, bourbon

Rob Roy- Manhattan with scotch instead of rye

Penicillin - Scotch, honey, lemon, ginger muddled, Peated scotch (2,.5,.75, .25)

Thief in the night - bourbon, averna, lemon, honey (1.5,1,.5,.5)

 

Dead Nettle - Egg white, tequila, orange, lemon, simple, st germain (2,.75,.75,.5,.25)

Madelaine - Tequila, lime, agave syrup, grapefruit (2,.5,.5,.5)

Smoky Margarita - tequila, lime, honey or agave, mezcal (2,1,.5,.5)



Rum swizzle - aged dark rum, lime, falernum, 3 angostura (2,.75,.5)

Dark and stormy - gosling rum, lime, ginger beer (2, .75, 4)


Vesper- gin, vodka, lillet blanc (2,1,.5)



Edit: forgot the only vodka cocktail i suggest on the merit that it has vodka in it. 

oh and a favorite shooter (makes 4)

Industry sour- fernet, green chartreuse, lime, simple (1,1,1,1)"
36165,Bourbon in a glass
36166,Good thing the bottle is glass
36167,I wanna fly with *you*.
36168,"Not a bar tender, but my cousin taught me this, and he's from New Jersey so he knows a thing or two about drinking.

The peppermint patty:

1. Take a swig of peppermint schnapps straight from the bottle.  Don't swallow it yet!
2. Squirt some chocolate syrup directly into your mouth.  Try not to miss, especially if you're wearing a suit on your way to a wedding.
3. Shake your head vigorously to mix, then swallow.

Stay classy NJ."
36169,"Peppermint Patty!

We did these all the time in college, with 100 proof rumpleminze."
36170,"Dirty girl scout!

We would put the chocolate syrup on tongue first, the take peppermint schnapps."
36171,"We Jersey boys are all about genuine class. Invented at my company christmas party after many shots were consumed (by me and my team) was the ""Mounds Don't"" which consisted of alternating shots of Malibu Rum and shots of chocolate from the chocolate fountain the company had rented. Needless to say we were kicked out and called in for a company meeting the following Monday."
36172,Got talked into trying a Gin & Tonic with a sprinkle of pepper and a piece of cucumber in it.  Absolutely delicious.
36173,use Hendricks gin-- made from cucumbers!!
36175,"One part Scotch whisky.  

One part man up

Enjoy!"
36176,"The Jack Donaghy?

The Ron Fucking Swanson?

The Ron Burgundy?"
36177,My favorite part about that list is Ron Burgundy is the only name I read as a question.
36178,"Not a bartender but we made this a lot in Newfoundland.

The lumberjack

* whiskey

* real maple syrup (none of that aunt jemima shit)

* bacon grease"
36179,"Next time you do it, try ""fat-washing"" the whiskey.  It'll impart the bacon flavor but remove the unappealing greasiness of the residual fat.

In a mixing bowl or large jar, mix a cup of liquid bacon fat in a liter of whiskey.  Stir, cover, and let it sit at room temperature for at least 6 hours, but not more than 3 days; try making a couple batches to see how strong you like the flavor.  Put the covered vessel in the freezer.  The fat will solidify and you'll be able skim it.  Finally, strain it through a washed paper coffee filter.  ""Washed"" means rinse the paper with clean boiling water to avoid the paper flavor.

It's not a spur-of-the-moment thing, but you can make as much of it as you want, and it'll keep practically forever, so make a big batch and enjoy at your leisure."
36180,You are a god among mortals.
36181,"Jersey turnpike
Empty the bar mats where you make drinks into a shot glass. Serve to the guy/girl who wont stop yelling ""shots"". They will stop"
36182,"The Last Word! Equal parts:

-Green Chartreuse

-Gin

-Luxardo Marasca liqueur 

-Lime Juice

Shake well with ice, strain into glass and garnish with a Maraschino cherry (Luxardo also produces Maraschino cherries that actually taste like something, if you're already slappin' down the cash for the Chartreuse you might as well get these as well, very much worth it)."
36183,"""Sääpallo"".

1 shotglass
50 % mint spirit
50 % tabasco

From Finland."
36184,That sounds terrible. But I'll try anything once.
36185,"We have a saying in Finnish: ""Try anything once except incest and folk dancing."""
36186,I don't think redditors got the memo.
36187,"What can I say, we have an inherent drive for traditional dance."
36188,"You also call puking ""speaking Norwegian"".  Y'all have some great sayings."
36189,"Shouldn't it be ""speaking Danish""?"
36190,"Ah, genuine Finnish tabasco"
36192,"I always love putting vodka into the cherry limeade they make at Sonic. Plus then you can walk around public places getting sloshed, and everyone just thinks you are drinking a Sonic drink."
36193,Sonic Screwdriver...
36194,"I heard it tastes a bit timey-wimey, with a hint of wibbly-wobbly."
36195,"Not really, but you'll feel that way after your 11th one."
36196,I'm going to try 12 this weekend.  I just hope it doesn't *Hurt.*
36197,This is actually a very clever pun.
36198,They're putting a sonic in my town and now I have a new goal!
36199,You know you can just add booze to any soft drink for anywhere right? I usually add it to a Big Gulp from 711.
36200,shhhhh. you're ruining it.
36202,"> then 3-4 counts (yes, that's correct) of each lime juice and grenadine. Shake, serve with cherries and limes.

I have a hangover just reading this. So much sugar."
36204,Its type 2 diabetes in a glass!... But really i want it now
36206,"My wife's favorite joke: A grasshopper walks into a bar and the bartender says, ""Hey! We have a drink named after you!"" And the grasshopper says, ""You have a drink named Stan?"""
36207,Get off reddit Dad
36208,garnish with grasshopper leg.
36209,If you came to our bar I would assume you were the 50+ crowd.
36211,"Grilled Pineapple Mojito--Malibu, grilled pineapple syrup, simple syrup, fresh squeezed lime juice, mint.  Oh. My. God. Delicious.

My favorite drink though is not a cocktail--I would much rather have a glass of wine or really great craft beer."
36212,Grilled Pineapple Syrup?? Sounds so yummy!
36213,"Bartenders of Reddit, I hate the taste of alcohol, but being a young guy, my friends never shut up if I order anything ""girly"". What can I drink that doesn't taste like rubbing alcohol?

EDIT: Thanks for all the awesome suggestions guys!"
36214,Honey Whiskey on the rocks. The manliest girly drink.
36215,Gin and Tonic with a splash of Roses Lime. Ordering it sounds like you know what the fuck you are talking about and it's delicious.
36216,"Well, if you don't want to get drunk, I find that a tonic and bitters serves nicely. If it's presented properly the glass should be filled with ice, topped with tonic water. Add 3-5 dashes of angostura bitters to the top of the ice, and squeeze a lime wedge into the mix. Drop the wedge into the glass and take a sip! Awesomely refreshing and it looks like something that packs a lot more punch than it does."
36217,"The Empire:   
1x Apricot Brandy   
1x Calvados   
2x Gin   

(sweeter) American Beauty:   
1/2 oz. brandy   
1/2 oz. dry vermouth   
1/2 oz. fresh orange juice   
1 dash crème de menthe   
1 dash grenadine   
Ice cubes   
Tools: shaker, strainer   
Glass: cocktail   
Garnish: float of Port wine   

EDIT:   
Hop Toad:   
1x Apricot Brandy   
1x Dark Rum   
1x Lime Juice

I am not a bartender but I have been systematically going through a number of cocktail books and keeping track of the good ones."
36218,"The Toronto.

2 ounces rye whiskey, 1/4 ounce fernet (Branca typically preferred), 1/4 ounce simple syrup, dash of bitters.

I usually toss a little extra fernet in because I love how it cuts the rye. I can't get enough of this."
36219,And some Coke and you've got The Mayor of Toronto.
36220,How many of these until my drunken stupor is of sufficient quality to defend smoking crack?
36221,"I work in a nightclub in the UK, not really a ""Bartender"" how you have one in mind, but I pull pints, make the very odd easy cocktail, but mainly its spirit and mixers or bottles. 

Me and a couple of guys had the night off, and got some drinks vouchers. We got a bit drunk and them and decided to start buying random drink, we ended up mixing spiced rum and amaretto. Honestly, it tasted like Christmas, normally I HATE amaretto, but it tasted so nice in the mix.

We worked out (like it took much working) that it was best in 2:1 of rum:amaretto, with coke on top. Its simple to make, but just give it a go. We all thought it tasted like Christmas, but we were all also rather drunk. 

Next one, Turbo Shandy, if you want to get drunk, quick, and on something that tastes alright, grab one of these. Get a bottle of beer, a bottle of smirnoff ice/wkd ice/vk ice etc mix them together and shove a shot of vodka in them. Works errryyyy time"
36222,"I'm not sure if it's popular elsewhere but nobody around me knows what a shot of **Three Wise Men** is:

1 part Johnny Walker

1 part Jim Beam

1 part Jack Daniels"
36223,"**The Four Horsemen**

add 1 part Jameson"
36224,"**The Jackson 5**

add 1 part Jose Cuervo"
36225,"**Film At 11**

add 1 part pickle juice (Vlasic)

add 1 part Peach Scnapps

add 1 part Malibu

add 1 part fabric softener (Downy)

add 1 part Sherriff (not vodka, we need pie filling, flavour up to you)

add 1 part Rosewater (pref from 3+ day old roses)"
36226,Fabric softener? I would like to wake up after the drink.
36227,"True, I only drink Downy when I'm getting fucked up that night."
36228,"Yep, I've seen the four horsemen bring about the end of a birthday celebration or two."
36230,Agreed. This shot is mostly pointless. People think they're getting so much more fucked up just because they are mixing 3-5 liquors. Really all you're doing is making a shot more unpleasant for yourself depending on what your taste in whisk(e)y/scotch is.
36231,"not the best tasting, but it will get you right pretty quick. 

It's called 2 hicks and a spic chasing a turkey down a gold mine.  You drink this monstrosity like a shot.

half ounce of the following:

Jim Beam, Jack Daniels, Cuervo, Wild Turkey, goldschlager.

Chase with regret and hatred for yourself."
36232,Sounds like a more fucked up version of a Four horsemen of the apocalypse.
36233,Where I am from that's called a Rocky Mountain Bear Fucker. Weird
36234,"Pan Galactic Gargle Blaster.

Take the juice from one bottle of that Ol' Janx Spirit.
Pour into it one measure of water from the seas of Santraginus V(Oh, that Santragian seawater! Oh, those Santragian fish!)
Allow three cubes of Arcturan Mega-gin to melt into the mixture (it must be properly iced or the benzene is lost).
Allow four litres of Fallian marsh gas to bubble through it, in honor of all those happy hikers who have died of pleasure in the Marshes of Fallia.
Over the back of a silver spoon float a measure of Qalactin Hypermint extract, redolent of all the heavy odors of the dark Qalactin Zones, subtle, sweet, and mystic.
Drop in the tooth of an Algolian Suntiger. Watch it dissolve, spreading the fires of the Algolian Suns deep into the heart of the drink.
Sprinkle Zamphuor.
Add an olive.
Drink . . . but . . . very carefully . . ."
36235,Like having your brains smashed out by a slice of lemon wrapped around a large gold brick
36236,"""Oh don't give me none more of that Old Janx Spirit

No, don't you give me none more of that Old Janx Spirit

For my head will fly, my tongue will lie, my eyes will fry and I may die

Won't you pour me one more of that sinful Old Janx Spirit"""
36237,"It is a curious fact, and one to which no one knows quite how much importance to attach, that something like 85% of all known worlds in the Galaxy, be they primitive or highly advanced, have invented a drink called jynnan tonnyx, or gee-N'N-T'N-ix, or jinond-o-nicks, or any one of a thousand or more variations on the same phonetic theme. The drinks themselves are not the same, and vary between the Sivolvian 'chinanto/mnigs' which is ordinary water served at slightly above room temperature, and the Gagrakackan 'tzjin-anthony-ks' which kill cows at a hundred paces; and in fact the one common factor between all of them, beyond the fact that the names sound the same, is that they were all invented and named before the worlds concerned made contact with any other worlds.	
What can be made of this fact? It exists in total isolation. As far as any theory of structural linguistics is concerned it is right off the graph, and yet it persists. Old structural linguists get very angry when young structural linguists go on about it. Young structural linguists get deeply excited about it and stay up late at night convinced that they are very close to something of profound importance, and end up becoming old structural linguists before their time, getting very angry with the young ones. Structural linguistics is a bitterly divided and unhappy discipline, and a large number of its practitioners spend too many nights drowning their problems in Ouisghian Zodahs."
36238,"Dark and Stormy:

* 2oz Dark Rum
* 4oz Ginger Beer
* Ice
* Lime Wedge"
36240,"Yup, the recipe is even on the bottle of Gosling's."
36241,"You would think so, but very few bars have ginger beer."
36242,"My dad and a buddy of his ""invented"" a drink in college they call the tootsie roll, which is a shot of orange flavored vodka in a big mug of root beer. Tastes just like an orange tootsie roll pop.

(No idea if they actually invented this, I'm sure they borrowed it from someone)"
36243,"According to Ted and The Slutty Pumpkin, Kahlua and root beer tastes exactly like a tootsie roll."
36244,"IANAB, but my favorite uncommon drink is the Scooby Snack. It's Banana Liqueur, Midori, and whipped cream, blended together. Tastes glorious and gets me trashed. It's been years since I've had one, come to think of it. Must remedy that soon."
36245,"IANAB...I am not a bartender?

You can't just make up your own acronyms YMFAMF."
36246,You mother fucking ass mother fucker?
36247,"Gadzooks! Good deduction, Sherlock. YSGAM"
36248,You should grow a mullet? Don't mind if I do!
36249,AYSSOAAW????
36250,Are you some sort of acronym answering wizard?
36251,this one makes the most sense but i cant help but think he really meant silly straws and watermelon.
36252,"Are You So Soapy Olives Are A Waste?

That doesn't even make any sense, jerk."
36253,All your silly straws or an awesome watermelon???? You drive a hard bargain sir.
36254,I wasn't sure if I had to add an AH for asshole or just an A.
36255,"Its a very undersold drink, I agree. I have a different recipe from my bartending days though.

1oz Malibu
1oz Midori
.5oz Banana Liquor
Splash on Bacardi 151
Top with even portions of heavy cream and pineapple juice 

and Viola! Lets drink!"
36256,I've never seen anyone drink this anywhere but Okinawa but they are delicious.
36257,"Christmass in a bottle

It's Becherovka with a cola-mix (cola and orange)  
About 1/4 becherovka and 3/4 cola-mix"
36258,A friend brought a bottle of this to my house and I have had no idea what to do with it until now.
36259,It's called a flaming Moe
36260,In the Netherlands we call It a: ''Flying Deer'' It's Red Bull 50% and 50% Jägermeister. It's fucking delicious!
36261,That's a really good name for that. Here in America that is A Jager-Bomb.
36262,"I've personally have only seen Jager-bombs as shots of Jager dropped into a glass of Red Bull - shot glass and all, rather than 50/50."
36263,This is because it says on the can not to mix it with other drinks. The bartend passes it to you un-mixed. Its up to you now to do whatever you please.
36264,"I love Jager-Bombs. Like, I love and respect them so much that I completely stay the fuck away from them."
36265,"You know that friend you really only hang out with to when you're going to some rager? And then you always end up getting absolutely fucking smashed and do things that you regret for the rest of your life?



That is my relationship with Jäger-bombs."
36266,The Bulldog : make a standard white Russian and add a splash of coca cola!
36267,"Yes, I've heard of it as a Colorado Bulldog, but it takes the White Russian and makes it taste like a Coke Float.  VERY good stuff."
36268,ITT: alcohol that nobody ever has.
36269,Creme de Menthe and cherry fresca tastes identical to a candy cane
36270,Vodka.  It goes with everything.
36271,"Lemon? Check.

Mint? Check.

Red Bull? Check.

Sadness? Check.

Mango? Check.

Yup. Goes with everything."
36272,"i only sarted drinking recently. vodka mainly. but. i do this for the taste. 1 can of seven up or sprit whoch equals.2/3 of the drink. 1/3 vodka. and add just a tiny bit of banana liquor for taste
on of this im out of this world. 2 of these im on the floor. i dont do it if i ate a big meal before though"
36273,"Oooh, I found another Russian troll trying to influence Americans. /s"
36274,Well before I quit drinking 17 days ago my drink of choice was Hennessy
36275,Keep at it man. You got this!!
36277,Tequila. Chilled.
36278,"This. People shit on tequila, but if you get a nice one it's heavenly. Cheap tequila is going to taste like shit."
36279,Cheap anything is going to taste like shit.
36280,"Jeeeeez thank you. Try this tequila. It will change your life. 

“Fortaleza Blanco” Be sure to get it chilled. Hands down best tequila I have tried thus far."
36281,Fortaleza is one of my go to’s. However it’s Anejo for me🙌🏽
36282,I haven’t tried it yet ! Will have to though. Chilled ?
36283,"Yes, ask for a chilled glass too!!"
36284,Omg game changer. Ty
36285,Or chilled tequila with mikes/Smirnoff if you just want your brain to shut down for a day.
36286,"Rum 

Yo ho, yo ho, a pirate's life for me"
36287,Kraken Rum is my friend.  I am spending time with him now as I type.
36288,Didn't expect the (current) top answer to be one I agree with.  Yay.
36289,Yay I'm top answer. Cheers mate!
36290,Single malt scotch.
36291,Islay preferably.
36292,"wheat beer, cant get why people are not drinking it."
36293,Can't beat a gin and tonic.
36294,"Gin, tonic and a slice of cucumber. Couldn't beat it with a big stick."
36295,[I'm about to blow your mind](http://www.ginfoundry.com/gin-news/gin-tasting-wheel/)
36296,"I'm an now indebted to you, my newest and dearest friend."
36297,I recommend if you can get it using Gatorade Lime Cuccumber.  I have used it with a variety of Gin's and Genevers and it is most excellent.
36298,It's refreshing as fuck
36299,Whiskey. Eagle Rare to be exact.
65963,Absolutely
36301,Eagle Rare is the best bourbon there is imo. The price to taste ratio is perfect.
36302,"Can't say your opinion is wrong but you gotta try some more bourbons friend. That being said, eagle rare is good shit"
36303,"Oh, I've tried plenty. Always open to recommendations btw. In terms of sheer taste, there are probably better ones out there. But part of what makes it the best for me is that it's such a tasty whiskey at a very affordable price point. Blanton's is good too, but $60+ dollars a bottle is roughly twice as expensive as ER10. 

Another great whiskey for the price is Wild Turkey 101. It's also far more available than ER10. Lots of people hear Wild Turkey and think it's some trashy swill, but they're wrong. I just see it as more for me."
36304,Wild Turkey drinkers unite!
36305,WT is delicious! What's your favorite variety?
36306,101
36307,"If you can get your hands on angels envy rye, I highly recommend"
36308,"Ah my son, you expose your own ignorance I'm afraid. I said the best bourbon. What you mention is not bourbon, and is wildly expensive"
36310,Bundaberg rum
36311,"Is that the Australian company? I didn't know they made alcoholic drinks, I'll have to try that!"
36312,Jameson
36313,Steele Reserve 211
36314,I see you are a man of frugality and class.
36316,Just when I thought I was falling in love.
36317,"Awww man, now I feel bad...."
36318,"It's cool, we can still be friends k"
36319,"Hard cider! Also beer - I'm pretty into red ales right now. If we're only talking liquor, then rum for sure."
36510,Alcohol
36321,Vodka! Even if it’s the cheap stuff. Mix it right and you’re good
36322,The first shot is the hardest and then after that everything goes down smoothly.
36323,"Vodka. Cheap, does the trick with fewer calories, and doesn't cause bad hangovers."
36324,my horrible Sundays beg to differ lol
36325,Sometimes I wish I had bad hangovers. Maybe I wouldn't drink so much if there was more of a negative price to pay.
36326,"Once youre like 30 or so you will have a hangover. This hangover will literally make think you might actually die. You do not wish you got bad hangovers, enjoy it while you can."
36327,"In what world does vodka not give bad hangovers, and can I live there?"
36328,The world where you get vodka sodas
36329,Goose in my experience
36330,The world where you're properly hydrated and fed before drinking?
36331,The only hydration I get is from alcohol
