idx,text
36643,Redbull and vodka and cranberry vodka are my go tos! I'm 23 now and not a big drinker so I don't know a lot about drinks but I swear by those! ALSO HAPPY BIRTHDAY!
36644,Cranberry vodka sounds like it'd be good!! And thanks!
36645,Its also good for urinary health!
36646,Minus the alcohol part lol
36647,"Those in moderation, the caffeine speeds up your heart rate big time."
36648,"Agree but some of us with terrible habits are unphased by a single redbull lol. I can down a pot of coffee like nothing, the 70mg caffeine in a normal sized redbull is nothing to be anymore.  


Don't be me though, that is not healthy."
36649,Lmao I feel you on this
36650,I’m also a fan of pineapple vodkas!
36651,Oh this sounds amazing. I’m gonna have to try
36652,I like rum and pineapple. Like a cheap pina colada.
36653,"Add a lime to it, and you will never go back to fruitless vodka cranberry."
36654,Oh yes I get mad when the bartender doesn’t give me one 😩
36655,"Moscow Mules!!

Edit: Seriously OP, don’t sleep on these."
36656,I’m partial to Irish mules! Jameson instead of vodka 👍
36658,A lot of people told me to try a Manhattan as my first! And I'll keep in mind about the mixing!
36659,"A Manhattan is technically a sweet drink but it's very, *very* booze-forward. If you don't like to taste alcohol, I'd probably hold off on trying one. Anecdotal evidence-- was recommended a Manhattan on my 21st bday. Chugged it because I hated it, then puked it up about 30 minutes later."
36660,"An old fashioned is a sweeter whiskey drink. A Manhattan doesn't have any sweet component to it. It's whiskey, bitters, and vermouth"
36661,The vermouth used in a Manhattan is sweet.
36662,Barely and the tiny amount used just offers some balance to the whiskey. I also think a Manhattan is a really bad first drink for someone on their 21st.
36663,"Fair enough. 

Looks like we agree that it's not a great intro to cocktails, though, for someone that doesn't already have a taste for booze."
36664,"I would not try a manhattan for your 21st birthday. Just get some cocktails that are enjoyable and easy to drink so you don't have to force down some 12-15$ STRONG drink you don't enjoy. Margaritas, daiquiris, tom Collins, white russians, mai tai, hard cider, micheladas, beers are all enjoyable to drink."
36665,Oh... noted!! Thanks for your suggestions :D
36666,I pretty much only drink beer.
36667,What's your favourite beer? :)
36668,"If you aren't normally a beer drinker, I would recommend something like a blond ale or an amber ale. You can just ask the bartender for his/her recommendation of those types of beers. Shy away from IPAS. Also hard ciders are delicious, they are basically beer made from apples and taste like alcoholic apple juice. Some are dry(not sweet) and others are a little sweet like angry orchards."
36669,"Lime margarita on the rocks, lots of salt.
Or a good hefeweizen.
Or cabernet."
36670,"Happy birthday!
I like margaritas and dark beers. Don’t mix them though."
36671,Thank you!! :)
36673,"thank you!! i haven't had any cocktails since i couldn't order legally in restaurants and don't go to parties, but i do like flavoured soju and white wines :) i've seen moscow mules mentioned a few times, i may need to find this!! and wow, i've never heard of a birthday cake shot!"
36674,Long Island Ice Teas are good when they aren't from a mix. Japanese beers and whiskeys are good because they are often pretty sweet and don't have as much of that bitter alcohol taste.
36675,"Sweet drinks like:

* White Russians -- Kaluha (coffee liqueur) + heavy cream or half & half + vodka
* Dessert beers or Stouts (think coffee and chocolate flavors, but not as sweet)
* Mead (super sweet fruit wine)
* Prosecco -- a sweet, bubbly white wine
* ACE Pineapple cider
* Hard apple ciders
* Rumchata (tastes like Horchata, basically. Or cinnamon toast crunch if you're not familiar with Mexican horchata)"
36677,Thank you! The drinks mixed with sodas sound like the best so far :)
36678,"The soda really takes the edge off of the alcohol. The berry and gin frink really just tastes like another soda. It makes the acohol invisible, which csn be dangerous becuase some people forget that they are drinking alcohol untill the stand up and notice that the world did a 360."
36679,"It depends on what my goals are.

If I’m going out to dinner and I’m going to get comfort food (99% of the time) I’ll get a beer or hard cider, usually local to my area but I also like angry orchard.

If I’m in the mood I’ll get a mixed cocktail, usually some variation of a rum punch or an margarita.

If I’m drinking to get drunk vodka crans all the way."
36680,"Happy Birthday! I love anything sweet and fruity. If I’m going to a cocktail place I’ll have a Pornstar Martini, and if that’s not on the menu then anything sweet (I look for passion fruit, cherry or raspberry flavours). If we’re doing wine I like white Zinfandel. If I fancy spirits then usually either amaretto and cranberry juice or flavoured gin/vodka and lemonade. 


Edit: apparently I can’t spell"
36681,"White Zinfandel is probably my favourite wine! Gin/vodka and lemonade seem like my type of drink, maybe I'll try it sometime! And thanks :)"
36682,"My favourites are cherry vodka and lemonade, passion fruit gin and lemonade and pink/raspberry gin and lemonade. It’s all about experimenting. I love trying new cocktails and don’t always like them, but it’s just about finding out what you like and don’t like. I can’t drink whiskey/bourbon alone or with mixers, but I love them in certain cocktails if the balance is right."
36683,usually a vodka cranberry or sprite. sometimes i’ll go for a long island tea!
36684,I've heard so much about long island iced tea lol i'm really curious!! one day ill try--
36685,they are v good and strong! hehe happy birthday!
36686,"Mixed drink, Mojito. A little sweet, a little sour, a little herby, a little boozey.

Beer, Pilsners are easy to drink and go well with fatty, savory foods like wings, BBQ, fries or bar snacks.

Wine, Riesling is a sweet to semi-dry white wine know for being pleasant and easy to drink. 

Since it's your 21st, I'd like to recommend tastings and tours of craft distilleries, breweries, wineries, etc if that's an option where you live. Distilleries generally serve unique cocktails if small servings of straight liquor isn't your thing. A brewery tasting lets you try a wide variety of beer styles, and the staff are often VERY knowledgeable and can help you find a beer that's right for you. Winery tours and tastings are more of a summer and fall thing, but they can also help you narrow down your wine palette so you know what styles to buy at the store."
36687,Sweet sweet scotch
36688,"My people.  I can't bothered with anything other than scotch rocks, bourbon w/ lime and tequila shots anymore.

Maybe mojitos if we patioing."
36689,Bloody Mary - it’s a meal in a glass.
36690,"I like craft beer now in my advanced age. When I used to drink more Tequila Sunrises were it. I’d recommend that for your birthday but tread carefully because you can get completely fucked up off a couple of those. 

Also happy birthday!!!"
36691,"Thanks!! I don't think I've ever had a good beer, I have yet to try..."
36692,"I like so many different drinks it's hard to decide and stick with one for the night, lol.

My favourites are:

* Früli (strawberry Belgian beer)
* Blonde Leffe (Belgian beer)
* Baileys Irish Cream (liqueur - I like it straight over ice)
* Honey Dew Golden Ale
* Strawberry and lime Kopparberg (Swedish cider)
* Prosecco
* Pinot grigio
* Strawberry Daiquiri"
36693,Fruli is seriously fucking amazing!
36694,"Isn't it?! I rarely find it anywhere though, shops or pubs. 😞"
36695,Really? It's pretty widely available where I live. Most pubs and stores carry it!
36696,"Where are you?? I'm in the UK but only find it when I go to cities (Belgo has it on tap!).

Tesco also stock it, but only sometimes (where I am anyway). 😞"
36697,Toronto! The LCBO (Liquor-store) has it in stock almost always!
36698,">Früli 

I live in Belgium and I haven't heard of it on the other hand we do have lots of beers and it might be one that's made for international market only. 

I actually prefer delerium red ,the cherre chouffe rouge , kasteelbeer rouge, or chima red. nowadays as red beers go. 

  
For OP: just try everything and find out what you like (you might want to take your time and not do it all on one night). I also noticed my taste evolves as I grow older.   


I would recommend paring more . Like when you go out for dinner depending on the dish you chose beer, cocktail, wine, ... for example in the irish pub you take an cider with your food, in a mexican restaurant a margarita or something, .... It all depends on where and when you are drinking. I know a few restaurants where you can choose to get with each course a paired wine or beer.    


In doubt you can always ask your server for some suggestions or just take the plunge and try something new"
36699,These all sound so good and my type of drinks!! Thanks for the suggestions :)
36700,A stout or porter. Always go for a stout first though
36701,"I've never had dark beer before, I'm curious to try!"
36702,Some are bitter. Some taste like coffee and chocolate. Guiness is the bitter type.
36703,"My favorite shot is the white gummy bear if made correctly tastes exactly like a white gummy bear

My favorite drinks at the bar are UV orange with sprite (tastes like Sunkist orange), sex on the beach (vodka peach schnapps OJ & cranberry), screwdriver (vodka OJ) or jack & coke

My favorite drink to mix at home is Cruzan peach rum with mango monster, it’s really yummy & girly but be careful with the monster lol Obviously don’t drink like 3 cans of monster"
36704,Raspberry screwdriver. Something about raspberry vodka and orange juice is just amazingly delicious.
36705,"Happy 21st! These were my favorite drinks when I was new to the world of drinking:

\- malibu and pineapple juice

\-vodka and pineapple juice

\-amaretto/whiskey sours

\-Tokyo Teas if I was trying to get drunk quick/cheaply (similar to long island teas)

Once I got more accustomed to the taste of alcohol I'd go with:

\-whiskey ginger

\-moscow mules

\-gin and tonics"
36706,Everything with pineapple sounds so good!!! And thanks!
36707,"Pineapple juice is THE best mixer, especially when you’re drinking at home. In our cheap college days my boyfriend would buy the biggest, cheapest handle of spiced rum and then giant cans of pineapple juice and just mix those. You couldn’t even taste the alcohol and we drank way too much for way too long off just $10-$15"
36708,"Vodka soda, splash of cranberry, and at least two limes. Not fancy, but very delicious and on the lower calorie end of the ""girly"" drinks."
36709,"I see you, and I raise you vodka cranberry with a splash of soda

also a lemon drop shooter if anyone offers you a shot"
36710,"I was ALL ABOUT vodka cranberries but I'm forever watching my weight and trying to lose a little more so I figured I'd switch the cran out for the soda, BUT, I still get that little cran splash to flavor the drink. So tasty. And then I'm like, ""AND GIVE ME ALL THE LIMES!"" I. Love. Lime."
36711,Spiced rum and coke!
36712,"My absolute favorite is a Negroni with a few dashes of grapefruit bitters and a splash of soda. (I've only ever made that at home and few bars are likely to have grapefruit bitters, although orange bitters are a good alternative) 

If you want something really fancy, find a Tiki bar; Tiki drinks mostly have long recipes that amount to gloving a heavy slug of rum in fruit juices and syrups, then garnishing elaborately with flowers, mint, tiny umbrellas, lime shells and almost anything else imaginable. (I once had a Tiki drink that was garnished with a banana cut to look like a dolphin with cloves for eyes and a burnt cinnamon stick put in the mouth so it looked like it was smoking a cigar) 

For a surprise, order a glass of Fernet Branca, an Italian amaro once aptly described as, ""mouthwash with delusions of grandeur.""  That said, I genuinely love it, especially with dessert, and my understanding is that it has a certain special popularity among those in the hospitality industry. (Somebody whom I know who has many acquaintances who work in food service told me about the 'Ferrari', a shot of equal parts Fernet Branca and Campari; I've made it a few times, it's... it's something)

If you want to be a troublemaker, order a Ramos Gin Fizz."
36713,Mojito!
36714,Whisky Sour!
36715,"Avoid sugary drinks, they will make you feel sick and hungover. Hard Ciders are great, but aim for dry ones (with a lower sugar content), and avoid wine-based ciders (apple or pear is great).  A lot of ciders have added sugar—even the drier ones. If drinking liquor such as vodka, try to drink potato or corn based as opposed to grain or wheat based—the human body processes non grains easier and you will be less ill - feeling the next day.  Learn a little about wines to better decide which ones you like (more expensive does not equal better). Importantly, drink water between each alcoholic beverage.  Limit mixing types of alcohols to no more than 2 types in one night; eg, just beer and shots (but not wine also), or better yet, jus one type. Enjoy trying different types of drinks while you’re young, the older you get the less your body can tolerate, and you are less able to bounce back / feel less hungover the next day. 

(Watch your drinks carefully while they are being made and all throughout drinking them to avoid foreign substances put in them by scurrilous types wishing to take advantage of you. Have fun and be bold but beware you boundaries and inhibitions are lowered. Party
 with people to trust.)


Happy Birthday!!!"
36716,Happy birthday!!! If I plan to get totally twisted my go to is Jameson and Disaronno. It’s called The Godfather.
36717,"I'm normally a jack and diet coke gal, but if I'm feeling adventurous I go for either a long island or a margarita"
36718,I love any and all fruity cocktail drinks but Pina Colada's are my favorite.
36719,Beeeeer
36720,"Happy Birthday!!

Beer: Blue moon is a basic ""everyone enjoys this"" beer. If you have the chance at any bar or craft brewery, try a flight of a bunch of different kinds of beers. I'm normally a light beer person but I surprisingly like a lavender stout or a coffee stout.

&#x200B;

Shots: My favorite \*slightly extra\* shot is called a breakfast shot. Its whiskey mixed with butterscotch schnapps, which tastes like a pancake, and then you chase it with orange juice. Sounds weird but it's delicious. Also, if you're a person who likes pickles, you can chase any liquor with pickle juice and there's no burn and its delicious.

&#x200B;

Cocktails: Only get a Long Island Iced Tea if you plan on blacking out/crying in my personal experience. Amaretto Sours are delicious and slightly sweeter than a whiskey sour. Martinis/Cosmopolitans are stronger than you want them to be no matter how attractive they look on tv. 

&#x200B;

Most importantly, drink a bottle of water before you go to bed and have fun!!"
36721,"Dry spicy red wine, hoppy bitter beer, frozen lime margaritas."
36722,Happy birthday!  I usually go for craft beers or a whiskey sour
36723,Testify brother!
36724,"Cranberry juice, splash of pineapple juice and clear rum. I generally go for the dragonberry Bacardi."
36725,"Tequila (preferably Don Julio) with soda and a splash of grapefruit!

Tequila is my favorite but I hate margs because the sugar overload is always too much for me, so this drink is a dream concoction for me. Also, if I want something a little sweeter, I do pineapple instead of grapefruit."
36726,"Mojito's! They have been my fave for soooo long, it's so refreshing!"
36727,I love gin and tonic with lime
36728,"When I drank, it was Vodka, pink lemonade, and sprite. Absolutely delicious and refreshing. Now I just drink it without the vodka."
36729,"Happy birthday! My go to’s are a Moscow mule or a good margarita, none of that house margarita junk where they use cheap tequila and triple sec (yuck). Or an old fashioned. 

What you end up liking will depend on how sweet you prefer your drinks."
36730,"I wonder if it's easy to tell which place will give you a good margarita vs a cheap one? I don't mind whether a drink is sweet or not as long as it tastes good and not like pure cough syrup! (looking at you, vodka..)"
36731,"If it’s a nicer bar or a restaurant and they have a drink menu, they’ll normally have a few different options listed, and will list what’s in the drink. In general, anything above the house Margarita is probably going to be decent. But you’ll learn over time what liquors and mixers you prefer. Grand marnier or Cointreau versus cheap triple sec, a smooth añejo or reposado tequila versus Cuervo silver or a mixto ‘tequila’.

The ‘drink menu with multiple margarita options’ thing may vary based on where you live. I’m in texas so margaritas are practically their own food group."
36732,"I totally agree with your post. That said BEWARE of mixed drinks that are advertised for cheap at chain restaurants, since usually they will be made up of cheap liquor.

Dallas BBQ in NYC, I still look at you badly all those years later after my NYC visit, for how much I felt like shit after drinking a certain drink(I think it was a margarita) there! Unlike another Mexican restaurant in Chicago(Cafe El Tapatio), where they actually do a decent job with their margaritas, and it isn't watered down liqueur that's a joke."
36733,"Yep, gotta be careful with those cheap mixed drinks, this is where knowing your liquors comes in handy. If they don’t list them on the menu, ask. If they’re selling the drink for $3, imagine how cheap it was to make."
36734,"So true, about that! And I think that's why I'll probably skip ordering anything like say a $1 or $2 margarita special at a casino, when I go to Las Vegas next month for my 2nd visit there. Going with others, since they found a cheap deal to travel there for next month."
36736,"I really dislike tomato juice so I'm kind of afraid to try it, haha. But maybe I'll try it again some time!"
36737,"Happy birthday! 

My go to drink is Irish Whiskey,  no ice, just a small drop of water to bring out the flavour. Smoother than any Scottish Whiskey."
36738,thank you!! furiously googling the differences between whiskies now haha
36739,"Try some beers! I love a Moscow mule, a sour beer or a dry white wine."
36740,"I'm not the biggest fan of beers, but maybe I haven't had a good one yet..! I hear so much about Moscow mules, I gotta try one-"
36741,"It’s definitely an acquired taste. A lot of breweries will do a tasting and you can sample. There are so many excellent ciders now too!

Moscow mules are the only vodkas I’ll drink because they’re super refreshing!"
36742,Amaretto and coke.
36743,Rum & Coke with grenadine. Tastes like a cherry coke!
36744,"I love the liquor named ""Ficken"". It is absolutely great!"
36745,Old Fashioneds and margaritas!
36746,Colorado bull dog
36748,Chocolate liker.
36749,"Happy birthday. I, personally, like really cheap crappy whiskey. Idk why I just prefer it. 
Things that are also good: ziplock; a shot of yager that you drop into a glass half full of red bull and blueberry grenadine. island devil .5oz pineapple vodka, .5 oz tequila, 1 oz coconut rum, champagne, Blue Long Island ice tea, .5 vodka, .5 tequila, .5 rum, .5 gin, .5 blue curacao. And finaaaally, pink lady which is basically gin, lemon juice, cherry juice and grenadine. Some people put egg whites in them too. These are my favorite “celebration” or ladies night drinks. These aren’t all exact recipes just what I remember from making them. Happy birthday!"
36750,"I tend to go vodka soda, but on occasion I'll get a greyhound (grapefruit juice with gin) with a splash of St Germain (which is an elderflower liquor, I think it adds a nice note)."
36751,Malibu + coke
36752,I'm 37 and Apricot Brandy Sour is  my all time favorite. Love the mix of sweet and sour. Have fun!
36753,"Happy Birthday! 

Mine is vodka diet coke, or if I'm going cocktails I like Mojito or some of the fruitier ones. Melon Ball (or something like that) is pretty good."
36754,Tequila soda extra extra lime
36755,Gin & Club Soda with Fresh Lime & Mint Leaves
36756,"Long Island Iced Teas! Sooooo much alcohol in them and you cab barely taste it. If you wanna get loose and Crazy, drink about 3 of them and you’ll be having a GREAT night!"
36757,"I'm trying to be healthier lately so I stick to vodka sodas with a splash of whatever juice I'm feeling. My favorite drink would be an orange crush, which seems to be a regional thing and I have been to many places where they don't know what that is. I also like a good dirty Shirley, really brings on the nostalgia!"
36758,"Vodka soda (la croix or soda water is preferred, whatever has no sugar), with lemon/lime/berries! 

I can chill with one or get schwasted on 10 if I want, but never have a hangover. No sugar and the water-based component of the drink is my tried and true hangover prevention."
36759,"Dash vodka
Dash peach
Cranberry juice
Top of with sprite and a twist of lime"
36760,"My (22F) go-to's are Whiskey sours, amaretto sours, coke and rum, amaretto and coke (VERY good), bay breeze (pretty sure that's pineapple juice, cranberry juice and Malibu) I recently started getting sprite and Malibu, dirty Shirley's are another good one as well, those are the drinks that I usually get at bars BTW, if I go to restaurants i like to experiment with different margaritas or the mixed drinks they have listed !! Happy birthday!!!!!"
36761,"I really like Moscow Mules (ginger beer, lime, vodka) and Mojitos (white rum, lime, mint). Both are very refreshing and light (and secretly have a good amount of sugar without tasting like it). Happy birthday!!"
36762,An old fashioned for sipping. When I started drinking my favorite was probably screwdrivers with flavored vodka.
36763,Jägermeister either pure or mixed with Red Bull.
36764,"Vodka, lime juice and lemonade/7Up. 

I do love a good cocktail though, and Apple Pie being my favourite. I can't remember all the ingredients though."
36765,"Depends on the situation. Most of the time I get a local beer, usually a kolsch, weiss, or amber (though I've recently developed a love of New England IPAs, whereas normally I'm not an IPA fan).  If I'm not getting a beer, I stick to a few basics that are usually hard to screw up:

&#x200B;

A glass of red wine. As long as it's not super cheap swill, red wine is usually a good option.

&#x200B;

Scotch and ginger. Two fingers of scotch with a splash of ginger ale.

&#x200B;

Vodka sour or whiskey sour. A staple at pretty much any bar, near impossible to screw up if the bartender has any experience.

&#x200B;

Mojito. If I'm feeling summery or eating something tropical/latin then this is my usual go-to.

&#x200B;

MaiTai. I go to Hawaii for a work convention every year. This is my go-to drink pretty much anywhere I go in Hawaii."
36766,"I'm not big into alcohol, so I like dessert drinks! There are a few places in town here that have adorable little chocolate-y coffee-y slightly spiked cocktails and I like them a lot. My go-to at a standard bar is a White Russian, which is essentially cream, Kahlua, and a little vodka. It tastes like a creamy vanilla coffee. Sometimes when I want to stay very sober, I ask for it without vodka.

(If anyone knows any other similar drinks I'd love to hear about them!)"
36767,"The first drink I purchased after turning 21 was a Long Island iced tea. Basically straight booze so if you’re not ready to take on something so alcohol-forward it might not be a good option but if you’re looking to make your first (legal) drink count, it might be a good option. Haha"
36768,"Tanqueray 10 and Schweppes. Lots of ice, large glass, fresh lime juice. Adult Sprite."
36769,Amaretto sour is my default for bars without a mix drink menu. Otherwise I'm a Moscato wine and mead girl
36770,"Short glass full of ice, 1 shot khalua, 1 shot rum top off with half and half cream."
36771,"When I don’t want to taste the alcohol I have Malibu and orange juice. Also I’ve noticed with the orange juice I rarely have hangovers the next day. 

Vegas bombs
Green tea shots

Cranberry vodka is a go to"
36772,"Happy Birthday! My favourite spirit is tequila, I always get that for shots and like most tequila based cocktails. I also often get a Long Island iced tea. A bar near me does a drink just called Fig, which is bourbon, fig, spices, wormwood and lemon and that’s my all time favourite but I’ve never seen it anywhere else :)"
36773,I may be basic as fuck in saying this but Kinky Vodka is the tastiest Vodka I ever drank. (I really dont like the alcohol taste)
36774,Gin tonics & Soju with any soda
36775,Malibu and cranberry with a squeeze of lime! Or vodka cranberry is always good.
36776,"My go-to is usually just hard apple cider. I don't have actual drinks often, last couple ones I had were some energy drink +  cranberry juice + vodka mixes and I didn't get any sleep after all that caffeine lol. Malibu rum + cola is probably my favourite drink I've had so far in my life, it's so sweet and yummy."
36777,"Happy birthday!

So when I first started drinking I stuck to very sweet drinks like Malibu+coke/lemonade, various flavours of Sourz, and vodka+orange squash, and then in my early 20s I'd moved onto things like snakebite (beer+cider), Jagerbombs (Jagermeister+red bull), and tequila shots. I do not necessarily recommend any of these if you're trying to be classy/fancy - save these for when you're trying to be very drunk.

For a nice, lowkey kind of drink, spirits and mixers are a good shout! Vodka can be mixed with almost any soft drink, I like gin best with lemonade and rum with coke. Cider is tasty (Swedish brands like Rekordelig make really good flavoured ciders, but apple is good too!), and I'm very picky about beer but I've found a couple that I like. 

&#x200B;"
36778,"Long Island Iced Tea made with Sprite, add peach Shnaupps....it's a nice peachy, spritey drink"
36779,"My go-to mixed drinks are either a Cosmopolitan or a Malibu and Sprite. If there's a decent selection for wine, I'll have a Moscato. I prefer my drinks to be sweet and fruity with very little flavor of alcohol.  Your preferences may vary depending on your sweet tooth."
36780,"Tequila, soda, splash of pineapple. Tastes good and it’s never given me too much of a hangover!"
36781,"Happy birthday!

I honestly just love Moscato wine, but for mixers my favorite is a fuzzy navel which is orange juice and peach schnapps (some bartenders add vodka too.)"
36782,Malibu Sunset! Soooooo sweet that I can't taste the alcohol.
36783,"Pina colava.

It's a cocktail from Disney, but everywhere I go has made it for me when I've asked.
Pina colava with raspberry puree in. It's gorgeous."
36784,"I like bloody marys, but I want it to be salty/savory and not overly acidic or for the tomato flavor to be overpowering. Someone once recommended putting crab meat into one and that sounds awesome. I still haven't tried it, but one of these days I will."
36785,Gin and tonic with a shot of peach schnapps.
36786,"Vodka or gin soda w lime is my go to—they’re refreshing and very drinkable, low cal/carb if you care about that, and won’t give you a stomachache or nasty hangover from a bunch of added sugars. I also like long islands if I’m just trying to get drunk, and beer if it’s on tap!"
36787,A Dumb Grandson Peptalk
36789,Cranberry and vodka. Sweet wine. Hard ciders.
36790,Happy birthday! I LOVE jalapeno margaritas-sweet and spicy. Also love gin and tonic.
36792,"Happy birthday! I turned 21 in april and didn’t drink alcohol until then. I’ve tried a lot of drinks these last few months lol. Wine and sangria get me fucked up like nothing else does. Vodka + cranberry juice or vodka +lemonade is a classic drink my friends and I get a lot. If you’re gonna do shots I like tequila more than vodka. 
Margaritas are amazing. 
Long Island iced teas are also great for getting fucked up and are super sweet. People might judge you for drinking them but who cares. Lol"
36793,"Happy birthday!

I like my drinks very sweet, so nowadays my go to drink is pineapple juice with malibu"
36794,Sea breeze :))))
36795,Pimms and moscato.
36797,"Ste. Chapelle Soft Huckleberry Wine is my all-time fave. But I'm a bit of a wino so I'm not extremely picky:)

If I want something light, I love hard seltzers. If I wanna go to a bar and get drunk, I love vodka crans and rum & coke."
36798,"Lemon Drops, Cosmos, Vodka sodas, Vodka/cran, Bicardi/Cran (was my college go to,) Beer choices are: Blue Moon, Stella, Kirin, Sapporo, Peroni"
36799,"Cocktail:  Blue Electric (1 part Blue Curacao, 2 Parts Vodka, 3-5 parts lemonade)--its a refreshing cocktails that's sweet, but drinkably so 

""Boring"" Cocktail:  Screwdriver/Cape Cod (2-4 parts orange/cranberry juice to 1 part vodka)--easy to make, easy to adjust the strength of/dilute

Beer:  Negro Modelo--not too grainy of a taste

Wine:  Pinot Grigio--mild flavour, goes with just about everything, not too sweet"
36800,"Whiskey sours and Jack & cokes, especially at bars because they are hard to mess up tbh!"
36801,Dark & Stormy! Spiced rum and ginger beer and a lime wedge if you like.
36802,"My favorite drink is a Bronx Cocktail, (gin, equal parts sweet and dry vermouth, and a splash of orange juice) but that's really only good for old people who want to drink something that tastes vaguely like cough syrup so you don't drink too fast.

My favorite thing to make when I was 21 is this beverage I invented called the Mango Berry Shit Spritzer.  That's where you take whatever random fruit-punch/crystal light/whatever mix you can find, combine it in a punch bowl with 7-up, a carton of rainbow sorbet, and the cheapest vodka you can find, and serve it to your friends so they don't make their way into your closet where you keep the good booze."
36803,margarita
36804,Moscow mule! So tasty
36806,Red Zinfandel or a Salty Dog.
36807,"Happy birthday! I'm a fan of lemon drops, screwdrivers, and appletinis"
36808,Various different stypes of beer from IPAs to stouts and porters. Ale when I'm in the mood. Of course I'm also quite partial to a nice glass of scotch or bourbon but it's stronger so I wouldn't necessarily drink that as often. I do love a a good Manhattan though!
36809,"Surfer on Acid - pineapple juice, jagermeister, rum"
36810,"Whiskey sour.  Equal parts whiskey, lemon juice and simple syrup. Tastes like lemonade. Or in the summer some whiskey in lemonade is great."
36811,vodka cranberry or a screwdriver
36812,Espresso martini. It's my fave but I can't sleep if I drink lots of them. I like most cocktails to be fair.
36813,"I’m hardened at 23 and only really like vodka rocks (with lemon), whiskey rocks, or tequila rocks (with lime), but if I’m not caring about calories I love a good Mai Tai, Hurricane, or Whiskey Sour."
36814,"Vodka proved to be too cough medicine-like for my liking, but a Hurricane sounds good!"
36815,"It might grow on you in time. Also “house” or lowest priced vodka is way better than any of the fancy expensive “small batch” stuff. Costco brand vodka is one of the best. Sochu, which I Japanese vodka is super smooth. A hurricane is like alcohol fruit punch lol. It’s so good but super sugary."
36816,"1. Goliath

2. Goliath

3. Goliath

4. Goliath (no not that one)

5. Mind eraser

6. Boomerang

7. Boomerang

8. Mind Eraser

9. Goliath

10. The King da Ka"
36817,"In these dark times, at least I can have some solace in there now being two /r/rollercoasterjerk subs"
36818,"ok bonus snark points for ""the"""
36819,What about the Superman?
36820,Oh yeah the superman six flags roller coaster at the six flags
36821,"I’ve only been to SFSL, SFOT, SFFT, and SFOG.

1) Iron Rattler

2) New Texas Giant

3) Twisted Cyclone

4) Goliath(SFOG)

5) WWGLC

6) Superman: Krypton Coaster

7) Mr. Freeze(SFOT)

8) Mr. Freeze (SFSL)

9) Dare Devil Dive

10) Boss"
36822,I'm glad to see another fan of The Boss! I love it. Did you ride before or after the helix removal?
36823,After. I’d say Boss is my favorite CCI I’ve ridden so far.
36824,"It's behind Boulder Dash for me. 

I just hope SFSL keeps the retracking going. There's too many people wanting it to be RMC'd. It's got a good layout for RMC but it's such a great woodie."
36825,"1. Iron Rattler  
1. X2  
1. Tatsu  
1. Goliath (SFOG)  
1. Goliath (SFGAm)  
1. Twisted Colossus  
1. Raging Bull  
1. Full Throttle  
1. Viper (SFGAM)  1.
1. X-Flight  

I know there are several that I haven't been on yet that would make this list (ie: El Toro)."
36826,"Iron Rattler is overrated. There’s not as much airtime, and the final drop isn’t that good. I found there to be more airtime on the first drop than that. For me it’s the worst of the three RMCs I’ve done (it’s my #6 overall so I don’t hate it). The other 2 I’ve done are twisted cyclone and Wonder Woman."
36827,I haven't done Twisted Cyclone or Wonder Woman but I've done Railblazer and I liked Iron Rattler better than that. I also likes Iron Rattler better than Steel Vengeance and Twisted Colossus. Maybe I just got it on a really good couple of days but the first drop is my 2nd favorite drop on a coaster after X2 and the dive off the quarry wall is one of my favorite elements on an RMC. I liked the pacing of the ride and it's one of the few rides that I've gone into with really high expectations and still walked away from impressed.
36828,"[in no particular order]

El Toro
Wonder Woman GLC
Twisted Cyclone
Superman SFNE
Kingda Ka
Iron Rattler
Goliath SFOG
The Boss
Mr. Freeze (both)
Wicked Cyclone"
36829,"I've only been to magic mountain, fiesta texas and  GrAdv

&#x200B;

1. El Toro
2. Iron Rattler
3. Twisted Colossus
4. Wonder Woman
5. Tatsuuuuuuuuuuu
6. X2
7. Kingda Ka
8. Full Throttle
9. Batman Clones
10. Bizzaro"
36830,Only El Toro?
36831,I clicked post too early. I edited it
36832,"Here:

1. Iron Rattler
2. New Texas Giant
3. Mind Bender
4. Goliath SFOG
5. Nitro
6. Twisted Cyclone
7. American Thunder
8. Ride of Steel
9. Batman SFGAm
10. Goliath SFGAm"
36833,"I'm not going to put these in order because it's hard to rank coasters when you haven't even been on your favorite in 17 years.

I've been to SFGAm, SFSTL, SFNE, and SFMM

SFGAm

- Viper
- Raging Bull
- Maxx Force
- Batman

SFSTL

- Boss
- American Thunder

SFNE

- Cyclone (defunct)

SFMM

- X2
- Full Throttle
- West Coast Racers

if Cyclone is disqualified for being defunct, then I'll add Viper - SFMM."
36834,"1. El Toro (4)
2. Twisted Colossus (7)
3. Goliath (Goliath SFOG) (12)
4. Iron Rattler (14)
5. Twisted Cyclone (15)
6. Wicked Cyclone (16)
7. Superman The Ride (21)
8. X2 (22)
9. New Texas Giant (27)
10. Goliath (SFGAm) (28)

The little numbers are where they are in my overall rankings. All the RMCs I’ve ridden at a Six Flags Park make this list. Wild."
36835,Tbf outside of something like toro the RMCs are probably always the best coasters at six flags parks
36836,"Depends when they were built. The only Intamin hyper in the chain(Superman the Ride) was still the best ride in the chain even like after El Toro and Tatsu were built...

But then the new restraints came and the ride isn't the award winner it used to be."
36837,"1. Maxx Force
2. El Toro
3. Goliath SFGAm
4. Nitro
5. Twisted Cyclone 
6. New Texas Giant
7. Goliath SFOG
8. Batman The Ride SFGAm
9. Kingda Ka
10. Viper SFGAm"
36839,"1. El Toro
2.  X2
3. Wicked Cyclone
4. Iron Rattler
5. Goliath SFGAm
6. Superman The Ride SFNE
7. Goliath SFoG
8. Maxx Force
9. Superman: Escape from Krypton
10. Apocalypse: The Ride SFMM

Honorable mentions for Mindbender and Riddler's Revenge SFMM

NOTE: I have not been on Wonder Woman yet but I bet it would be in there and I find Twisted Colossus and Twisted Cyclone to be overrated.  

Also I have only visited SFMM, SFDK, SFFT, SFoG, SFGAm, SFGAd, & SFNE"
36840,"1. El Toro, Great Adventure
2. Twisted Colossus, Magic Mountain
3. Iron Rattler, Fiesta Texas
4. X2, Magic Mountain
5. Wicked Cyclone, New England
6. Superman the Ride, New England
7. Goliath, Great America
8. Goliath, Over Georgia
9. Superman, Mexico
10. Wonder Woman, Fiesta Texas"
36841,"I like these thread, BTW!  Just wanted to say that! 

My Top 10 personal favorites, based on personal enjoyment of the coaster, is:

1. El Toro, SFGAdv
2. Goliath, SFGAm
3. Nitro, SFGAdv
4. Tatsu, SFMM
5. Superman: Krypton Coaster
6. Raging Bull, SFGAm
7. X-Flight, SFGAm
8. Kingda Ka, SFGAdv
9. Maxx Force, SFGAm
10. Apocalypse: The Ride, SFMM

Clearly, I have some gaps in my Six Flags experience! lol"
36842,"Ive only been to 3 Six Flags parks... And one of them only has one good coaster. 

1. Superman : The Ride(SFNE) (this is based on my rides before that fat asshole fell out of the ride and ruined it forever)

2. El Toro(SFGA)...self explanatory.


3. Wicked Cyclone(SFNE)


4. Medusa/Bizzarro(SFGA)


5. Nitro(SFGA)


6. Batman(SFNE)


7. Batman(SFGA) 


8. Kingda Ka(SFGA) 


9. Thunderbolt(SFNE) 


10. Comet(GE)"
36843,"1. Joker - SFDK

2.  Goliath - SFoG

3.  Iron Rattler

4.  Goliath - SFGAm

5.  Wicked Cyclone

6.  Twisted Cyclone

7.  Maxx Force

8.  X-Flight

9.  Twisted Colossus

10.  Nitro"
36844,"1. Tatsu

2. Iron Rattler

3. Wonder Woman Golden Lasso Coaster

4. Riddler's Revenge

5. New Texas Giant

6. Full Throttle

7. Ninja (SFMM)

8. Mr. Freeze Reverse Blast

9. Superman Escape from Krypton

10. Twisted Colossus

*didn't get to ride X2 while at SFMM unfortunately :("
36845,"1. X2
2. Shockwave (SFOT)
3. Wonder Woman 
4. Twisted Colossus 
5. Ninja (SFMM)
6. Tatsu 
7. Iron Rattler 
8. Titan 
9. Superman Krypton Coaster
10. Full throttle"
36846,"Only been to the 3 in the North Eastern US

1. Wicked Cyclone

2. El Toro

3. Nitro

4. Superman: The Ride

5. Comet

6. Batman: The Ride (SFGADv)

7. Bizarro (SFGADv)

8. Batman: The Dark Knight (SFNE) 

9. Pandemonium (SFNE) 

10. Ridder Revenge (SFNE)"
36847,"Only been to SFGAm, SFSTL, SFOT, SFDK, and SFA
10. American Thunder - Six Flags St. Louis. (58)
9. La Vibora - Six Flags Over Texas. (50)
8. Goliath - Six Flags Great America. (38)
7. Superman: Ride of Steel - Six Flags America. (36)
6. Raging Bull - Six Flags Great America. (32)
5. Titan - Six Flags Over Texas. (31)
4. Joker's Jinx - Six Flags America. (27)
3. Viper - Six Flags Great America. (22)
2. The Joker - Six Flags Discovery Kingdom. (12)
1. New Texas Giant - Six Flags Over Texas. (3)."
36848,"1. X2 @ SFMM
2. Tatsu @ SFMM
3. Twisted Colossus @ SFMM
4. Iron Rattler @ SFFT
5. Medusa @ SFDK
6. Superman: Krypton Coaster @ SFFT
7. Wonder Woman @ SFFT
8. Riddlers Revenge @SFMM
9. Apocalypse @ SFMM
10. New Texas Giant @ SFOT

I’ve only been to the CA and TX Six Flags Parks though."
36849,"1. Batman: The Ride
2. Superman: Ultimate Flight
3. Bizarro
4. Skull Mountain
5. Thunderbolt"
36850,Which BTR?
36851,"If you’re making a Six Flags super park, your only real invert option is Batman: The Ride from any park."
36852,SFGAdv
36853,Try to ride the parachute tower! It’s the last one of them in the US and maybe the world!
36854,Few others in the world. Very rare though for a large scale one.
36855,"Like someone mentioned, there isn’t much to skip. Obviously hit Ka, el Toro, nitro, Batman, joker can be fun, bizarro is cool, I have a soft spot for the mine train but it’s rough, Jersey devil if that’s open lol. Basically everything but the dark night. Personally I don’t think green lantern is bad as long as you properly prepare your seat and brace yourself."
36856,Just ride everything. If you really don't have time then dark knight coaster is pretty skippable and green lantern is horrid.
36857,"I've always felt like the Green Lantern hate is hugely overblown. I thought it was a great ride, not quite as good as Riddles revenge but I certainly enjoyed it, it's a very good layout with a lot of forceful moments and I love the straight drop on it, which is rare for a B&M looper. I guess Standups have never really been an issue for me."
36858,"i don't personally mind GL, but certain body types don't take kindly to stand ups so the hate is understandable imo"
36859,"Like mine, I walk off in pain from the restraints, and wobbly legs from all the forces. It has such an amazing layout, it's just a shame I can't enjoy it. I tried it again last year, just to see if I was over reacting. Nope, worse than ever for me. I believe I'll be skipping it this year."
36860,Totally agree. But ride everything.
36861,"It's a really nice park so yes, allow a full day and ride everything. There are some unique rides like like Schwarzkopf Ferris wheel, Von Roll sky ride, Arrow log flume, Houdini's Great Escape, Safari, classic Round Up, and Parachute Tower in addition to a fantastic lineup of roller coasters."
36862,"As others have said, Dark Knight is really the only thing you can skip without feeling like you missed out on something. I guess you could throw skull mountain in that category as well. Also, if you’ve been to any other six flags parks, you’ve been to other six flags parks, odds are you’ve probably ridden a clone of the Batman invert (and possible Superman flying coaster) so I guess you could skip them too if you’ve ridden them before."
36863,"Dark Knight gets an awful lot of hate for some reason that's a mystery to me. It's a wild mouse in a box. Not anything too exciting, but it doesn't starve puppies or give little kids cancer either."
36864,"It might not be that bad, but in a park filled with great coasters it’s very forgettable. It sucks that the coaster it replaced was a great coaster (the chiller)."
36865,"But it didn't directly replace Chiller because that was out of commission long before TDK came along and awesome as Chiller was, it was very unreliable."
36866,"That’s not true. The Chillers last season was 2007. It was demolished after the 2007 season ended, and the Dark Knight coaster was then constructed and opened in the beginning of the 2008 season in May.

No denying Chiller was unreliable, which ultimately led to its demise, but The Dark Knight was very much its replacement. The chiller ran throughout 2017, they even made a change to the layout between 2006 and 2007 to try and get the ride to run better for the 2007 season. Batman side hardly ran in 2007, but Robin side was running most of the time. I don’t know why your saying is was out of commission long before TDK when it was running right up until they demolished it and replace it with TDK..and there was only 6 months between the time the Chiller closed permanently and TDK was fully built and open."
36867,"Great Adventure is my home park. It operated about 20% of the time so it wasn't a valuable addition for many of the years it stood. Most guests never eveb had the chance to ride it because of its constant issues. And while TDK technically took over part of its real estate, it's not as if it was meant to replace Chiller. One was a hardcore thrill coaster and the other is a family ride. By that point Great Adventure had a lot of other thrill coasters and it can be argued KK and El Toro more than adequately filled the void left behind. 

I'm not saying TDK is an awesome ride but to hate on it for not being Chiller doesn't make sense to me."
36868,If you ride Ka in the front and Toro in the back you have gotten the park's two premier experiences. Everything else is icing.
36869,Prioritize Kingda Ka and El Toro. If lines are moving slowly due to restrictions then skip the clones if you've been on them. The safari is cool so check it out too.
36870,"One point on the safari, it is driven through for the time being.  I would definitely try to do it on the way into the park."
36871,If you get to the park when it opens you should be able to score a few KK rides before anyone else makes it back there.
36872,Ka front row for sure.
36873,"Skipable  
Cyborg (Sorry it stinks,so meh)  
Zumanojaro-The Height is cool but its kinda meh,want to try it again and the walk back can be miserable

Must do  
Wonderwomen  
JD  
Twister (One of the last,most likely on its way out)  
Justice League-If you love Dark Rides if you haven't done a Justice League it is a must  
Log Flume-I love Arrow Flumes  
Minetrain-One of the best minetrains with Airtime,you HAVE to try it. Picks up pretty good speed"
36874,"X2 > Twisted Colossus > Tatsu > Lex Luthor > Batman > Scream > Riddler's > Full Throttle > Crazanity > Goliath. 

The rest is either closed or kinda mild."
36875,Thank you so much I’m so excited I’ve been wanting to go for years! Unfortunately I only get one day in the park because I couldent find a sitter for my dog :(
36876,"I agree with /u/provoaggie \- I'm pretty sure the above order is order of thrill or intensity, and NOT the order you should ride it in. The park is basically a large circle. Just do rides in the order of that circle, skipping some if you don't want to ride or don't have time.

X2 is the most intense, and *can* break down so that may be a good place to start, or at least, do earlier in the day. You can always circle back and ride again later."
36877,You may want to check a map before trying that order. SFMM is a very large park and it also has some very big hills to climb. I'd choose a more methodical approach around the park rather than a run back and forth across the entire park between each ride approach.
36878,For sure that’s what I was thinking. Do you think I’ll be able to get them all done if I get there before it opens?
36879,I would assume so. I've done everything when there were no closures before.
36880,Is there any rides that are currently closed that I’m really missing out on or are the best open right now?
36881,Apocalypse is a solid wood coaster and probably the only thing you're missing out on. Green Lantern sucks and there is a much better 4D coaster that is open and Viper is your typical Arrow looper. It's fun but a bit rough. It's also supposed to be open again soon so maybe you'll get it.
36882,No Superman?
36883,I think its closed. It was listed on the website when I went last week
36884,Bummer.
36885,Here right now and its running
36886,"I'd start with Full Throttle, Goliath, Twisted Colossus, Scream, Batman, Riddler's. Then work over to Ninja, Tatsu and X2. This takes a methodical approach around the park. The order posted by the other user has you running back and forth across a very large park between each ride which isn't very efficient."
36887,"As with above, I definitely say start at the front. Full Throttle and X2 get horribly long lines and have terrible throughout. Start at Full Throttle, then X2, and continue clockwise. I’ve done the hop around and counterclockwise, but this is the best way to get around. The park is just too massive with no direct route (being essentially a circle around a hill) to hop from one side to the other. The rides on the right side (Goliath, Scream, Twisted Colossus) have much better rider throughput than the left side so it’s better to end there, imo."
36888,Thank you so much that helps tremendously
36889,"I always say start at the front because, being at the front, they’re the easiest coasters to get to so people gravitate to them. So that should get them out of the way quick 👍🏼 Have a good time at the park! I grew up going there so it holds a special place in my heart molding me into this coaster maniac. It’s not a pretty park, but it has quite a unique collection!

I’ll also add, Revolution and Viper are on the left side (next to X2 and Tatsu) and usually don’t get too long of lines. Revolution shouldn’t since i don’t believe they run VR anymore, so those you could skip in the first run and return to later. X2 and Tatsu are much more pressing."
36890,"I'm only including the ones I've been to. I still need Discovery Kingdom, Mexico, and La Ronde. 

1. Magic Mountain: Obviously they have a ton of coasters but I also love that they have some great Arrows as well as a good balance in the line up between old and new. Outside of the coaster line up I thought this was one of the nicest SF parks in general. Clean, pretty, and overall a great experience.

2. Great America: This is one of the more personable SF parks. There isn't really one stand out coaster here for me (closest would be Viper) but the overall line up is incredibly well rounded and it's another park that I have a good time at every time I visit.

3. Over Georgia: Another SF park with a bit of charm and a solid lineup. I think I enjoy Great America's lineup slightly better but Mind Bender and Goliath are both stand outs to me. I also love Monster Mansion.

4. New England: There's definitely a little home park bias here. Superman and Wicked Cyclone are good enough to elevate the park for me but it really needs another stand out coaster, more flats, and just more to do overall. 

5. St Louis: I would consider this the ""hidden gem"" of SF parks. It has 3 awesome woodies, all of which deliver different experiences and are great in their own way, while on the steel side of things, Mr. Freeze is a lot of fun. However, the park definitely is in need of a stand out new addition.

6. Great Adventure: Obviously El Toro and Nitro are fantastic and the safari is an incredible perk but I just never feel like I'm having much fun when I visit here. Mandatory lockers and the way they're enforced are honestly day ruining for me, sorry, and for the most part the park is quite ugly and laid out poorly. I also don't think I've ever been when the park wasn't absolutely packed, and while that isn't their fault, it does make me like it a bit less. That being said I'm really looking forward to Jersey Devil.

7. Fiesta Texas: This is by far the prettiest SF Park. I haven't ridden Wonder Woman so I'm sure that addition helps, but I find the coaster line up here to be a little lacking. Not a big fan of Iron Rattler.

8. Over Texas: Like Great Adventure, I just wasn't impressed with the park overall. The classic sections towards the middle of the park are cool but it doesn't feel like SF is putting in any real effort to preserve and showcase them and the rest of the park looks pretty dingy. I've only been once and didn't have the best experience with staff and overall cleanliness so hopefully my next visit is better. Ranking it below some of the other parks with similar problems because I didn't love any one particular coaster quite as much as I enjoy, for example, El Toro, but New Texas Giant and Shock Wave certainly are fantastic. 

9. America: SFA honestly isn't a bad park. It's just that nothing there besides Wild One is particularly noteworthy. It's also very strange that the park goes from fairly pretty and well themed in the front to an empty field in the back. I've been a few times and never really had issues with operations or anything like that though, which I know is a common complaint.

10. Frontier City: Cute little park. I don't remember much about Wildcat but obviously it's a classic. I really liked Diamondback because I'm a sucker for Arrow shuttle loops. Unfairly taking away points because it was like 95 degrees and crowded when I went, and because they wouldn't let us ride the kiddie coaster (yes I'm petty). In all seriousness, I'd love to see this park get a new addition. 

11. Darien Lake: Darien Lake is just SFA with abysmal operations and even less charm, if that's possible. I'll admit this is a park I've only visited once and didn't have the best experience at, so your mileage may vary. I will say that my one ride on Predator (would be great if we ran more than one train on anything) was a lot of fun.

12. Great Escape: I wouldn't call Great Escape a bad park. It's in the same boat as SFA where the only noteworthy coaster is Comet, and as much as I enjoyed Comet, I like Wild One a bit more. However, the rest of the coaster line up is...not great, which gives America the edge. One positive of this park is that it really is quite pretty. There's some cool theming in the form of story book characters and walk throughs, and I really appreciate that it has that personality. I understand the return on investment likely isn't there, but a new addition could go a long way here."
36891,the reason sfa transitions so harshly is that everything in front of wild one was built over decades while the area behind it was planned and built in a few years. Until 1999 Wild One was effectively the very back of the park
36892,"1: Magic Mountain. X2,Tatsu,and Full Throttle(X2 and Tatsu are insane, so many other amazing rides here).

2: Great America. Maxx Force, Vertical Velocity, and Goliath(My Home Park, so many good rides, V2 is really underrated, especially in the front row).

3: Over Texas. NTG, Mr. Freeze, Titan(Lots of charm here. I also really enjoy the Texas Skyscreamer).

4: St Louis. American Thunder,Mr. Freeze, and Boss(American Thunder is super underrated, one of my favorite wooden coasters, Mr. Freeze is really good also, everything is kinda eh).

5: Fiesta Texas. Superman and Iron Rattler. (Not impressed by anything else here, Iron Rattler was very disappointing(Went Before Wonder Woman))."
36893,"I really agree about fiesta texas. IR is the most disappointed ive been on a coaster. the operations were horrible and the crowd was particularly rude (maybe I got unlucky). food was bad, and rides broke down constantly. it was pretty, but honestly I think its one of the least pretty SF parks ive been to. I think SFMM is the prettiest especially during golden hour"
36894,"Operations weren’t too bad when I went to Fiesta Texas, except food operations were terrible. Then again when I went the park was pretty much dead. I wouldn’t say it’s one of the least prettiest six flags though, probably second for me behind Magic Mountain as the prettiest. Also, finally someone else feels the same way about Iron Rattler as me. It’s my least favorite RMC. It’s still a good ride, but not that great."
36895,"1. Great America

2. Fiesta Texas

3. Great Adventure 

4. over Georgia

5. over Texas

6. St. Louis 

7. New England 

8. Discovery Kingdom

9. America 

10. (AstroWorld)

11. Frontier City

12. Darien Lake

13. The Great Escape

14. La Ronde"
36896,"1 MM (2017) planned 2020 for WCR moved to 2021

2 GAdv (2016)  planned 2020 for Jersey Devil moved to 2021

3 GAm (2019)

4 FT (2018)

5 NE (2019)

6 OT (2018)

7 OG (2018)

8 DK (2018)

9 Stl (2019)

10 LR (2019)

11 SFA (2017)

12 DL (2019)

13 ESC (2019)"
36897,"Here:

1. Great America
2. Over Georgia
3. Over Texas
4. St. Louis
5. Fiesta Texas
6. Darien Lake
7. Great Adventure 
8. SF America

Great America is the cleanest, has the most well rounded collection of rides, a good layout, decent theming, decent food, and the best operations and customer service. Never had a bad day there.

The original 3 SF parks have a certain charm to them, more history, and a lot of tree cover. Georgia is the prettiest and has the best coaster collection. Texas has a good collection, has a gorgeous old section, but an ugly Gotham section. St. Louis is beautiful and has the best woodie collection out of the SF parks, but lacks in steel coasters. 

Fiesta Texas is beautiful, but doesn't have as much of an abundance of good rides. There's very little shade. However, the theming is the best in the chain, and three of the coasters use the terrain, and they make the trip worth it.

Darien Lake had the best food I've had at a SF park, and had a shockingly awesome coaster collection, at least four very underrated coasters. Very little ads, and a unique feeling to the park, and very pleasant. 

Great Adventure has great coasters and the skyride makes getting around easier, but that's it. The park is very ugly and needs a fresh coat of paint, and the food is quite bad. SFA has the same issue, except with a worse layout, no transportation, and not as many rides."
36898,"I don't really like ranking stuff, but if I had to put a list together, it'd probably go like this:

1: Feista Texas
2: Great America
3: Great Adventure
4: St. Louis
5: America (home SF park) 
6: Darien Lake
7: New England
8: The Great Escape
9: Over Georgia"
36899,"1. Great Adventure (2019)
2. New England (2019)
3. America (2019)

New England and Great Adventure are great so they could really be swapped around if wanted"
36900,"1. Six Flags Magic Mountain
2. Six Flags Over Georgia
3. Six Flags Great America
4. Six Flags St. Louis"
36901,"1. SFMM
2. SFFT
3. SFOT
4. Frontier City"
36902,"*  1.Great Adventure (Beautiful property and forest. Great Intamins and Beemers, Top tier RmC coming, and a Wildlife park to put it at top)
* 2.Magic Mountain (Best Coasters overall for sure. So much hiking)

* 3.Over Georgia (Not a bad coaster in the park. Good Scenery, some unique classics)

* 4a.Great America (Again well rounded , but no coasters that are the absolute best of their type, some meh rides.)

* 4b.Over Texas (Almost the same as Great America, just maybe a little less polished. Weird Layout issues)

* 6.Fiesta Texas (Great top 2, the best scenery, actually has shows, however: butt-ugly operations)
* 7.America (A couple of great coasters. Ugly scenery, ops can be bad
* 8.Darien Lake (Great Scenery, Fascination!, but the weakest Collection of rides and also 1 train ops)
* 9.St Louis (Kind of Ugly, Meh rides, Things are often closed. Several rough coasters. Definitely the weakest)

These are the parks I've been to."
36906,"1) SFOT

2) SFOG

3) SFFT

4) SFSL"
36907,"1. Great Adventure
2. Great America (2019 before Maxx Force)
3. New England (2016)
4. Discovery Kingdom (2016)
5. Over Georgia (2011, Goliath & Dare Devil Dive were closed)"
36908,"1. SFMM
2. SFOG
3. SFGAv
4. SFOT
5. SFNE
6. SFFT
7. SFGAm
8. SFA
9. SFDL






10. The Great Escape.

Edit - the space was intentional between 9 and 10, The Great Escape is terrible."
36909,haha. this looks spot on. SFOG is a bucket list park for sure. what was your favorite there?
36910,"Have not been to a SF park so all of these come with asterisks:

1. SFGAm

2. SFMM

3. SFFT

4. SFOG

5. SFGAdv

6. SFM

7. SFDK

8. SFNE

9. SFDL

10. SFOT

11. SFStL

12. SFA

13. Great Escape

14. La Ronde

15. Frontier City"
36911,"1. Great Adventure
2. Nothing else matters
3. FIGHT ME
4. The bunny in our yard had babies today"
36912,"im not going to fight you, great adventure has el toro....but id love to hear why."
36913,It's the world's largest theme park. 'Nuff said.
36914,I tend to care more about coaster count/quality and overall park atmosphere/theming/operations over size. but I respect your take. cheers!
36915,"I've been to SFDK most recently, and I enjoy it a lot. In the 80's and 90's I went to SFGAm and SFMM and they were both incredible parks, which seems to still continue today."
36916,"I've been to great America, magic mountain, and discovery kingdom, and i put them all tied for sixth."
36917,"1) Six Flags over Georgia

I need to go to more SF parks. The closest one besides SFoG is still pretty far though."
36920,"Batwing and Wild One are both fantastic. Joker's Jinx and Superman are serviceable clones with better versions found elsewhere. Roar is okay. Mind Eraser and Apocalypse have pretty scenery, at least."
36921,"Wild One followed by Roar, Superman, and Jokers Jinx."
36922,">followed by Roar, Superman

ANGERY"
36923,"Wild One.

Edit: /u/GauntletVSLC is the one to ask."
36924,This is the correct answer.
36925,Yaaaassssss!!!!!!
36926,"Roar, Superman, and then Wild One.... 

Those 3 are pretty closely rated so if you ask me on a different day I might change their order but these 3 are the best in the park by far."
36927,For me the best part about the roar is the firstdrop after that the ride seems really rough.
36928,">Roar, Superman

ANGERY"
36929,Wild One front row at night if you can get it! Wild One is my all time favorite coaster.
36930,"I'm sorry, but your really mean next to last seat on the left. :D"
36931,That too;) though with the track work they did during the off season the front is amazing this year!
36932,I haven't gotten a chance to go this year. Maybe I'll make my way there this weekend.
36933,"Do it! They fixed the part of the first airtime hill where there was a big jolt, so it’s absolutely phenomenal! I’m supposed to be going this Friday morning... before my wedding! XD"
36934,"Sweet, maybe I'll try and make it on Sunday. And congrats on the wedding, but why didn't you do it a couple of weeks ago on the Voodoo Drop? lol"
36935,"Haha! Because while my fiancée does like coasters and is supportive of my hobby, she has to draw the line somewhere 😂"
36936,"Batwing  
Joker's Jinx  
Superman - Ride of Steel  
Roar  
Apocalypse  
Ragin' Cajun  
Wild One  
Great Chase  

Mind Eraser was closed when I went so I can't judge it."
36937,Lucky. You missed the concussion.
36938,Would you say he missed his mind being erased?
36939,"Lol. Unfortunately, I can remember that experience and I wish my mind was erased of that trauma"
36940,I don't know that I would ever consider missing a coaster as lucky.  I don't know when I'll have a chance to ride it again and even if it's painful I gotta try everything once.
36941,">Batwing, Joker's Jinx, Superman, Roar, Apocalypse, Ragin' Cajun, Wild One

ANGERY"
36942,It's just my opinion. It looks like a lot of people really like Wild One but it didn't do much for me. It wasn't terrible but it was rough and didn't excite me. I've only ridden it once though.
36943,"I had a really good ride on Superman last fall with crazy good airtime, and also had a good ride on Roar. I rank Superman at 66 and Roar at 85 out of 280."
36944,"Bat, Roar, Supes"
36945,Wild One for sure
36946,"The exit ride for sure!

Superman was the only one I actually enjoyed, but not that enjoyable.  Roar was OK."
36947,The ride home. 😏
36948,Wild One (but I’m biased- it was my first coaster).
36949,"I'd say it depends on what you like. I think both woodies are good, and Superman is one of my favorites. Of course I'm a bit biased since I've been going there for years. 

My daughter says Roar is her favorite coaster."
36950,"Superman,  Batwing,  then Jokers Jinx. I don't remember much of Wild One. I only got one ride before it broke down, mean while I lost track of my rides on the other 3 I mentioned, 16+ each or something"
36951,"Haven't been in a long time, but probably Superman....Wild One and Roar are good too."
36952,I Can't believe so many People like Roar and rank it so high. It is a disappointment to GCI.
36953,"1.  SFGAm - Best coaster collection by far of any SF park to me.  Easily my favorite.

2.  SFoG - Fav coaster(Goliath), a good overall collection but nothing else spectacular, lots of trees, 

3.  SFGAd - good collection of coasters, my favorite layout and location of the SF chain

4.  SFMM - Been 16 years since I've been here so can't remember too much and I'm sure the park has changed a lot in many ways.

5.  SFDK - Besides Joker (which is amazing), not much else exciting.    

RIP - SFWoA  -  A fun park and such a shame its gone."
36954,I have to agree
36955,"Of the ones I've been to, best to worst:

SFGAdv

SFOG  

SFFT  

SFOT  

SFAstroworld  

SFNE"
36956,Why do you dislike SFNE?
36957,"Wicked Cyclone is good, but it's 1 ride. Superman would be good, but honestly the restraints ruined the ride for me. Other than those two, small park, not much to do."
