idx,text
29106,No in app task manager though.
29107,Google Task and reminders is built in to Google Calendar
29108,Not in the app.
29109,Good point. you would need to download the Google Task app too then.
29110,Which is rubbish unfortunately...
29111,CalenGoo
29112,Seconded. Always switching back to it after trying something else.
29113,I like how it shows the week in 2 columns. Think aCal does it too. Thanks for the suggestion.
29114,"Tons of settings for the week view.

http://imgur.com/a/tE4Pels"
29115,Linkme: calengoo
29116,"[**CalenGoo - Calendar and Tasks**](https://play.google.com/store/apps/details?id=com.calengoo.android&referrer=utm_source%3Dreddit-playstorelinks__bot) by Dominique Andre Gunia | Paid: $5.99  | 100 thousand installs



> CalenGoo is a flexible and extensive calendar app with integrated task management. It is designed to make it easier and faster to work with your calendar on you...

[Search manually](https://play.google.com/store/search?q=calengoo)



------

[^Feedback](https://www.reddit.com/r/cris9696/comments/91a1ls/)"
29117,Agreed. The Dev has also developed a desktop version of CalenGoo also which is is designed based on the Android and IOS app.
29118,"I use aCalendar+, has the added benefit of saving Tapirs!"
29119,"I've been trying the free version this morning, looks very similar to BC2. I like the week view though. And the widget with full month + daily events on the bottom.

But can't see much more differences.

Thanks for the suggestion"
29120,"I love aCalendar. The week view is great and hard to find in other calendar apps (which typically have each day as a column, which are too narrow to actually read any of the events). 

[Screenshot](https://imgur.com/RogrDRW)"
29121,I've been trying a few options throughout the day and can't find any with that view. I might just use my Google credit on aCal then...!
29122,I'm impressed at how many people have not mentioned BC2... I thought it was one of the most loved calendars out there. I was wrong then!!
29123,"maybe because you mentioned it and asked about alternatives

BTW BC2 sucks, I use for years Business Calendar Pro 1.x, hands down no competition and I tried all calendar apps

for starters repeated reminders and condensed/compact agenda view are killer features, also own fast numerical keyboard to enter time

everything else looks like coloring book for toddlers next to BCP1 including BC2, if you mean business BCP1 it's the only option"
29126,Google calendar is the best. It has tasks and reminders built in it.
29127,I can't see it syncs with Google Tasks...
29128,Today calendar but it hasn't been updated in a while and widgets got an Oreo bug
29129,I had it before too but not updated since 2015...
29130,"I liked how simple yet efficient it is. Right fonts, right amount of detail. Keep coming back to it. Some of the others are to colorful out have too much info.


Only problem I got with it more is the agenda widget shows loading fit empty space. Happened after Oreo update. It's ok on Nougat.

Gonna find a slender a try because it got a lot of love here"
29131,"Same. Had to go back to Event Flow Widget to get a widget that was similar looking to Today Calendar's agenda view. 

I recall the dev was working on a successor to Today Calendar and I even had the alpha installed  for a while, but I haven't seen any updates to it in forever."
29132,"I'm looking for a calendar app that I can share with my wife.

I travel a lot for work, so i'd like to be able to update a shared calendar with my away days.

Any ideas?"
29133,"Do you both have Google accounts, if so then Google Calendar."
29134,"Linkme: TimeTree  
Haven't used it myself, but it was suggested in another calendar thread, specifically for sharing with others."
29135,"[**TimeTree - Free Shared Calendar**](https://play.google.com/store/apps/details?id=works.jubilee.timetree&referrer=utm_source%3Dreddit-playstorelinks__bot) by JUBILEE WORKS, Inc. |  Free  | 1 million installs



> TimeTree helps you coordinate events all on a single app. With over 9 million users and growing, allow TimeTree to take away the burden of keeping agendas up to...

[Search manually](https://play.google.com/store/search?q=TimeTree)



------

[^Feedback](https://www.reddit.com/r/cris9696/comments/91a1ls/)"
29136,Literally any calendar app can do that if you utilize CalDAV.
29137,"> Tapirs!

You can share calendars on google calendars. No need for an app."
29138,Linkme: acalendar+
29139,"[**aCalendar - Android Calendar**](https://play.google.com/store/apps/details?id=org.withouthat.acalendar&referrer=utm_source%3Dreddit-playstorelinks__bot) by Tapir Apps GmbH |  Free with IAP | 10 million installs



> aCalendar 2 is available NOW! 
We improved everything but kept it familiar.
For questions or problems see our new help system at https;//acalendar.tapirapps.de ...

[Search manually](https://play.google.com/store/search?q=acalendar+)



------

[^Feedback](https://www.reddit.com/r/cris9696/comments/91a1ls/)"
29140,aCalendar+
29141,"I like Google Calendar but think the widgets are ugly so I use Event Flow Widget along with it, which interfaces well."
29142,"I wouldn't say that it's the ""best"", but Simple Calendar is nice if you don't need a lot of features.

https://play.google.com/store/apps/details?id=com.simplemobiletools.calendar.pro&hl=en"
29143,"I've been using aCal for a few weeks and it's great but I'm having sync issues... Google account not syncing. I've tried all suggestions on the help section and nothing seems to be working. 

Anyone with the same issue?"
29144,"""Best"" depends on the user. Try them all. I used to use Nine but have since switched to Outlook."
29145,"Thanks guys. We do both have Google accounts, I'll check it out."
29146,I’m surprised no one has mentioned TickTick. It’s exactly what you want.
29147,"Yep, this is the one. Even has a Pomo toner. Thank you so much!"
29148,"You might find [NotePlan](https://itunes.apple.com/nl/app/noteplan-markdown-calendar/id1180443101?l=en&mt=8&at=1000l3&ct=rdd) interesting. It’s technically a very powerful Markdown-based calendar. It works well with macOS and iOS, and if you use IFTTT then you can actually automate a lot while always have a complete picture in your NotePlan and your Calendar. It’s available on macOS as well, [NotePlan for macOS](https://itunes.apple.com/nl/app/noteplan-markdown-calendar/id1137020764?l=en&mt=12&at=1000l3&ct=rdd)."
29149,This is interesting. Do you find it quick to use though?
29150,"Check Microsoft Todo.

I use Clean Todo, but I really need simple task planner. It also misses some features."
29151,"I use todoist for this one. You can schedule daily tasks, tasks with specific due time. Then they have a possibility to show all the tasks in the calendar (as a plugin for ical)."
29152,Thanks for the suggestion. I just checked it out and while it is a nice app it isn’t exactly the calendar hybrid I’m looking for. Yes you CAN view it in iCal but it is focused on a daily/weekly todo. I schedule things months in advance and this doesn’t have a built in calendar. So this would be a lot like just switching from Trello but not combining anything. Thank you though!
29153,"I usually combine couple of calendars in 1 view. But you are right, it can be viewed in one place, but not managed from one place, so you still need to manage two apps"
29154,I use ToDoIst and run IFTTT on the backend to sync it with some other calendars. I know its not a single product solution but its the best that I Have managed to find to date.
29155,"There are very few to-do list apps that really have that daily scheduling approach. Most just create a ""today"" list based on whatever is DUE today. Which to me doesn't make sense as I only want to add due dates to things that have a hard deadline. And recurring tasks are also a mess in those systems as they just go on the list again with a due date for the day you want to DO them on. I created an application (Amazing Marvin) that does let you schedule tasks into days. So you have due dates and do dates. It's kind of like a zoomed out calendar and to-do list in one. A real calendar beyond the daily lists is being added soon to."
29156,"I use two applications, Timepage and Actions, that integrate with each other. It has all the functionality I need, but maybe not as crazy feature rich as Fantastical. The WHY to use these apps are really the beautiful design and user-friendly layout. 

[Timepage](https://us.moleskine.com/timepage/p0486) 

[Actions](https://us.moleskine.com/actions/p1230)"
29157,"I would say that Siteground is a good web hosting choice, especially for beginners. 

Few things that stand out for me: 

Support is brilliant 

Tools are awesome 

Quick (weak point for Bluehost) 

Stupidly cheap 

I would also recommend Bluehost tbf but Siteground takes it for me. 

Also, does anyone know if Bluehost have discount codes btw?"
29158,"Thanks! Great best web host Reddit thread. Did you happen to notice if there were any differences in speed if you migrated your site from - say DreamHost to another host? 

Also, do you generally have any optimisation plugins or caching installing on your sites? 

Thanks again."
29159,"I would add regarding DreamHost is that I’m a web designer and I can say that it works well for me. It’s pretty expensive, as you said, and I’m not sure it would be of much use to anyone who isn’t a designer. Also, their email service is weak and there’s not a lot of options that come with it. For basic, rudimentary web hosting, however, it’s fine."
29160,"Yeah, best WordPress hosting Reddit threads generally blow. But, I also think you've missed a trick here too bro.

For anyone who isn’t aware, there are 3 types of WordPress hosting:

* **Managed hosting (also known as shared hosting) -** Siteground and Bluehost are both examples of managed hosting services. They provide you with WordPress tools and WordPress support, and they provide good WordPress hosting at a reasonable price. Some are better than others, but even the really expensive ones offer solid value. Plus, they do all the hard work for you.
* **Managed hosting but not WordPress -** Some companies will manage your server for you - but not if you’re using WordPress. If you have multiple sites, this is a good option BUT you’ll need to take care of things like backups, caching etc yourself. 
* **Unmanaged hosting services -** This means everything is on you. It will save you a fair amount of cash in the long run, but it will require time, dedication and know-how. 

However, you’re not going to get any brownie points from anyone for making life harder for yourself, so unless you’re really into your servers and know your stuff, unmanaged hosting just isn’t worth the time. Don’t be a tight ass, spend a bit of cash and use a shared hosting server :)"
29161,I’ve also read about CloudLinux. Anyone used them? Thoughts?
29163,Just seen this thread. Gave siteground a look....but they seem to be down just now.
29164,"Will, this post is just a model of how bad service companies marketing works it is all over the internet  ... only true if you are looking for the Cheapest hosting .but remember that nothing actually is cheap , starting cheap mean paying more later"
29165,"Thank you so much for your review, I was looking for the same :)"
29166,"It all depends on what a person needs and where they are at currently in terms of the age of their website. For example, if someone is just starting out, I would recommend that they use a basic managed WordPress hosting package from the likes of NameCheap. It’s affordable and it’s got all you need to handle a modest amount of traffic. 

Also, if someone doesn’t know squat about development and design, Elementor is a VERY handy WP page builder. There’s a free version for newbies, as well as a premium version. If you’re serious about your website, I definitely recommend going with Elementor premium. Yeah, it will set you back around $60 a year, but what’s $60 per year if you’re ruining a serious, legit business, bro?"
29167,"The problem with hosting services is that they have their pros - and they have their cons. I use BlueHost but I’m not going to shy away from the fact that they have things that I DON’T like about them. There’s no magic bullet in the WP hosting world. None of them are perfect. BlueHost isn’t perfect, but neither is SiteGround or DreamHost. I challenge anyone to defy me and say they are. I also challenge anyone to defy me and say they’re total shit."
29168,"Agreed on this. But I’d also add that free hosting sucks balls. It’s only when you pay for premium that you get a quality hosting plan that's actually worth something. Also, I hate it when people say a hosting service is shit when they’ve only been using it for 24 hours. It makes me so mad! My buddy did the exact thing - he got a new plan that I recommended, used it for a day and told me it was a piece of junk. No, give it time, bro. You can’t comment on a hosting service after just 24 hours."
29169,"You know what, a lot of people hate GoDaddy. And I mean really hate it. I’m talking about professionals - developers, coders, entrepreneurs and so on. But I don’t get it - surely they’re one of the most cost effective when it comes to WordPress website plans? Plus, you get a page builder with it and it’s super easy to use."
29170,"I kinda get what you mean. There’s something about people on Reddit whereby they all same to love and hate the same thing. GoDaddy is a case in point. I see a lot of folks on here constantly rubbishing it and talking it down and I do get it that, yeah, GoDaddy spams the fuck out of you and they’re always trying to upsell you something. But my local business uses it and I know of other local businesses that use it and we’ve never had an issue with it. Also, if it was so rubbish, why is it always number 1? They’re quick, they’re stable, and whilst the customer support isn’t the best, it’s good."
29171,"I meannnn GoDaddy is definitely okay for noobs. Same with SiteGround. Then again, SiteGround can get really expensive after your free trial is over."
29172,"Nice work. Let me tell you all about my own experience. I went with SiteGround after carrying out a lot of research. The StartUp plan was really appealing to me, and wouldn’t cost me much at all for 3 months worth. Small investment, and what’s 3 months? So I went for it. I also used Divi and Elementor and I bought a theme. It’s been good so far, but I get what others mean when they say there is no perfect host. I say this because, whilst I used SiteGround (and enjoyed it), I’ve also used BlueHost in the past who are a little more hit and miss. Not awful, not great - just somewhere in the middle and probably ideal for noobs. 

Like with SiteGround, I signed up to BlueHost for 3 months of WordPress Pro Build. It wasn’t too pricey and I could then go onto buy either another 3 months worth, or even 6 or 12 months. Their support was good and their team was always available. The onboarding process was a bit of a pain because I literally got stuck on the ‘Installing WP’ bit for about 20 minutes and had to refresh - and got stuck again. Interface was good, nice and intuitive, and although the WP dashboard was fairly confusing at first, I soon got the hang of things. That said, does anyone else constantly get the error “no input file specified”? It was a bit of a pain! 

Anyway, that error meant I had to switch to the classic editor. It didn’t work out lol so I restored the backup and then had to contact support. They fired the SSL and domain for me and I was back to normal. All in all, BlueHost was okay but - again - my experience taught me that no WP hosting is perfect. 

I’ve also used GoDaddy in the past. The website builder was okay, uptime was okay and overall it was a decent experience. However, what really ruined it was that eventually my yearly plan ran out - and my website was seemingly lost forever!! Naturally, I was in a panic and looking for answers when the supervisor told me that - hurrah! - they can actually restore it. Hallelujah! However, they also told me that it would cost me money to restore it, which really frustrated me. And it was that which led me to SiteGround."
29173,"Dude, I feel you. I just want a hosting that puts ME first. I want to be able to build a long-term relationship with them, you feel me? Your situation sounds just like mine - constantly on the move, from one hosting provider to another. I’m a complete idiot when it comes to web design, so maybe that’s part of the problem IDK. But what I’d say to anyone reading this is that signing up to a WP host provider for the first time doesn’t mean you’re completely sorted. It’s very likely that you’ll be switching a couple more times before you find the one that’s right for you!"
29174,"I was using SiteGround but then I switched to BlueHost to save some money. BlueHost is definitely cheaper (I was paying just $4 per month) but cheaper in this case definitely doesn’t = better. TBF I actually don’t mind BlueHost but it hasn’t given me what I need or want, and I’ll be switching back to SiteGround once my 3 months are up. I know, I’m an idiot."
29175,"The thing I don’t like about BlueHost is that they will increase your monthly fee after a year without warning you! You can buy their package at a discount but what you don’t realise is that once the year is up, the price increases dramatically - for the same service?"
29176,"I mean, it’s normal. I think most web host providers do the same thing? Like, Hostinger are offering a 90% discount at the moment but it’s for a limited time. Do you really think they’d let you use their services at 90% discount the whole time?"
29177,"No, but it seems kinda sneaky when they suddenly increase the price without any warning."
29178,"I like SiteGround. Their customer service team are very friendly, helpful and - best of all - efficient.
Their basic plan is pretty good to, and can handle around 10,000 visits per month. That’s the kinda traffic I get at the moment. And if my website grows quickly, I can just get an easy upgrade. 
You also get unlimited subdomains and emails, which I think is pretty cool. 
And in the event something goes wrong with your website, I found that they ask for as much information as possible so that they can help you sort it as quickly as they can. If, however, they can’t fix it from the server side, they will instead send you over to someone who can help you. This really pleased me and I’d say that SiteGround is easily one of the best when it comes to customer service. It’s as though they’ve actually invested proper time, care and money into securing the best agents. 
Overall, my experience with SiteGround has been very good and I have no qualms with recommending them to others. That said, for a cheaper option, GreenGeeks is also okay. It’s not as good as SiteGround IMHO, and they don’t seem to be completely open when it comes with how much visits are allowed (they’re also a closed book when it comes to disk space - is it unlimited, is it not?)."
29179,"Aside from the ones already mentioned, any host with mysql and php supports WP. I work in the hosting industry, and as such I will sound biased - but I can say with honesty that there is no such things as the ‘best’ WordPress web host. The absolute best case scenario (if you’re aiming for that) is to run your own server. Why? Because in this instance you’re controlling everything. 

Another issue I wanted to mention - be wary of review sites because most of them will be paid reviews. At some time or another, you will read a glowing review of web host A and then a really bad review of the same web host. Who do you believe? 

When looking for a host, then, I suggest you look for one that meets specific criteria. For example, longevity. If a host has been around for 5 years and is doing well, that’s a really good sign. Customer support is the bedrock of a good host, too, as has some form of security addition, be it a web app firewall. Make sure the host lets you create your own backup too, as this is really important for site security. Hosts perform backups themselves but you don’t get to retain the data. Moreover, how often do they perform the backup? Key question."
29180,"Okay, in reply to your reply - what’s your opinion on the web hosts listed by the OP? SiteGround, BlueHost and DreamHost? They seem to meet your criteria. Which is the standout choice?"
29181,"I prefer to go with a control panel. It’s just easier, simpler and more efficient. I save so much damn time when working on my websites. I’m also leaning towards A2 at this point as the cost seems just about right, and will allow me to host more sites that I’m currently contracted for. But I’m not sure, I’m torn between that and SiteGround. Looking at your criteria, what do you think is the better choice? Both seem to have good reviews."
29183,"It really depends on the tools that the individual uses, as well as your use case. Most stacks and frameworks have their preferred hostess where maintenance and deployment is simpler than on others. For this, you have apps like Apex Up, Zeit Now, as well as FlyWheel for WP and Heroku. Render is a fairly new one that’s worth checking out too as they try to be an all-rounder while at the same time delivering integrated workflows. And then, of course, you’ve got the more traditional hosting providers, such as the aforementioned SiteGround, BlueHost and DreamHost."
29184,"I prefer SiteGround. Good packages, fast support, nice and efficient."
29186,Just be careful because they jumped their prices recently. Very easy to miss!
29187,I ended up using Siteground after quitting DreamHost. Had a TERRIBLE time with them but found a comparison website which I only wish I’d have used sooner!!
29188,Share the comparison site?:)
29189,"There are a lot more solutions people can choose from that the OP hasn’t listed. I agree that SiteGround is good and BlueHost is decent. DreamHost is another well-known one but it’s not one that I’d personally use. I’ve used GreenGeeks and BlueHost in the past, but these were only for ‘side hustle’ projects. For my main projects I use SiteGround. Now the thing with both BlueHost and GreenGeeks is that they’re good for those little side hustle projects you undertake for clients. You get unlimited subdomains and email accounts, they charge monthly AND you can lock yourself into a 3-year contract if you want to grab the discount (this is what I eventually did when I realised it was worth it). I also have a buddy who paid $150 for 2 years and got 1.5GB of ram. The only restriction was that his INODES were capped at - don’t quote me on this - 300k. Maybe a bit more. Anyhow, they also do 1-click installs of WP."
29191,"SiteGround allows for 10,000 visits per month as part of its basic plan."
29192,"Cheap isn’t always good, but if anyone’s on a budget I recommend A2, BuyShared and RamNode."
29193,"Sorry bud, but cheap hosting is never the answer. You admit as much yourself but still go ahead and recommend it - why? I think mods should eliminate all answers that have ‘cheap hosting’ in them as it’s just causing people to make bad decisions. If you buy cheap from the start, you will invariably be switching plans again soon."
29194,Everyone has different reasons for using a web host tbf.
29195,[Cloudways](https://www.morecyberdeals.com/cloudways/) or [siteground](https://www.morecyberdeals.com/siteground/) are my personal favorites atm.
29196,I recommend [Bluehost](http://www.websitesreviewer.com/bluehost.html) they been around the longest and cheap and they have great support.
29197,"Definitely [Dreamhost](https://reddlink.tech/dreamhost). Solid cheap hosting, very affordable domains, etc. Don't go with Siteground, they're scammy."
29198,Never ever recommend Siteground. People recommend it because they get affiliate commission. Be careful!!
29203,what you recommend as top hosting for wordpress web ?
29200,+1 on Siteground
29201,"I prefer Siteground. Their packages are just great. And the support is quick, efficient and solved all my problems. love it :)"
29202,Siteground is NOT the best Host although many claim that
29204,">what you recommend as top hosting for wordpress web ?

What I love is how you asked this question two times and both people didn't reply to even offer anything else - just blurted out negativity... very telling.  


I used them for 3 years, never had an issue, but my site is small potatoes... so I think this industry is super greasy."
29205,I stick to DigitalOcean or other cloud’type hosting if apps built on new type like Vue or Angular because it works faster and migration is pretty simple
29206,"Signed up with Siteground 3 yrs ago and while the service seemed great, they have increased the monthly fee continuously each year (not the initial cheap signup rate, but the standard fee), they are now far more expensive +200%). They are not worth the additional costs as it is, and I am sure they will only continue to raise rates further."
29207,"Every host hoses you after the term... EVERY ONE.

If you want deal rate on renews, best to sign three years and move between companies every three years."
29208,I've tried a couple of new providers last year and I particularly liked JustVps too. gave me 3 months plan with a 25% off too and I also saw they had promo codes for cloud but havent bothered to check their cloud yet
29209,how do you guys get promo codes? I can't find any on their website
29210,got mine in an email when I signed up. you sure you got them right? it’s [JustVPS.com](https://JustVPS.com)
29211,\+ on JustVPS
29212,"SiteGround is good, especially, their VPS which I tried some time ago. Customer services not the best, but it isn't bad either."
29213,"Although you have mentioned a couple of hosts, I can see you have nicely put the name JustVPS. And credit goes to you that I opened their site and saw their plans that sound quite interesting to me. Maybe I can test their service as well and then share with you my feedback here."
29214,"Do NOT go with Nexcess...they just screwed up a simple migration on a bunch of my sites (May 2021). I just switched over to DigitalOcean and got complete control over my server config, files, etc...at least as close to complete control without having a rack sitting my house somewhere. Use https://m.do.co/c/d7bf9ba6a802 for some free hosting credits - I get some goodness too ;) - ...so far I really dig it, lots of different options (CPU's, storage, locations, etc.) and like I said, you're pretty much in control. edit: Forgot to mention plans (US-based IP address & storage) start at $5...hard to beat!"
29215,"With a good web host, your site will run faster and your visitors will want to stay longer. Visitors who stay on the site for longer are more likely to turn into customers. Instead of settling for cheaper web hosting, it is better to opt for high quality web hosting, read more about web hosting [here](https://mediaonemarketing.com.sg/web-hosting-singapore-guide/)."
29216,"Hello Friends,

Are you willing to launch your blog or website but got confused in selecting the best web hosting provider? But not to worry here I have collected the best web hosting options for beginners.

***Here we make it more easy for you by sharing the criteria for best web hosting***

•	One-click website installers  
•	User-friendly dashboard  
•	Affordable pricing  
•	Beginner-friendly support  
•	Free SSL and Security

Create and manage your website without having any technical knowledge by utilizing hosting series with perfect features holding options for you.

***Best and Cheapest Web Hosting for Beginners***

•	**DomainRacer**: Affordable Web Hosting with Great Reliability  
•	**BlueHost**: Oldest Brand with Limited Recourses  
•	**SiteGround**: Beginner-friendly dashboard but Expensive Hosting

Out of these 3, I would like to recommend **DomainRacer** as a top most option for new comers will to set up their business. Because of its promising nature for flexibility, reliability, scalability, and affordability.

**DomainRacer** offers well manageable and customizable dashboard for newbies. That helps them to handle all hosting operation with so much easier. They offer absolutely amazing 99. 99% uptime assurance and 21X Faster server loading speed. That helps you to make your website more visible in short time and enhance people reach.

Most importantly **DomainRacer** provide real time beginner friendly customer support vial mail, ticket, and live chat and phone call. So don’t worry whenever you got stuck at any point  
So just go and make a successful deal with *DomainRacer* Today!  
  
***Thank You.....!!***"
29217,great list
29218,"No requirements, side bar."
29219,"Minimal traffic going to site, just need wordpress integration."
29220,"If there are minimal traffic, then try the hosts in side bar, offering hosting for as low as 5 dollars per month. Alternatively Wordpress.com, 3 dollars per month."
29221,"I want to use wordpress.org to be able to use themes/plugins. Don't think I can do that on wordpress.com without buying business package. 

Any personal recommendations out of the sidebar ones?"
29222,"It depends on countries you live in. I only have experience with Cloudey, their support is fast and helpful, but their server is not litespeed server though, so if you loved litespeed you might be disappointed. If litespeed is not your concern then I absolutely recommend Cloudey."
29223,"USA, seeing good things about nixihost might go with them"
29224,Try for one month then decide if you want to pay annually.
29225,I recommend nexusbytes man. That's what I use
29226,I’m still happy with DreamHost.
29227,Do they up their renewal prices after 1st year? Looks like for 1 year $3.95/mo ..not bad
29228,I’ve been paying the same for years now.  Mid VPS for $30/mo.  Many months I don’t pay due to me having clients set up their own accounts and me getting referral credits.
29229,"Nice. Do they give the best affiliate bonus for referrals? Then it sounds like a great host to recommend, basically for any hosting needs I can think of."
29230,But thst’s not why I use them.  Their servers are reliable and support is really good as well.
29231,Ok cool that's good to know.
29232,"Let me google that for you. 

 I got on ""position #0"" (note that the page with the expert advice may receive referral commission, but this has supposedly no influence on the advice given) 

The 10 Best Web Hosting Service Providers in 2021

Bluehost – Best for New Websites. Bluehost Pros. ...

Hostinger – Best Pricing ($0.99) Hostinger Pros. ...

A2 Hosting – Fastest Shared Hosting. A2 Hosting Pros. ...

DreamHost – Best “Monthly” Payment Plan. ...

SiteGround – Best Customer Support. ...

GoDaddy Hosting. ..."
29233,"[Siteground](https://sghosting.us) and [Bluehost](https://bluehostsignup.com) are all mentioned on this sub a lot as a good pick.  I almost went with BH because they were always mentioned on the SPI podcast i listen to, but I really liked how Siteground has the 30 day money back deal and had good reviews on here.  6 months into siteground now and have no regrets yet, good quality and good price"
29234,"I'm a PlayStation guy, so I'd have to say a PS3. 

All PS3s play PS1 games. 

Launch model PS3s natively play nearly all PS2 games. 

2nd revision PS3s can natively play most PS2 games. 

3rd revision and later PS3s can't natively play PS2 games but can be modded to emulate many of them.

The PS3 has many wonderful exclusives.

The PS3 is an old school Sony product which means that it's made to be taken apart and easily serviced.

There's a huge homebrew community. The system has been hacked wide open for many years and there are very active communities reverse engineering the system.

Blu Ray discs are a lot tougher than DVDs. They don't scratch easily. However, if a Blu Ray does get scratched, it usually becomes unreadable.

All PS3s have HDMI ports unlike the Xbox 360 and Wii.

All but 1 model of PS3 has WiFi unlike the 360 and Wii

You can easily upgrade the hard drive. It doesn't use proprietary drives like the 360.

The most common fatal flaw of the early PS3s that causes the Yellow Light of Death is often reparable with moderate electronics repair knowledge. The most common problem that causes the 360's Red Ring of Death is repairable but needs professional tools and skills. It's cheaper to just get another Xbox.

While the PS3s disc drive daughterboard is married to the console's motherboard, swapping drives is still easy. You can just change the mechanism and keep the old drive's daughterboard. Also, the Blu Ray lasers are dying, but they're easily replaceable.

If you do need to remarry a drive daughterboard, custom firmware can easily do it.

With custom firmware you can set the fan speed to keep the console cooler than it was when it was new and hopefully prolong its life.

An early PS3 and a PS5 is all you need to play nearly 100% of Playstation titles to date."
29235,"> An early PS3 and a PS5 is all you need to play nearly 100% of Playstation titles to date.

Where you playin PSP and Vita games on the PS3 and PS5?"
29236,"I forgot about the handhelds, but I was talking about home consoles.

There are quite a few PSP games that are playable on PS3 as PSP Minis that you can download on the PlayStation Store. With homebrew, you can expose this emulator and load your own games, but compatibility is kinda poor.

As far as I know there isn't a way to run Vita games on any PlayStation home console."
29238,"Ok so turns out I was a bit wrong. 

They're called PlayStation Minis and they were first playable on the PSP, then later the PS3, and finally the Vita. They basically are DSi Ware games. I don't believe any had physical retail releases. They're digital only.

The PS3's built in PSP emulator is meant exclusively for PlayStation Minis but struggles with real PSP games if you load them with homebrew. You need to convert a PSP game into a PlayStation Mini or a PSP Remaster and stuff usually doesn't work right. 

Here's a rather in depth compatibility list:

https://www.psdevwiki.com/ps3/PSP_Emulator_Compatibility_List

I really don't know much about the PSP. I had a DS. And I don't know much about the Vita either. I just bought one last year and that was only because it was too cheap to pass up."
29239,"On a budget, Xbox 360. Lots of great games super cheap. 

With a little more disposable money, I think Nintendo Switch, unless you need latest and greatest graphics. Still tons of great games coming out, tons of Nintendo exclusives, lots of retro games available in the digital store, and it has both a handheld and a home console."
29240,Depends entirely on what you’re looking for in a console
29241,all of them😀
29242,"On a budget I’d say PSP/Vita(more expensive). The modding and emulation capabilities are endless and has a very manageable entry price point. 

More expensively I’d go the route of the PS5 or Nintendo switch. The PS5 gets the latest and greatest gaming technology in your hands with a growing library of great games as well as access to the PlayStation collection games. The switch rivals most current gen consoles with having an gigantic library of games and the ability to take it on the go.

Honorable mention the Nintendo 3DS"
29243,PSP homebrew/emulation is a treasure trove.
29244,Kickstarting a collection? Anything Gen 7. You can get most games for dirt.
29245,"Does it matter how GOOD a game was (metacritic) rating for its value? 

Good games = higher value in 5 years?"
29246,"Somewhat interrelated factors. Generally speaking, value is a function popularity (demand) and the supply. I would consider a rating to be factor in popularity, but clearly not the most important one. In my experience, the print run numbers tend to have significantly more impact on value than the quality of the game."
29247,Depends on what you want to invest in long term
29248,"Ps3 if you want to get the expensive games before they increase even more.

Wii and Wii U if you want to collect a bunch of hidden gems and awesome games for cheap before every other collector jumps into them.

OG Xbox and Xbox 360 if you want a large collection of great games for excellent prices.

Other than that, whatever seems the most interesting to you. Personally, I’m working on my Ps3 and Dreamcast collections."
29249,Are you talking new or old? What kind of games do you like? Are you only interested in a certain company? I mean there's a lot of variables...we have no idea what you like.
29250,"In this year I started my retroconsole collection and I bought a ps3 super slim and a psvita slim, now I’m looking for a psp go. So I’m for a PS3 as home console and psvita as portable console"
45243,"Get a ps2, super cheap these days and most games are also cheap."
45244,Thank you!  I'll have to look into this one!!!
45245,"Given your game selection, I'd recommend a used PS4 or Switch, or even a new one if you can get a good deal. Switch Lite if you don't care for the TV feature.

Xbox One S is a great value too these days"
45246,"Thank you so much!!  I was actually looking a little at a Switch, as I know several people who have it."
45247,Maybe try something like an Xbox 360 or a Wii. Amazing consoles you can get for pretty cheap.
45248,"Based on your game selection, sounds like you will need to make a decision. The last of us is on ps3/ps4, while mario kart is on nintendo systems. If you are looking for a more story/narrative driven experience, the last of us on ps3/4 is what you want, whereas if you want just something quick and possibly on the go, a switch may suit you better.

That being said, Nintendo is usually pretty user friendly, where ps3/4 is less so. (Its still easy to get into, I just find nintendo titles tend to hold your hand more as they are usually designed for kids)"
45249,"The more I look into it, the more I find myself leaning towards a Nintendo Switch...it seems pretty user friendly and the game selection seems more up my alley.  I suppose if I end up liking it, I could also splurge and get a PlayStation, too!"
45250,"I would go with a PS4 as long as it’s a decent deal. You should be able to get one sub $200 especially if it’s a slim or the first version. Also they will have games with it. Hopefully TLoU is one of them (amazing game btw, story is good within the first few minutes)."
45291,Get the PS4 or a Nintendo Switch.
45292,"Buy ps4, god of war, modern warfare and a stack of snacks. Voila you can kill over 100 hours of time.👍"
45293,God of war must have an amazing campaign... don’t think I could get more than a half hour in with COD
45294,"I just ordered an Xbox One X because:

* best buck for real 4K (PS4 Pro has a fake 4K)
* future proof (my current TV is only Full HD, but soon I will have to change it)
* retro compatibility with 600+ games from Xbox and Xbox 360 and of course the current games
* When Xbox Series X comes out, I could play with my games enhanced due to ""Smart Delivery""

I have to state I don't have any console or PC gaming right now."
45295,whatever your friends play. if you dont have friends that play video games get the switch. make sure to play breath of the wild and mario odyssey
45296,"In order of my preference:

1. Xbox One X if you want the best graphics and online services
2. PS4 Pro if you want strong character-driven single-player campaigns.
3. PS4 if you're on a budget
4. Nintendo Switch if you like Nintendo franchises and/or have friends who also own the Switch and you want to play with them.

Don't bother with an Xbox One S. If you want an Xbox, get the One X."
45297,I'm actually looking to get an Xbox One S. I want the X but I'm on a budget so 🤷‍♂️
45298,"I’m a big an Xbox fan as they come, but Xbox One S really hasn’t aged all that well. If you’re on a seriously tight budget and there are specific Xbox-exclusive games you want to play, then sure. Otherwise it’s probably not the best way to spend your gaming dollars."
45299,"You're definitely right, but it's actually exactly that. Tight budget, and I'm a hardcore Forza fan. If Forza wasn't an Xbox exclusive, I would have switched to PlayStation a long time ago. Although I must say, the Xbox controller is MUCH better than the PS controller in my opinion."
45300,"Agreed. I have never really liked PlayStation controllers, and the PS4 controller is the worst of the bunch. Xbox controllers have always been more comfortable and easier to use (except the original ""Duke"" controller)."
45301,Perfect thanks I might go for PS4 I think.
45302,It depends.
45363,Switch
45335,"PS4, been playing on the PlayStation since the 90s and I have a lot of memories from using these consoles."
45336,PS4 purely for the nostalgia factor it gives me.
45337,"PS4 and Xbox one are very similar, but PS4 has more exclusives I want to play"
45338,Ps4
45339,Ps4 cause i grew up with Playstation
45340,ps4 and switch
45341,Ps4 because i got it free
45342,"PS4 and it's not even close. I loved Breath of the Wild and Super Mario Odyssey, but have barely touched my Switch since those games. Many of the releases since have been ports of games I bought on Wii U. Also, the joycons are absolutely awful. Horrible, cheap joysticks that are way too inaccurate for FPS, Rocket League, etc. I've never been an Xbox guy and prefer those titles on my PC."
45343,"PS4, specifically pro. Phenomenal game library, mostly. Switch next if we're allowed to have a 2nd place, really pure gaming titles."
45344,PS4 because there are so many exclusives that I want to try
45345,Ps because it is the first console I ever played with and 1 game is uncharted then I got a wii
45346,"PS4. I like the exclusives a bit more. The controller feels a bit more comforting. Better free games of the month each month I feel like. To each it’s own though! 

Only con I find with the PS4 is that I’m American and I rarely ever run into Americans on PS4. Saying that, I need more friends so if anyone wants to add me, my user is tidaljunkee.

I own both but I find myself on the PS4 way more. I don’t have a Pro yet, but that’s fine! I’ll get it one day. Heard the Pro is a very big hit! I’m from Iowa, and the only Pro that is for sale last time I checked is literally 3 hours from my local metro store. Insanity."
45347,"Grew up with PlayStation... also got great memories with an Xbox 360, so I feel like I have a lot of love for both brands. 

Due to exclusives on the PS4 that are more to my taste, makes it my favorite over the one.  I could totally live with an Xbox if the exclusives start piling up!"
45348,"PS4 for the great exclusives

Switch for Nintendo exclusives plus indie gaming on the go

PC for everything else

&#x200B;

If I didnt have a PC I would get an xbox."
45349,"Ps4 because it has the most games,exclusive and diverse in category, as well as the most stable software. I have all three and just find the xbox way to buggy and annoying. Ps. I was a xbox 360 guy"
45350,Xbox one x because it has the best hardware for consoles and Halo
45351,"I prefer the PC but have tried all consoles. I own the PS4 but also want to buy a Switch and sometimes a Xbox seems also interesting. It depents (in my eyes) what you want to play or if you want to play while you are on the bus or train. So if you like games like  Horizon:Zero Dawn, Detroit:Become Human, etc you HAVE to buy a PS4. If you like Forza Horizon, Halo etc you HAVE to buy a Xbox and for the Mario titles and maybe the coming Pokémon games -> Switch. And then there is the  Point where you don't mind at all about the aaa-only titles therefore i would prefer the xbox.  
1. The controler (in my eyes) ist realy nice and feels great  
2. You can play some titles with your friends on the PC (Halo Wars, Sea of Thieves, ?Forza Horizon?)  
3. It is the better console (not because i hate PS4 ... i love the Playstation style) but if you read down the Hardware what is in the Xbox One X you can see that the XOX has better stuff in it that the PS4Pro   
( 4. It has the best Graphics (without Mods) on Monster Hunter World )"
45352,"Ps4, it has the best controller Imo."
45353,All including PC cause I love gaming as a whole and own all.
45354,"PS4, goat of all time"
45355,PS2!!!
45356,Xbox has an ergonomic controller at least for my hands
45357,"Guess we're rare, that and the backwards compatibility. Plus, Halo 3 will always be fun and our Microsoft has always been professional with their practices."
45358,"I own all three, so from my experience
XBone has most comfortable controls
PS4 has a simple UI/quality games
Switch easily has the best tested/most couch co-op games."
45359,Grew up with PlayStation but owned a Xbox 360 and felt like I needed to continue on with the Xbone. Plus the PS4 dashboard is too bland. But probably is better because Xbox switches their dashboard every 5 seconds to “enhance” it.
45360,"I've been on Xbox since the first one, i also had the very first playstation and the first nintendo. For online games i go to xbox, for single player games i usually play on ps4 and i dont have a switch yet. 

So it varies depending on what im feeling like.

Really? You ask a question and when you dont like the answer you downvote? Really?"
45361,PS4.  Sony is the best.
45362,The one with Bloodborne.
45364,Switch. It just has way better exclusive titles despite ps4 having bloodborne.
45365,Like them all personally
45366,Personal like all of them
45367,"I'm leaning towards switch, because of my love of nintendo, but I'm going to say ps4, because it's just better"
45368,Xbox for backwards compatibility and controller.
45370,"Used to love PS4 but at the moment, Switch because it’s so fascinating, and it has a lot of RPG games which is my favorite genre."
45371,It's a tie between switch and ps4 for me. They both have great exclusives. Although the switch being portable is a huge plus in my book.
45372,PC obviously
45373,The one that gets 154 fps
45374,Wii U. It's a lot easier to keep track of than the tv remote and you can use it as a tv remote.
45375,Been an Xbox guy since the original. Halo was a wow landmark moment for me when i first played it. And i was set on an Xbox when Microsoft acquired Rare.
45376,If i had the money to buy all 3 i would say they're all the best and they all have their strengths and weaknesses
45377,"Switch for the portability, and great games. But PS4 has some great games too. But I still prefer PC over any of them."
45378,"The switch, mostly because it has a good number of games that I am interested in playing. So far the other 2 consoles haven't released games that I personally am intereseted in enough to warrent buying another console. PS4 got close with Monster Hunter World but that came out on PC aswell so I bought it for PC instead of buying a PS4."
45379,"I've really been enjoying breath of the wild on switch, however God of war and Spiderman look great. So ps4s exclusives, Xbox's controllers and Switch's motion controls. Probably ps4 as #1 And Xbox as #2 but switches games are really good too so... send help"
45380,"Nintendo Switch! I prefer playing games on handhelds. With how busy I am nowadays, I tend to get a lot more play time out of them when I can just pick it up and play for a bit during my breaks. It’s nice to play from my bed too, when I wake up and right before I sleep. I have yet to actually play my switch docked for single player games."
29318,For me it is the DS. It is the last gaming console where I spent more time playing instead of researching about games.
29319,SNES because it's the pinnacle of it's era and has stood the test of time in a way that I don't think any modern consoles will.
29320,The switch will be an icon for years to come.  It has such an appeal that I think will continue to be there for a while.
29321,"Nintendo Switch. It is an innovative console with it's handheld and home capabilities. It also has amazing games. People say that the PS4 is one of the best consoles because of exclusives, but the switch has just as many great exclusives such as Mario Odyssey, Mario Kart, Zelda: BOTW, Arms, Splatoon 2, Pokémon, etc."
29322,"Well said, my friend."
29323,"NES. It singlehandedly revived  the Global videogame industry after the crash of '83. Add that to the sheer density of titles that span every genre, as well as its constantly evolving graphical capability that helped it compete with both the Atari 2600 and the Sega Master System, it is simply the most historically significant system ever. 




....Also Super Mario Brothers 3."
29324,"sega genesis.

my brothers and i scraped for every penny and sold stuff to get it.

came with altered beast and mail in for sonic 1 for free!"
29325,"Nintendo Switch 

Its a great companion console for PC and has BotW"
29326,"I technically don't have a console but I'm planning to buy one. I've used the PS4 and the UI is good. I've seen that the Xbox one x is more powerful but the PS has more exclusives, and it seems that Xbox has backwards comparability which I hear is coming to the PS5. So I'm a PC user. Just a regular PC with ok gaming. I want to make a good decision on which console I want to buy so I've come you console users who have years of experience to help me make a good decision.
Thank you in advance for you time."
29327,"If you have a PC, I'd say PS4 for the exclusives alone. Definitely worth it, though be warned: PS5 is only confirmed to have PS4 backwards compatibility, whereas the Xbox Series X seems to be having full backwards compatibility from all generations."
29328,Well I'm still waiting for the ps5 and Xbox series x or whatever Microsoft is calling it. There is one game that is only worth for me to get Sony and that is god of war but sadly Sony doesn't support backwards comparability that's such a dick move. How far back is Xbox game comparability.
29329,"So far, I'm fairly certain it's all generations. First gen Xbox, 360, and One games can all be played on the new one that's coming out iirc"
29330,"Out of current gen, I'll go with Switch as it's the one I have and I really like its exclusives, as well as handheld mode, motion control in some games, unique stuff such as Ring Fit Adventure etc. Although to be honest, I'd probably have chosen a PS4 if I didn't have a PC. Xbox One is sadly irrelevant in my area due to MS's lack of support unless you're really willing to jump through some hoops to make it work, but I really like its' controller, and I use one on PC for some games."
29331,"I only own the base model of Xbox One, which has its own shortcomings, but I really like it for its convenience and versatility.

The price/value ratio is unbeatable considering how cheap it is when on sale (I even got my spare BNIB All-Digital edition during the BF sales for 79€ (approx. 89$), which is just insane).

3TB external drive + about 75 favorite games in total ranging from the 6th-gen titles such as Panzer Dragoon Orta or SSX 3 to the current fan favorite AAA ones like Dark Souls 3 or Doom = what more could a (rather casual) gamer like me want?

Also, 10 TB worth of movies and shows in 1080p/4k - no problem, because KODI

Also, 4k Blu-Rays - no problem, because 4k UHD Blu-Ray drive"
29332,"Both are good in it's own way. I think xbox is more powerfull and silent, while ps have better exclusive games."
29334,"I think xbox has better exclusives. Forza, gears, halo, wasteland. Found uncharted, god of war and the last of us absolutely shite."
29335,"Forza is one of the reson I got xbox and I mostly play xbox and has two xbox, but sometimes when I wanna relax and play campaign games I play on ps."
29336,The main exclusive that ps4 has for me is spiderman. The rest I can give a miss.
29337,"Xbox for me, xbox and ps4 are basically the exact same. have all three main ones. Love the xbox exclusives the most though. Halo, forza, gears, wasteland plus many more. Thought majority of the ps4 exclusives that I played were shite. Last of us, uncharted, God of war were  shite for me, really didn't like them.
Spiderman was class and horizon zero dawn was OK.

Switch would be second for me as their exclusives are much better than ps4 too, plus football manager and pokemon."
29338,"XB1 feels like ""PC Lite.""

PS4 or Switch for ""the console experience.""

Switch is more kiddie but some people like that.

PS4 is more serious/adult ""console experience.""

So my vote is PS4."
29339,"The NES or Genesis. The NES does deserve to be number one, since we probably wouldn't have consoles today without it. It was my childhood console in the early 90s. Almost everyone I knew had one.

The Genesis was truly amazing for the time. I unfortunately didn't own one at the time. Instead I had an NES, but a friend had a Genesis and I remember playing over his house and being completely blown away by the ""High Definition Graphics"". It doesn't seem impressive today, but the Genesis was a powerhouse back in it's day. It came close to arcade graphics which was incredibly impressive.

Edit: Just realized you said this gen, but mentioned the Xbox 360 and Wii? You should make your title more clear. It's very confusing.

The Switch so far is my favorite console. It's probably the most innovative console since the Wii. I love being able to take it on the go. Being able to play SNES and NES titles is also a huge plus for me.

The Xbox One and PS4 don't peak my interest at all. The Xbox One is my least favorite, due to the lack of exclusives. I have a PC, so it really makes it completely pointless for me to own one. The PS4 isn't bad, but again nothing interests me."
29340,"Super Nintendo. It had some of my fave games. Super Mario, Street Fighter, Final Fight, etc. But, the main reason why its my fave is I used to play with my older brothers. I cherish those memories. My fave game though, was a pc game. My fave game is Doom."
45216,"Xbox with gamepass is my advice. While missing on out some exclusives would suck, the value with that service is too good"
45217,"For me, it is PC and Nintendo Switch.

A lot of Games can be played either on PS and PC or Xbox and PC. This is why I have PC (oh and for modding some games like Fallout, Skyrim, etc.)

And a Nintendo Switch because I grew up with it and want to play Pokémon, Monster Hunter, Super Mario and METROID PRIME 4 (please we need some answers, when do we get some informations?!?)"
45218,"Want exclusives: PS5 (maybe Nintendo too)

Want a catalog: XBox"
45219,"Gamepass on Xbox is really good. There aren’t many new AAA games coming out this year, you can just play gamepass games for months without spending money on fully priced games. GTAV and Skyrim with mods will last you months alone."
45220,Thanks for this
45221,"This is the way, Xbox and GamePass."
45222,On the other hand ps exclusives have been the better exclusives for at least the last 2 generations
45223,Yes there are few good games included in PSN+ and few are my favourite but it doesn’t have the variety and amount of games coming month. At least this year Xbox seems like a better choice.
45224,"I agree, I was just trying to show op both sides of the coin"
45225,"Nintendo 64. You can easily get a console and controller (with booster pack) and 4 copies of Paper Mario 64. Best possible use of your money. 

Advantages: no patches, no updates, no laggy connection, perfect performance every time, looks good

Disadvantages: unfortunately with your tight budget you can’t afford Gex 64 unless you sacrifice the controller. Which I guess is an option but that’s your call."
45226,"Ps5 or Switch. They both have better games in my opinion. For example games such as God of War, Uncharted, Pokemon are always fun."
45227,"You're correct. The downside is you have to pay full price for each exclusive on ps. If you have gamepass, all exclusives are available to the subscriber."
45228,Yup. That is true
45229,"you can’t get a good gaming computer for $500, so nix that right away. and i wouldn’t get an xbox either as it’s just a cut down pc. personally i’d go for a used ps4 and a switch. that should fall into $500 nicely"
45230,An original XBox and Morrowind.
45231,Love this
45232,"Switch is cheap, portable and has great exclusives. For your 500 you could get the system, one aaa game, a pro controller, and a year of nintendo online which comes with a wealth of emulated nes and snes games. And youd still have money left over."
45233,A PS5 solely for Sony exclusives which are undeniably the best in the industry
45234,"Very true. But, value for money is with an xbox with gamepass.  Additionally, somewhere along the line Bethesda is going to even up the the exclusives market"
45236,A used PS4 or a switch will due.
45237,Love the game pass mentality. BRO ITS A BETTER DEAL YOU SHOULD DO IT! When you pick a game do you pick the one that’s the absolute cheapest or do you pick the one that you actually want to play? Forking over hundreds of dollars over time to RENT games that you aren’t even going to play 90% of is so shortsighted and silly.
45238,I would save the money to buy a nice gaming computer set up
45239,A SNES has pretty good controllers.
45240,"I have a PS5, Xbox Series X, PC, Quest 2 and a Switch. If I had to choose just one of them, I would probably say PS5. My reasoning is that the PS5 controller is absolutely fantastic (my favourite of any console by quite a margin), and there are many great exclusive games (including PS4 games that are now available at higher resolution/better framerates for free on PS5 with a PS+ subscription). I think it’s all about individual taste though, to be honest."
45241,Pc will always be dawae
45242,Xbox or Switch. Better first party studios
45251,"Honestly, PC is your go-to gaming system for all round general purpose. You can use gamepads on it for a more relaxed experience and you're going to be able to get ~most~ games.

If you want to go the console route though, just take a look at the exclusives and choose that way. If no exclusives entice you towards something, then go in to a game store and just hold some controllers, what feels best in your hands? 

Personally I like the PS controllers over all the others, it's small and light, but I've also grown up with only PlayStation's, so the size of it just feels normal to me. I've met a lot of people who hate the PS controller though. It really just comes down to preference.

And if all those things don't matter then I guess just go for something people you know use, so you have people to play with.

Pretty much all consoles now require you to pay for online function, AFAIK Nintendo Switch is the cheapest for online, something like £20 for the entire year. So maybe let that come in to consideration if you want to be playing online.

Sorry it's a very ""you need to choose"" response, but overall no one apart from you is going to be able to tell you what games you want to play, what controller you prefer etc."
45252,"I feel like I'd have to get/build a brand new PC though. It's definitely an option, I am very tempted... It just seems like a console might be better because I'm always using PC and Mac for my business, so console might feel like more of an escape. 

It all comes down to choice, I think I will explore some controller options, see how they feel etc.. Then I will know a bit more. 

Thanks for your answer!"
45253,"I have a nice PC for gaming, I have an XB1 as my main console, and I have a PS4 that I got on sale for a few exclusives.

I completely agree with your thought of wanting to use a console because you're on a PC all day. I rarely play games on my PC. There's something nice about sitting down at a console and just having it ""feel different""."
45254,"You should try a Switch! They're a little cheaper than an Xbox or Playstation, have a good selection of games to get you started, are pretty intuitive, and with you being busy, you can take it with you when you're on the go. Stuck in line at the post office? Get your Switch out.

Seriously, though, Nintendo has a lot of integrity, which is hard to find these days. I've never bought a Nintendo game that was a disaster like Fallout 76, Battlefront 2, Anthem, etc. They try their best to make sure their games are as good as possible."
45256,"That's a good point. I've recently got a 4k projector, so I'm just looking to explore gaming on a big screen. It's all about fun obviously, it just seems like there's so much choice. 

What games do you play on console and/or pc?"
45257,"Honestly since you’ve never really gamed that much any of them would probably do you good. 

PS4 has some great exclusives and story driven games and the same multiplatform games that Xbox has. 

Switch has probably the best exclusives, and is portable as well as a home console. Though does have some crap on it. 

Xbox has lacked in terms of exclusives in comparison to the other two (though it still has some great ones), it also has backwards compatibility which allows you to play certain older games from the 360 and OG Xbox days. Plus gamepass is probably one of the best things this generation."
45258,"Cool, I appreciate your suggestions. It seems like there are no bad choices between PS4, Switch and Xbox.

Maybe I'll aim to buy all of them! Might take a while to free up enough cash for that though.

Which is the cheapest?

Thanks!"
45259,"I think the Xbox is the cheapest, or it is where I’m living anyway."
45260,"Thanks, I might start with that then. I'm in the UK, so I might find the best deal online."
45261,The Xbox one s is around £200 on amazon.
45262,"Cool, what about games though.."
45263,"I honestly can’t recommend gamepass enough. It’s a bit like Netflix, but with games. And the Microsoft exclusives are on it permanently. So that would be gears of war, halo master chief collection and 5, forza horizon 4 (a racing game), the fable series, plus a lot more 3rd party games. Some of the games on gamepass are garbage, but a lot of them a great. They usually have deals on gamepass as well like the first 3 months for £1 (which was the deal a few weeks ago). 

If game pass isn’t for you I’d recommend halo the master chief collection as it’s halo 1-4, forza horizon 4 is one of the best racing games ever made and set in the U.K. as well, the bioshock collection is great, as is the batman return to Arkham. GTA5 and red dead redemption are both fantastic as well."
45264,"I think it depends mostly on the type of games you like to play. 

Nintendo has a very specific style, so if you think you'd like solid gameplay in cartoon fashion with often a less-serious tone, as well as couch co-op, then the Switch may be the way to go. It has a ton of great exclusive franchises like Mario, Splatoon, Zelda, Pokemon, etc. but doesn't have a ton of major AAA releases though because of its much more limited processing capabilities. A Switch will also give you a good degree of mobility, if that factors into your decision at all. Also, in my personal opinion, the joycon controllers absolutely suck. Theyre very uncomfortable for any extended period of time (I'm talking like an hour) and are way too small. But you could always get a Pro controller which is more like an Xbox or Playstation one. 

The Xbox is a great console, especially the One X if you have a 4K HDR TV (or even if you dont, everything still runs and looks better just not as good as it could). It is definitely the 'best' way to play third-party titles. Gamepass and EA Access also have large libraries of great games for a monthly fee if you wanted access to a bunch of games right off the bat those are both exclusive to Xbox. It supports a ton of backward compatibility as well, if you wanted to try out any games from the Xbox 360 or even original Xbox generations. That being said, it's first party library is severely lacking which I will go into more in a second. As far as an overall entertainment device, I think the Xbox is a superior console to the Playstation. Purely for gaming though, that may be a different story. I also prefer the Xbox controller to the Playstation one, and the Xbox Elite controller (although pricey) is by far the best controller ever made in my opinion. 

You'll want to get a Playstation 4 if you are most interested in its story-driven first party exclusives, because there are a wealth of amazing titles you can only play on Playstation. Namely The Last of Us, the Uncharted series, Spiderman, God of War, Until Dawn, Infamous, Horizon Zero Dawn, and more. Sony is absolutely killing the exclusivity game right now. It can also do pretty much everything the Xbox can, although I personally like the way Microsoft does things better. There is also a game subscription service like Xbox Gamepass but I don't think the games are as good overall.

These are my personal opinions so take them with a grain of salt, but I do own all three and have been a gamer most of my life. Hope this helped!"
45266,"Thanks for the quick response. 

I don't know, I've heard great things about Red Dead Redemption.. 

Anything like that or driving games.

Something fun.. What do you like?"
45267,Do you mean racing games? Or driving like in GTA? Xbox has the best racing games by quite a large margin.
45268,Forza 4 was one of the most fun games I have ever played
45269,"There are two reasons why I play games, either the theme of the game or the gameplay.

Theme wise, I like fantasy, sci-fi and Japanese themed games. Gameplay wise, I like mmorpg (World of warcraft, ffxiv), strategy games (civilization series), platformer (Shovel knight, blaster master), metroidvania (castlevania series, metroid series, the messenger, guacamelee) and JRPG (old final fantasy series until 12, suikoden series, child of Light - even though it's not really a Japanese game -)"
45270,"Are you wanting to start retro or new-gen consoles? If retro, I’d start with an Atari 2600 or NES. They’re not the first home consoles, but the more popular in the beginning of gaming at home. If new-gen is where you’re looking, PS4 would be a good start. I have an Xbox One, Switch, and PS4, but play the PS4 most. The Switch is a good console and there are a lot of great games for it already, but the library just isn’t there yet. As for Xbox One, there are only a few exclusive games for it that stand out, otherwise the games are on PS4 as well. Hope this helps."
45271,"I'd say new-gen. Some people are saying Switch will live longer than PS4.

I was tempted to go for a PS4, but now I'm having doubts.

Thanks for your suggestions!"
45272,It may be worth waiting. The next console generation is coming out within the next 2 years and blowing money on something that’ll be obsolete in a year or two isn’t worth it
45273,"Good point. Ahh... It's a tough one, I'm so tempted to start gaming now though. How about a few games for PC. Any suggestions?

My current machine isn't really built for gaming, which is why I was looking into consoles.

I appreciate your response btw, wasn't expecting comments this quick!"
45274,There's absolutely no reason not to pick up a console if that's what you're looking for. I will say that the Switch is getting some really great games these days.
45275,Doki doki literature club. It’s a visual novel and can be played on pretty much anything.
45276,Why isn't it worth it?
45277,Consoles are expensive and buying games for a console that’ll be obsolete soon isn’t worth it
45278,Just because a new gen comes out doesn't make the current one obsolete though.
45279,"You’re right, not obsolete, just not as good"
45280,That's debatable
45281,I mean technically. The 360 is leagues better than the One
45290,"One and ps4 are at the end of their life, maybe a switch?"
45283,"Yeah, perhaps. Thanks for the idea!"
45284,"Switch will live longer than PS4 and XBO, if you don't want it better wait for the new generation."
45285,"The biggest question here is ""what are your friends playing on?"" If that isn't part of the equation for you personally, it really just comes down to what exclusives. I think moooooost people would be of the mindset that PlayStation is the winner here. 

Other things to consider though would be something like Xbox Gamepass, which is Xbox ""Netflix of video games"" like service that is becoming better every month."
45286,"Haha, yes I'm on my own at the moment. Just looking for a way to chill out on my own and relax after work. Would be good to play some game/s with a social element though.

I was looking at playstation, hadn't considered Gamepass... That might be a good idea.

Thank you for the info!"
45287,"I've personally always been a fan of Xbox. It's where many of my friends are, and I love some of the games.

I also have a PS4, but don't really use it much....mainly for a few of the exclusives.

I enjoyed Nintendo as a kid, but kinda ""grew out"" of many of those games. There's still a few that I'd love to try, but my tastes have changed.

PC is going to give the best graphics, won't charge for online, and has a large variety of games available.

.

Really, it's going to come down to what type of games you want to play.

If you already have a PC, I'd probably stick with that for the short term, and figure out which genre of games you enjoy the most.

Once you decide that it will be easier to figure out which console to get - as they really shine in different areas.

If you don't have a PC currently, I'd recomend the Xbox One S. It's a nice console, and probably one of the cheapest options currently.

.

Next Gen consoles are probably \~18 months out at this point.

So, I wouldn't go spending a ton of money on any current gen console if you think you'll want to get into next-gen."
45288,"Ps4, i'm a primarily xbox player and I love it but more classic games that are just plays are ps exclusives, I hope this helps and good luck have fun!"
45289,"If I were you I'd hop on eBay and get a ps3 or 360 and a bunch of games because if you missed the last 10 years you missed the greatest generation of console.

You could get an Xbox one and go for backwards compatibility and then you could play both red deads on one console. 

I know that EA is a swear around here, but they have several need for speed games in their subscription, this is available on Xbox and PC, and it would give you a bunch of gems to try out like Mass effect, Titanfall 2. Dragon age. Etc. Xbox game pass  had a bunch of games too and sometimes has a sale for a month for a dollar. I think ps has a subscription too but I've never used it. If you want to go crazy and soak in the history on console these are options."
29408,"NES- Maniac Mansion
PS1- FF7
PS2- Socom CA
PS3- The Last of Us
Xbox 360- Fallout New Vegas"
29409,"NES: The Legend of Zelda  
SNES: A Link to the Past  
Game Boy: Link's Awakening  
N64: Ocarina of Time  
GameCube: Metroid Prime"
29410,A little shocked you didn't pick wind waker for GameCube choice. No shame in metroid prime though. That game is absolutely amazing.
29411,"1. Castlevania: Symphony of the Night (PS1)
2. NiGHTS Into Dreams (Saturn)
3. Micro Machines (Genesis)
4. Kingdom Hearts (PS2)
5. Star Wars: Knights of the Old Republic (XBox)"
29412,"1. Chrono Trigger (snes)
2. MGS3 (ps2)
3. Mario Bros 3 (nes)
4. Zelda 64 (n64)
5. Halo 1 (xbox)

others/non console:
6. Mass Effect Trilogy (multi)
7. Half-Life (pc)
8. Street Fighter 2 (arcade)
9. Tetris (gb)
10. Angry Birds (iOS)"
29413,"1. Shinobi NES

2. Turtles in Time SNES

3. Thrasher Skate and Destroy PS1

4. Warhawk PS3

5.Assassin's Creed 2 XBOX 360"
29414,Another thrasher fan! Good stuff
29415,Turtles in Time was the first SNES game I ever had. I played that game for a year straight.
29416,"1.  Super Metroid (SNES)
2.  Castlevania: Symphony of the Night (PS1)
3.  Phantasy Star Online (Dreamcast)
4.  The Legend of Zelda (NES)
5.  Shining Force 2 (Genesis)"
29417,"1. Spyro the Dragon (ps1)

2. Super Mario 64 (N64)

3. Star Wars Battlefront 2 (PS2)

4. Super Mario Sunshine (Game Cube)

5. Halo Motherfucking 3 (Xbox 360)"
29418,"Your #3 reminded me of a game that I absolutely loved on the N64:  Rogue Squadron.  But, alas, I'd already picked my N64 game."
29419,Damn them for escort/protection missions.  Take those out and you could crank out new versions of that game every year CoD-style and I'd eat them up like candy.
29420,"1: Sonic the Hedeghog 2 (Mega Drive/Genesis)

2: Kingdom hearts 2 (PS2)

3: Legend of Zelda: Twilight Princess (GameCube)

4: Legend of Zelda: WindWaker (Wii U)

5: GTA V (PS3)"
