idx,text
71224,Reality is often disappointing
71225,*grinds teeth*
71226,The /s was too late for me not to sit up straight.
71227,That was the plan :)
71228,The original Old Boy.
71229,"Unbreakable

""In a comic, you know how you can tell who the arch-villain's going to be? He's the exact opposite of the hero, and most of the time they're friends, like you and me."""
71230,The kids!!! They called me.......Mista Glass.
71231,"I also love all the dialogue leading up to that point

""They say this one has a surprise ending""

""There's two types of villains in a comic. The one who battles the hero with his hands, and the one who battles the hero with his mind. He's the real threat."""
71232,Hulk smash Loki
71233,There's also a portion where it talks about how you can recognize the villain through having a larger head.
71234,"Man you just reminded me of when I was 11 and on my way to the theater with my sister to watch the movie. Some asshats in front of me walking down the street were talking really loud and one of them says ""so Sam Jackson was actually the terrorist the whole time???""

It took me like 10 seconds to figure out the movie and I was so goddamn angry. Fuck you lady!"
71235,"Vertigo, because it does more than just „shock“.
It asks a question. Do we love people for who they are, or do we love them for what we see in them?"
71236,"I remember Vertigo being like the 1950s ""Primer"""
71237,"I've been planning to watch that for two weeks now, but nothing motivated me to watch it. Until you commented :)"
71238,The sixth sense. Bruce Willis was bald the whole time!
71239,The bald guy was Bruce Willis?!
71240,He has hair in that movie
71241,"I still don’t know how this is possible, but maybe two months ago I come to find out that not only had my wife never seen The Sixth Sense, but that she hadn’t had it spoiled. I carefully asked what she knew about the film and she said nothing so we watched it together that night. 

It was SO FUN to watch it with someone who didn’t know the twist, because when the big reveal happens she lost her shit, it was amazing."
71242,"Did the same with my little brother a few years back. Was super fun watching the shock on his face and seeing him put the pieces together.

On the same note, I have to emphasize how much that movie stands up on it’s own as absolutely fantastic even if you know how it ends, unlike other well known “big twist” movies"
71243,Exactly! I loved rewatching it. Definitely holds up on its own.
71244,Is the movie still worth the watch even if you know the twist? I never watched the movie and I didn't have it spoiled for me... Well if you're not counting that I figured what the twist must be on my own.
71245,"Yes, it’s a great movie - fantastic performances"
71246,"I think that was part of the appeal. At the time of theatrical release everybody was talking about how no one saw it coming.
Except for some asshats who claimed they knew all along."
71247,Jizz. In. My. Pants.
71248,"I will never forget the conversation I witnessed between my two 3rd grade schoolmates around the time the movie was in cinemas.

A: ""Dude, have you seen The Sixth Sense? You should really go to see it.""

B: ""No, I haven't. What is The Sixth Sense?""

A: ""It's the new movie with Bruce Willis where he plays a ghost.""

Luckily by the time that conversation happened I'd already seen the movie so all it did was cementing the impression that my schoolmate A was a really dumb A-hole."
71249,The Empire Strikes Back
71251,I'm still getting over Ben kenobi being obi wan kenobi
71252,"I know, right? Who could have forseen that?"
71254,"There are shittons of videos on YouTube of parents showing star wars with that twist to their children the first time. The kids are absolutely flabbergasted. Check it out, real fun."
71255,"Oh man, how could I forget... Thanks for reminding me about that!"
71256,"The perfect example. It is completely unexpected, and is devastating to both the main character and the audience.

It also retroactively alters the context of the entire conflict up to this point, and changes the trajectory of the story going forward. 

It throws you off balance while simultaneously deepening the entire narrative."
71257,Spoiled for me by a loud nerd narrating the film to his friend from one row back.
71258,The Others
71259,The Usual Suspects-who would’ve thought Kevin Spacey was just acting and actually a pedo the entire time
71260,The Sting.
71261,"Ah, the long-con gold standard."
71262,The twist in The Sting is one of the more underrated movie plot twists. Nobody really talks about it much despite the fact that the movie is universally considered a classic
71264,One of the few times a movie left me so empty inside.. I love it but I will never see it again. If anyone know similar movies please comment.
71265,Memento and The Best Offer
71266,Jacob’s Ladder has a pretty good twist. That one steadily unfolds and then flips it on you pretty well.
71267,Is this a Jacob’s Ladder scenario?
71268,"Probably due to recency bias, but I thought Searching had an amazing twist that I personally didn't see coming. The movie made you think that it could end in a few different ways and just when I start believing in one, they introduce another possibility."
71269,It also has a hidden subplot playing out in the background.
71270,Wait. What's the hidden subplot?
71271,https://www.youtube.com/watch?v=-KIiPAFDdLY    It's also been confirmed by the crew as intentional.
71272,"Yes! It used the screen-based as essential to its storytelling, not just a newfangled gimmick. I had fun speculating what the ending was gonna be and it was such a wild thrill ride that especially escalated after the dad throws that one movie in the trash. Heavy emotional note."
71273,No. It actually is a pretty good twist.
71275,My man haha! My favourite film of all time!
71276,Yah man it’s def top 5 for me and it’s also highly rewatchable
71277,One of only 3 films I've went to the cinema multiple times to see. The others are Casino Royale and Deadpool.
71278,"Shawshank Redemption!!!! Man, who would have thought about that hole???"
71279,"Yeah, the movie sets itself up to be another Cool Hand Luke, about the triumph of hope, even in defeat. Then...not so much."
71280,"I mean, really, how often do you look at a man's shoes?"
71281,Psycho
71282,"Agreed, that film still creeps me out."
71283,"Arrival has to be up there

&#x200B;"
71284,Was it a twist? Which are you referring to? I loved the movie
71285,">!Throughout the movie, Amy Adams's character remembers her daughter who died of cancer. At the end it's revealed that she was not remembering the past, but actually foreseeing her future daughter that she will have with Jeremy Renner's character. They get together at the end and have a baby, even though she knows the daughter will die of cancer at a young age.!<"
71286,"I always forget how sad that movie gets. Great movie, I love Amy Adams!"
71287,"I would add The Handmaiden, this movie catching me off guard, I love it. Would definetively recommend, gets more layered as it goes."
71288,The Skeleton Key has a great twist and is a great little film. The terrible title puts a lot of people off I think.
71289,"The Skeleton Key is one of my favorite movies still to this day! I really love the southern gothic vibe it had going on. I can't help but notice while watching Get Out (which I also liked), they had a *lot* of similarities or if that was just me."
71290,Maybe even too much. But I liked get out more.
71291,"Haha, I wanted to watch it today but I didn't have time for it. I'm probably watching it tomorrow with Vertigo. I don't like horror *movies* tho, but I will probably check it out! :)"
71292,"Fun fact it's actually translated to: 'Titkok kulcsa' in my langauge , and it means: 'Key of secrets'"
71293,I'm not sure if that's better or worse!
71294,Spider Man Homecoming. When Michael Keaton answers the door!!! Mannnnnn
71295,"This one may fall short since it a relatively recent comic book movie but that scene truly got me. I’m usually really good at seeing things coming in movies and the filmmakers just did a good job at hiding it and distracting me before they revealed that. Love that scene, and the subsequent ones after. So much awesome tension, and really nails the work life balance Spider-Man always struggles with"
71296,After posting it I had to watch it again. Its so tense and I can really empathize with how frightened Peter must be...I was shaking!
71297,The original Planet of the Apes and Fight Club.
71298,You gotta have ‘Saw’ in the top 10
71299,"I didn't put movies in that were (sadly) spoiled for me already. And this is a personal opinion but I know, Saw has an amazing twist, especially for it's time. Even if I know that Jigsaw was there the whole time, I was still shocked. It would've been in the top 6-7 for sure!"
71300,"I'm not really sure why this is ""controversial."" It's hard to judge how great a twist actually is when you didn't get to fully experience it yourself. I haven't even bothered to watch *The Sixth Sense* or *The Usual Suspects* yet because I had the twists spoiled for me."
71301,"I feel bad for you about Usual Suspects. Such a masterpiece, and throw whatever you want at me, but Sixth Sense twist was kind of predictable."
71302,"For its* time.

And I agree, one of only 2 'horror' movies that I actually enjoy."
71303,"Malice with Bill Pullman and Nicole Kidman.

a sleeper movie and starts out slow but the wait is worth it"
71304,"Shutter Island...... really liked the movie.... but you know what I feels would’ve made it better? A double twist. It’s been a while since I’ve seen it, but the twist when it’s revealed he’s an inmate was good, but the final scene where he’s sat on the steps and the doctor comes over and talks to him...... imagine if he winked at the other guy as if to say “got him”.... like he wasn’t actually an inmate, but they’d managed to convince him that he was. I always thought that would’ve been a great ending."
71305,"It does have a double twist, though.  The first twist is that Leo is an inmate, not an investigator, that keeps regressing from his treatments.  The second twist is that the treatment used throughout the film *works*, and Leo pretends to have regressed because he doesn't want to live knowing what he did to his wife."
71306,"It comes off better in the book, but Leo delivered the final line pretty damn well. Seemed more open ended in the film while the book it was pretty certain he was pretending to regress."
71307,"Wow man that's actually genius, but what would be the point of that? :D"
71308,"Because all the way through the film, isn’t Leo “investigating” bad shit going on there? They’re lobotomising people or something? I can’t remember now. Is it murders? Anyways, they’ve convinced him he’s crazy so he can’t go back to the real world and report all the bad shit that’s going on there, so they can carry on doing it."
71309,"I can appreciate twisting on a twist, but there would have been waaaaaay to much to explain away or expect the audience to just ignore if it went down that way."
71310,Surprised no one said Angel Heart.  The last couple minutes bounces the movie into a different genre.
71311,"I had read the book first so it wasn't a surprise, but I thought it was really well done!"
71313,"I watched the trailer of that, and the first comment I saw spoiled it. So sad :("
71314,Watch it anyway! I rewatched it and it's still amazing. Knowing the twist makes you pay attention even more.
71315,"Hey I got my first silver, thank you stranger!"
71316,Sarah Snook was so good in this!
71317,"also 'Witness for the Prosecution' 1957, there are several twists"
71318,"And the thing is, all of them very direct, but very simple too. So good."
71319,"Here's a (perhaps) interesting sort of last moment ""twist,"" from the movie **King Rat** --about a prisoner of war camp where a low-ranked, scheming soldier rises to power by being able to procure ""what's needed"" for the rest of the prisoners.

Throughout the film, this man has another highly ranked soldier as his ""arch enemy"" --a man who works feverishly throughout their imprisonment to bring the upstart down.  And always failing.

At the movie's end, when the POW camp is liberated and the soldiers are being trucked home to freedom the ""arch enemy"" is getting his final licks in, dressing down the ""King Rat"" who is now just a powerless underling again, and assuring the man that he was less than worthless.

That's when another soldier tells the arch enemy the truth/the twist:  That if it weren't for the King Rat giving him something to hate with all his heart, he wouldn't have found the strength to survive the horrors of the camp."
71320,"I'm not gonna read it because I don't want to get spoiled, but thanks for the recommendation! I wrote it into my 'must watch films' list! Appreciate it!"
71321,Empire Strikes Back.
71322,"The Sting is probably the best one imo.

The twist in The Game was just way too far fetched imo."
71323,The game twist was the most original and creative of them all in my opinion. I will surely check out The sting!
71324,What was the twist in The Game? That it was actually a game? I watched it recently and was generally unsurprised.
71325,It was dumb. They would have had to predict everything happening exactly as it did for it to work.
71326,The Sting is probably one of the oldest (and best) plot twist movies.
71327,"That's not true at all. The first plot twist was in 1903, in The Great Train Robbery. 1920(?) The Cabinet of Dr. Caligari, and last but not least, Citizen Kane. Such a masterclass movie and a classic. Well, these are 'different' twists than twists these day but they are all considered as twists. :) And The sting got 3 votes in the comments, Im sure I will watch it next week! :D"
71328,"You're right - maybe I should have said 'one of the oldest *modern* movies with a plot twist' - by modern, I mean containing actors who some of which are still alive."
71329,The Orphanage
71330,Psycho is the gold standard for how to do it and do it right.
71331,Cloverfield Lane
71332,"Kill Bill 2 when she finds Bill

Nothing even comes close"
71333,"My favourites: Prestige and Memento.

&#x200B;

 I also like to mention""Gone Girl"".  That movie completely blow my mind."
71334,"Here are a few extras for you to watch if you like these sorts of films:

1. Coherence.  A darling of the Reddit crowd, and it deserves the love.  A great and cheap little film.

2. The One I Love.  A great little known film shot almost exclusively at Ted Danson's house.

3. The Thomas Crown Affair.  The remake."
71335,Scanned the comments and didn’t see Arlington Road or Suicide Kings. Don’t look them up. Don’t watch the trailers. Just go watch them.
71336,"I'm also surprised about not seeing the original Planet of the Apes in the comments. It must've been shocking for people when they first watched in the cinema back then. Still holds up to this day, but couldn't make it on my Top 10 list. It must be like 11th. I put Invisible Guest before it because there are so many twists, literally the whole movie is about twists. Just when you think 'ok, this is the final twist, right?' and it gives you another one and another one lol."
71337,"I was browsing the comments to find your comment, because Arlington Road was the first movie I watched because of this post. I just wanted to tell you that in my opinion it was like Secret Window for a weird reason. Both had interesting plots, I was sitting on the edge of my seat all the time UNTIL the twist happened. Both had really bad twist in my opinion. But still, it was so much better than Secret Window. At least I had a 'holy fuck' moment when he found it the bomb was in his car. And the other 95% of the movie was one of the most interesting stories I've ever seen. Too bad the twist kind of ruined it. It could've been a 9/10, but the twist had no build-up at all, even if I know how the bomb got into his car, so it's a solid 7/10! Thank you for the suggestion, I really enjoyed it! :)"
71338,I love how the original The Secret in Their Eyes ends. I suppose it's a twist but maybe others don't consider it that way. The whole movie's perfect to me though.
71339,Fight Club.
71340,The Departed where >!Leo gets shot in the head!<
71341,Seven
71342,"The ones I remember most: 

A Tale of Two Sisters (2003) (The Uninvited (2009), a US remake, isn't that bad at all.) 

Oldboy (2003) 

Right at Your Door (2006), April Fool's Day (1986), The Ninth Configuration (1980), Arlington Road (1999), Frailty (2001), Identity (2003), and No Way Out (1987) -- I knew nothing about those movies when they showed up on Netflix and Amazon Prime. Same with Dead Man's Shoes (2004) I suspected half way through, but it still managed to take me by surprise, anyway. 

Mindhunters (2004) shouldn't be counted here as it's a whodunit, but I'm listing it here for those who enjoy guessing who might be behind it."
71343,"Thank you for the nice list. I watched The uninvited and it became one of my favourites. I somehow expected Anna to be the killer but when I FOUND OUT ALEX WAS DEAD THE WHOLE TIME, THE WHOLE TIME. Oh damn I fucking threw my headphones away. Oldboy also became one of my favourites. Probably in TOP5. It was disturbing and the fact that we weren't watching the main character's revenge story the whole time. Oh fuck. And for last but not least, I think No way out is way overrated. I found it boring and I also found the twist making no sense at all. And thank you once again buddy, two of your recommendation became my favourite."
71345,The Lego Movie.
71346,"Frailty - great little twist that makes the movie a classic.

No Way Out - still one of the few twists I never saw coming in any way."
71347,Terminator 2 if you managed to skip the trailer.
71348,Dirty Rotten Scoundrels
71349,"The Others. I wasn't expecting the twist and when it happened, it really scared me. Which made my experience of the movie so much better.

I really liked the genre twists in From Dusk Til Dawn and The Guest as well."
71350,The Knights of the Round Table getting arrested.
71351,A literal cop out. They ran out of money to film the battle.
71352,In the original ending they were going to find the grail at Harrods.
71353,Book of Eli
71354,I was okay with the bible being in a language only some people know but the real twist was that he was blind while clearly playing the character as being able to see. The twist would have been great if it was a latin bible or something. But like this it was really bad imo.
71355,"Book of Eli was a fine twist to me because it was so heavily foreshadowed & noticeable on a 2nd watch. Check out this list of all the moments it was hinted at

https://www.reddit.com/r/movies/comments/1rdyeu/spoilers_every_clue_in_the_book_of_eli_that/"
71356,But this ignores so much else. He makes eye contact with people constantly throughout the movie.
71357,Blind people can usually tell right where someone is and how tall they are when they speak. You also have to remember God was helping him to deliver the bible throughout the film.
71358,"This is not the same as eye contact, not even close. Dude literally walks everywhere without bumping into things or falling down. He fights groups of people. He goes into shops asking about items, picking up things he didn't put down without searching for them, and pretty every interaction he has, he behaves as if he has sight. Either God gave him sight and then took it away, which is fine here t poorly explained, or they did a very bad job trying to make this a twist."
71359,"That's great and all but he also looks at people the whole damn movie. The director probably told him something like ""you're blind but don't make it obvious"". He keeps looking at other people's faces, he looks at his own reflection in a cup of water for crying out loud. And it's all misdirection."
71360,"I am your father...easy. 
Keyser Soze a strong runner-up"
71361,The Rudderless twist still has me thinking to this day
71362,The ninth Configuration
71363,"The Guilty (2018) has a great twist. It's not the best in movie history or anything, it's just on my mind because I saw it recently."
71364,"Wow, I can't believe I've never heard about that! And finally a non-american film recommended to me! I always find them interesting, for example The invisible guest is Spanish and it was very very surprising. I'm gonna watch this first out of all recommendations and I will let you know what I think about it! Thank you! :)"
71365,I just think its funny that the Invisible Guest and the Invisible Guardian are both Spanish language crime thrillers.
71366,"Hey man! Just watched The guilty! Well it's not on my top 10 list, but damn, I would've never guessed that the mother was the one who killed the baby. I love these kind of plot twists, it gives you the information, and when the twist happens it's like a puzzle. It all makes sense. But you know what could've been an even better twist? If the mother would've left a message before she committed suicide, and the message would say something like that the father was actually the one who killed the baby, but he said he would kill her if she tells it to the police, and just like that, the father gets away. I hope you know what I mean, and thank you for your suggestion, it was a good film! 7/10!"
71367,Magnolia - if you call that a twist. Amazing movie regardless.
71368,Citizen Kane is a classic twist
71369,"Chinatown is my number 1.

Also though; Citizen Kane, Laura, The Third Man, Psycho, Empire Strikes Back, The Terminator, Seven, Oldboy, and The Matrix Reloaded (I know, I know)."
71370,"Others may beg to differ, but for me it's Blade Runner 2049. When I first watched the movie, it stung when >!K found out he wasn't the child!<"
71371,"Spider-Verse. The reveal of Prowler along with his theme pumping in the background was awesome. 

Before the nerds say everyone should know who Prowler is, no, we don't all read the comics. It was one hell of a reveal."
71372,"One of the best uses of Elephants in a key sound design moment out there, up there with Star Wars’ TIE fighters."
71373,"the ending of La-La-Land. A whole movie that plays as a classic romantic fantasy, genuinely romantic, it just shoots you to the MOON with love and happiness and magic and then....they don't end up together ----- wait no they do! ---- Wait no....they don't.

You watch that entire movie, the idea that it doesn't end on a kiss is an amazingly brave choice. especially after it gives you a montage of them having children and all of it...

Movie ends 5 seconds earlier with the smile it's a romantic classic, with the ending now it completely changes things. Best  / boldest plot twist I have seen in recent years, it stuck with me it was so unexpected

&#x200B;"
71374,The matrix. The others.
71376,That's why it's my favourite film of all time. I watched it with my classmate and damn we were in shock for two days..
71377,"You could've put a spoiler mark there, I haven't seen that movie :D"
71379,Incendies has one of the most earth-shattering twists in film. What a knockout.
71380,Den of Thieves. the last 30 mins of that movie was wild
71381,"The secret in their eyes. (2009)
Not the inferior American remake."
71382,Body Heat
71383,"Really surprised you thought the game had a good plot twist. I thought it completely ruined the movie and wasn't honestly all that shocking, just made me feel like I wasted my time. That being said, I'd say my top 3 are The Prestige, Fight Club, and The Usual Suspects"
71384,Surprised nobody has said Lucky Number Slevin yet. I'm usually pretty good at seeing twists coming (not necessarily knowing what they will be) but that caught me so off guard.
71385,"Hey man! So I'm on a journey to watch the films that were suggested me under this post, and I just finished Lucky Number Slevin. And damn I knew the beginning of the film with the death of the family will be important, and fun fact that I thought that they didn't show the kid getting killed because well, you can't just show a kid getting killed on screen. And damn, this was so smart at the end, I had the same feeling when I was watching Oldboy. I didn't know what was going on in the whole movie but the twist hit me like a truck! Brilliant movie, not in my TOP10, but still brilliant! Thank you for the suggestion! :)"
71386,">> Psycho 8: Shutter Island

I don't know if this is my redditisfun app's fault or if the post is badly formatted, but damn."
71387,"Guardians of the Galaxy Vol 2.

Now, I think we all knew that >!Ego was going to be a villain!<, but >!the twist where he had purposely given Peter Quill's mother a brain tumour!< was very unexpected to me."
71388,*whaaa...* **BLAM BLAM BLAM**
71389,Ant-Man and the Wasp. The post-credits scene >!that linked to The Decimation that occurred at the end of Avengers: Infinity War!<.
71390,"Avengers: Infinity War. Revealing that >!Red Skull was the Stonekeeper guarding the Soul Stone. This may not have been a major plot twist for this movie, but it retroactively adds a plot twist to Captain America: The First Avenger!<."
71391,Why was he tho
71392,You named some pretty good ones man.  I got nothing.
71564,From Dusk Till Dawn
71770,The Invisible Guest
71395,*Terminator: Genisys* had a pretty interesting plot twist. Too bad it was blown in the second trailer.
71397,"'I am your father, Luke.' - I saw this in theaters back when there was no internet. Spun my head around."
71398,"Wow, did you? :D I wish I was alive back then, same goes to Planet of the Apes. Should've been a mini heart attack for people when these two happened in the cinemas!"
71399,"I saw both in theaters, but was a little young when I saw Planet Of The Apes.   (It still blew my tiny little mind.)"
71400,Pan's Labyrinth
71401,"Sometimes I feel like I'm the only person who saw the twist from The Prestige coming from a mile away. I mean, they foreshadow it and beat you over the head with it in the first couple minutes of the movie.
  
I liked the movie. But it was so obvious with the Chinese guy and the cat and the twins and everything that it kept me from enjoying the movie as much as I think I otherwise could have."
71402,"Well there were three twists? Did you see all of them coming? I only saw the Angier is still alive twist. It was obvious he survived because they showed him dying in the first scene, but it was just a clone. And yes, that's the brilliant part of the movie that makes it my favourite. When the kid starts to cry on Borden's teleporting man trick. Borden showed the same thing on a bird, and the kid asks: But where is his brother? They also tell Angier that it can't be real magic, so Borden must have a twin. But it was just so simple we just forgot it. And the suspense, the music and everything.. 'Abracadabra'. I just didn't see it coming, it was way too obvious! And the third last twist was that Angier still has clones. Well that was kind of predictable. Thank you if you understand why I love this twist so much, same goes to The game. It's so obvious that it's the last thing you would think of. :)"
71403,"Soylent Green. Everyone knows the twist, now, but that movie was ahead of its time and had a great twist.

  


The Sixth Sense. Saw this in theaters when I was young and it blew my mind.

  


Planet of the Apes. Also saw this at an early age, rented it from Blockbuster and it caught me off guard at the end.

  


I was too young to remember much about watching the original Star Wars trilogy for the first time, but I'm sure Empire Strikes Back threw me for a loop."
71404,"Soylent green was way ahead of its time considering the plot twist! Citizen Kane was also similar, such a creative twist, and the feeling that they never found out *SPOILER: that Rosebud was his childhood sled, but we, the viewers got to know it was so smart SPOILER*"
71405,PREDESTINATION
71406,"Yeah, it's on my must watch film list! And yes, I'm sad it got spoiled for me but I'm pretty sure I will enjoy it the same way! :)"
71408,Memento is pretty great too
71409,"Dead Man's Shoes - man returns from military to childhood home and wreaks havoc on small group of friends who treated his brother poorly, all the while talking to his brother about what he's doing. 

*Spoiler Alert*

Final scene depicts flashbacks of friendship group torturing and murdering the brother. You slowly realise you never see the brother in any scenes other than in isolation with main character. Dead the whole time."
71410,"God yes. That movie is amazing. Honestly, that film is almost completely up front about the fact that his brother is dead (re: title), yet it was a complete shock at the end. Paddy Considine doesn't get the accolades he deserves."
71411,I suggest reading We Were Liars if you get the time. You'll love it!
71412,"The beginning of the other guys when Samuel L. Jackson and the Rock ""aim for he bushes"". I died laughing at that part."
71413,"""Hey! Are you dirty Mike and the boys?!""


Yeah, we call that a soup kitchen."
71414,We *will* have sex in your car again.
71415,Everybody rub your dicks on his car as we run away!
71416,How dare you! That is a Toyota Prius!
71417,"""I have an apartment downtown that I use for my parents and prostitutes...not at the same time though, that would be weird"""
71418,Gentleman you have two choices...Jersey Boys or Mama Mia
71419,There goes my hero!
71420,Watch him as he goes.
71421,There weren't even any bushes in that scene lol
71422,"It's in that moment you realize they aren't supercops.       
They're flat out stone cold *nuts*."
71423,There wasn't even an awning.
71424,"There was, they were just across the street."
71425,When Riggs and Murtaugh switch in *Lethal Weapon 5*.
71426,One of the best.
71427,The sex scene at the end of Lethal Weapon 6.
71428,The blackface seemed racist though...
71429,It was tasteful
71430,"That John Cusack movie ""Identity"" - a bunch of strangers end up stuck together at a hotel after the roads get flooded. Ever so often the scene would cut to a guy being evauated at a mental ward.  
Anyways, people in the hotel start getting murdered.

Twist part:


They're all different personalities in the patients head, and it's a process where the docs are getting rid of his multiple personality disorder.  Only problem is, one of the personalities is a murderer..."
71431,The ending of The Mist definitely.
71432,Two minutes... if the dude waited just 2 minutes....
71433,"I like to think that his son actually was the anti-christ or whatever, and he only ""ended"" the mist by killing/ sacrificing  him like the crazy religious women wanted"
71434,I'd like to think this is true it makes the ending less sad
71435,Yes.. That's what makes it a good twist. Even Stephen King agrees.
71436,Which is saying something. King hates his movies.
71437,"Probably not. The crazy religious lady, Mrs. Carmody was right most of the time. When the mist descends on the town, she predicts that someone will die that night and she's right. The monsters break in that night, one lands on Carmody while she's praying and spares her then moves on to kill the cashier. When Amanda slaps her the first time, she says ""If you hit me again, if you dare, you'll be on your knees to me before this is through."" Later, when Amanda slaps her again, Carmody's followers force Amanda to her knees. And finally, at the climax of the movie, Carmody claims that God wants them to sacrifice David's son and they'll be saved and what happened? David killed his son and the mist immediately disappears and the army rolls in to save the day."
71438,"Great film.

Stephen King has called the ending more brutal than he could have thought up himself. 

Trivia: The mist in the movie is actually a [Thinny](http://stephenking.wikia.com/wiki/Thinny). A Thinny is a doorway between worlds in the Stephen King universe and they appear on several occasion in The Dark Tower."
71439,"That ending made me angry that they didn't wait, few films mess with me like that."
71440,I was angry because of that overly religious lady in the market.
71441,"Yeah, she was a cunt. The actress did such a great job at making her character so utterly deplorable."
71442,Se7en's or The Usual Suspects' ending.
71443,"If you like Kevin Spacey twist endings, check out *The Life of David Gale*."
71444,"This ruined Interstellar's big surprise for me. 

Spoilers obviously

But when Matt Damon sits up, uncredited, never shown before, two hours into a movie?   I turned to the friend next to me and said ""put two rounds in the back of his head right now ""  because the only reason a major star goes uncredited that long is he's a bad guy."
71445,"As someone who went into the usual suspects unspoiled, the ending blew my fucking mind."
72139,WHAT'S IN THE BOX?
71447,"Fight Club.

I ain't gonna talk about it, though."
71448,My wife has never seen this and I really need her to...
71449,"Just do what me and my brother did with his girlfriend. She stood by her reasoning of not wanting to watch it (It's just a movie about a bunch of guys fighting, I don't want to watch that) So, we started the movie and paused it right after ""Fight Club"" left the screen during the opening credits. Then we told her we had a movie picked out and we're waiting on her to start it. She fucking loved the movie, but as soon as Brad Pitt said, ""Welcome to Fight Club."" She lost her shit. It was pretty hilarious."
71450,Reminds of the video where a group of friends trick one friend who hates Kevin Spacey to watch Se7en and the guy loses his shit in the reveal.
71451,Tell her she can see Brad Pitts dick. That might do it.
71452,And that it looks like your own but smaller
71453,John Travolta and Una Thurman in Pulp Fiction.
71454,I like part 2 better with Una's sister Uma Thurman.
71456,http://giphy.com/gifs/filmlinc-pulp-fiction-steadicam-WWwv4kP2Nc03m
71458,"Gone Girl. 

Without majorly spoiling it, I watched with my boyfriend (who had not seen it) and the first half of the movie, he was SO angry with Nick's character. By the second half/the first twist, his attitude completely reversed. It was amazing. And he can usually call a twist pretty quickly."
71459,I realised I was in an abusive relationship because of that book.  The fake diary that she writes - all of her lies where she makes her husband out to be a shit - I related to it way too much.
71460,"Vader: ""Obi Wan never told you what happened to your father.""

Luke: ""He told me enough. He told me you killed him!""

Vader: ""No. I am your father."""
71461,I was born way after so unfortunately this was common knowledge by the time I got to watch the movies.
71462,My sister managed to avoid finding out that Jekyll and Hyde are the same person. She had to read it for class this past month. This was entertaining for everyone else in the house.
71463,8 year old me was completely mindfucked at this revelation
71464,"Ace Ventura 

""Thats it! Einhorn is Finkle. Finkle is Einhorn. Einhorn is a man! Oh my GOD! Einhorn IS A MAN!! *uuugggghhhh*""

♫*i know all there is to know about the crying game*♫

*retching noises*


""NO!....NO!!!....NO!.....""  *Cries in shower*"
71465,"the plunger to the face really seals it for me.

i really can't think of another actor that could pull that off.

Jim Carrey was amazing. A 4 year run (1994-1998) of The Mask, Dumb and Dumber, Ace Ventura 1&2, Truman Show, Liar Liar and The Cable Guy. IMO probably the best collection of quotable movies from one actor."
71466,"The Mask, Dumb and Dumber and Ace Ventura we all released the same year (1994). What a year!"
71467,"94 also had Shawshank redemption, Forrest Gump, Pulp Fiction, and the Lion King"
71468,And Jim Carrey was great in those too!
71469,"I feel there should be an honorable mention for Me, Myself and Irene as well. He was playing two roles, and at one point both at the same time."
71470,"""Your gun is digging into my hip....uuuuuuuugghhhhhhhhhhhh"""
71471,That scene at the end when he fights the other team's mascot... I laughed so hard. He turns from goofy pet detective guy to a UFC fighter in an instant. Straight comedy.
71472,"As someone who never saw Cloverfield, 10 Cloverfield Lane was a hell of a surprise. Made me go back and watch both but in order this time."
71473,"I was honestly laughing at the cheekiness of those last 10 minutes, and how much of a non-sequitur it felt like after an hour and a half of unbelievable slow burn.

Having seen Cloverfield, I figured they'd do something like that to tie this movie in a little bit, but I didn't expect that intensity.  It was an out-there choice and I don't fault anyone for not liking it because it doesn't mesh with the film as a whole at all, but I loved it."
71474,"Really enjoyed 10 Cloverfield Lane, just didn't like the last part, felt added on."
71475,Loved the movie until she actually makes it out and kills a spaceship with a bottle......
71476,"Hey, don't doubt the destructive powers of a bottle.
I killed my marriage with a bottle."
71477,"....Bottles>Aliens  ¯\\_(ツ)_/¯

Plus that running alien, she should have been dead from that thing alone."
71478,"In The Sixth Sense, that dude with the hairpiece was Bruce Willis the whole time."
71479,I watched that movie five times before I realized the skinny junkie with the gun at the beginning of the film is Donnie Wahlberg.
71480,"Was entering the thread to post this. Nice job, Charlie."
71481,He *NOSE* the truth!
71482,CRIME STINKS: THE SMELL OF PENETRATION
71483,"Despite it having mixed reviews, I really liked the plot twist in The Village"
71484,There are dozens of us!
71485,Dozens!
71486,I actually really liked this movie.
71487,I feel like I'm one of the only people that enjoyed The Village.
71488,"Wait, people don't like it?"
71489,"Have you ever... spoken to people about this movie before?  Seen a review?

It's generally considered the start of Shyamalan's downfall."
71490,"The end of the original ""Saw"" movie had me trembling when the ending happened... people that have seen it know what I'm talking about... people that haven't seen it I recommend it, it's a very mediocre, gory movie until about the last 3 minutes where it becomes one of the best movies I've ever seen.

SPOILER ALERT:
If you haven't seen it but still want to know how it ends [here's the ending](https://m.youtube.com/watch?v=v01gDZVRTf0) 
Explanation: The entire movie you are lead to believe that the guy in the black jacket that enters the room with the gun is controlling the two men in the room, one who cut his foot off and the one still shackled, as well as some random dead guy that has been laying on the floor in the middle of that room for the ENTIRE movie. Turns out, the guy who is still cuffed to the pipe kills the guy in the black jacket and the guy who is missing a foot crawls out of the room for the first time all movie to go get help... but then, the guy in the middle of the room stands up and walks out after the guy who just crawled out... turns out, the ""dead guy"" laying in the floor was running the whole operation and enjoyed his front row seat. The movie leads you to believe that he is completely insignificant cause the two men in the room have minimal interaction with him because he's ""dead"" right? Wrong. Just watch the video."
71491,"This is just about every Saw movie, but the first did it the best."
71492,"Yeah, the second movie does it super well too, the only problem is you know to top the original they have to have a crazy twist so you expect it, the beauty in the first movie is that if you watch it with no knowledge or expectation of what happens, it makes it the ultimate twist. 
Spoilers:
another thing I think that makes it so good is the fact the it comes out of no where, there is no indication of it at all throughout the movie unless you watch it super carefully. For instance when it cuts to the hospital and the cancer patient is the guy in the floor, but the viewer can't know that because of the bloodied face of the guy on the floor.

So yeah, the others do it well but the first is definitely the best."
71493,"""Game Over!""

*chills*

Every damn time"
71494,"The prestige. All of it.

And the ending to The Orphanage/El Orphanato."
71495,The prestige is even better when you know the twist. There are so many details you notice when watching it a second time
71497,"No one watches the prestige twice. You watch it once, or you watch it every other month because it's one of your favorite movies"
71498,"Oh thanks for reminding me, I'm overdue for another rewatch. Even got a buddy what hasn't seen it to watch it with."
71499,"I saw the most of the major ones coming but I think that's because it was so intricately plotted. Movies sometimes just focus on one gotcha without laying any groundwork for it to make it more unpredictable. Prestige, on the other hand, was brimming with subtlety and gave the viewers a much fairer chance at the guessing game."
71500,"I figured out the Christian Bale twist early in the movie, the High Jackman twist surprised me."
71501,"I think that's what gets you. The Christian Bale twist is pretty obvious, and you think you figured out the movie when you notice it. The Hugh Jackman twist is too bizarre to see coming."
71502,"For me, it was the other way around. When he brought in the expertise of Nicola Bowie I knew shit was about to get weird."
71503,I cry like a bitch every time I watch The Orphanage.
71504,Primal Fear -
71505,Ed Norton is amazing.
71506,"Moana, it never struck me that Te Ka was actually Te Fiti until you realize that nature also has a destructive side."
71507,such a good soundtrack also
71508,"Literally finished this one an hour ago. Moana deserves more love, it was overall a great film."
71509,I thought Shutter Island had a good twist.
71510,Even better if you notice he didn't actually relapse in the last scene. He just didn't want to live with it anymore
71511,"""Is it better to die a good man or to live as a monster?"""
71512,"Didn't relapse? As in he knew it wasn't real, but kept going to avoid his real life?"
71513,Exactly. He wanted to be lobotomized to the sake of relief
71514,Moon.
72192,The Usual Suspects.
71517,The Game (1997) with Michael Douglas
71518,I like The Game because the whole time you're thinking everything is just part of the game but it makes you doubt it but then you realize it's just a part of the game but then it makes you doubt it but then you realize it must just be a part of the game but then at the end if makes you doubt it.
71520,"The one at the end of Robot & Frank. I had no idea what to expect from that film, I only watched it because I saw it on Netflix, liked the title and laughed at the synopsis, but it has quickly become one of my very favourite movies."
71522,Gotta love the Kansas city shuffle.
71523,"I feel ashamed for not seeing it from a mile away, but the twist in Wreck-it-Ralph was amazing.

Blew my mind and I was totally sober."
71524,"I thought that was actually really well done, especially for a kids' movie. There's subtle hints throughout the film, but you don't see the connection until it's revealed. It actually took me by surprise too."
71525,"The exact moment where the movie shifts is really well done as well. Ralph got his medal and returned to discover himself unhappy even though he got what he thought would redeem him, and he throws the medal into the back of the screen, a really cathartic moment. And from there, you see the side of the Sugar Rush game and it leads perfectly into the final part of the movie. I love this movie, if you couldn't tell"
71528,"The twist in ""The Others"" was one of the best twists in cinematic history."
71529,"True, that was spectacular."
71530,The 2017 Best Picture Oscar.
71531,You could have as well written the name of the film......oh wait
71533,Harry potter when he sees the past with snapes tear drop
71534,"The movie take on it is a bit meh. 

The book one however. Probably the best single chapter of a Harry Potter book, it tied everything together so incredibly neatly."
71535,"The Princes Tale. It's where ""Always"" comes from. And while the cringe Harry Potter community made it a joke from redundancy, it's still one of the most powerful parts of the story and why Snape is admired by many including me."
71536,"Huge HP fan. I don't really admire Snape. His love for Lily was obsessive and creepy. While it was his best redeeming feature, it was also his worst flaw; it caused him to brave and to work for the greater good, but it also caused him to be a bullying wanker to Harry and Neville. As Sirius (rather hypocritically) says: *If you want to know what a man’s like, take a good look at how he treats his inferiors...*"
71537,"I love Snape as a character, but I agree with you that I don't find him admirable. 

As for Sirius I'd argue the way he treated Kreacher had less to do with Sirius thinking of him as an ""inferior"" and more to do with the fact that Kreacher was a strong reminder of a very bad part of his past. Also having a shitty childhood and 12 years in wizard joy-sucking prison probably leaves you with some difficult anger issues. Not saying Sirius is flawless, obviously, I just don't see him as hypocritical. He never looked down on Lupin for being a werewolf or Lilly for being muggle-born, for example."
71538,"True, but neither Lily or Lupin were his explicit inferiors; Kreacher was totally at Sirius' whim and he doesn't treat him well. I do know what you mean though, I do believe that it's more about Kreacher idolising Sirius' parents that makes Sirius treat him like shit- it's still crappy behaviour on Sirius' part though."
71539,"He never thought of Lilly or Lupin as inferiors, but werewolves were *definitely* looked down on in that society. In the later books Lupin had a hard time even finding employment because of it. Lilly was muggle-born and again, while Sirius didn't look down on her for it, his family sure would have. He was a pureblood and therefore had a higher status among many in the wizarding world. 

Sirius could easily have decided that they were beneath him, and he certainly grew up with parents who would have told them they were. While we don't know much about his time at Hogwarts he clearly decided to be friends with them anyway. He probably had to battle the prejudices his family tried to ingrain into him. So when he tells Harry ""*If you want to know what a man’s like, take a good look at how he treats his inferiors...*"" he's coming from a place where he himself learned to treat people that society says are inferior with respect. 

Sirius is an interesting mixture of egalitarian and judgemental. He's judgemental and mean to Kreacher, to my knowledge never stood up to James for his treatment of Snape when they were at Hogwarts (and they remained pretty rude to each other through the books), and he hated his brother and likely never suspected that Regulus would steal and attempt to destroy one of Voldemort's horcuxes. Yet he's perfectly willing to accept werewolves, muggle-borns, and others as equals."
71540,"Yeah I know what you mean about Lupin and Lily. Sirius is certainly an interesting character in this regard. Don't get me wrong, I think he's 90% good and admirable, but I still do think you can call him a hypocrite though because of his inconsistency. He explicitly condemns Crouch for being a dick to Winky and yet he treats Kreacher with cruelty only a few months later. 


I think Sirius lacks self-awareness: he wouldn't even make the link between Crouch and Winky and his own treatment of Kreacher;  he never looks back on what he and James did to Snape with the sort of regret that Lupin shows. I doubt it would even cross his mind to. He's not a bad guy but I do maintain that he's got a slight nasty streak."
71542,I don't know that the movie did a great job of potraying what was going on in that scene. Some people I talked to that hadn't read the book thought it meant that Snape was Harry's dad.
71543,Harry Potter movies confusing the story beyond all recognition? Say it ain't so!
