idx,text
60349,I’ve been told it’s really good! I’ll give it a try TY:)
60350,"Another couple of shows which are awesome but only have one season so far, so I wouldn't include them in 'binging' are Barry and Kidding."
60351,TY :) they look great
60352,First season of cuckoo is really funny.
60353,What about the second season?
60354,Is community still on Netflix?
60355,"its not but ive also seen that, was amazing!

&#x200B;"
60356,Hulu I think. I think I have it on my watch list if I'm not badly mistaken.
60357,I am the only person I know that has watched and also enjoyed Final Space. Needs a couple of episode to get used to the characters and then it's great fun!
60358,"Oh my word!! I LOVE final space, the humour is unique Hue is a classic, kvn and the cookies 🍪is too much feel sorry for Gary sometimes"
60359,Haha yeah Gary is great! I love the opening scene of each episode as well..!!
60360,Agreed!! So different! Also want mooncake as a pet
60361,I'm Sorry... Only one season on Netflix but it's great
60389,TY :)
60363,Blue Mountain State. Has me dying every episode.
60364,Try friends from college. Surprisingly funny
60366,"I’ve watched that, classic comedy and luckily it is on the South African Netflix. TY :)"
60367,The Office!!!!
60368,Hands down best series!!!
60369,Get a trial for Hulu just to watch Rick and Morty :)
60370,Rick an Morty potentially one of the best under the radar series out there 🔥
60371,Not trying to hate but how is it under the radar?
60372,"It doesn’t seem to be too popular in South Africa, but I guess it’s really popular overseas"
60373,Call my agent
60375,"Literally the same list of television on Netflix that I’ve gone through. Moved on to Fresh Meat because I liked Bad Education and the Inbetweeners. Second episode in - so far, I can highly recommend."
60376,TY ;) have you seen the in-betweenness movie? Have to watch it when you finished the series! “Ahhh Friend!! “ if you like those watch the peep show! Rewatched that many times it’s a classic
60377,I have. Love them all!
60378,Friends from College
60379,TY :)  busy with that at the moment started it last night
60380,Enjoy! I ended up liking it way more than I thought I would.
60381,Yeha it’s gripping! Like that keegan-Michael is in it! Love his other series Key & Peel! If you haven’t watched that before I highly recommend it
60382,Chewing Gum!
60383,Chewing gum is too much! Love that show 🤘🏼🤣
60384,Spaced
60385,"Insatiable
Unbreakable Kimmy Schmidt
Weeds (I guess it's more of a dramedy but I think it's hilarious)"
60386,"Loved that show, bit silly at times but you can’t beat Titus"
60387,"Oh yeah it is pretty goofy but still hilarious. Titus is amazing. They're about to come out with the new season and I think it's the end. I actually haven't finished all the current seasons yet myself but I do think it's funny as hell. I love the stuff Tina Fey comes up with. And speaking of Tina Fey, another show I love that i forgot to mention is 30 Rock."
60388,"Bojack Horseman 

Club of Crows"
60390,"No problem, btw club of crows is in Spanish but it's quite funny if you don't mind subtitles (or speak Spanish yourself), it's about a soccer team but it's really about the rich kids who inherited the team from the father and have no idea how to run it, very funny in the vein of arrested development or always sunny, i.e. Shows about bad things happening to terrible people."
60391,"The Good Place, hands down."
60392,"Hmmm should give this a shout, quite a few people have been recommending it:)"
60393,"Two I haven’t seen mentioned yet:

Friends 
Love"
60394,TY :) love looks really good and friends will have to rewatch at some point
60884,Trailer Park Boys
60396,"Schitt’s Creek

American Vandal

The End of the F***ing World

Derry Girls"
60397,"-Friends from college has 2 seasons its got keagan key in it. 
-Easy
-Master of none 
..... Series of unfortunate Events is really good. They just finished it. Its strange but its probably more enjoyable if you grew up on the books"
60628,The Good Place
60399,The Ranch!
60400,Friends From College
60402,"the detectorists 

barry

party down

love

crashing 

flight of the conchords"
60403,I enjoyed cuckoo
60404,Cuckoo is really good
60405,"Get on Hulu and watch Letterkenny

[Clip from Youtube](https://www.youtube.com/watch?v=9rSBmOgpcDE)"
60406,Just watched that clip! Had me in tears WOW so rare to find a show like that! Thank you so much gonna watch it now🔥
60407,"They just added the other seasons too. 3 is kind of a lull but important for the later ones. I know it's not Netflix, but damn that show is great at making me laugh."
60408,"Daaamn!! I checked on IMDB, they have 6 seasons out 😐 watched some of it last night with my brother had us in tears, they sooo quick it’s crazy just a massive roast session, love it! Thank you for the top recommendation what a champ"
60409,"Recently started watching Episodes and like it, never saw Friends, but Matt Leblanc plays himself and is funny."
60410,"Love it. Just rewatched the series. I was bummed it ended bc it could've gone on, but I loved how they ended it."
60411,i agree.
60412,We loved this show!
60413,Great show and first season is just perfect!
60414,Very clever and smart.
60416,TPB is great but it definitely took me a few episodes to really get into it.  If it weren't for the effuse praise it gets online I probably would have given up 2 or 3 episodes in.  But once it gains its footing its a really hilarious Canadian comedy.
60417,"Frig off, Randy."
60418,"Ash Vs. Evil Dead

Its a hell of a roller coaster of laughs and horror. Bruce Campbell never loses a beat with the entire series."
60419,"IT WAS A SHAME IT ENDED SO EARLY BUT DAMN THIS SHOW WAS GOOD

Bless Bruce Cambell"
60420,First two seasons were some of the tightest I’ve ever seen. Every episode was a classic. Third season started off well but dropped in quality. I was saw about the cancellation but not surprised.
60421,"I heard Season 3 was rushed, hence the drop in quality. At least they were able to slap SOME kind of ending on, even though the crew wanted a 4th season to wrap up as they wanted."
60422,"Teenage Bounty Hunters, The Good Place"
60423,+1 for Teenage Bounty Hunters! Surprised me but I was sad when the season ended. Also Highly Recommend Broad City!
60424,"I tried an ep of Teenage Bounty Hunters, thought it might be a good stupid show to zone out too, bit came off as just too country. Is it worth giving it another shot."
60425,I thought so. They ended up doing some tasteful character development that I didn’t expect but worked really nicely. Overall it’s still a lighthearted show but they didn’t shy away either.
60426,+1 for The Good Place! It's so well written
60427,"Derry Girls, Teenage Bounty Hunters"
60428,Derry Girls is fantastic. I watch with subtitles.
60429,Omg I LOVED teenage bounty hunters and was truly shocked with the ending. I hope there is a second season soon!
60430,"How in the hell has no one said **What We Do In The Shadows**?!? It's truly the best comedy on television right now, especially since Schitt's Creek is off the air. They did two seasons and are working on a third now. If you liked Parks and Rec, you'll love this. Basically every line is quotable. It sounds like a strange concept, but give it a chance. Available on Hulu."
60431,I second this. Everything about it is fantastic and hilarious. One liners galore.
60432,"Much thank, Jesk."
60433,Schitts Creek!
60434,"""Oh David!"""
60435,"My favorite line is ""Eww, David!"" then ""Bébé"". 😂"
60436,IMO funniest moment in the show is David saying “What am I supposed to look at the cherry blossoms alone like some pervert?”
60437,"My wife says ""Eww, David"" every time I do something weird. My name is not David, but I always respond with ""Bébé..."" in return. So many great performances in Schitt's Creek."
60438,My name is David my girlfriend does this constantly...
60439,*Stop acting like a disgruntled pelican.*
60440,My wife's favorite quote from the show!
60441,On the list!
60442,You’re in for a real Catherine O’Hara treat.
60443,She is a treasure! She apparently made up her pronunciations as she filmed.
60444,"I noticed in an episode we watched last night that, when she got upset, her accent slipped. It’s a such perfect choice, to show that Moira doesn’t really talk that way, it’s on purpose."
60445,"Hahahaha so true. I haven't noticed that, but will definitely keep an eye out for it next rewatch.

Another thing that heard Catherine O'Hara explain (on radio interview) was that all of her wigs (bébés) are named after her family and friends! 

Hahahaha immortalizing her friends on tv via her wigs, *which she also sometimes wears as hats too*."
60446,Omg that’s amazing. I’ve always thought she was amazing but she is just incredible in this role.
60447,Totally!  She is amazing in this role and the main reason I re-watched the series a second time.
60448,"I find her character hard to watch - or listen to, really. So OTT that it' s like nails on a chalk
board for me. Worst is Roland though, especially in S1. I'm finding this show OK, has sweet moments, but too exaggerated."
60449,Her character definitely grates as much as she grows on you. I found it helpful to see it as the genius of the actor. Any episode where Moira winds up at the Herb Ertlinger winery is pure gold to me.
60450,"Do it! I was iffy about show initially, but it really draws you in by Season 2. Wonderful, feel-good show."
60451,Some of it is funny but the characters got on my nerves for me to continue. I recommend the good place. Season 4 is out on Netflix soon
60452,My wife has been watching it and i caught a couple episodes. It is really funny. I like their wild situations they get into.
60453,It's hilarious! First season was kind of hard to get into but I was hooked after season 2.
60454,"I've only seen bits and pieces of it. I dont usually watch drama type shows, but I enjoyed the little bit I did watch!

The mom/wife is so hilarious, sometimes i think shes overacting, but it works so well for the character."
60455,Ew david!
60457,"To be fair, Arrested Development is a very tall bar..."
60458,Portlandia
60459,Yeah based on the other stuff listed here I think this is a great suggestion.
60461,"This one was weird for me. I liked in the beginning but lost interest after the plot change, so stopped watching. Does it get better later on?"
60462,It does! It gets way better!!! Season 2 dropped a bit for me but seasons 3 and 4 were phenomenal. The point of the show shifts from S1 to S2 and then 3/4 are a tag team. Give it another try!
60463,Will have to check it out now. Thanks!
60464,">Does it get better later on?

I thought the seasons got progressively worse. It gets way too sappy way too fast (usually it takes around 100 episodes for a Schur show to get too sappy for me, but this one did it in like 10). And I didn't find the overarching exploration of the afterlife and morality very satisfying - which was a problem since the show is a more focused serial format."
60465,Community is good
60466,"Saw it a few years back, it was okay but I sadly didn’t love it"
60467,Booo
60469,Annies Boobs
60470,Yeah it’s quite okay... but I just looked and Netflix did really drop the d&d episode so it lost like one of the best episode of the entire show... u/Netflix how could u
60471,Brooklyn99!!!
60472,is Brooklyn99 on netflix?
60473,"Only if you spell it ""H-U-L-U"":

[https://www.justwatch.com/us/tv-show/brooklyn-nine-nine](https://www.justwatch.com/us/tv-show/brooklyn-nine-nine)"
60474,NINE NINE!
60475,"Sadly Brooklyn 99 wasn’t really for me, got through only two seasons though"
60476,We started watching during lockdown with zero expectations. It was a nice surprise.
60477,Same. Honestly it got me and my wife through quarantine
60478,The umbrella academy
60479,"Good show, S2 surpasses S1"
60480,I thought season 1 was good. Season 2 is fantastic! Love the music. Klaus is my favorite!
60481,Agreed and now I'm at where I hate being and why I usually don't watch shows until they end... Waiting for a new season!
60482,"I am really trying to watch that show, but I find it incredibly boring."
60483,"If you like 80s nostagia and a surprisingly well-crafted story, Cobra Kai is lots of fun."
60484,Saw the first episode and enjoyed it. Does it hold up?  Are there going to be more seasons?
60485,"There’s two seasons and it holds up great!! If anything, it gets better!"
60486,"Rake, Kim’s Convenience Store, Derry Girls, Shameless, I’m Sorry"
60487,I can vouch for Kim’s and Derry Girls both are awesome
60488,Second vouch. They are great! And super easy to watch.
60489,Kim's is my jam
60490,shameless US is soo good!
60491,Rake is so freaking good. Highly recommend
60492,"I thought I'm sorry was hilarious. I love the whole comedy bang bang crew. Scott aukerman, jason mantzoukas Rob huebel"
60493,You mean Shop Talkerman?
60494,I mean Gym Lockerman
60495,Shameless is such a shame. One of the best shows period for years and then fell off a cliff.
60496,"The Good Place is pretty good, so is B99 and early Modern Family, but it would help to know what kinds of shows you *did* enjoy, rather than all the ones you didn’t like."
60497,How much always sunny did you watch? It takes a few episodes to get Into it but once Frank arrives it's comedy gold
60498,"Try New Girl, I'm Sorry, and Dead To Me. New Girl and I'm Sorry are light hearted and funny, bit not as wacky as something like Parks and Rec. Dead To Me is a bit more of a drama, but it is also a little funny, and very bingable."
60499,"Grown man here: my wife introduced me to New Girl and it was much better than i thought it would be and the cast is likeable.

I'm Sorry was another good one. It's short, only one (or two?) seasons but it's raunchy and well written. It avoids the standard tv tropes pretty well too. I'd watch more of it."
60500,"I'm Sorry was great. It was picked up by TBS after season 2, but it was recently cancelled in the middle of shooting season 3 due to COVID. (They used real locations rather than a soundstage.) I'm hoping Netflix will pick it up."
60501,"Ah that explains it, what a bummer! I do hope netflix picks it up, it definitely had potential."
60502,"Thanks I’ll make sure to add those, couldn’t find I’m sorry but the others I’ll check out"
60503,New Girl for sure.
60504,"Black books.

Spaced."
60505,Is Spaced streaming anywhere?
60506,"Not Netflix, but it's on Amazon Prime and Hulu, and it looks like it's been [uploaded elsewhere](https://www.youtube.com/playlist?list=PLCK5Lcs_vqSB3Zz9URbIB3dcJy9FmtL3I) too."
60507,Spaced. I can't listen to 'Let Me Show You' without thinking of that episode.
60508,Black books is awesome and has been one of my go to shows for years!
60509,"What *do* you like? Or why ?

Can’t really think to suggest anything. And how can you not like breaking bad, I really like to know why."
60510,The Office and The Boys - both great!
60511,Need to watch the boys heard such good things
60512,The Boys is definitely a great choice!
60513,It’s excellent! Only caveat is that it’s one of the most graphically violent shows on TV
60514,"That poor whale, lol"
60515,Just started The Boys and it is DEFINETELY worth the hype
60516,Just finished the Office a few weeks ago. Planning to get the box set so I can rewatch it anytime. 🙂
60517,I just watched the entire series of The Office over several weeks. (What else does a 58 year old do during a pandemic?)  LOVED IT!!!  Hilarious!
60518,"Get ready to watch it in a loop for years lol, it becomes addictive"
60519,15 times in 3 years for me... and i’m not about to stop.
60520,"Lucifer! 3 seasons in now, I was reluctant to start but it's a perfect mix of genres plus it's fucking hilarious."
60521,"Santa clarita diet & dead to me.

Really easy watches and good laughs"
60522,Better Off Ted
60523,"Shameless, I’m Sorry, or BoJack Horseman. I will say that the first episode of BoJack is the weakest I’ve seen so far; gets much better."
60524,BoJack Horseman is an outstanding series; absolutely fabulous!!  I cannot recommend this to people enough. Trying to get my sister to watch it.
60525,Feel Good. A stand up comedian starts a relationship with a girl that gets more complicated as it goes on.
60526,I second this one
60527,Dead to me
60528,"Love sick (used to be titled scrotal recall) is on Netflix and has 3 seasons. 30 min episodes set in the UK

Overall story is that the lead is diagnosed with chlamydia and needs to contact his old partners. Each episode is a flash back to their relationship. Very funny heartwarming comedy."
60529,If you liked IT Crowd my suggestion would be Flight Of The Conchords.
60530,Master of none
60531,"Didn’t like it I’m afraid, plus the main guy is one of those actors I just end up finding annoying in most roles he’s in"
60532,"I'm the same way- LOVED Aniz in Parks and Rec, but otherwise I can't stand him."
60533,"Sex education. Santa Clarita diet. How to Sell drugs fast online (haven’t watched second season yet!)

Edit: Clara to Clarita"
60534,"Dave, quality show from lil dicky"
60535,"For the best binge worthy series in my opinion, from what you put in your post, I strongly recommend Stranger Things, Attack on Titan, and Sex Education. Oh and if you haven't watched Avatar the last airbender; it's amazing."
60536,Galavant! Doesn't get the attention it needs
60537,new girl!! some best characters i’ve personally seen on tv
60538,"Realise you're asking about Netflix but if you're in the UK, Catastrophe on 4od is really excellent. Can't recommend it highly enough!"
60539,"Catastrophe is a great show! And if you’re not in the UK, it’s available on Amazon Prime."
60540,"Dead to Me is really good , imo. Funny, yet dark, and both Cristina and Linda are great in it"
60541,"11.22.63, on Hulu if I’m not mistaken, best series I’ve ever seen"
60542,Whar is it about?
60543,"It’s a Stephen King book adaptation, James Franco goes back in time to prevent the assassination of John F Kennedy, sounds more cheesy than it actually is ;)"
60544,Parks and Recreation
60545,Wrecked is absolutely hilarious and a crime it was cancelled. If you can find it.
60546,Oki doki I’ll look :)
60547,"""The good place"" is really good and funny if you're up for something wholesome."
60548,"We just got done watching both seasons of Umbrella Academy, and really enjoyed it. Then there's The Office, obviously, if you've never seen that."
60549,"You have to watch **THE OFFICE** there's nothing like it.  
P.S. Bear with the first season (6 episodes). Trust me. Trust us."
60550,Life in Pieces on Amazon Prime is a great comedy series. 4 short stories per episode and it's all about one families life experiences
60551,"If you want to try something different, I recommend the French comedy-drama, Call My Agent (Dix Per Cent).

Also, Broadchurch and Hinterland."
60552,Chuck is fantastic
60553,*Shameless* Best show ever.   If you haven’t seen it- I wish I was yew!!!!
60554,Derry Girls
60555,[Norsemen](https://www.youtube.com/watch?v=HpMvIZRUPf4) on Netflix is pretty good.
60556,"Weeds was a creation of Jenji Kohan, who also created Orange is the New Black.   

I cannot recommend BoJack Horseman enough; it is outstanding.  

If you like stories about families, you may like Rectify."
60557,Peep show
60558,I will likely be in the minority but I found Teenage Bounty Hunters to be really charming.
60559,"Justified. Technically it's not a comedy, but there's plenty of comedy in with all the violence...of which there is plenty. Great writing, great casting, even tertiary characters are well written and well acted. I just finished my second run of it, and I enjoyed it as much the second time as I did the first."
60560,Afterlife (Ricky Gervais one)
60561,Fleabag
60562,"The office, Scrubs, Better off Ted, corporate"
60563,"I’ll have to look up what the last two are but scrubs was great, only seen episode one of the office so far"
60564,Better Off Ted was a criminally underrated ABC comedy...more laughs per minute than just about any show I could name.
60565,The Good Place!
61066,Arrested Development
60567,"The game is great, first three season are on netflix, the other season are on hulu. 

Its quite soap opera like, but they lean into that and make me laugh out loud 3-4 times an episode"
60568,I’m Sorry and Workin Moms
60569,Living With Yourself is definitely binge-worthy. I watched it all in one go.
60570,"Episodes, really underrated"
60571,I’ve been watching Sister Sister on Netflix and it’s sooo funny! Lisa Landry is hilarious 😂
60572,"Sex Education, Atypical, Grace and Frankie, I am not okay with this 

Dark isn’t a comedy but I loved that show."
60573,"The Good Place, season 1 is great but it really takes off to another level after that."
60574,"Patriot. Funny as hell, if a little twisted."
60575,Sons of Anarchy
60576,"Seinfeld 
The office"
60577,"Love

One of my favorite Netflix original series created by Judd Appatow. Good mix of comedy and romance"
60578,The Good Place was really good!
60579,"How I Met Your Mother (binge-able doesn't even come close)

The Good Place

King of the Hill"
60580,"The Inbetweeners! British comedy, really awesome!"
60581,Cobra Kai
60582,Sherlock.
60583,"Cobra Kai is super good, season 1 and 2 just released on Netflix season 3 on the way."
60584,"F Is For Family

One Punch Man"
60585,West world
60586,Derry Girls for sure. It is a travesty how unknown this show is
60587,New Girl is surprisingly funny. Good ole Schmidt.
60588,Norsemen is hilarious
60589,New Girl!!
60590,Cobra kai
60591,"Haunting of Hill House, not comedy so I’m not sure you’ll enjoy it but is definitely one of the best shows I’ve seen. It is an anthology series and it continues on October 9th with the Haunting of Bly Manor. I’ve seen some people recommend Umbrella Academy and that show is just too good. You should definitely give that a go too."
60592,Halt and catch fire
61014,Community
60594,"B99 is my favorite comedy of all time... it’s what you want Parks & Rec or the Office to be, but it pulls it off. Black Books is a personal favorite show, Broadchurch is a good crime binge, Schitt’s Creek is a good comedy, British Baking Show warms the soul, The Good Place moves fairly quickly (season two loses steam but 3/4 slam the point home beautifully), Lovesick is fun and easy to finish in a weekend."
60595,New girl!! Super underrated show
60596,community watch community right fucking now
60597,Wow almost all the ones you didn’t like I loved and the ones you liked I like them get into. I guess I won’t give you any recs
60598,People just do nothing.
60599,"Barry! Funny,suspenseful, and great character development."
60600,"Burn notice, white collar"
60601,Kim’s Convenience is fun!
60602,"Miracle workers, Avenue 5"
60603,"Derry Girls, Arrested Development, Community"
60604,Derry Girls!
60605,I'm Sorry
60606,Watching this right now. Sooooo funny.
60607,Schitts Creek
60608,Gotta disagree there … it wasn’t really that funny at all
60609,I second Schitt's Creek
60610,"I Think You Should Leave. It's six episodes, 15 minutes each, and it's [pure insanity](https://youtu.be/WLfAf8oHrMo)."
60611,The IT Crowd
60613,Season 5 tomorrow!
60614,"I know, can’t wait!"
60615,Arrested Development.
60616,"The first three seasons are some of the funniest, best written and acted comedy ever put to screen.

Season 4 was disappointing and a gigantic drop in quality. I watched it twice and even though there are the odd good moments, it all feels contrived which the first three seasons never did.

I've only managed to get half-way through season 5 before giving up."
60617,I think it depends which season 4 you watch. The original one that requires 200% attention or the re-release they did to appease all the people without an attention span. The second one sucked.
60618,"Interesting. The first time I watched it, it was the original one and I didn't like it. The second time was the re-cut re-released one and I liked it slightly better. Partially because my expectations were lower, but I also think it just flowed a lot better than the original one."
60619,The original season 4 is so smart to me because as you get further into it you start seeing the past episodes happening in the background and they make more sense and simultaneously you are also hearing what you saw in the background in past episodes. It would mean nothing though if you don't catch them going on silently.
60620,"I did actually like that aspect of it, how things happening in the background started making sense later on. But apart from that, there really wasn't much to that season. The jokes and situations were often rehashed from earlier, better ones. But the biggest problem was that the thing that made the earlier seasons so great, the interaction between the various characters, was largely missing. 

That's why I liked the re-cut better. The interaction was still missing, but by not focusing entire episodes on one character, it created a better flow."
60621,"Fair enough, I couldn't handle all the extra narration on the second one they needed to fill the gaps. Try watching the first one again. You'll see things right from the go and it may be more interesting. Either way, love the show."
60622,Community!
60623,Is on Hulu
60624,"Yeah it's on Netflix, Hulu AND Amazon Prime."
60625,I just realized that😶
60626,Parks and rec
60627,The Kominsky Method seasons 1 and 2. You can skip season 3.
60629,Yeah it was freaking amazing - somewhat of a drop in quality as it progressed but still super good.
60630,Aunty Donna!
60631,"New Girl, Community, and The Good Place."
60632,Brooklyn nine nine is pretty funny
60633,And on Hulu
60634,Wtf is it with you and Hulu?
60635,That's actually a legit question. I don't know what I was doing. Irresponsible redditting on me.
60636,It's all good I love Hulu but we don't get a hip sub for it
60637,After Life
60639,You're shitting me you shit bird 😎 TPB is hilarious
60640,"The Unbreakable Kimmy Schmidt. It's a netflix original, and in my opinion the wacky humor is perfect and never fails to crack me up."
60641,Titus is my spirit animal
60642,The End of the F*cking World
60643,Not for everyone but I love Lunatics.
60644,"I Think You Should Leave and Aunty Donna's House of Fun are both absurdist sketch shows I've rewatched multiple times, lotta fun and easy binging (6 episodes each)"
60645,Brooklyn nine nine
60646,"brooklyn nine nine 

the good place

community 

schitt’s creek

santa clarita diet

derry girls

agrettsuko"
60647,"I don't know about funniest on Netflix, but I found Superstore very enjoyable to watch..."
60670,Modern Family
60649,If you like things a little darker: Shameless.
60650,"Can't do US version, saw U.K. first. So funny"
60651,Shameless
60652,Is the good place still on netflix?  If it is- that.
60653,Paradise pd lol
60654,Special is really good!
60655,"For something less high profile, try “Why Are You Like This”."
60656,welcome to waikiki
60657,Kim's Convenience.
60930,One of my favorite shows.
60659,"Arrested Development, Schitts Creek, Parks and Rec, Cheers, Unbreakable Kimmy Schmidt, The Good Place, Frasier, Master of None. Bonus if you have HBO... Veep!"
