idx,text
15714,[Warby Parker](https://www.warbyparker.com/)
15715,Surprised this took this long.
15716,"[Cubitts](https://www.cubitts.co.uk/sunglasses)

For anyone in the UK, Cubitts is a great brand to consider for good construction, a solid range of modern styles, and great price:quality."
15717,"They also make really good prescription sunglasses. 

My prescription is +5 so the lenses are thicker. Cubitts offer high index lenses which reduce the thickness -- though it costs extra.

My favorite is the [Granville](https://www.cubitts.co.uk/sunglasses/granville?color=black)"
15718,[Ace & Tate](https://www.aceandtate.com/nl/en/men-sunglasses)
15719,"It's like someone couldn't pronounce Acetate, the material used to make the frames."
15720,[Retrosuperfuture](https://retrosuperfuture.com/pages/all-1)
15721,[Randolph Engineering](https://www.amazon.com/Randolph-Sportsman-SP7R412-Aviator-Sunglasses/dp/B00CHYGKBA/ref=sr_1_8?s=apparel&ie=UTF8&qid=1525967053&sr=1-8&nodeID=7141123011&psd=1&keywords=randolph+engineering)
15722,"I've tried to pull the trigger on these, but most of their stuff seems like more expensive versions of American Optical stuff. Am I wrong?"
15723,"Quality wise they're both very similar with Randolph perhaps having an edge, what separates them is the more design options that Randolph has. I was able to pickup the 23k gold sportsman on discount a while back and I love them. I have gifted AO in the past and they are just as solid."
15724,"Nope, you're correct. Both were originally US military contract holders; I believe Randolph currently holds the contract for ""Aviator"" glasses. They're very similar in hand although I \*think\* the Randolphs \*feel\* slightly heavier/thicker/more durable... but that's probably just my cognitive dissonance."
15725,"[RAEN!](https://raen.com/)

Sorry this took so long. A killer brand from CA. The Remmy fits anyone's face."
15726,[the Bespoke Dudes](https://www.thebespokedudeseyewear.com/en/)
15727,Shuron Escapades. Of Nightcrawler fame.
15728,[Retrosuperfuture x The Pelican](http://www.thepelicanstudio.com/brand/retro-super-future/)
15729,[Cubitts](https://www.cubitts.co.uk/sunglasses)
15730,I love my Arnettes.
15731,# $200-$300
15732,[Illesteva](https://illesteva.com/pages/mens-sunglasses)
15733,[Moscot](https://moscot.com/shop/sun)
15734,Costa Del Mar.
15735,[Randolph engineering](https://www.randolphusa.com/men/sportsman/)
15736,[A Kind Of Guise](https://akindofguise.com/product-category/eyewear/)
15737,Garrett Leight
15738,[HUGO BOSS](https://www.misterspex.de/sonnenbrillen/boss-boss-0595s-5ts-y1_f6520666.html)
15739,Ray Ban hands down!
15740,You are paying way too much for ray bans.
15741,I'm always happy to change my opinion when proven wrong. What do you believe make the other brands mentioned here better quality as Ray Ban in this price range?
15742,"I know almost nothing about sunglasses, and I love my Ray Bans, but you can get Ray Bans for a lot less than $200."
15743,Most ray ban are $190-210 after taxes that's $230
15744,"Even full price on their website, no, a lot are much cheaper than that. But as others have pointed out here, a lot are also much cheaper at different retailers, so... Yeah, no, don't pay that."
15745,Lmao they are Like 130 in Germany
15746,# Best Value Overall
15747,"**Kirkland \(Costco\)**

Wayfarers and Aviators, both made in Italy and almost similar in quality to Ray\-ban, for [$27](https://www.reddit.com/r/malefashionadvice/comments/1dg2ui/review_of_kirkland_wayfarersalbumcomparison_inside/)."
15748,Does anyone have a link to these on Costco's website? I couldn't find them the last time I looked.
15749,"I found these: https://www.costco.com/Kirkland-Signature-M38-Black-Polarized-Sunglasses.product.100394883.html

they're the Aviators though, couldn't find wayfarers"
15750,"I've never seen them online, only in store and it's been a year or two I think."
15751,"> Wayfarers and Aviators, both made in Italy and almost similar in quality to Ray

Do they still have these? Last time I was at Costco, the only sunglasses option was something made in china."
15752,Seems like they haven't sold them in a few years.
15753,This link is 5 years old. Cosco hadn't sold those wayfarers in years.
15754,:(  Too bad. They looked great. And this is coming from a guy who has  had two pairs of full prices Wayfarers stolen.
15755,# Above $300
15756,"[Maui Jim](https://www.mauijim.com/) gets a lot of attention, but mostly for their quality lenses."
15757,"Can confirm this. I have the Kawika model and the polarized lenses are simply stunning.

Their QC is not very good though. Had issues with my first pair and then the very same issue with my replacement pair. The third pair was finally perfect."
15758,Oliver People's Gregory Peck
15759,Oliver People's makes some great frames. I picked up a pair of their O'Malley's last year and love them.
15760,Yeah I have a pair of vintage O'Malley's with tortoise colored frames and green lenses and I absolutely love them.
15761,"Have had a pair for four years, love em."
15762,[Mykita](https://mykita.com/en/sunglasses)
15763,"Tom Fords are great. A good selection of classic styles, as well as some more modern takes."
15764,[Garrett Leight](https://www.garrettleight.com/sunglasses/)
15766,"i bought the kurt glasses for $2 in chinatown and they look decent and have good build quality, wouldn't wanna spend $350 on something that's a meme. (never wore them as real shades though)"
15768,"[Kuboraum](http://kuboraum.com/masks/collection/sun-mask-collection/)

(they call them 'masks' which sounds pretentious as fuck, funky designs though.)"
15769,"Don't quote me on this but supposedly it helps with shipping things and avoiding fees associated with eyewear. /u/vaeltaja, please correct me."
15770,"I mean maybe, but if the box gets opened, it's not gonna change anything.  I think they're just MASKS FOR YOUR FACE because that's the image they're trying to portray.  Something about how they're more than (sun)glasses which can sit in the background of one's outfit, whereas these are supposed to help highlight you/your outfit/whatever.  Plus ""masks"" sounds like art pieces more than just some wearable."
15771,[Cutler & Gross](https://www.cutlerandgross.com/shop/collection/ss18-collection)
15772,[Matsuda Eyewear](https://www.matsudaeyewear.com/sun-collection/)
15773,[Linda Farrow](https://int.lindafarrow.com/linda-farrow-men/shop-by-category/sunglasses?product_list_limit=all)
15774,[Eyevan 7285](http://eyevan7285.com/collection-all-models/)
15775,[Jacques Marie Mage](https://jacquesmariemage.com/home/)
15776,[Max Pittion](http://www.maxpittion.com/collection.html)
15777,"I mean, if you're not buying the best, what's the point anyways?

[Linda Farrow](https://us.lindafarrow.com/linda-farrow-men) kinda expensive

[Gold and Wood](https://www.gold-and-wood.com/storelocator-en) pretty expensive

[Maison Bonnet](https://www.maisonbonnet.com) really expensive"
15778,">Gold and Wood pretty expensive  
>  
>Maison Bonnet really expensive

You know they expensive when you can't even figure out what they cost or how to buy from their websites."
15779,"gold and wood, you gotta use their store locator, they don't do online sales besides custom stuff


maison bonnet, you have to make an appointment and physically be in paris, they measure your face and stuff. you can choose plastic or buffalo horn or tortoise shell, in that order of expense, but they're really nice glasses though"
15780,[Salt](https://saltoptics.com/)
15781,"If money is not a problem, Dior makes cool twists to original designs that stand out without being into your face ""these are expensive glasses""

The price is from around 300€ to 1200€ with most of the models being in the 400-600€ range

Quality is one of the best if not the best I've ever handled."
15782,"[Thom Browne](https://thombrowneeyewear.com/thom-men/) makes some pretty dope shit. Actually not the crazy unwearable lookbook looks I expect from Thom Browne, but, like, really compelling very wearable legitimate things."
15783,"Hold up a moment there, while TB's designs generally aren't the most appropriate clothing at all times, to call it ""crazy unwearable crap"" is just plain ignorant. He's one of the very few designers who pays extreme attention to details and production of his clothing. And also one of the very few who can claim the exorbiant prices he demands is somewhat acceptable without taking into account his worth as a designer. I highly suggest you go check on some of his clothing if you ever get the chance."
15784,"I probably shouldn't have used the word ""crap,"" but I needed a noun after unwearable. I'm mostly confused by a lot of his designs \-\- particularly all the shorts. But looking at the store, outside of the lookbooks, I see a lot more that I would actually like to own \(if I could afford it\). Anyway, I edited my comment a bit."
15785,[Rigards](https://www.rigards.com/)
15786,"OvvO
https://ovvooptics.com/sunglasses-3/ super strong and durable, in addition to being independent from the huge sunglass monopolies"
15787,[Barton Perreira](http://www.bartonperreira.com/)
15788,My last pair of sunglasses got stolen last saturday and i'm looking for a replacement. I like those with a futuristic feeling and style but i honestly don't know which brands to look after. Max 100-150$/euro. Any suggestions?
15789,#mega cheap[!](https://www.youtube.com/watch?v=cHkaIHRK35g)
15790,"H&M. $12 a pop, huge selection, all 100% UV protection."
15791,Do we want a sub\-$50 section?
15792,"Or even <$25. It's so easy for sunglasses to break/get lost/get stolen, I just can't stomach spending much at all on them."
15793,">It's so easy for sunglasses to break

Because you're buying cheap, plastic sunglasses from H&M.

> get lost/get stolen 

I've had the same pair of Ray\-Bans for 5 years. I never lose them because they're either on my face or in my car. Sunglasses rarely ""get stolen"" when you don't leave them laying around. 

You're blaming these issues on the glasses when it's really your lifestyle that can't handle them."
15794,">You're blaming these issues on the glasses when it's really your lifestyle that can't handle them.

[Oh ho ho](https://www.youtube.com/watch?v=BY1k1GcZRww) 

I'm not the person you replied to, but you're kinda right. At the same time, it's always nice to have a pair of sunglasses you're going to wear at a place where there's high risk of them breaking or something like that (ie, times when you anticipate being rowdy). I'm thinking of stuff like festivals, where you might need to block out the sun, be (potentially) intoxicated, or maybe just know the sun is going to come down before the event ends. Massive crowds = more chances of sunnies getting knocked off, stepped on, etc.

But yes - if you invest in a pair of nice sunglasses, you bet they're going to not break as easily as a cheap pair, and you'll be more mindful of where you keep them and who you allow to hold them. They'll also be more resistant to scratches, which is where I feel a lot of cheap sunglasses fail."
15795,"I suspect that most sub\-$25 sunglasses will hurt your eyes in some way or another... And also, yeah, break, because yeah, they're that cheap. I've had a pair of ray bans for five years now, and as irresponsible as I am, they've been going strong."
15796,"If they have dark lenses without UV protection, yes they are dangerous. But the UV coating is not a difficult or expensive thing to do. Yeah, they might not be optically great, but that isn't a big concern unless you're a pilot or something. I don't think anything aside from UV rays are a health concern."
15797,"I mean there's cheap UV coating, and then there's proper polarized lenses. I think most cheap brands that claim to offer UV protection but really cheap out."
15798,"""Ray Ban Clubmasters"" for ""checking under the couch cushions for the remote the morning after a party"""
15799,"AliExpress. I don't like spending more than $50 on sunglasses. KnockAround is reputable but since I mess up/lose them, and even shitty quality sunglasses have UV protection since it's very cheap to apply, I'll go with AliExpress. Shipping from China takes a while but they work. Black wayfarers are the way to go for me, this stuff is like $5-20 and the selection is imo better than what's available on Amazon Canada or the US. I have a small face so it also lets me be selective with size (like a 52mm lens instead of 54 or 55).

https://www.aliexpress.com/wholesale?catId=0&initiative_id=SB_20180510182446&SearchText=wayfarer"
15800,[Inspiration](https://imgur.com/gallery/Cr7VVXz).
15801,I have a pair of Enchroma colorblind glasses. They cost 300$ lol but I wear them every day.
15802,"This guide was 99% written by /u/thecanadiancook but left unsubmitted to MFA. The timing of this guide is bit bad, but it was just found recently.

To quote Cook:

> A quick disclaimer: I don't consider myself to be an expert on glasses. This is a summary of the relevant information I have collected, and any suggestions from MFA will be welcomed and added to the guide accordingly. If I am missing anything or have made a mistake please leave a comment to let me know."
15803,"Even if it is late, this is exaclty what I've been looking for!"
15804,"Wow. Good job! I found that the club masters are really good for my face, so thanks for putting in the effort to make this!"
15805,"There's really only two things I feel strongly about for sunglasses:

1. Polarized or bust. I've seen polarized pairs at gas stations for <$15, I can't stand wearing sunglasses that aren't polarized. They just aren't worth it in my opinion and you don't need to spend $$$ to get it if you try.
2. ""Face Shape"" is largely bullshit. I have no idea what my face shape is and have yet to be able to correctly categorize anyone's face shape ever. Just go to a gas station or a random sunglasses hut and try on literally every pair. I've worn both aviators and wayfairer look-alikes and they both look pretty good despite round and square frames often being recommended as opposites.

My guide: buy polarized, try on literally any pair you can get your hands on."
15806,"My old car had tinted windows. Polarized lenses made it look like a thin film of oil on water had developed, almost psychedelic."
15807,Ah yes it is very funny
15809,I've heard pilots have issues with polarized as well. My feeling has always been that polarized is the way to go unless you know you have a reason you can't.
15810,"The reason pilots can't use polarized glasses is because the instruments are already covered in polarized glass, and it'd make them difficult to see."
15811,"I did not know this. I fly a 1970s Cessna while wearing polarized sunglasses, and I've never noticed any issues. I'm guessing the older instruments don't have polarized glass."
15812,I've honestly never heard this actually but I also don't play golf or tennis and I do fish. I wear polarized glasses for driving but I never felt like my depth perception was off.
15813,what are you saying about polarized sunglasses? do you like em or not? your comment about them is very confusing
15814,"> I can't stand wearing sunglasses that aren't polarized.

The rest of that bullet point is confusing, but this part is the most clear. Non-polarized sunglasses are not worth it in my opinion. You can find polarized glasses that are really cheap, no need to go designer to get it."
15816,More expensive polarized lenses will have the same issue with windows and such. I don't have the issue when I'm driving though.
15817,"If you ever drive a car, get polarized lenses. They will make driving during the day significantly safer as they will greatly reduce glare from the sun and reflections, making it easier to see the road and focus.

Don't even consider non-polarized lenses. They're not worth even the $5."
15818,"On the flip side, if you ever fly a plane, get non-polarized lenses. They make it possible to see the avionics displays and the windshield (airplane windows are made with layered acrylic) won’t have a weird wavy rainbow effect.

Don’t even consider polarized lenses. They’re not even worth the $150."
30558,Touche.
15821,American Optical are USAF issue and pretty good. Solid affordable shades.
15822,"If you want to go classic aviator style, try the American Optical/Randolph Engineering aviator. They’re the same sunglasses issued to military pilots and astronauts back in the day [as seen here](https://m.imgur.com/UfBc7U1). The only downside (or plus, however you look at it) is that the lenses are made from glass, so they can shatter.

Aside from those, Ray-Ban makes a non-polarized version of nearly all their sunglasses, and plenty of other manufacturers."
15823,"American Optical is the military issued pilot sunglasses, they look nice to boot"
15824,i was in a cessna grand caravan EX and everything was specifically polarized diagonally so it was fine
15825,"Only downside is that if you use your phone for GPS, you're going to have trouble seeing the map."
15826,"For some models, yes. It depends on the phone what polarization state it uses."
15827,"Oh oops, til."
15828,"Only poorly designed phones have this issue nowadays, most will darken when viewed 45° off axis, but landscape and portrait should both be fine."
15829,"Ahh that makes sense, I use a relatively cheap phone"
15830,My HTC One M9 I can't see in landscape at all and it's super annoying. I blame the phone not my glasses tho
15831,"Another popular style is the P3/keyhole shape. This is another classic style that has become super popular in the past 10 years. [Here's a guide I wrote on the style](https://fromsqualortoballer.com/p3glassesroundup/) (they're my personal favorite). They're a great way to wear round lenses without looking anything like Harry Potter. 

Also, some of my favorite brands:

* aviator: American Optical
* p3: Garret Light, Oliver Peoples, Bespoke Dudes Eyewear
* Browline: Shuron"
15832,"One important aspect I don't see mentioned here is arm length (also called temple length).  After years of trouble finding sunglasses that fit me well, I found out that I have a 'long' head, from front to back.  This means most standard sunglasses tend to pinch just behind my ears and the arms flex outward, rather than hugging the sides of my head.  This has nothing to do with frame size, but it looks pretty dreadful.  

One way to fix this is to ask an optometrist to straighten the arms, which are usually curved inward.  Though most cheap sunglasses cannot be reshaped."
15833,"You should add ""dude Lebowski"" to square frames."
15834,Added!
15835,"One thing that I think can be added to the guide is where to buy them for cheap. ZeroUV is always an option, but I think you can get more bang for your buck getting luxury brands for way less then retail. Forgive me for the bad formatting, I'm typing this on my phone.

Nordstrom rack is a great place to start. You can try on every pair they have, even if discounted they still retail for hundreds. If you're looking for Ray-Bans, this is the place to go. They never have more popular styles like the Clubmaster or Erika, but they always have aviators, wayfarers, and various round frames priced from $80 to $100. Nordstrom rack also has a TON of designer glasses. Céline, Gucci, Prada, Balmain, Givenchy, Persol, etc. However they all still cost $100+ and are almost never polarized, so I would avoid them until the clear the rack sale starts so you can maybe snag a pair for less than $50. I highly recommend Shwood sunglasses if you can find a pair. They're made in Portland out of real wood and all of the pairs I've seen at Nordstrom rack are polarized. Great quality and really cheap. 

Next place to look is Saks off 5th. They have mainly designer sunglasses and the same stock of Ray-Bans as Nordstrom Rack, but their prices are usually lower and have constant sales throughout the year. I've had good luck with Céline, Saint Laurent, Oliver Peoples, and Balmain. All are very well made and have interesting styles. Also, none of them are made by luxottica, which is a plus. Only downside is most of the time they aren't polarized. I've had the best luck at Saks so if you're near one go scope it out. 

Now for the places you should avoid. Burlington, Marshall's, Ross, Neiman Marcus Last Call, and maybe TJ/TK Maxx. The first three will never have good sunglasses in stock, so they're a waste of your time. Last call has a small selection of crazy expensive shades like Cartier, so they're also not worth visiting. TJ Maxx also has a small selection of mostly junk, but very rarely you can find Persols, so sometimes it's worth looking. If you're overseas, though, TK Maxx has a CRAZY good selection of sunglasses at good prices and I'm jealous we don't have that in the states. 

I hope this helps!

Edit: Another point I forgot to mention. Let's say you found the perfect pair of sunglasses, but they aren't symmetrical(you can test this by laying them upside down. The end pieces should both be touching the ground). Still buy them! Many glasses stores, including Walmart, have machines to correct your glasses and some even do it for free!"
15836,If y'all have Asian face (ie small/non existent nose bridge) I would recommend Covry. They actually fit on my face and the glasses don't hit my chubby cheeks. Arm length could be a bit longer but is a non-issue for the most part. I used to wear Ray Ban New Wayfarers (for Asian people) and the Covry were a nice improvement in fit.
15837,The PC Police are down-voting you but your not wrong and that is helpful. Oakley even has an entire line of Asian fit glasses because SURPRISE all races aren't shaped the same. Pretending that Asian people aren't generally shaped different doesn't help anyone get proper fitting glasses.
15838,"It's fine, just trying to give others another option to check out besides Warby Parker. You can imagine the disappointment I felt when I tried on a classic pair of Wayfarers and that shit just rested on my cheeks. Doesn't help that I don't wear glasses either so I don't know how good glasses looked/felt. Idk why I got down votes but whatever. I guess some thought it sounded too ad like?"
15839,Nah you put forth an informative comment and I appreciate it. Reddit is just ridiculous at times.
15840,"Somebody downvoted you for this comment, equally as ridiculous as the comment you replied to getting downvoted.

Oakley has had that Asian fit for years, I remember looking on their website awhile back and being pretty happy that Asians were getting considered by a company."
15841,"I would bet all the money in my wallet that it's not anyone Asian down-voting me, it's the absolute worst kind of white person there is. They think any talking about race is racist. They're the kinds of people who get mad when you say the word Mexican, and it's like hey pendejo, Hispanic doesn't mean Mexican, Mexican means I'm from Mexico.  
 
But anyway yeah, people are different and fashion is big in Asia especially tech wear/street wear so you see companies like Oakley making stuff to fit smaller framed/different shaped people and that's a GOOD thing."
15842,"Retrosuperfuture has quite a few fits that sit well on Asian noses too.

In addition to an Asian nose, I have a big ass dome, so despite really liking the style, dainty little Ray Ban Wayfarers don't fit me well at all. I got a pair of Supers in their classic style and it's large enough, and sits on the nose."
15843,Oh forgot about that brand too. I've been meaning to get a pair from them too.
15844,Here's a video explaining the difference between polarised glasses and UV protection https://www.youtube.com/watch?v=72PcNz5DmUo
15845,I've been trying to figure out who makes my sunglasses. They're Robert Graham Skyline in gold. Best pair of sunglasses I've ever owned. Going on 2 years without a scratch in the lenses. Retail price was $270 but I paid $45 for mine. I want to avoid Luxottica for obvious reasons but I'd love to purchase this brand again as they're apparently well-built. I'm hoping they're not Luxottica built.
15846,[https://www.nouveaueyewear.com/](https://www.nouveaueyewear.com/) pretty much trying to be luxottica with the licensing business model.  nothing proprietary or necessarily eyewear focused here.  kinda worse than luxottica.
15847,"Worse than how? Build quality? Or licensing? I'd argue if they have nothing proprietary, they have less of a chance to monopolize. Nothing which forces companies to use them. Licensing alone isn't inherently bad or evil, it's standard practice in business.

Thanks for the info by the way. Checking out the link now."
15848,Just got [these Kent Wangs](http://www.kentwang.com/misc/sunglasses/sunglasses-keyhole.html) and love them.
15849,KW is nice for the price. I have a pair of the aviators for when I don't wear my oakley's.
15850,"It's worth noting size as well. The difference between say, large wayfarers and small wayfarers, is important. You could look like a diva or a man in children's sunglasses. Get a pair of sunglasses you like and take their basic measurements. That way you have a baseline for what you're looking for if ever shopping online."
15851,"> Put this On has a fantastic series on sunglasses Come back and do this

Oh, hey, that guy he's talking about is the Stoffa guy!"
15852,"For those of you who wants high-end sunglasses but want to avoid Luxotica but also don't have money for LVMH, I suggest Sun Buddies, their glasses range from 130€ to 150€ and they recently had a collaboration with Eckhaus Latta"
15853,"I like Eyevan 7285, Silver Lining Opticians, Masunaga, Moscot, etc."
15854,I have a pair of polarized Ray Ban wayfarers (purchased from Ray Ban directly). How can I tell if they also have UV protection?
15855,They have uv protection. All sunglasses but the cheapest gas station glasses do.
48963,Awesome!
15857,"Anyone got a rec on a Clubmaster/browline style frame in the 40-80 dollar range?

I have some cheap $12 amazons that I like but they are incredibly flimsy and I have a few pairs of Warby Parker Ames (that are all Rx'd) but I'd like a sturdy pair of non-RX glasses that have the weight/feel of the Ames at a cheaper don't care if I lose them price point."
15858,The rack has Ted Baker clubmasters for that price range. Just bought a pair myself
15859,Jomashop generally has Ray Bans on the upper end of your range. I got polarized ones from there for $100
15860,I've been thinking about getting a pair of Sunski glasses but some of the reviews have complained that the polarization layer peels off. Has anyone else experienced this?
15861,"Huge fan of Moscot. They're like the suit supply of glasses IMO. Went to the one on 6th ave and 18th street recently, great staff and awesome glasses."
15862,"This thread also included the names and recommendations of quite a few makers- https://www.reddit.com/r/malefashionadvice/comments/8mv0xm/oliver_peoplestier_glasses_rec/

On a side note, does anyone know if Luxottica produces Warby Parker in Japan, or if it's a situation like TNF Purple Label, as Optec Japan is listed as the parent company for the Japanese Warby Parker line, and can anyone speak to their quality? I've handled them in Japan and liked them, but didn't have much time to check them out in detail."
15863,"All the classic styles have huge gaps at the sides. That's why I always wear active wear type sunglasses. Are there any ""stylish"" glasses that actually block the sun when it's beside you?"
15864,"Does anyone know the frames that are in the ""square frames"" picture, on the bottom right hand corner? 

Thank you!"
15865,"I have a pair of ray-bans. Wayfarers with no bottom rim. Cost me $150. Nice pair, glass is high quality, strong frames. Wear them the majority of the time. 

I have a cheap pair that I'll wear if I'm doing a long distance run. Picked those up in a gas station a while back for like $5"
15866,Do you mean the club masters?
15867,Yes. Was too lazy to look up the name.
15868,"The glass is not high quality in ray bans. They do use glass in the club masters as opposed to plastic, but the actual quality of the lens is just decent. They also use glass in the aviators, but wayfarers are plastic. I'm not trying to be rude or correct you, I just want OP to get solid information. High quality lenses are more what you see in Maui Jim."
15869,"Throwaway because I don't like giving clues about who I am on my main account. I sell sunglasses as a job, so this is my area of expertise. 

Quick tips:

* If you do a lot of driving or have sensitive eyes, get a pair of polarized glasses. There's some sciency stuff, but basically, it reduces glare quite a bit. 

* Don't leave them in the car, either. The heat bends them out of shape, especially if they're plastic (but even the metal ones can get weird if you put them on when they're hot). 

* Buy the lens cleaner. It's cheap and usually wherever you get it will do free refills. Windex is not the same and will absolutely ruin the lenses. 

* You get what you pay for. Cheap sunglasses won't have UV protection, the polarization will be poorly done and likely to rub off when you clean them, and they can break pretty easily. 


Brands*:
 
* Maui Jim:  Overall, these are the best glasses you can get, especially dollar for dollar. They're solidly constructed, people will have a pair that lasts them 6+ years no problem. They're all polarized (I believe they're all double polarized, so you really won't be squinting in these). The weight distribution is great, so they feel light on your face. If you get the sports, you won't even feel them. Oh, and they come with a 2 year warranty. Only downside is that some of them aren't that great to look at. On the other hand, there are some extremely good looking pairs. My favorites are: Baby beach, makaha, front street, cat III, and cliff house. 

* Ray Ban: Other than the iconic wayfarers, aviators, and clubmasters, they aren't much to look at. Lens quality is okay but nothing special. I noticed I get a LOT of ray ban repairs. Probably 80% of my repairs are ray bans. Could be because they're more popular, but I've seen more screws fall out than I can count, lens layers separating, the plastic reacting with people's skin and turning white, etc. I don't find them to be very comfortable personally. Everyone has a pair, but that doesn't mean they're the best sunglasses. I get a lot of people who are VERY insistent that they only want Ray Bans. It's silly, you're selling yourself short. They're a good starter pair, don't plan on them lasting for more than 2 years. They might, but they also might not. Huge lack of variety, as well. They put 70% of their energy into 3 styles. They really work on some people, but not everybody. Favorites: club masters, wayfarers, aviators. They make all three of those in a travel version which folds up and you can put them in your pocket (in the case which is just as small). Worth checking out if you're on the go a lot.

* Prada: The lens quality is pretty good from what I've seen but I haven't had a chance to take them for a real spin. Aesthetically, these are the top dogs in my book. They use very clean lines and everything looks ""just so"". I could see a pair of pradas I've never seen before and I'd know they were prada because nobody makes glasses that crisp. A little pricey, but if you want to look good, prada will get it done.

* versace: Surprisingly cheap for the brand name. They are not well made. I've heard the lens quality is phenomenal, but the actual glasses look and feel somewhat cheap a lot of the time. I wouldn't get these. 

* Persol: These guys look amazing, good lens quality, too. Only gripe I have is that the screws always seem to be coming loose. For non-wired glasses, these might be more aesthetically pleasing than the Pradas. The Havanas in tortoise shell are probably my favorite from their collection. Don't have a ton of experience with these, but they are very nice glasses. 

* Burberry: Very comfortable sunglasses for the most part. I actually think they did the clubmasters better than ray ban, so if you don't like how the ray bans looked on your face, check these out. They also have some new pairs with leather behind the ear which is probably extremely comfortable when you break them in. I feel that they're a little overpriced overall, but that's the case with most brands that don't exclusively make sunglasses. Check out the round and square trenches. 

* Oakley: Don't get them to look good, you probably won't. If you own guns, play sports, or ride a bike, these might be for you. They're pretty hard to break (sit on them, shoot them with a gun, stomp on them, you're not going to break them). There's a video on youtube of a pair taking a bullet and looking like nothing happened. All of the pieces are replaceable, too. Great value, well made, very comfortable. They aren't very stylish, though. I like the gas cans and the ferrari series, but they're hard to pull off.

Overall, Maui Jim is what gets my recommendation. If your budget is unlimited, the Oakley juliets in titanium are pretty nice if it's your style and easily the most comfortable pair I've ever tried by a wide margin. Otherwise, Maui jims are a good bet. If you're fashion conscious on a budget (sub 150) Ray ban wayfarers, though they wouldn't be polarized at that price. Feel free to ask about any other brands and I'l tell you what I know. These were just a few that came to mind.

* you cant go wrong with these brands. I know I was a little harsh about ray bans but it was partially because I was coming down off of the euphoria of preaching the Maui Jim gospel. If it's on the list, it's worth a look. 

Edit: made it a little easier to read and added a few tips"
15870,"If Luxottica makes virtually all of these brands that you listed, why would they be any different from each other in quality? I'm certain the Ray-Ban repairs percentage is simply because those are super popular compared to those other brands. Anectodally, I see way more Ray-Bans than any other luxury sunglasses brand on campus."
15871,"Mostly two things:

* Not every brand is made for the same reason. Some are made for the every day person, some are made for people who want to spend a lot on sunglasses. Persols are fairly expensive. Most pairs would be in the $300 range. Ray bans are usually between 130 and 200. Rarely, they creep up near the $300 range. A cheap pair of Persols will cost about as much as some of the most expensive Ray Bans. So when the price is double in some cases, you can expect that quality will improve. The most comfortable pair of sunglasses I've worn (titanium oakley juliets) the guy said were $600 and they're on ebay for around that. Ray bans are closer to 1-200 and aren't as comfortable. You get what you pay for.

* Also, Maui, my top recommendation isn't made by Lux, so it explains the quality difference there. Again, overall they're more expensive than Ray bans. But, personally, I feel that Mauis are the best value in terms of quality per dollar. 

But I should have said, every brand I listed gets my recommendation. It probably sounds like ray ban hate, but I do like them. I just don't like seeing people refuse to wear anything else when there are other great brands out there.

On ray Ban repairs, it's a mixture of quantity and design. They're very popular so it'll be a popular repair. But, the wayfarers (one of their most popular styles) is prone to warp a little over time. They don't fare well in hot cars, so I bend them into place a lot. The aviators are also pretty delicate because the metal is so thin and the lens is glass, so I see a lot of people break them from dropping them or being rough on them. 

Hopefully that's a good answer, I really enjoyed that question."
15872,What's your opinion on Oliver Goldsmith sunglasses?
15873,"I haven't personally worn them, but the quality of construction is excellent. To say they're beautiful would be an understatement. As I recall, I was told by a huge gunglass guy that these were the best sunglasses he's ever worn in terms of both lens quality and how they look. Make sure you can pull of whatever pair you're thinking of before buying them, since they're pretty polarizing (no pun intended). If you can, I'd get them. These are very elegant sunglasses. 

Disclaimer: don't have a ton of experience with these guys. From what I can tell, they're a safe bet."
15875,Rayban 4140s which are the Retro Wayfarers I believe.
15876,"I wear [Persol 714's](http://www.eastdane.com/classic-folding-sunglass-polarized-lens/vp/v=1/1528273306.htm) though I didn't pay that much for them. Style aside they are the most comfortable pair of sunglasses I've owned, and I wear sunglasses 8 hours a day while working."
15877,they look cool. Did you get these sunglasses because they looked good on you or another reason? I just don't think i can pull those off.
15878,"Persols are all around great. Aesthetically they look good, but they also offer UV protection, solid lens quality and they're pretty well built. Like I said in my comment, the travel pairs have issues with the screws from what I've seen, but overall, they're great glasses. They definitely make you stand out."
15879,"I bought them online without trying them on, but I had a good idea that they would look good on me through experience with other sunglasses. 

I picked them out while browsing a sunglasses thread on styleforums although I can't find the link now for the life of me."
15880,"I have 2. A no name pair of wayfarers for the beach, and some American Optical sunglasses for anything else."
15881,RayBan New Wayfarers and Persol aviators have been in my rotation as of late. Always in tortoiseshell.
15882,I've got a pair of prescription Ray-Bans with transition lenses.
15883,"I have 2 pairs:

* The first are some light blue, oval wayfarers with grey/green polarized lenses (will post picture tomorrow) and I have to say, they're the best sunglasses I have ever owned/tried.
* The second ones are a pair of Persol tortoishell wayfarers with grey/green lenses as well. Can post pictures of them too, if anyone is interested.

Edit: Pictures of the oval wayfarers ([one](http://media-cache-ec0.pinimg.com/736x/12/67/d6/1267d69e8a1e0b723410351929022ad0.jpg), [two](http://media-cache-ec0.pinimg.com/736x/a8/da/91/a8da91f19964e9f7a1a3c270a432ff68.jpg))."
15884,"Cheap knockoff wayfarers. 

There are guides on the sub on sunglasses. Go with what looks good on you rather than the current trend."
15885,"One thing I'll say about knock off sunglasses is that they usually don't offer UV protection. They also might be polarized, but it's usually either a coating or a film on the front layer. So when you clean it, it rubs off. If you spring for the real deal, they make two layers of glass or plastic and then sandwich the polarization layer between them. Other than that, they usually look fairly similar."
15886,"AO polarized aviator

Wonderful sunglasses!"
15887,"Ray Ban Wayfarer Black

Ray Ban New Wayfarer Tortoise

Prada Square Aviator 

About to buy Ray Ban Caravan with gold frames"
15888,The Prada squares are one of my favorites. Especially on people with well defined cheekbones.
15889,"i have ray-ban wayfarers. they are very simple and that's what i wanted.

i would really like a pair of oliver people's someday though"
15890,"I lose mine on the regular.  I have two in my rotation right now that keep coming back to me: off brand, $10 or less aviators and wayfairers."
15892,"Persol is a decent middle ground between the two (I find most Ray Bans to be quite bland), and can be had for ~120-150 on Amazon. Of course, they're all the same company..."
15893,I have persol and def enjoy them.
15894,"theres no jump from raybans to oliver peoples lmao, theyre both just luxicotta with different labels slapped on top. same with persol, oakley, and most of the other brands mentioned in this thread.

http://www.luxottica.com/en/eyewear-brands

unless youre buying from specialty brands like linda farrow, mykita, kuboraum, and a couple others, its just the same shit with a different label, the only difference is how much the name on the sides markup is worth."
15895,"That's what I said, qualitywise there is no difference, but the price jump is real. ;)"
15896,How about Shuron?
15897,"I like mine, they are well priced and I enjoy supporting a US brand"
15898,"Same here - I've never had other high end glasses, though, so I'm not sure how they compare."
15899,"Eh, I'm not sure that's entirely true. I've had both Ray-Bans and Oliver Peoples (currently only have the former), and I still found the Oliver Peoples to be of a higher quality. The primary difference I noticed was that the hinge on the Oliver Peoples was much more substantial and protective of the glasses' shape. Then of course there was the fact that from a design perspective, I think Oliver Peoples blows Ray-Bans out of the water. 

However, to the question, I'm still not sure those differences are worth the price jump, but I understand people who would rather have the Oliver Peoples (myself included) for the quality bump and the (in my opinion) better design."
15900,"Wrong, Oliver peoples have better lenses and frames than most of Luxottica's other offerings. Not ""worth""  the premium, but the quality is clearly better."
15901,Yeah that's like saying there's no difference between old navy and banana republic clothing.
15902,Sounds right-ish but I think a few of us would like to see a blog post/write up or something proving this
15903,It's very obvious. The acetate is certainly a higher grade. You can tell this pretty quickly from handling both brands. Of course I'm not commenting on luxottica vs non luxottica but this has been a hilariously misleading comment chain
15904,"You've only ever bought $20 glasses in the store, those are cheap crap.

Its now possible to buy online much more directly from China, and purchase high quality goods for much less than in a store.

So $20-$35 glasses online are roughly the equivalent in terms of quality to $80-$130 in most stores/domestic online retailers.

I strongly suggest that you check out cheap high quality sunglasses from China and re-evaluate your opinion.



Check out [reviews](https://www.reddit.com/r/FashionReps/search?q=rayban&restrict_sr=on&sort=relevance&t=all) on /r/FashionReps or track down some good ones yourself."
15905,"Oh man, this is just like running into /r/frugalmalefashion for the first time. This is gonna convince me to spend a shitload of money all over again."
15906,Any brands you recommend? I figure it isn't taboo since you didn't offer any.
15907,"this store is highly recommended on r/fashionreps, and there are plenty of reviews to judge for yourself:

http://www.aliexpress.com/store/2292005"
15908,Buying from China is usually lower quality...
15909,Most expensive glasses are coming from the same factory dude...
15910,"Not necessarily, unless you know the right place to look or buy from."
15911,"Than what?

You must keep in mind there are less middlemen in the process looking to make money, and there is availability of goods and competition- which drives prices down.

Compared to the domestic US market- where just about every accessory you can think of has wild profit margins."
15912,"Yeah, but their resources are limited to cheaper materials. I have fake aviator and clubmasters of Ray-Bans from China and bought real ones a bit after. The difference is night and day."
15913,Where does Kent Wang stand here?
15914,"I'm a bit of a camera/lens nerd, and I picked my glasses based on the brand the lenses.  I ended up picking [shwood](https://www.shwoodshop.com/) glasses, because they use Zeiss lenses, and are made in Portland Oregon, not by Luxotica.  As an added bonus the Canby Fifty Fifty with Polarized lenses is actually cheaper than similar Raybans with Polarized lenses.  I have no idea if it is psychosomatic, but I feel that things are much less distorted looking through these compaired to the pair of Prada glasses I replaced. Those Prada glasses aren't polarized and cost much more."
15915,"gf has a pair of the Canbys she was gifted by a coworker who bought in bulk. I almost want my own.

But since she helped talk me to contacts I've been enjoying cheap sunglasses for the first time in decades these days."
15916,Mind if I ask you how durable the glass on Ray Bans are? I just purchased a couple and was hoping to use them during the winter in Minnesota to protect my eyes from the wind.
15917,well they're gonna hold up to wind...
15918,"The wind isn't the problem, the temperature at -10F is.  
  
I'm wondering if it's bad to wear them at such low temperatures and then transitioning into heated buildings; will that cause them to crack?"
15919,no. you're fine.
15920,"Cheers man, thanks"
15921,"I don't own Rayban glasses, and am from LA, so I cannot offer any insight to your specific question.  The only thing I can say is that almost nobody uses glass in their glasses any more.  Just about everything is[ cr39 polycarbonate \(plastic\)](https://www.zeiss.com/vision-care/en_de/sunlens/products/lens-material.html).  If you are careful you can find [Glass lenses](http://www.zappos.com/sunglasses/CKzXARCq2QE6AvsP.zso). I find in stores Maui Jim are about the only ones people cary with glass lenses, and they are quite a bit heavier."
15922,Maui Jims and Costas are worth it to me. The lens quality and feel of the glasses themselves is absolutely worth it.
15923,"I bought ray ban clubmasters on Amazon for $80, for that price I have no complaints. The lenses really are better than a $20 pair. Much beyond that, they are about as worth it as $350 white sneakers, if you can afford it and its exactly what you want then go for it, but otherwise its not going to be anything amazing if you don't think it will be."
15924,">The lenses really are better than a $20 pair.

They're better than marked up sunglasses sold in a US store for $20, chances are $20 sunglasses in the store are equivalent to $4 online.

The game changes when you spend $20-30 online. You can get a high quality pair of sunglasses which are basically identical to $80-130 sunglasses."
15925,Any links in particular? My sun glasses are scratched to shit and will  be cycled  into work wear.
15926,"http://www.aliexpress.com/store/2292005

this store is highly recommended"
15928,"Fair enough, the $20 pair I was specifically thinking of were Kirkland brand from Costco. I was happy with paying $78.99 for the raybans I have now, although I would not pay $250+."
15929,"the kirkland ones were pretty good in terms of quality,

you really think the $80 raybans are really $60 better than those?

but yea it really gets ridiculous past $100"
15930,"Yes, I do think that between those two the quality of the lenses (how clear they are and how long they last before the coating starts coming off) was worth the price difference, but beyond that the only reason to spend more is if there is a pair that is exactly what you want and anything else wouldn't be quite good enough."
15931,"I've been using two pairs from aliexpress for the last two years.   Both of them get abused pretty bad (i only paid $12/each so I don't really care if they break).  Anyways,  both have minimal scratches and are holding up much better than shades I buy locally for 3-5 times the cost.   Ordering directly from China is the only way to go."
15932,Can you give the link to the store?
15933,I've had the same pair of Ray-Bans for 5 years. A lot of people I know have had pairs for much longer than I have. I think you underestimate the construction quality of them. Are they overpriced? Probably. But I will never ever buy cheapos again. It's not cost effective if I have to keep buying multiple pairs a year...
15934,I've had like 3 or 4 pairs of cheap ass wayfarer knock offs and every one of them has fallen apart or broken in some way. Bought pair of Ray-Bans like 6 years ago and they're still going strong.
15935,"On the other hand, I've been using my €5 random sunglasses for years, whereas my brand sunglasses always broke"
15936,"Definitely worth it. I'm actually more careful, because of how much they are. Even keep some just in the car. Plus once you go polarized, you never want to go back.

Can never go wrong with Ray's. Check amazon. I was able to get the polarized wayfarers for $110."
15937,Polarization is a result of a membrane added to the lens during manufacturing that costs pennies...
15938,"Definitely not worth it, can get fake polarized wayfarers for $30 on aliexpress which are identical in every way."
15939,"You know sometimes I want to make sure I have a genuine product and a quality one too. So I'll pay a little extra to have that, I can afford it. It's a bit of a pride thing for me to not order fake junk from China. The only time I've ever ordered from one of those websites was in college to get an NBA jersey to get blacked out in on the weekends."
15940,"no the whole point is that its fake, but not junk.

so you get all the benefit- function and appearance of the expensive item, but at lower price."
15941,"I won't criticize someone for wanting to spend less. Because who wouldn't to really? I guess my point is for classic things like Ray Ban Wayfarers for example, for me at least, there's just a certain pride in having the real deal."
15942,"If you're able to score 50s-80s vintage sure. Wayfarers haven't been the real deal since Bausch and Lomb sold the Ray-Ban name in the late 90s. I think that's part of the reason so many advocate internet sold knock offs. You are getting good quality lenses with the same level of UV and polarization if you want it, without paying a fortune for the name/marketing of a brand that is essentially a name license at this point."
15943,Could you point me toward some by any chance?
15944,Definitely. Costa Del Mar and Natives both come with great warranties and are awesome quality in durability and lenses
15945,"I swear by Maui Jims. Not made by Luxotica like most fashion brands and Ray Ban. I've had ray bans too but nothing compares to the quality, polarization, and most of all- the color you get with Mauis. They actually make everything look better. They just seem to boost color in a beautiful and non-obnoxious way. Think of importing a photo into an editing program and using the ""enhance"" feature. That's what the lenses do. 

my favorites are the Dawn Patrol with the bronze lenses."
15946,"Persol and Maui Jim definitely house the best quality lenses/frames on the market and are worth every penny. 
Persol still manufactures all of their shades in Italy and they are still hand-made, going through 15 different artisans before they make it to the consumer. Also, Persol houses their crystal glass lens which makes it worth every penny. 
Maui Jim on the other hand has the BEST Polarized lenses for more crisp detail when it comes to colors. They also have amazing customer service with a lifetime warranty included with every pair. 

I wear my Persol's when I'm going out for a day on the town, but I wear my Maui's when I'm out on the beach or doing a long day of driving."
15947,"Not sure why downvoted. But essentially [most major sunglass brands are made by the same company.](https://en.wikipedia.org/wiki/Luxottica) I've had oakley, mauijims, and persol along with lots of really cheap ones. There is definately a difference in lens quality in $100+ sun glasses. The persol 714 polarized I have are super clear and really comfortable."
15948,"I would spend more on sunglasses if they are hand-made in house and have unique styling or colors, but for the most part I avoid sunglasses made by fashion houses. It just seems like they make them cheaply on the side in order to pull in profits for the clothing lines. If you want to get nicer sunglasses, it's probably best to look at companies that specialize in making frames and have their own independent factory."
15949,"I think the answer depends on various factors and then it's still highly subjective.  I remember when Ray Bans cost less then $20, so it seems odd that anyone would pay $70+ for a pair today.  The increase in price is mostly due to the designer price tag, but I'm sure the quality is also much better today."
15950,"Alternatively, are cheap glasses from places like Zenni fine? I don't really have the scratch to throw at a nice pair of regular glasses but kind of need some for short term."
15952,"I found that paying a bit more for glasses made me take better care of them.  My go-to pair right now is the AO Aviators.  At 65$, I take care of them, but won't anguish over them if I break or lose them.  Also, if they're good enough for NASA, they're certainly good enough for me."
15953,"I went through a brand-name glasses phase for a couple years, specifically a couple each from Ray-Ban and Revo.

After shelling out hundreds and constantly having them break and the lenses scratch at the slightest touch, I picked up a pair of wayfarer knockoffs from Target that have held up far better under way more abuse, and lasted longer than any name brand pair I've ever owned.  

The only noticeable difference to me is the lack of polarization, which means I can actually see my phone now."
15954,"NO! Don't waste your money on expensive name brand sunglasses!

If you’re like me, or everyone I know, sunglasses last me a matter of weeks.  They’re easily lost, somehow get scratched in my backpack, or I simply come across a pair that makes me throw my current shades into that ‘everything’ drawer. Something so transient should not eat your dollars.

Sunglasses, especially, have an extremely high markup when stamped with a brand name.

Any pair retailed over $99 is highway robbery.

I like zeroUV.com for $10 sunnies that are high-quality and stylish."
15955,"i got these a month or so ago, they're great. (they are mislabeled as women's)   https://www.nordstromrack.com/shop/product/1678028/smith-optics-women-s-marvine-rounded-sunglasses?color=TORTOISE+RED&size=OS"
15956,"My Ray-Bans, Carbon Fibre Tech, are really well made. Yes, it was a large investment. But because of that, I'm taking actual care of them and they're going to last me a while (hopefully more than 20 years). Plus they come with a lifetime for the glasses waranty, as long as the frame still says Ray-Ban on it, they'll replace my pair for a new one."
15957,"Not really worth it to me. I live in AZ and I have a real need for shades but still I think this. 

>I seem to be buying at least 2 pairs every summer since they break so easily.

Keep them out of your car and the heat and they will last a long while. I've owned $1 sunglasses last over a year before finally succumbing. I also place them in a protective pouch. The heft is noticeable between expensive and non-expensive sunglasses, which is important to some. I honestly don't care though and can't justify expensive sunglasses that I wear 90% of the time alone while driving. I guess it depends on how often and where you will be using them."
15959,"bought chinese knock off ray-bans for 3 dollars last year, still wear them every day in the summer. 

A girl I work with walked up to me and said ""I have ray-bans too!"" and I was like ""Oh these aren't real I got them for 3 bucks!"" and she just looked mad idk"
15960,"Certainly not. They are higher quality, but the slight edge in durability won't make a difference if you step on them or drop them on asphalt (or worst of all, lose them).

On the other hand, polarized lenses are definitely well worth the upgrade over non-polarized lenses. Thankfully you can get perfectly decent polarized sunglasses on Amazon for $10 or less."
15961,"Can guarantee you that if you drop your raybans on any type of surface, they will pretty much only get scratched. I don't know if you are slam dunking your glasses onto the sidewalk, but i've dropped mine plenty of times and they are fine. Even had a few close calls where i stepped or slightly sat on them and they were fine. I also think the losing your glasses argument is pretty bad. I can lose my phone, that doesn't mean I wouldn't want the one that is more durable..."
15962,"The more expensive your sunglasses = the better you take care of them.

Also, there's a massive difference between cheap sunglasses and $200 Ray Bans."
15963,"OP's question focused on durability. Ray Bans definitely feel like much nicer sunglasses, but you can snap them in half with your bare hands just as easily as the cheapos."
15964,"Depends on what you mean by ""cheap"".

You can get nearly identical glasses to $200 raybans for like $30 from china."
15965,"Identical in quality, materials, and construction?"
15966,"yea, pretty much.

check out [reviews](https://www.reddit.com/r/FashionReps/search?q=rayban&restrict_sr=on&sort=relevance&t=all)"
15967,the worst purchase in my life have been a pair of persols i used maybe 3 times and nearly lost. now its in my closet and I never use them. Best purchase? thousand mile boots.
15968,Expensive sunglasses made in a Chinese factory = inexpensive sunglasses made in a Chinese factory
15969,I bought some Randolph Engineering Aviators and I think they're definitely worth it. Also they're not made by Luxotica so that's a bonus
15970,"I own Ray Bans and while nice, they are part of the Luxottica monopoly. What I really want are a pair of Randolph Engineering sunglasses. They are made for pilots and are, from what I've heard, really well made. Alas, I need prescription lenses, but you should definitely check them out! I like The Intruder the best."
15971,My folding Persols have been holding up two years strong!
15972,"I would say so, yes. I bought a pair of Ray Ban Wayfarers whilst travelling in 2011 and they're still going strong now in 2016. Could I say the same about a pair of cheap knockoffs? I don't think so..."
15973,"Don't buy your cheap glasses in a store.

Buy high quality ones online from aliexpress.

Check out /r/FashionReps to see how good they are for $20-35 USD.

Anyone who says expensive name brand sunglasses are worth it simply hasn't bought good stuff from China."
15975,"if you want to make the MiUSA argument you need to specify-  from a company based in the US which also makes all of their products in the USA.

A company being based in the USA doesn't imply that their products are made in the USA.

Also, something being MiUSA doesn't imply high quality or always justify a higher price..."
15977,"If it wasn't implied, then what does it have to do with buying high quality goods from china?"
15979,"Once again, that stipulation is meaningless as any *US based* company can sell anything made in China.

US based implies the company operates in the US, or was founded in the US, not that the products are made in the US.

Which is why I pointed that out...."
15981,"But this doesn't make sense if the goods you are purchasing aren't made in the US, they could be the same chinese products but simply at a higher price (which is often what happens with many smaller US based companies that simply import their products).

>This seems like youre implying a chinese company.

I should clarify: I'm implying that anyone who says expensive name brand sunglasses are worth it simply hasn't bought good stuff *more directly* from China through aliexpress or similar website.

If I setup a US based company reselling things on aliexpress- which would you prefer to pay: my inflated price just because I'm based in the US? or the cheaper price on aliexpress?"
62445,No.
15984,"Is it worth it on a dollar by dollar basis?  Hard to say.  But if you handle a pair of Ray-Bans in store, I feel like there's a fairly obvious difference in quality between them and cheap sunglasses.  $100 or so worth?  You kind of have to judge that for yourself.

To me, it's tough because a lot of that quality difference is in the lenses, and I need prescription sunglasses, so the stock lens quality doesn't matter."
15985,"""Shit be looking way different through these thousand dollar frames""

-Problem"
15986,This question gets asked all the time
15987,"Knockarounds!

Because I can make custom combinations with polarized lenses for cheap and I don't feel like shit when I ruin them."
15988,"I like nice sunglasses.  I tend to buy 1-2 pairs per year, if that.  I have a round face and a small-ish nose, so it's hard finding ones that fit me well.  Current favorites are:  
  
[thierry lasry sexxxy](https://www.thierrylasry.com/us/collections/sexxxy?userSpecifiedCountry=true#black__gold)  
  
[fendi plastic aviators](http://www.barneys.com/product/fendi-aviator-sunglasses-504658755.html?utm_source=google&utm_medium=cpc&cmpgntype=pla&campaignid=345487275&adgroupid=27670179675&product_partition_id=262887720385&product_id=00505046587565&cmpntype=pla&campaign=[PLA]%20-%20Fendi%20-%20Tier%201&adgroup=Fendi%20-%20Women%20-%20Accessories%20-%20Sunglasses22&k_clickid=8a806e97-e8b5-4e73-8e4b-3193d9d5b095&gclid=CMHFytaQm9MCFQuifgodnXsGog)  
  
[celine aviators](https://www.amazon.com/Celine-Small-Mirror-Aviator-Sunglasses/dp/B016A2S1G6/ref=sr_1_21/137-7614661-8137443?s=apparel&ie=UTF8&qid=1491870060&sr=1-21&nodeID=2474971011&psd=1&refinements=p_4%3ACeline)"
15989,"Black RayBan wayfarers that I found on the ground in 2008. I washed them off, put them in a protective case and have been wearing them daily ever since. They fit my face, have held up well, and go with everything. They are one of my most prized possessions."
15990,"I own one pair of sunglasses, Ray-Ban Clubmasters. They truly go with everything in my wardrobe, but particularly when I'm wearing my more edgy pieces.

I'd like to own a pair of subtle cat eye sunglasses as well. I'm thinking of ordering [these](https://www.aceandtate.co.uk/katie-bio-black-s) (or something very similar) the next time I'm going on a sunny holiday."
15991,"This is my only pair too! Mine are prescription though, so i can't ever just pick up cute/cheap ones whenever, but honestly these have been working for me for years."
15992,"Same! Also prescription, so I can't change sunglasses at the drop of a hat, but with these I haven't wanted to. :) Love them so dang much!"
15993,"This is mine, too. I went through two pairs of cheap versions of the style before I decided that I liked them so much and should get the real Ray-Ban version. So worth it! They are infinitely nicer than my previous Marshall's pair."
15994,I wear [these](http://ep.yimg.com/ca/I/yhst-81269699784480_2464_1221002383) they are the Quay Australia My Girl sunnies in Black/Pink.
15996,"I have the Erika in tortoishell too, and love them so. The shape is better for my face and the more.... Rubbery? Plastic means I don't think sweaty cheeks!"
15997,"I have got a pair of prescription ones that I've not broken in yet (UK weather). 

My most used pair are cheap Primark ones that look like Celine sunglasses (the sort of cat eye ones), which I am lusting after. I do tend to go for the classics - I've got some cheap aviator sunglasses (thin gold frame) and RayBan wayfarers. But generally, I'll buy them from the high street shops as they have UV protection."
15998,Banana Republic aviators...a good compromise between cheap and high-end.
15999,"I'd like to start by encouraging everyone to wear sunglasses with UV protection! They'll protect your vision and the delicate skin around your eyes. You wanna be able to see your swanky outfits when you're 90, right?

My sunglasses and my watch are the only accessories I wear. I got [these](https://cdnb.lystit.com/photos/2012/06/26/kate-spade-tortoise-angelique-twotone-plastic-catseye-sunglasses-product-1-4014836-635226018.jpeg) tortoiseshell cat eye glasses from Kate Spade about a year ago. They're the most flattering glasses I've had to date. If you suddenly find yourself smitten with them, [here's](http://www.ebay.com/itm/Kate-Spade-Angelique-JUH-Y6-Tortoise-Brown-Blush-Womens-Cat-Eye-Sunglasses-/232225816524?hash=item3611bcbfcc:g:t7QAAOSwo4pYkmvB) a pair for sale on ebay.

When I play sports, I wear [nike karma sunglasses](https://groupon.s3.amazonaws.com/sponsorship-imgs/Goods/Nike%20Sunglasses/884499492962_Nike-Unisex-Plastic-Sunglasses-Black-Sport-Wrap-Frame-Smoke-Lens-KARMA-EV0581-001.jpg) which aren't flattering for me, but stay on my face when I run, so it's cool.

 I don't have prescription lenses."
16000,"I love Celine for sunglasses. They're so expensive but sometimes you can get pretty cheap ones on EBay.

I also have the round Ray-Bans that everyone is wearing right now and one oversized black Prada cat-eye for when I don't want to be seen by anyone."
16001,"What are your thoughts on the Ray-Bans round lenses? Do you think they're considered classics, or just a trend?"
16002,"I guess I would consider them a classic sunglasses style in the same way I'd consider Cat Eye or Aviator. Round lenses have been around forever. They're definitely more on trend now but I think if they fit your face and you like them, you should go for it!"
16003,"I have prescription sunglasses, [these, to be exact](https://www.classicspecs.com/womens-sunglasses-vanderbilt-black-crystal-020330040019016F)"
16004,Did you try out their Home Try-On kit before ordering? I've never heard of this brand before so I'm curious
16005,"I did not, but I totally should have because the first pair I ordered was *way* too big, but their returns and exchanges are so easy!"
16006,that's good to know! thank you :)
16007,You're welcome! It's very much like Warby Parker (if you've ever used them)
16008,I haven't but I saw someone else say the same thing!
16009,"I recommend both sites (my regular glasses are WP), they just have a slightly different selection of frames."
16010,Moscot Lemtosh. Classic and timeless.
16011,"Prescription! Right now, [something cheap](http://www.zennioptical.com/472112-metal-alloy-full-rim-frame-with-spring-hinges.html) I got from Zenni Optical. When I get my next pair, I'm going to have sunglass lenses put into a pair of funky Alain Mikli frames that don't quite fit my current style as regular glasses."
16012,"Not exactly high fashion, but these are really comfortable for my wide temples. [Maui Jim Twin Falls](
https://www.mauijim.com/en/shop/sunglasses/wrap/twin-falls)

I can run in them, sleep in them, and have taken them on many cross country and international trips.

I have two and got the second one last year only because the plastic was getting too loose after 5 years."
16013,"Maui Jim makes the best lenses too! All my sport glasses are Maui, and I have a few fashion pairs from them that I like too."
16014,"I have Maui Jim Aviators and I love them. They don't even look that great on me, but they are so comfortable and work so well that I'll not give them up."
16015,"MY THOUGHTS EXACTLY

I think I would look better in a square frame sunglasses but the last time I had a pair they were too narrow and the next model up was too wide. Twin Falls is pretty much perfect on me because I can actually wear them all day even if I look like a dorky volleyball player."
16016,"I want to be a one moderately-high-end pair sort of person, but apparently one of my most accomplished skills is the ability to lose sunglasses without a trace.  After losing the last pair I'm wrestling with myself over whether it's worth blowing another $150 on something I'll lose in a few months.  On the other hand, I've never found a pair of cheap frames that wasn't really poorly constructed and ended up being uncomfortable to wear.

Right now, I'm eyeballing the Ray Bans Wayfarers, but I'm on the lookout for something with a similar shape that doesn't have the logo because I'm not a huge fan of branding."
16017,"i have [this pair](https://www.amazon.com/SojoS-Mirrored-Lenses-Fashion-Sunglasses/dp/B01D2XQKXC/ref=sr_1_1?ie=UTF8&qid=1491884652&sr=8-1&keywords=sojos) of cheap amazon sunglasses in both the gold/pink and blue light colors and they're actually great. i didn't expect much from them but they're metal frame, reflective lenses, i get SO many compliments on them and i've seen similar pairs at Nordstrom and free people for 3x the price. i would definitely suggest them!!"
16018,"Those are so cool! I think I'm gonna have to pick up the pink/gold ones, thanks for linking! :)"
16019,"I own one pair of sunglasses, I wear glass and so these are prescription sunglasses. I only have one pair because prescription glasses are expensive. [They are the ones on the left](http://static2.stuff.co.nz/1373605961/457/8912457_600x400.jpg)

Prescription glasses are interesting in that most people take their sunglasses off indoors because the shade makes it harder to see. I leave mine on because no matter how dark it is indoors, I can see a tonne better with them. Rude people have commented on it before and then I have to explain that I forgot my regular glasses and can't see if I take my sunnies off."
16020,"I buy cheap sunglasses. 

https://www.amazon.com/dp/B06XXB4XJH/ref=twister_B012YQL4VG?_encoding=UTF8&th=1 this one, but with orange reflection lenses."
16021,"I bought [these guys](http://www.vogue-eyewear.com/it/collezione-sole/vo4002s/996s-13) when I was in the States at Christmas which were my first pair that cost more than £15. I think they were around $90 or something close, so not crazy expensive but not cheap either. Sadly, I don't think I can go back; I love them too much!"
16022,"haven't seen this brand mentioned yet so i figure i'll throw them in: i wear the [komono clement](https://shop-usd.komono.com/products/clement-acetate-black-tortoise) -- these aren't the color of mine, mine have black metal frames and super black lenses. i got them on sale at a boutique for like $75 and i absolutely love them. i just think the shape is perfect on my face. before these, i had never spent more than $20 on a pair of sunglasses so it was a decent upgrade."
16023,"[Krewe!](https://www.krewe.com/collections/st-louis-mirrored-1) I love these glasses. I like having one pair of nice glasses for wearing to brunch or shopping, and then having a bunch of cheap ones for boating, swimming, travelling. I need a prescription pair for driving though and I'm hoping to get something with a classic silhouette, maybe [Holly Golightly like](http://68.media.tumblr.com/0e8bcd29a93023a42bad010a39590278/tumblr_ncj4vrWwZ51qhekpro1_250.gif)."
16024,"Sunglasses mean an opportunity for me to wear whatever ridiculously coloured, odd shaped pair makes me happiest. I'm totally prepared to pretend that they were all that was available at a gas station and it was an emergency. Price wouldn't matter, but I don't want my sunglasses to be serious and the name brand ones often are. Unfortunately, I've graduated to prescription lenses only and my sunglasses purchases are much less spontaneous."
16025,"I only wear sunglasses under $20! I lose them so much, it really adds up even at under $20 a pair. I don't understand why people buy expensive glasses other than prescription ones. There are soo many cute sunglasses that are cheap."
16026,"I was gifted a pair of [Malibu Jim Venus Pools](https://www.mauijim.com/en/shop/sunglasses/cat-eye/venus-pools) and I fucking love them. I have very light, super sensitive eyes and I'm prone to migraines (eye strain is a trigger) so I *need* good sunglasses. If (heaven forbid) I lose or break these I will definitely repurchase MJ's, though maybe a slightly lower end model."
16027,"I prefer having one pair at a time. Currently, I'm wearing polarized rectangle sunglasses from Chanel SS 2016. They're light and don't slide down my nose (hard to find, actually!). I've never lost a pair, and I plan to wear them for a while."
16028,"I'm sort of a sunglasses enthusiast. I have really bad eyes and grew up poor, so I had to wear glasses every day and we could never afford prescription sunglasses. 

Now I'll buy myself a new pair of sunglasses every year or so. More often if they're cheap, but at least one nice pair every year or two. 

I have: 
* [Quay Paradiso](https://www.shopbop.com/paradiso-sunglasses-quay/vp/v=1/1505288109.htm?fm=search-viewall&os=false) - my newest, wonderfully oversized 

* Ray-Bans in [New Wayfarer](http://www.ray-ban.com/usa/sunglasses/RB2132%20UNISEX%20047-new%20wayfarer%20classic-black/805289048527) (my first real sunglass purchase back in 2007 when these were everywhere), [Caravan](http://www.ray-ban.com/usa/sunglasses/RB3136%20UNISEX%20011-caravan-gold/8053672494556?category_Id=333139) (great aviator shape for rounder faces/full cheeks) and [Caravan with Violet Mirrored Lenses](http://www.ray-ban.com/usa/sunglasses/RB3136%20UNISEX%20007-caravan-bronze-copper/8053672341690?category_Id=332668)

* A blonde tortoiseshell cat-eye from See (non-prescription) and a brownish tortoise shell classic square from See (prescription) 

* Several pairs of cheapies from Loft, Old Navy, Target or The Limited (RIP) that I'll buy for trends, like smaller round-eye ones (for that 1920's/[Judge Doom in Toon Town look](http://aintitbalenews.com/aibn-content/uploads/2012/03/586911-wfrr5.jpg). 

I store them all on a little picture rack behind my bedroom door, the kind that comes with miniature clothespins for holding tiny photos on string. It's perfect and also I don't feel so guilty when they're all strung up."
16029,"These, in the red. I'm 30 now, but I wear them even when I have to be in a suit or something. What can I say? They suit me.

https://www.amazon.com/dp/B00YMQ3GCW/ref=cm_sw_r_cp_api_F4f7ybV54N28F"
