[
  {
    "text": "I was just wondering this. If I restore rootfs because I think I have some incompatibility/battery drain rejailbreaking with Odyssey after checkra1n, and I reinstall my tweaks/settings using either of these apps, I have a high likelihood of reinstalling something that buggedy system out right? Or is it possible there is something more system level restoring rootfs would clean out these package managers don't reinstall",
    "annotations": []
  },
  {
    "text": "The fifth one still uses baking soda.",
    "annotations": []
  },
  {
    "text": "1% of major league pitchers surely?  I can walk into my backyard and throw a no-hitter with my cat right meow!",
    "annotations": []
  },
  {
    "text": "I thought there was gonna be a s3 but it was just gonna take a while like s2 did??",
    "annotations": []
  },
  {
    "text": "> Er....I guess that's one way to get a head.\n\nFTFY",
    "annotations": []
  },
  {
    "text": "Did you know if you don't have a dad, you won't be a dad?",
    "annotations": []
  },
  {
    "text": "Berry gin + seven up is always my go to when i am home. If i am out i just do tequila shots or a safari cola. I have also tried a sex on the beach and i liked that one a lot too!  \n\nHappy birthday and have fun with the suggestions from the rest of the answers!",
    "annotations": [
      {
        "text": "Berry gin + seven up",
        "start_idx": 0,
        "end_idx": 20
      },
      {
        "text": "tequila shots",
        "start_idx": 78,
        "end_idx": 91
      },
      {
        "text": "safari cola",
        "start_idx": 97,
        "end_idx": 108
      },
      {
        "text": "sex on the beach",
        "start_idx": 130,
        "end_idx": 146
      }
    ]
  },
  {
    "text": "\"His name literally means 'Dark Father' in German\"\n\nEdit: I guess not very many of you have seen Pitch Perfect...",
    "annotations": [
      {
        "text": "Pitch Perfect",
        "start_idx": 97,
        "end_idx": 110
      }
    ]
  },
  {
    "text": "so, butt stuff?",
    "annotations": []
  },
  {
    "text": "[uwu](https://www.youtube.com/watch?v=BqUnQxHyopM)",
    "annotations": [
      {
        "text": "uwu](https://www.youtube.com/watch?v=BqUnQxHyopM",
        "start_idx": 1,
        "end_idx": 49
      }
    ]
  },
  {
    "text": "Autumn Blaze Maples are popular in Colorado. They do very well in cold climates and turn a stunning red in the fall.",
    "annotations": [
      {
        "text": "Autumn Blaze Maples",
        "start_idx": 0,
        "end_idx": 19
      }
    ]
  },
  {
    "text": "Switzerland? Not that that's an easy thing to do",
    "annotations": [
      {
        "text": "Switzerland",
        "start_idx": 0,
        "end_idx": 11
      }
    ]
  },
  {
    "text": "For compounds, I just follow what's in the dictionary. ",
    "annotations": []
  },
  {
    "text": "But factor \"exotic\"...this pet will be problematic. ",
    "annotations": []
  },
  {
    "text": "That's a creative idea.",
    "annotations": []
  },
  {
    "text": "candy corn is good",
    "annotations": [
      {
        "text": "candy corn",
        "start_idx": 0,
        "end_idx": 10
      }
    ]
  },
  {
    "text": "It just brings me to the home screen, not the course page, but I don't think I'd be able to give guidance to you. It looks like you definitely need that calculator\n I suggest a backlit screen, rechargeable battery, and as cheap as possible. You may also be required to download pre-written programs onto it for certain courses, so be sure that, if that is true, you'd be able to do that. I don't think you'll find much use for the thing after you graduate.",
    "annotations": []
  },
  {
    "text": "Get a gps collar for your cat. ",
    "annotations": [
      {
        "text": "gps collar",
        "start_idx": 6,
        "end_idx": 16
      }
    ]
  },
  {
    "text": "Yeah - Kevin Smith blew my mind when he came to my college for a night of Q&A. He actually showed up late because of horrible traffic, but made it up to us by staying until *everyone* got to ask what they wanted - not just the 2.5 hrs allotted for him.\n\nAnywho, I got up on stage with him while he talked to my friend on the phone and he talked me up. Dude is just so down to earth and talks to you like you're a normal person. This man has gotten fame *right*.",
    "annotations": []
  },
  {
    "text": "that one channel where the dude builds penthouses out of mud hahaha\n\nI can watch for hours\n\nyou all know what I'm talking about don't lie",
    "annotations": []
  },
  {
    "text": "And he said \"Open...the country...stop...having it...be closed\"",
    "annotations": []
  },
  {
    "text": "average would be 2 peices of mini \"fun-size\" candy. Put it in a bowl and lets the kids grab 2, this allows kids to be happier picking candy they want. DO NOT PUT CANDY IN THEIR BAGS! It can make parents nervous as you might be \"slipping\" something in. Just keep all the lights on in the house that can be seen in the house and you can keep the door closed and let the kids knock on the door and they will yell out trick or treat. Always compliment the kids on their costumes. Just keep your lights on and the kids will come out, and then them off when you are out of candy. ",
    "annotations": []
  },
  {
    "text": "I tried. I used all 4 of my emails to signup, it gave me a password each time I \"created\" an account (just displays the password I chose), but when I try to login it says incorrect. Then I try to \"reset/retrieve\" my password using the email/username I literally just created, and it says account it not found... so I try going back and creating an account using that email/username and it says account already exists, but I can't login... wtf is this nightmare?\n\nAnd yes, I am using the grey torrent button. Not interested in the other methods.",
    "annotations": []
  },
  {
    "text": "That is the coolest thing I've seen this week.",
    "annotations": []
  },
  {
    "text": "MATH. NOT EVEN ONCE.",
    "annotations": []
  },
  {
    "text": "I just bought one of these and am very satisfied. My mouth feels so much less stale in the morning. Scrubbing with the back of the tooth brush never seemed to work and made me almost throw up (or actually throw up a couple times).",
    "annotations": []
  },
  {
    "text": "Haha well thanks!",
    "annotations": []
  },
  {
    "text": "Ask the guy that discovered N rays, or the canals on Mars.\n\nYou need multiple people to verify what you have seen, and to figure out the probability that they're all wrong.\n\nOr maybe I'm talking out of my arse.",
    "annotations": []
  },
  {
    "text": "i knew better than to start reading this thread because shit like this makes me sad. ",
    "annotations": []
  },
  {
    "text": "Ty you for the list and ratings! Will definitely be trying a few of them out!",
    "annotations": []
  },
  {
    "text": " No",
    "annotations": []
  },
  {
    "text": "I'm always reminded by how much uBlock Origin spoils me when I use any computer other than my own. ",
    "annotations": [
      {
        "text": "uBlock Origin",
        "start_idx": 32,
        "end_idx": 45
      }
    ]
  },
  {
    "text": "How was Old Man's War not on the list?",
    "annotations": [
      {
        "text": "Old Man's War",
        "start_idx": 8,
        "end_idx": 21
      }
    ]
  },
  {
    "text": "I'd say 1000 hours. That's about 1 hour every day for 3 years or 2 hours every day for less than 2 years. Learn to read music, learn the scales and chords, get comfortable moving around the piano. There's no one right way to learn as long as you're always learning something new. ",
    "annotations": [
      {
        "text": "Learn to read music",
        "start_idx": 106,
        "end_idx": 125
      },
      {
        "text": "learn the scales and chords",
        "start_idx": 127,
        "end_idx": 154
      }
    ]
  },
  {
    "text": "This doesn't surprise me, but at least my grandmom says Will was nice, she knew before he was famous/starting his rap career. He would deliver ice with his dad to her work and she was the receptionist so she saw him every time they came ice. Granted he was necessarily famous at the time, but Philly knew who he was and my grandmom said he was very kind and respectful, he sign autographs for a coworkers daughter that like his music.",
    "annotations": []
  },
  {
    "text": "Oh shit, how could i forget: MF Doom - Mmm Food",
    "annotations": [
      {
        "text": "Mmm Food",
        "start_idx": 39,
        "end_idx": 47
      }
    ]
  },
  {
    "text": "Not knowing anything if you ask me which random roadside hotel I want I probably go with a Hampton Inn.",
    "annotations": [
      {
        "text": "Hampton Inn",
        "start_idx": 91,
        "end_idx": 102
      }
    ]
  },
  {
    "text": "Works for me",
    "annotations": []
  },
  {
    "text": "I love stand-up, a quick browse through my recent netflix veiwing activity shows the kind of stuf I'll recommend:\n\nDimitri Martin, Tom Segura, Bill Burr, Gary Gulman, John Mulaney, Dave Chappelle, Jim Jefferies, Hannibal Burress, Jimmy Carr, Anthony Jeselnik, Donald Glover, Michael Che, Bo Burnham, Neal Brennan, Joe Rogan, Juda Friedlander, Craig Ferguson, Mark Birbiglia, Louis CK, Ali Wong\n\nThere are still probably others, but I think that's enough for now",
    "annotations": [
      {
        "text": "Dimitri Martin",
        "start_idx": 115,
        "end_idx": 129
      },
      {
        "text": "Tom Segura",
        "start_idx": 131,
        "end_idx": 141
      },
      {
        "text": "Bill Burr",
        "start_idx": 143,
        "end_idx": 152
      },
      {
        "text": "Gary Gulman",
        "start_idx": 154,
        "end_idx": 165
      },
      {
        "text": "John Mulaney",
        "start_idx": 167,
        "end_idx": 179
      },
      {
        "text": "Dave Chappelle",
        "start_idx": 181,
        "end_idx": 195
      },
      {
        "text": "Jim Jefferies",
        "start_idx": 197,
        "end_idx": 210
      },
      {
        "text": "Hannibal Burress",
        "start_idx": 212,
        "end_idx": 228
      },
      {
        "text": "Jimmy Carr",
        "start_idx": 230,
        "end_idx": 240
      },
      {
        "text": "Anthony Jeselnik",
        "start_idx": 242,
        "end_idx": 258
      },
      {
        "text": "Donald Glover",
        "start_idx": 260,
        "end_idx": 273
      },
      {
        "text": "Michael Che",
        "start_idx": 275,
        "end_idx": 286
      },
      {
        "text": "Bo Burnham",
        "start_idx": 288,
        "end_idx": 298
      },
      {
        "text": "Neal Brennan",
        "start_idx": 300,
        "end_idx": 312
      },
      {
        "text": "Joe Rogan",
        "start_idx": 314,
        "end_idx": 323
      },
      {
        "text": "Juda Friedlander",
        "start_idx": 325,
        "end_idx": 341
      },
      {
        "text": "Craig Ferguson",
        "start_idx": 343,
        "end_idx": 357
      },
      {
        "text": "Mark Birbiglia",
        "start_idx": 359,
        "end_idx": 373
      },
      {
        "text": "Louis CK",
        "start_idx": 375,
        "end_idx": 383
      },
      {
        "text": "Ali Wong",
        "start_idx": 385,
        "end_idx": 393
      }
    ]
  },
  {
    "text": "Get a switch tester if you're looking for your favourite, or go to a meet-up and try some out. I searched for my favourite tactile switch recently and it's between Holy Pandas, Zealios (67g, lubed) and BOX Royals. I'm currently using the Zealios and they're just awesome. ",
    "annotations": [
      {
        "text": "Holy Pandas",
        "start_idx": 164,
        "end_idx": 175
      },
      {
        "text": "Zealios",
        "start_idx": 177,
        "end_idx": 184
      },
      {
        "text": "BOX Royals",
        "start_idx": 202,
        "end_idx": 212
      },
      {
        "text": "Zealios",
        "start_idx": 238,
        "end_idx": 245
      }
    ]
  },
  {
    "text": "Scotland checks off a fair few on that list. Edinburgh is beautiful and is surrounded by wonderful countryside. The lifestyle is pretty relaxed people are friendly. It gets cold but nothing like as cold as the Nordic countries. Government is much more progressive than the UK as a whole fwiw",
    "annotations": [
      {
        "text": "Scotland",
        "start_idx": 0,
        "end_idx": 8
      }
    ]
  },
  {
    "text": "Scotland checks off a fair few on that list. Edinburgh is beautiful and is surrounded by wonderful countryside. The lifestyle is pretty relaxed people are friendly. It gets cold but nothing like as cold as the Nordic countries. Government is much more progressive than the UK as a whole fwiw",
    "annotations": [
      {
        "text": "Scotland",
        "start_idx": 0,
        "end_idx": 8
      }
    ]
  },
  {
    "text": "I actually prefer paper over digital, & was told that the matte display feels exactly like paper but honestly it was far from it in my experience. I had the supershieldz one.",
    "annotations": [
      {
        "text": "paper",
        "start_idx": 18,
        "end_idx": 23
      },
      {
        "text": "digital",
        "start_idx": 29,
        "end_idx": 36
      },
      {
        "text": "paper",
        "start_idx": 91,
        "end_idx": 96
      }
    ]
  },
  {
    "text": "I always use apple cases and watch bands, imo the combo looks elegant.",
    "annotations": [
      {
        "text": "cases",
        "start_idx": 19,
        "end_idx": 24
      },
      {
        "text": "bands",
        "start_idx": 35,
        "end_idx": 40
      }
    ]
  },
  {
    "text": "I stayed on atom way too long.. VS code is rad",
    "annotations": [
      {
        "text": "atom",
        "start_idx": 12,
        "end_idx": 16
      },
      {
        "text": "VS code",
        "start_idx": 32,
        "end_idx": 39
      }
    ]
  },
  {
    "text": "I love the Moana Surfrider! In my top 3 too!",
    "annotations": [
      {
        "text": "Moana Surfrider",
        "start_idx": 11,
        "end_idx": 26
      }
    ]
  },
  {
    "text": "It's a virus and has to run it's course. Generally the worst is over in a week but it can take up to two weeks before you feel better. You can help alleviate some of the effects by resting, good nutrition and using otc meds.\n\nPersonally, I just drink lots of whiskey.",
    "annotations": [
      {
        "text": "resting",
        "start_idx": 181,
        "end_idx": 188
      },
      {
        "text": "good",
        "start_idx": 190,
        "end_idx": 194
      },
      {
        "text": "nutrition",
        "start_idx": 195,
        "end_idx": 204
      },
      {
        "text": "otc",
        "start_idx": 215,
        "end_idx": 218
      },
      {
        "text": "meds",
        "start_idx": 219,
        "end_idx": 223
      },
      {
        "text": "whiskey",
        "start_idx": 259,
        "end_idx": 266
      }
    ]
  },
  {
    "text": "All these should be on here can't believe I forgot Keith!!!! I'd probably take madvillain over operation though ",
    "annotations": [
      {
        "text": "Keith",
        "start_idx": 51,
        "end_idx": 56
      },
      {
        "text": "madvillain",
        "start_idx": 79,
        "end_idx": 89
      },
      {
        "text": "operation",
        "start_idx": 95,
        "end_idx": 104
      }
    ]
  },
  {
    "text": "Line of Duty.",
    "annotations": [
      {
        "text": "Line of Duty",
        "start_idx": 0,
        "end_idx": 12
      }
    ]
  },
  {
    "text": "Chess",
    "annotations": [
      {
        "text": "Chess",
        "start_idx": 0,
        "end_idx": 5
      }
    ]
  },
  {
    "text": "> Axios \n\n574 open issues lul",
    "annotations": [
      {
        "text": "Axios",
        "start_idx": 2,
        "end_idx": 7
      }
    ]
  },
  {
    "text": "Good point about no skill ceilings. Uke has a pretty flat initial learning curve.  Most instruments don't hold my interest long enough for me to get decent at them, but I learned the ukulele in a few weeks (at least well enough to play chords for most songs).  But there are amazing uke players with a skill level that I do not have the dedication to aspire to.",
    "annotations": []
  },
  {
    "text": "And all the unemployment percentages are lower than the national average. If you click through a couple times, the average for the top 100 \"best\" majors is 7.7%. Only two of these majors have worse unemployment than that. ",
    "annotations": []
  },
  {
    "text": "I've gotten by in all of my classes using the TI 36X Pro. It's a non-graphing calculator that handles matrix calculations (up to 3x3) and integration, along with a bunch of other awesome features.\n\nLink: https://www.amazon.com/Texas-Instruments-Engineering-Scientific-Calculator/dp/B004NBZB2Y",
    "annotations": [
      {
        "text": "TI 36X Pro",
        "start_idx": 46,
        "end_idx": 56
      }
    ]
  },
  {
    "text": "I got high once and a friend took this from the all-time top of /r/Music and made us listen to it a hundred fucking times.\n\nhttp://www.youtube.com/watch?v=edAxujKev1I&feature=kp\n\ndiz mi jam",
    "annotations": [
      {
        "text": "http://www.youtube.com/watch?v=edAxujKev1I&feature=kp",
        "start_idx": 124,
        "end_idx": 177
      }
    ]
  },
  {
    "text": "room perfection is pw protected",
    "annotations": [
      {
        "text": "room perfection",
        "start_idx": 0,
        "end_idx": 15
      }
    ]
  },
  {
    "text": "GTD is David Allen. The Now Habit is Neil Fiore.\n",
    "annotations": []
  },
  {
    "text": "Honestly, i would keep these Colors, i love it!",
    "annotations": []
  },
  {
    "text": "Are there subscription services?",
    "annotations": []
  },
  {
    "text": "They do because it is.",
    "annotations": []
  },
  {
    "text": "Heck yeah. Team vanilla all the way!",
    "annotations": [
      {
        "text": "vanilla",
        "start_idx": 16,
        "end_idx": 23
      }
    ]
  },
  {
    "text": "Links, so we dont get a non-legit site.\n\nUpdate: Wow, negative votes for requesting actual links. Done once, shows its legit, shows TLS, and saves time",
    "annotations": []
  },
  {
    "text": "I just got a paper like for my old 12.9 2018 and will buy one for the 2021 I ordered. I moved my note taking for work to my iPad. \n\nThe new version of paperlike seems to not distort videos like the last generation did. I can tell it’s not as clear as a glass protector though.",
    "annotations": [
      {
        "text": "paper like",
        "start_idx": 13,
        "end_idx": 23
      },
      {
        "text": "paperlike",
        "start_idx": 151,
        "end_idx": 160
      }
    ]
  },
  {
    "text": "Can't wait for Super Weenie Hut Jr.'s in 10 years.",
    "annotations": [
      {
        "text": "Super Weenie Hut Jr.'s",
        "start_idx": 15,
        "end_idx": 37
      }
    ]
  },
  {
    "text": "3030 was the first rap concept album I ever heard. Life changing. To be fair I was also smoking my first blunt but still... ",
    "annotations": [
      {
        "text": "3030",
        "start_idx": 0,
        "end_idx": 4
      }
    ]
  },
  {
    "text": "THE SOUP STORE!!!",
    "annotations": [
      {
        "text": "THE SOUP STORE",
        "start_idx": 0,
        "end_idx": 14
      }
    ]
  },
  {
    "text": "Wreckfesttttt",
    "annotations": [
      {
        "text": "Wreckfesttttt",
        "start_idx": 0,
        "end_idx": 13
      }
    ]
  },
  {
    "text": "I see. I'd say go for the Acer Swift X on my list. It provides a good balance between performance and battery life, unlike most other options at this price point.",
    "annotations": [
      {
        "text": "Acer Swift X",
        "start_idx": 26,
        "end_idx": 38
      }
    ]
  },
  {
    "text": "Can I ask what you liked about Hyperion? I just read it and it felt like it dragged really hard after the opening chapters.\n\nI'd really love to know what I missed, and why other people recommend it so much.",
    "annotations": [
      {
        "text": "Hyperion",
        "start_idx": 31,
        "end_idx": 39
      }
    ]
  },
  {
    "text": "what are your thoughts on Sonic tooth brushes.",
    "annotations": [
      {
        "text": "Sonic tooth brushes",
        "start_idx": 26,
        "end_idx": 45
      }
    ]
  },
  {
    "text": "r/Mechanicalkeyboards",
    "annotations": [
      {
        "text": "r/Mechanicalkeyboards",
        "start_idx": 0,
        "end_idx": 21
      }
    ]
  },
  {
    "text": "Bumped into Gordon Ramsay in the lift in a hotel in Hong Kong. He was very friendly. We didn't talk to him or ask for a picture. I just blurted out \"You're Gordon Ramsay!\" and he aknowledged and smiled. He insisted on us going first because we had our suitcases with us, wished us a nice day, said bye several times when we saw him in the lobby again. Very friendly!",
    "annotations": []
  },
  {
    "text": "Chance Eau Fraîche is so good! It was perfect for the extra hellish summer",
    "annotations": [
      {
        "text": "Chance Eau Fraîche",
        "start_idx": 0,
        "end_idx": 18
      }
    ]
  },
  {
    "text": "Though I will say if you press near the top the wobble is worse",
    "annotations": []
  },
  {
    "text": "too many words in the title,, thats the problem!",
    "annotations": []
  },
  {
    "text": "My mother lives around 10hiurs south of where I live. Though plane tickets can be about $70 and it's a one hour flight. So I flew down to her a week before Christmas to help her make wonderful food an help her out :) and truth be told. The motherly smile she gave me when I knocked on the door. It's the essence of love",
    "annotations": [
      {
        "text": "help her make wonderful food",
        "start_idx": 169,
        "end_idx": 197
      }
    ]
  },
  {
    "text": "Really interesting, i thought gentoo was way higher",
    "annotations": [
      {
        "text": "gentoo",
        "start_idx": 30,
        "end_idx": 36
      }
    ]
  },
  {
    "text": "This should be higher. I’m crying laughing",
    "annotations": []
  },
  {
    "text": "How did u find this bruh. Any others?",
    "annotations": []
  },
  {
    "text": "You're not really wrong (browsers are complex and becoming more so rapidly), but they're still thin clients.\n\nThe distinction between thick and thin doesn't really have much to do with application size, it has to do with client structure.  \n\nThin clients are designed to connect to remote services.  Generally they expect those remote services to do calculations and store data for them.  Without those services, they don't work.\n\nThick clients can stand by themselves.  They don't need a remote service to function (although they may still talk to remote services for certain extra features).\n\nBrowsers are very much in the \"need a remote service to connect to\" realm.  Although you can start to make interesting arguments these days with things like local storage apis and performant multi-context javascript environments.",
    "annotations": [
      {
        "text": "thin clients",
        "start_idx": 95,
        "end_idx": 107
      },
      {
        "text": "Thin clients",
        "start_idx": 242,
        "end_idx": 254
      },
      {
        "text": "Thick clients",
        "start_idx": 431,
        "end_idx": 444
      }
    ]
  },
  {
    "text": "Might as well ask, what is APKGKAH?",
    "annotations": []
  },
  {
    "text": ">The experience of going into their stores sucks. Feels like they're stuck in the 80s. \n\nWhile this is true, I don't know this is a valid criticism. You certainly can't look at it in a vacuum when it comes to pharmacy.\n\nAre Walgreens, Rite Aid, or any other pharmacy competitor providing a significantly better experience? If not, peope are going to get your heart medications whether the experience is shitty or not.",
    "annotations": [
      {
        "text": "Walgreens",
        "start_idx": 224,
        "end_idx": 233
      },
      {
        "text": "Rite Aid",
        "start_idx": 235,
        "end_idx": 243
      }
    ]
  },
  {
    "text": "Favourite opera or composer?",
    "annotations": []
  },
  {
    "text": "Please explain that Major ",
    "annotations": []
  },
  {
    "text": "TIL. I always thought that alert was obsessive. Now I know gmail was looking out for me the whole time!",
    "annotations": [
      {
        "text": "gmail",
        "start_idx": 59,
        "end_idx": 64
      }
    ]
  },
  {
    "text": "Oakley has surprisingly great backpacks.",
    "annotations": [
      {
        "text": "Oakley",
        "start_idx": 0,
        "end_idx": 6
      }
    ]
  },
  {
    "text": "no, not anymore. i used to drink them fairly regularly, but when i was fifteen a had a terrible solipsistic experience in an airport involving forty hours without sleep and waaayyy too much red bull.",
    "annotations": []
  },
  {
    "text": "How is the service regarding speed?\nTheir $40 offer looks pretty good. I’m curious if the service will work with any unlocked phone.",
    "annotations": []
  },
  {
    "text": "Always reminds me of this video of him being interviewed by his former student:\n\nhttps://youtu.be/yj46BWpxFcA.",
    "annotations": []
  },
  {
    "text": "Am I the only one surprised A Feast for Odin is number 1? Not because it doesn't deserve it, but because it doesn't seem like it is often mentioned as being the number 1 game in most lists.",
    "annotations": [
      {
        "text": "A Feast for Odin",
        "start_idx": 28,
        "end_idx": 44
      }
    ]
  },
  {
    "text": "Just because the coil is inaccessible doesn’t mean it shouldn’t be cleaned. But for $150,  ¯\\_(ツ)_/¯  indeed",
    "annotations": []
  },
  {
    "text": "No installing Arch sucks.  I'd advise you to stick with Manjaro, it's just better.",
    "annotations": [
      {
        "text": "Arch",
        "start_idx": 14,
        "end_idx": 18
      },
      {
        "text": "Manjaro",
        "start_idx": 56,
        "end_idx": 63
      }
    ]
  },
  {
    "text": "The answer you're looking for is Avocado Toast. Bread, butter, avocado, salt, and pepper. ",
    "annotations": [
      {
        "text": "Avocado Toast",
        "start_idx": 33,
        "end_idx": 46
      }
    ]
  },
  {
    "text": "I drink to get drunk and I get drunk to unwind after a long week",
    "annotations": []
  },
  {
    "text": "very good for linux. lol.",
    "annotations": []
  },
  {
    "text": "Will you be adding the new Logitech Pro X Wireless on the list?",
    "annotations": [
      {
        "text": "Logitech Pro X Wireless",
        "start_idx": 27,
        "end_idx": 50
      }
    ]
  },
  {
    "text": "Shutter Island was sooooo unpredictable. Fight club too",
    "annotations": [
      {
        "text": "Shutter Island",
        "start_idx": 0,
        "end_idx": 14
      },
      {
        "text": "Fight club",
        "start_idx": 41,
        "end_idx": 51
      }
    ]
  },
  {
    "text": "i take nyquil the day a cold appears at like 8:30pm, knocked out by 9:30, wakeup feeling pretty good next day.  all the nyquil did was help me sleep.",
    "annotations": [
      {
        "text": "nyquil",
        "start_idx": 7,
        "end_idx": 13
      },
      {
        "text": "nyquil",
        "start_idx": 120,
        "end_idx": 126
      }
    ]
  },
  {
    "text": "The FT but it's pricy",
    "annotations": [
      {
        "text": "FT",
        "start_idx": 4,
        "end_idx": 6
      }
    ]
  },
  {
    "text": "Just watched it this past weekend. It takes a long time to reveal its self but once it does, it is really captivating. At least for me. The last 1/3rd of the movie is really inception like.",
    "annotations": []
  },
  {
    "text": "jugga jigga wug jugga jigga wug jigga wugga jug",
    "annotations": [
      {
        "text": "jugga jigga wug jugga jigga wug jigga wugga jug",
        "start_idx": 0,
        "end_idx": 47
      }
    ]
  },
  {
    "text": "I'm still reading and loving all your post keep them coming!",
    "annotations": []
  },
  {
    "text": "Smarties are like the best candies on that chart",
    "annotations": [
      {
        "text": "Smarties",
        "start_idx": 0,
        "end_idx": 8
      }
    ]
  },
  {
    "text": "Did you make him ask nicely not to kick his ass?",
    "annotations": []
  },
  {
    "text": "I second that, beautiful country out there.",
    "annotations": []
  },
  {
    "text": "anything by kyle\n\nhttps://www.youtube.com/watch?v=3FcyJRf6PFw&list=UUi5LWGay0KkESHzImWIIzcA\n",
    "annotations": [
      {
        "text": "https://www.youtube.com/watch?v=3FcyJRf6PFw&list=UUi5LWGay0KkESHzImWIIzcA",
        "start_idx": 18,
        "end_idx": 91
      }
    ]
  },
  {
    "text": "There's probably a 1 in 100 chance that any give person has heard of some esoteric shot. And I call it esoteric because it sounds like a novelty shot whose only value is its name.",
    "annotations": []
  },
  {
    "text": "Dammit Woodhouse!",
    "annotations": []
  },
  {
    "text": "In the case of Ray Ban, you're very much correct; they were never consider much of a higher-end item before Luxottica. Their pushing of the brand as an item with a substantial premium is not why Ray Ban designs became trendy in the first place.\n\nIn the case of Oakley though, Luxottica has increasingly given them a longer leash in terms of design in the past couple years. The new Radar Pace, Badman and Madman models are evidence that Oakley is being allowed to do edgy, experimental designs again. Hopefully that will come with a return to some quality manufacturing as well.",
    "annotations": [
      {
        "text": "Ray Ban",
        "start_idx": 15,
        "end_idx": 22
      },
      {
        "text": "Luxottica",
        "start_idx": 108,
        "end_idx": 117
      },
      {
        "text": "Ray Ban",
        "start_idx": 195,
        "end_idx": 202
      },
      {
        "text": "Oakley",
        "start_idx": 261,
        "end_idx": 267
      },
      {
        "text": "Luxottica",
        "start_idx": 276,
        "end_idx": 285
      },
      {
        "text": "Radar Pace",
        "start_idx": 382,
        "end_idx": 392
      },
      {
        "text": "Badman",
        "start_idx": 394,
        "end_idx": 400
      },
      {
        "text": "Madman",
        "start_idx": 405,
        "end_idx": 411
      },
      {
        "text": "Oakley",
        "start_idx": 437,
        "end_idx": 443
      }
    ]
  },
  {
    "text": "I think it shows a shift in critic demographics and the genre as a whole being warmed up to.",
    "annotations": []
  },
  {
    "text": "> Colgate total is my preferred toothpaste, mainly because of the triclosan and co-polymer that keeps it active for 12 hours. \n\nI am not at all a fan of triclosan in toothpaste. There have been [studies](http://mbio.asm.org/content/5/2/e01015-13.short) showing this can have a really negative impact on our gut bacteria. \n\nTriclosan is a hospital-grade antibacterial that came into prominence in the 90s as a *surgical scrub*. It doesn't have a place in routine health products. ",
    "annotations": [
      {
        "text": "Colgate total",
        "start_idx": 2,
        "end_idx": 15
      }
    ]
  },
  {
    "text": "To add to this... a jumper. Basically a battery in a box that has battery clamps. For jump-starting your vehicle. Get one that has a dc/ac outlet so you can use it to power small electronics when you have a power outage at home. \n\nI would not recommend combination jumper/air compressor units. WOULD suggest separate jumper and air compressor.\n\nNote: doesnt hurt to have actual old fashioned  jumper cables too.",
    "annotations": [
      {
        "text": "jumper",
        "start_idx": 20,
        "end_idx": 26
      },
      {
        "text": "combination jumper",
        "start_idx": 253,
        "end_idx": 271
      },
      {
        "text": "air compressor units",
        "start_idx": 272,
        "end_idx": 292
      },
      {
        "text": "separate jumper",
        "start_idx": 308,
        "end_idx": 323
      },
      {
        "text": "air compressor",
        "start_idx": 328,
        "end_idx": 342
      },
      {
        "text": "jumper cables",
        "start_idx": 393,
        "end_idx": 406
      }
    ]
  },
  {
    "text": "1 The Dispossessed, Ursula K le Guin\n2 Blindsight, Peter Watts\n3 A Canticle for Leibowitz, Walter M Miller jr\n4 Walkaway, Cory Doctorow\n5 Embassytown, China Mieville\n\nReally though all of these are subject to change at any point.",
    "annotations": [
      {
        "text": "Dispossessed",
        "start_idx": 6,
        "end_idx": 18
      },
      {
        "text": "Blindsight",
        "start_idx": 39,
        "end_idx": 49
      },
      {
        "text": "A Canticle for Leibowitz",
        "start_idx": 65,
        "end_idx": 89
      },
      {
        "text": "Walkaway",
        "start_idx": 112,
        "end_idx": 120
      },
      {
        "text": "Embassytown",
        "start_idx": 138,
        "end_idx": 149
      }
    ]
  },
  {
    "text": "So a PS3, PS5, and Vita will allow you to play nearly 100% of PlayStation games ;)\n\nI'm actually surprised to hear there's a PSP emulator for PS3. Do PSP minis include any retail games or is it just smaller titles comparable to DSi Ware?",
    "annotations": [
      {
        "text": "PS3",
        "start_idx": 5,
        "end_idx": 8
      },
      {
        "text": "PS5",
        "start_idx": 10,
        "end_idx": 13
      },
      {
        "text": "Vita",
        "start_idx": 19,
        "end_idx": 23
      },
      {
        "text": "PS3",
        "start_idx": 142,
        "end_idx": 145
      },
      {
        "text": "PSP minis",
        "start_idx": 150,
        "end_idx": 159
      }
    ]
  },
  {
    "text": "In that case, Redbuds. They get lots of character when they get older and gorgeous flowers in spring.",
    "annotations": [
      {
        "text": "Redbuds",
        "start_idx": 14,
        "end_idx": 21
      }
    ]
  },
  {
    "text": "Ghost Lake at Conneaut Lake Park was surprisingly good. 13 haunts and it was cheaper than Cedar Point. Plus, Devil’s Den and and Blue Streak were open (I went in 2019)",
    "annotations": [
      {
        "text": "Ghost Lake at Conneaut Lake Park",
        "start_idx": 0,
        "end_idx": 32
      },
      {
        "text": "Cedar Point",
        "start_idx": 90,
        "end_idx": 101
      },
      {
        "text": "Devil’s Den",
        "start_idx": 109,
        "end_idx": 120
      },
      {
        "text": "Blue Streak",
        "start_idx": 129,
        "end_idx": 140
      }
    ]
  },
  {
    "text": "I've taken courses at both UC and CSU, I like the teaching styles and personalities of CSU professors way more and it led me to an actual career vs UC.",
    "annotations": [
      {
        "text": "UC",
        "start_idx": 27,
        "end_idx": 29
      },
      {
        "text": "CSU",
        "start_idx": 34,
        "end_idx": 37
      }
    ]
  },
  {
    "text": "Acqua di Gio Profumo by Armani and L'Homme Ultime by Yves Saint Laurent.",
    "annotations": [
      {
        "text": "Acqua di Gio Profumo",
        "start_idx": 0,
        "end_idx": 20
      },
      {
        "text": "L'Homme Ultime",
        "start_idx": 35,
        "end_idx": 49
      }
    ]
  },
  {
    "text": "Aqua di Gio & Pretty Hot",
    "annotations": [
      {
        "text": "Aqua di Gio",
        "start_idx": 0,
        "end_idx": 11
      },
      {
        "text": "Pretty Hot",
        "start_idx": 14,
        "end_idx": 24
      }
    ]
  },
  {
    "text": "I have a question: my front teeth are somewhat transparent around the bottom and the edges. They've been like this for years, and I can't tell if it's getting worse...I haven't noticed any big changes. Is this a sign of enamel erosion? Am I going to be enamel-less by the time I'm 30?",
    "annotations": []
  },
  {
    "text": "Ex game dev here. Can confirm. Working as a game dev is a life decision to earn less money than your worth, work long hours, and perpetually live in fear of sudden unemployment.",
    "annotations": []
  },
  {
    "text": "I really REALLY dislike trimming in all sense. I love the trimless modern contemporary designs, but I couldn't get that to work within my budget. :( Im unable to get any surface to be bubble or streak free without Marquee. I had to re-repaint my hallway because I thought the Sherwin would work. I'm glad I've gone through these experiences, but still. Advertise your colors & lighting requirements for advertised conditions or make a product that persists representation in most lighting environments. We consumer folk don't appreciate having inconsistent product!",
    "annotations": [
      {
        "text": "Marquee",
        "start_idx": 214,
        "end_idx": 221
      },
      {
        "text": "Sherwin",
        "start_idx": 276,
        "end_idx": 283
      }
    ]
  },
  {
    "text": ">if I’m correct they crippled the iPhone 7 too and only offered cheap replacements when they were caught.\n\nYou're incorrect. They rolled that out to all devices, it was only with the 7 that people found out about the throttling, at which point they gave you a switch to turn it off on all devices. The 7 is a great phone and still works well to this day. The discounted battery replacements applied to all phones too I believe.",
    "annotations": [
      {
        "text": "iPhone 7",
        "start_idx": 34,
        "end_idx": 42
      },
      {
        "text": "7",
        "start_idx": 183,
        "end_idx": 184
      },
      {
        "text": "7",
        "start_idx": 302,
        "end_idx": 303
      }
    ]
  },
  {
    "text": "Another One Bites The Dust is #9.\nthis list is just horrible.",
    "annotations": [
      {
        "text": "Another One Bites The Dust",
        "start_idx": 0,
        "end_idx": 26
      }
    ]
  },
  {
    "text": "You're probably getting downvotes because you said you're not an expert. As someone that is studying dentistry I can back up your statement on xylitol: it is a synthetic sugar that inhibits the growth of some of the bacterial species most involved in decay. There are other synthetic sugars that bacteria can't metabolize, but xylitol is the only one that actually goes further and inhibits them. \n\nXylitol gum is actually prescribed to people who have dry mouth or many cavities, but anyone can use it (found in grocery stores usually near toothpastes).",
    "annotations": [
      {
        "text": "xylitol",
        "start_idx": 143,
        "end_idx": 150
      },
      {
        "text": "xylitol",
        "start_idx": 327,
        "end_idx": 334
      },
      {
        "text": "Xylitol gum",
        "start_idx": 399,
        "end_idx": 410
      }
    ]
  },
  {
    "text": "Probably [this place](https://www.ayadamaldives.com/sunset-ocean-suite) in the Maldives.\n \nWe had full board so drank and ate to our heart's content with not a care in the world!",
    "annotations": [
      {
        "text": "place](https://www.ayadamaldives.com/sunset-ocean-suite",
        "start_idx": 15,
        "end_idx": 70
      }
    ]
  },
  {
    "text": "Staffordshire Bull Terrier. These used to be known as ‘nanny dogs’ as they are good with kids. But regardless of which dog you choose it’s all down to training: the dog - for obedience and the kids - to respect the dog and how to approach etc. Good luck. ",
    "annotations": [
      {
        "text": "Staffordshire Bull Terrier",
        "start_idx": 0,
        "end_idx": 26
      }
    ]
  },
  {
    "text": "**The Bridge:** Over the span of a year, cameras capture tormented souls trying to kill themselves by leaping from San Francisco's Golden Gate Bridge, underscoring the landmark's rep as the world's most popular suicide destination.",
    "annotations": [
      {
        "text": "The Bridge",
        "start_idx": 2,
        "end_idx": 12
      }
    ]
  },
  {
    "text": "You can search for USB-IF certified cables. Most cheaper companies won't certify their cables. Amazonbasics (all), Anker (powerline), and Monoprice (select series ) cables are USB-IF certified.",
    "annotations": [
      {
        "text": "Amazonbasics",
        "start_idx": 95,
        "end_idx": 107
      },
      {
        "text": "Anker",
        "start_idx": 115,
        "end_idx": 120
      },
      {
        "text": "Monoprice",
        "start_idx": 138,
        "end_idx": 147
      }
    ]
  },
  {
    "text": "Since no one has said this, I absolutely hated this. The show is too confusing and requires way more attention than necessary. I love myself a good mind-bender, time travel story, but this one had way too many characters and not enough clarity. Be prepared to having to go scouring for episode summaries constantly.",
    "annotations": []
  },
  {
    "text": "Ketchup instead of salsa? YOU MONSTER!!!!",
    "annotations": []
  },
  {
    "text": "49 dollars cash",
    "annotations": []
  },
  {
    "text": "All of these hotels have top level service and management in common.  I've had great experiences with them at all levels.  All of them (IDK about dock/surfside) enable you to have in park purchases sent to your room. (At time of writing this, to the guest services/luggage desk)  All on site hotels except Cabana provide a water taxi experience that is awesome.  I've only ever had a bad experience by the hotel once.  They left us hanging for several hours and didnt notify us that our room had been ready and available for a while.  Other time I had to ask to speak to the manager, we had a neighbor who just happened to have a 10ish boy that was a crybaby.  They woke up around 6am and had to fight him to do everything and he just cried.  All. The. Time. (Seriously, everywhere we saw them the one kid was crying and mom and dad were doing all they could to give the other 2 kids a great vacation.  Felt bad for them.) The 2nd morning of their stay when their kids started knocking on the adjoining door at 6am we had to ask for a move.  The hotel worked with us, moved our luggage for us, and while we lost our pool view room, we were able to sleep in the rest of our trip (We were there for late nights, not early mornings)\n\nTier 1 \n\nPortofino - Favorite pool with poolside service.  Nice other 2 pools for quiet time. (there are three) best rooms, best restaurants.  Long walk to starbucks depending on room location.  Best option for rooms with ground floor outside patio area.\n\nHRH - 2nd favorite pool excellent poolside service, great rooms, closest to the parks.  Always a fun time at their bar both inside and at the pool.  (Also can get your room key made into a guitar pick)\n\nTier 2 \n\nSapphire Falls - good restaurants, good pool, good rooms, nice layout.  Our go to for HHN when we don't go to the parks during the daytime that much.\n\nRoyal Pacific - on par with Sapphire  (last option for weeklong stays)\n\nTier 3\n\nAventura - great for a weekend, we always feel we need the deluxe king to have enough room, a bit noisy with traffic right outside.  Small pool with no poolside service.  Great breakfast and food areas.\n\nTier 4\n\nCabana Bay - Hotel theming is nice.  The restaurant areas are large.  Has a bowling alley and huge pool.  But, we have never stayed there because they have zero king size beds.\n\nTier 5 (I dont consider across the highway to be onsite)\n\nDockside and Surfside.  May as well stay at the Marriott or Hyatt or Hilton hotels in the area.",
    "annotations": [
      {
        "text": "Portofino",
        "start_idx": 1240,
        "end_idx": 1249
      },
      {
        "text": "HRH",
        "start_idx": 1487,
        "end_idx": 1490
      },
      {
        "text": "Sapphire Falls",
        "start_idx": 1699,
        "end_idx": 1713
      },
      {
        "text": "Royal Pacific",
        "start_idx": 1850,
        "end_idx": 1863
      },
      {
        "text": "Aventura",
        "start_idx": 1930,
        "end_idx": 1938
      },
      {
        "text": "Cabana Bay",
        "start_idx": 2142,
        "end_idx": 2152
      },
      {
        "text": "Dockside",
        "start_idx": 2378,
        "end_idx": 2386
      },
      {
        "text": "Surfside",
        "start_idx": 2391,
        "end_idx": 2399
      },
      {
        "text": "Marriott",
        "start_idx": 2426,
        "end_idx": 2434
      },
      {
        "text": "Hyatt",
        "start_idx": 2438,
        "end_idx": 2443
      },
      {
        "text": "Hilton hotels",
        "start_idx": 2447,
        "end_idx": 2460
      }
    ]
  },
  {
    "text": "Danny Brown- XXX\n\nBusdriver- electricity is on our side\n\nMadvillain- Madvillainy\n\nKendrick Lamar- To Pimp a Butterfly\n\nWu-Tang Clan- Enter the 36 Chambers\n\nLil Ugly Mane- Third Side of Tape\n\nMilo- Things That Happen at Day/Night\n\nDJ Shadow- Endtroducing...\n\nKanye West- My Beautiful Dark Twisted Fantasy\n\nPublic Enemy- It Takes a Nation of Millions to Hold Us Back\n\nHM to some Death Grips- The Money Store and Flying Lotus- Los Angeles which are controversial for considering them hip hop. \n\n",
    "annotations": [
      {
        "text": "XXX",
        "start_idx": 13,
        "end_idx": 16
      },
      {
        "text": "electricity is on our side",
        "start_idx": 29,
        "end_idx": 55
      },
      {
        "text": "Madvillainy",
        "start_idx": 69,
        "end_idx": 80
      },
      {
        "text": "To Pimp a Butterfly",
        "start_idx": 98,
        "end_idx": 117
      },
      {
        "text": "Enter the 36 Chambers",
        "start_idx": 133,
        "end_idx": 154
      },
      {
        "text": "Third Side of Tape",
        "start_idx": 171,
        "end_idx": 189
      },
      {
        "text": "Things That Happen at Day/Night",
        "start_idx": 197,
        "end_idx": 228
      },
      {
        "text": "Endtroducing",
        "start_idx": 241,
        "end_idx": 253
      },
      {
        "text": "My Beautiful Dark Twisted Fantasy",
        "start_idx": 270,
        "end_idx": 303
      },
      {
        "text": "It Takes a Nation of Millions to Hold Us Back",
        "start_idx": 319,
        "end_idx": 364
      },
      {
        "text": "The Money Store",
        "start_idx": 390,
        "end_idx": 405
      },
      {
        "text": "Los Angeles",
        "start_idx": 424,
        "end_idx": 435
      }
    ]
  },
  {
    "text": "I ranked my favourites (1 being the best) and noticed they tend to lineup with design revisions, but these three stand out to me more than the others:\n\n1.\tOG iPhone (no other piece of tech amazed me more)\n2.\tiPhone 4 (quintessential Apple design IMO, antenna-gate was an issue but the design remained unchanged in the following iPhone 4S)\n3.\tiPhone X (paying homage to the original while still be completely new and fresh)\n\nIn terms of the worst (1 being the worst), I’d rank them as follows:\n\n1.\tiPhone 5c (internals of the previous iPhone with new colours, a misstep imo)\n2.\tiPhone 6 Plus (great phone but seemed about a year too early in terms of durability and performance)",
    "annotations": [
      {
        "text": "OG iPhone",
        "start_idx": 155,
        "end_idx": 164
      },
      {
        "text": "iPhone 4",
        "start_idx": 208,
        "end_idx": 216
      },
      {
        "text": "iPhone X",
        "start_idx": 342,
        "end_idx": 350
      },
      {
        "text": "iPhone 5c",
        "start_idx": 497,
        "end_idx": 506
      },
      {
        "text": "iPhone 6 Plus",
        "start_idx": 577,
        "end_idx": 590
      }
    ]
  },
  {
    "text": "1) Black Clover\n\n2) Re:Zero\n\n3) Jujutsu Kaisen\n\n4) My Hero Academia\n\n5) Fire Force\n\n6) Steins Gate / Steins gate 0 \n\n7) Fairy Tail\n\n8) Quintessential Quintuplets \n\n9) Talentless Nana \n\n10) Blue Exorcist",
    "annotations": [
      {
        "text": "Black Clover",
        "start_idx": 3,
        "end_idx": 15
      },
      {
        "text": "Zero",
        "start_idx": 23,
        "end_idx": 27
      },
      {
        "text": "Jujutsu Kaisen",
        "start_idx": 32,
        "end_idx": 46
      },
      {
        "text": "My Hero Academia",
        "start_idx": 51,
        "end_idx": 67
      },
      {
        "text": "Fire Force",
        "start_idx": 72,
        "end_idx": 82
      },
      {
        "text": "Steins Gate",
        "start_idx": 87,
        "end_idx": 98
      },
      {
        "text": "Steins gate 0",
        "start_idx": 101,
        "end_idx": 114
      },
      {
        "text": "Fairy Tail",
        "start_idx": 120,
        "end_idx": 130
      },
      {
        "text": "Quintessential Quintuplets",
        "start_idx": 135,
        "end_idx": 161
      },
      {
        "text": "Talentless Nana",
        "start_idx": 167,
        "end_idx": 182
      },
      {
        "text": "Blue Exorcist",
        "start_idx": 189,
        "end_idx": 202
      }
    ]
  },
  {
    "text": "Sweden here - sandwiches, cereal with milk/yoghurt/[filmjölk](http://en.wikipedia.org/wiki/Filmj%C3%B6lk), toast, orange juice. We usually don't eat fried stuff for breakfast.\n\nWe do, however, drink copious amounts of coffee. We consume something like 10-12 kg per capita annually. America consumes something like 4.5 kg/capita. ",
    "annotations": [
      {
        "text": "sandwiches",
        "start_idx": 14,
        "end_idx": 24
      },
      {
        "text": "cereal with milk",
        "start_idx": 26,
        "end_idx": 42
      },
      {
        "text": "toast",
        "start_idx": 107,
        "end_idx": 112
      },
      {
        "text": "orange juice",
        "start_idx": 114,
        "end_idx": 126
      },
      {
        "text": "coffee",
        "start_idx": 218,
        "end_idx": 224
      }
    ]
  },
  {
    "text": "1. X2\n2. Twisted Colossus \n3. Goliath (SFOG)\n4. Twisted Cyclone\n5. Goliath (SFGAm)\n6. Raging Bull\n7. American Thunder \n8. Mr. Freeze (SFSTL)\n9. West Coast Racers \n10. The Boss",
    "annotations": [
      {
        "text": "X2",
        "start_idx": 3,
        "end_idx": 5
      },
      {
        "text": "Twisted Colossus",
        "start_idx": 9,
        "end_idx": 25
      },
      {
        "text": "Goliath",
        "start_idx": 30,
        "end_idx": 37
      },
      {
        "text": "Twisted Cyclone",
        "start_idx": 48,
        "end_idx": 63
      },
      {
        "text": "Goliath",
        "start_idx": 67,
        "end_idx": 74
      },
      {
        "text": "Raging",
        "start_idx": 86,
        "end_idx": 92
      },
      {
        "text": "Bull",
        "start_idx": 93,
        "end_idx": 97
      },
      {
        "text": "American Thunder",
        "start_idx": 101,
        "end_idx": 117
      },
      {
        "text": "Mr. Freeze",
        "start_idx": 122,
        "end_idx": 132
      },
      {
        "text": "West Coast Racers",
        "start_idx": 144,
        "end_idx": 161
      },
      {
        "text": "The",
        "start_idx": 167,
        "end_idx": 170
      },
      {
        "text": "Boss",
        "start_idx": 171,
        "end_idx": 175
      }
    ]
  },
  {
    "text": "[Guerrilla Analytics: A Practical Approach to Working with Data](https://www.amazon.com/dp/0128002182)\n\nShould be required reading for every professional data scientist, but seems like most people haven't even heard of this book. It encapsulates a ton of knowledge that most people only learn through years of project-based ecperience.",
    "annotations": [
      {
        "text": "Guerrilla Analytics: A Practical Approach to Working with Data](https://www.amazon.com/dp/0128002182",
        "start_idx": 1,
        "end_idx": 101
      }
    ]
  },
  {
    "text": "Buffy the vampire slayer. If you can make it through the first season, it's gold from the second to the end.",
    "annotations": [
      {
        "text": "Buffy the vampire slayer",
        "start_idx": 0,
        "end_idx": 24
      }
    ]
  },
  {
    "text": "Hey we're talking about cigarettes, not girlfriends.",
    "annotations": []
  },
  {
    "text": "As a newbie with only a few months experience I can’t go into a lot of technical stuff like the far more experienced people commenting. I can relay my experience thus far though. My first install was Ubuntu as I wanted to run Arduino IDE, Visual Studio with Platformio, a decent terminal and text writer. It didn’t take long to find it too generic and bloated. My main OS now is EndeavourOS Gnome which I admit frightened me to begin with but there’s so much help out there for all installations. I like this system a lot, it’s light and very easy to build up programs you want. I also have a dual Windows 10/ Mint Mate for my laptop I take out, I don’t need anything fancy on this one.\n\nSorry, I forgot you said it had to be out of those three, I’d go with the Mint.",
    "annotations": [
      {
        "text": "Ubuntu",
        "start_idx": 200,
        "end_idx": 206
      },
      {
        "text": "EndeavourOS",
        "start_idx": 379,
        "end_idx": 390
      },
      {
        "text": "Windows 10/ Mint Mate",
        "start_idx": 598,
        "end_idx": 619
      },
      {
        "text": "Mint",
        "start_idx": 762,
        "end_idx": 766
      }
    ]
  },
  {
    "text": "Happy birthday! On my 21st my parents took me out for a *good* margarita. Those taste like the nectar of the gods when made from scratch (and good tequila). \nI'm an Old now, so I don't really have a taste for sugary stuff anymore. \nFavorite cocktail: a Negroni (1 part each of Campari, gin, and sweet vermouth) or a perfect gin martini (\"perfect\" in this case means a drink made with equal parts sweet and dry vermouth; most martinis are made with dry only). \nI really like red wine, especially Pinot Noir and Cabernet. My go-to beer is damn near any kind of pale ale. I love the grapefruity flavor they get. ",
    "annotations": [
      {
        "text": "margarita",
        "start_idx": 63,
        "end_idx": 72
      },
      {
        "text": "Negroni",
        "start_idx": 253,
        "end_idx": 260
      },
      {
        "text": "perfect gin martini",
        "start_idx": 316,
        "end_idx": 335
      },
      {
        "text": "Pinot Noir",
        "start_idx": 495,
        "end_idx": 505
      },
      {
        "text": "Cabernet",
        "start_idx": 510,
        "end_idx": 518
      },
      {
        "text": "pale ale",
        "start_idx": 559,
        "end_idx": 567
      }
    ]
  },
  {
    "text": "haha i saw that, too. Broadchurch, Happy Valley, The Fall, Hinterland, The Bodyguard, Night Manager - All great suggestions though that I've seen.",
    "annotations": [
      {
        "text": "Broadchurch",
        "start_idx": 22,
        "end_idx": 33
      },
      {
        "text": "Happy Valley",
        "start_idx": 35,
        "end_idx": 47
      },
      {
        "text": "The Fall",
        "start_idx": 49,
        "end_idx": 57
      },
      {
        "text": "Hinterland",
        "start_idx": 59,
        "end_idx": 69
      },
      {
        "text": "The Bodyguard",
        "start_idx": 71,
        "end_idx": 84
      },
      {
        "text": "Night Manager",
        "start_idx": 86,
        "end_idx": 99
      }
    ]
  },
  {
    "text": "I can't believe my favorite didn't even make anyone's top three.\n\n* *Startide Rising* by David Brin\n* *The Many-Colored Land* by Julian May\n* *Friday* by Robert Heinlein \n\nHonorable mentions to *Splinter in the Mind's Eye* by Alan Dean Foster, *Alien* also by ADF (the movie novelization), and elsewhere mentioned *Ready Player One* and *Crystal Singer*..",
    "annotations": [
      {
        "text": "Startide Rising",
        "start_idx": 69,
        "end_idx": 84
      },
      {
        "text": "The Many-Colored Land",
        "start_idx": 103,
        "end_idx": 124
      },
      {
        "text": "Friday",
        "start_idx": 143,
        "end_idx": 149
      },
      {
        "text": "Splinter in the Mind's Eye",
        "start_idx": 195,
        "end_idx": 221
      },
      {
        "text": "Alien",
        "start_idx": 245,
        "end_idx": 250
      },
      {
        "text": "Ready Player One",
        "start_idx": 315,
        "end_idx": 331
      },
      {
        "text": "Crystal Singer",
        "start_idx": 338,
        "end_idx": 352
      }
    ]
  },
  {
    "text": "Finished acoustic installation panels, or just the insulation itself?\n\nTypically people either use rockwool or Owens-Corning (OC) 703 or 705.  705 is much better absorption due to the density.",
    "annotations": [
      {
        "text": "rockwool",
        "start_idx": 99,
        "end_idx": 107
      },
      {
        "text": "Owens-Corning (OC) 703",
        "start_idx": 111,
        "end_idx": 133
      },
      {
        "text": "705",
        "start_idx": 137,
        "end_idx": 140
      },
      {
        "text": "705",
        "start_idx": 143,
        "end_idx": 146
      }
    ]
  },
  {
    "text": "The TI-83/84 are extremely popular; you will not have difficulty finding resources that walk you through how to solve various types of calculus problems using those calculators.  Many textbooks just assume you have a TI and will show the appropriate sequence of button presses.\n\nThey're not particularly fancy calculators, but they're well-known and durable.  No reason to go out and spend $120+ for a new one when a 10-year-old one will do the job for $40.  My TI-85, bought in 1992, still works and does what the new ones do if not more.\n\nThe TI-30X IIS is a nice enough unit but doesn't have the table features and graphing features that will be helpful on some problems.",
    "annotations": [
      {
        "text": "TI-83/84",
        "start_idx": 4,
        "end_idx": 12
      },
      {
        "text": "TI-85",
        "start_idx": 462,
        "end_idx": 467
      },
      {
        "text": "TI-30X",
        "start_idx": 545,
        "end_idx": 551
      }
    ]
  },
  {
    "text": "Maybe a full IDE like NetBeans, Eclipse, Code:Blocks, KDevelop, or others? I like NetBeans.\nThen there are the classic Emacs and Vim (it important to understand that Emacs is clearly superior to Vim while Vim is clearly superior to Emacs). Both are ridiculously awesome but have a steep learning curve.\nThen there is Sublime Edit, but its not open.\n\nAs a side note, IntelliSense is very specific Microsoft as far as i know.\n\nAtom and similar essentially browser based editors may be an alternative (i just read that Atom is now owner by Microsoft). VS Code actually is just one of these. There is a opensource fork of it.",
    "annotations": [
      {
        "text": "NetBeans",
        "start_idx": 22,
        "end_idx": 30
      },
      {
        "text": "Eclipse",
        "start_idx": 32,
        "end_idx": 39
      },
      {
        "text": "Code:Blocks",
        "start_idx": 41,
        "end_idx": 52
      },
      {
        "text": "KDevelop",
        "start_idx": 54,
        "end_idx": 62
      },
      {
        "text": "NetBeans",
        "start_idx": 82,
        "end_idx": 90
      },
      {
        "text": "Emacs",
        "start_idx": 119,
        "end_idx": 124
      },
      {
        "text": "Vim",
        "start_idx": 129,
        "end_idx": 132
      },
      {
        "text": "Emacs",
        "start_idx": 166,
        "end_idx": 171
      },
      {
        "text": "Vim",
        "start_idx": 195,
        "end_idx": 198
      },
      {
        "text": "Vim",
        "start_idx": 205,
        "end_idx": 208
      },
      {
        "text": "Emacs",
        "start_idx": 232,
        "end_idx": 237
      },
      {
        "text": "Sublime Edit",
        "start_idx": 317,
        "end_idx": 329
      },
      {
        "text": "Atom",
        "start_idx": 425,
        "end_idx": 429
      },
      {
        "text": "Atom",
        "start_idx": 516,
        "end_idx": 520
      },
      {
        "text": "VS Code",
        "start_idx": 549,
        "end_idx": 556
      }
    ]
  },
  {
    "text": "Female, late 60s, I have two perfume polarities, if you like: true incenses, no doubt arising from my frankincense-sneezing childhood in church, and bright clean floral musks, probably kicked off by my Mum's fondness for Yardley Lavender, now sadly defunct in any meaningful form.  Searching along these lines has found me some predictable and some less known or liked beauties.  I don't care much about sillage or longevity.  I don't want to knock people over in the street.\n\n• Yardley Lavender, the original, loved by Royalty and Marilyn Monroe, but reformulated to a synthetic mess now\n\n• Aromatics Elixir Clinique\n\n• Heeley Cardinal.  This is one of the best churchy incense out there.  It doesn't smell like the dank, moist stones of CDG   Avignon, but I do get a whiff of the Cardinal's pristine, starched linen alb.\n\n• Armani Privé Bois d'Encens A really great churchy incense, clean and not smoky.  Not terribly affordable.  I reject any suggestion that this is masculine and I don't believe that was the intention.\n\n•  Diptyque Essence of John Galliano, Room Spray or Candle.  No not a perfume, but certainly a fragrance.  The opening notes are like an old bonfire, but the sweet woody drydown is what sells it for me.\n\n•  Heeley L'Amandière  A soft green almond fragrance, really pretty.\n\n•  Franck Boclet Incense.  No trace of incense, it turns out, but a very nice cardamom without a culinary tone.  Unfortunately, there are lots of fakes out there (pink or violet in colour).\n\n•  Dolce e Gabbana L'Eau The One.  I guess it qualifies as a flanker, but to me it's several orders of magnitude better than the principal.\n\n•  Perfume & Skincare Fig & Olive.  This is a small Australian producer, perfumer is Sheila Massetti and this is their flagship fragrance.  It's a pure green floral that might remind you of CK1, but different. I think it's better.  Sweeter  less frankly young.  I have also found the little roll-on to be better.  They do an excellent lavender.\n\n•  Baccarat  Les Larmes Sacrées de Thèbes.  This was one of three fragrances produced by Baccarat towards the end of the last millenium.  The heavy pyramidal bottle alludes to the tomb of King Tut and the supposed perfumes in which the ancient Egyptians anointed their Royal dead. Frankincense, myrhh, egyptian cassia, black pepper, thyme, jasmine, basil, myrtle, ambergris and other spices.   It's not the kind of thing you dab on every day.   I have very little left and wonder what I'll do with the extraordinary bottle.  Murder weapon, maybe. 😉\n\n•  Opium, original.  Nearly forgot!  Who smells better than someone who puts on a bit of Opium just after a shower?\n\nYeah, I can't count, sue me 😁😁",
    "annotations": [
      {
        "text": "Yardley Lavender",
        "start_idx": 479,
        "end_idx": 495
      },
      {
        "text": "Aromatics Elixir Clinique",
        "start_idx": 592,
        "end_idx": 617
      },
      {
        "text": "Heeley Cardinal",
        "start_idx": 621,
        "end_idx": 636
      },
      {
        "text": "CDG   Avignon",
        "start_idx": 739,
        "end_idx": 752
      },
      {
        "text": "Armani Privé Bois d'Encens",
        "start_idx": 826,
        "end_idx": 852
      },
      {
        "text": "Diptyque Essence of John Galliano",
        "start_idx": 1028,
        "end_idx": 1061
      },
      {
        "text": "Heeley L'Amandière",
        "start_idx": 1232,
        "end_idx": 1250
      },
      {
        "text": "Franck Boclet Incense",
        "start_idx": 1302,
        "end_idx": 1323
      },
      {
        "text": "Dolce e Gabbana L'Eau The One",
        "start_idx": 1493,
        "end_idx": 1522
      },
      {
        "text": "Perfume & Skincare Fig & Olive",
        "start_idx": 1634,
        "end_idx": 1664
      },
      {
        "text": "CK1",
        "start_idx": 1821,
        "end_idx": 1824
      },
      {
        "text": "Baccarat  Les Larmes Sacrées de Thèbes",
        "start_idx": 1980,
        "end_idx": 2018
      },
      {
        "text": " Opiu",
        "start_idx": 2530,
        "end_idx": 2535
      }
    ]
  },
  {
    "text": "Got my Serengetis cheap ($70) from Costco. They have an Aviator style and a second style on their website right now.\n\nI really recommend checking out their in-store selection. The reason I went there in the first place was to buy a pair of Maui Jim's. I saw a pair at Macy's/Sunglass Hut and liked them way better than the Ray Bans I thought I wanted. But they were full price there -- $300 -- which was way out of my budget. I looked for a cheaper price on them online and lo and behold Costco had them for only $100! I went in to my local store to buy them. They had about 30 pairs of \"designer sunglasses\" in total. Tried on a number of them and actually preferred the Serengetis.\n\nTo sum up: When buying expensive expensive sunglasses, go to Costco. Their prices are at least 50% off retail, though their selection is much smaller.",
    "annotations": [
      {
        "text": "Costco",
        "start_idx": 35,
        "end_idx": 41
      },
      {
        "text": "Macy's",
        "start_idx": 268,
        "end_idx": 274
      },
      {
        "text": "Sunglass Hut",
        "start_idx": 275,
        "end_idx": 287
      },
      {
        "text": "lo",
        "start_idx": 474,
        "end_idx": 476
      },
      {
        "text": "Costco",
        "start_idx": 488,
        "end_idx": 494
      },
      {
        "text": "Costco",
        "start_idx": 746,
        "end_idx": 752
      }
    ]
  },
  {
    "text": "My favorites are the johto games any of them are fine. They’re a bit more open then most Pokémon games the story is kept to a minimal so the adventure becomes the focus. The whole saving the world from some crazy legendary was never my thing just let me explore the region on my own get some badges while encountering my rival every now or then.  That said the Gen 7 games are my least favorite you can’t really explore and NPC’s are in your face the whole game USUM is the first main series Pokémon game I couldn’t finish after barely getting through Sun the year prior because of the crazy amount of boring dialogue.",
    "annotations": [
      {
        "text": "the johto games",
        "start_idx": 17,
        "end_idx": 32
      },
      {
        "text": "the Gen 7 games",
        "start_idx": 357,
        "end_idx": 372
      }
    ]
  },
  {
    "text": "[Fucking Hostile by Pantera] (https://www.youtube.com/watch?v=E929gqIcwwI)",
    "annotations": [
      {
        "text": "Fucking Hostile by Pantera",
        "start_idx": 1,
        "end_idx": 27
      }
    ]
  },
  {
    "text": "[This review on the RPG Codex](https://rpgcodex.net/content.php?id=10848) explains it much better than I ever could.",
    "annotations": [
      {
        "text": "This review on the RPG Codex](https://rpgcodex.net/content.php?id=10848",
        "start_idx": 1,
        "end_idx": 72
      }
    ]
  },
  {
    "text": "Dark Age\n\nHyperion\n\nDune",
    "annotations": [
      {
        "text": "Dark Age",
        "start_idx": 0,
        "end_idx": 8
      },
      {
        "text": "Hyperion",
        "start_idx": 10,
        "end_idx": 18
      },
      {
        "text": "Dune",
        "start_idx": 20,
        "end_idx": 24
      }
    ]
  },
  {
    "text": "Happy Birthday! I usually just drink bourbon (on the rocks or old fashions) or red wine. But I've recently made up with vodka (college left its scars) and I now love a good vodka soda with lemon or lime. \n\nLike everyone else is saying dont mix your booze. Pick one for the night and stick with it. I'd also recommend avoiding the sugary sweet drinks. The sugar will make a hangover 10x worse than the alcohol itself. If I am out for a night of drinking I might have a moscow mule as my first (sweet and delicious) drink and then switch to vodka sodas for the rest of the night to give myself a fighting chance. ",
    "annotations": [
      {
        "text": "bourbon",
        "start_idx": 37,
        "end_idx": 44
      },
      {
        "text": "vodka",
        "start_idx": 120,
        "end_idx": 125
      },
      {
        "text": "vodka soda",
        "start_idx": 173,
        "end_idx": 183
      },
      {
        "text": "sugary sweet drinks",
        "start_idx": 330,
        "end_idx": 349
      },
      {
        "text": "moscow mule",
        "start_idx": 468,
        "end_idx": 479
      },
      {
        "text": "vodka sodas",
        "start_idx": 539,
        "end_idx": 550
      }
    ]
  },
  {
    "text": "It's far too late, she's 7.5 months now and we can barely keep up on normal chores let alone painting a room! LOL. I agree, though. A light grey with a barely pinkish undertone is what I was thinking or sure.",
    "annotations": [
      {
        "text": "light grey with a barely pinkish undertone",
        "start_idx": 134,
        "end_idx": 176
      }
    ]
  },
  {
    "text": "Thank you for all your hard work! This is awesome!",
    "annotations": []
  },
  {
    "text": "PM me as well, I'd like to know too.",
    "annotations": []
  },
  {
    "text": "Dark mode, much more fluid and better looking daily view, better monthly appointment view (colored dots correspond with appointments in a calendar - my school assignments calendar is green so any day with a green dot is when something is due; different from stock Calendar where any day with any calendar appointment has 1 gray dot) & natural language support for adding reminders and events.\n\nIt's just nice all around.",
    "annotations": [
      {
        "text": "Dark mode",
        "start_idx": 0,
        "end_idx": 9
      }
    ]
  },
  {
    "text": "IEEE \nhttps://www.ieee.org/publications/index.html\n\nThe RFC Archive\nhttps://www.rfc-archive.org/#gsc.tab=0",
    "annotations": [
      {
        "text": "IEEE",
        "start_idx": 0,
        "end_idx": 4
      },
      {
        "text": "RFC Archive",
        "start_idx": 56,
        "end_idx": 67
      }
    ]
  },
  {
    "text": "> Seveneves\n\nMore importantly, the last third of the book was way too drawn out descriptively and the ending kind of sucked. It's the first book i've ever gotten a refund for on audible, it just left me feeling disappointed. I think the last section, set in the future, should have been made into it's own second novel and been longer, but with less verbosity about the environment and such.",
    "annotations": [
      {
        "text": "Seveneves",
        "start_idx": 2,
        "end_idx": 11
      }
    ]
  },
  {
    "text": "The New Workout Plan is one of my favs! It's so over the top and ridiculous, but I swear listening to it increases my gainz x10",
    "annotations": [
      {
        "text": "The New Workout Plan",
        "start_idx": 0,
        "end_idx": 20
      }
    ]
  },
  {
    "text": "Zion national park... but it looks like you are looking for something totally different.",
    "annotations": [
      {
        "text": "Zion national park",
        "start_idx": 0,
        "end_idx": 18
      }
    ]
  },
  {
    "text": "r/HardScience - Scientific papers\n\nWell it used to be anyway, now it seems that r/scientific takes it place until *that* gets overrun or sloppy.",
    "annotations": [
      {
        "text": "r/HardScience",
        "start_idx": 0,
        "end_idx": 13
      }
    ]
  },
  {
    "text": "Scotch. ",
    "annotations": [
      {
        "text": "Scotch",
        "start_idx": 0,
        "end_idx": 6
      }
    ]
  },
  {
    "text": "Only now so cause people forget the before playstatuon got huge they were a major player in stereo's and tv's. The fact that they dont make tons of money for sony doesnt help. Though this has happened with all high end electronics. Your sony surround sound from 80's/90's is still running golden probably.",
    "annotations": []
  },
  {
    "text": "Thanks. Now I will go and ask McDonalds for advice on diabetes prevention.\n\n",
    "annotations": []
  },
  {
    "text": "I have this monitor and it's great!",
    "annotations": []
  },
  {
    "text": "Nice post 💪🏼",
    "annotations": []
  },
  {
    "text": "I’m amazed I had to scroll this far to find Shift. My favorite racing game of all time. Perfect mixed of arcade and sim with great tuning and progression. \n\nIt’s the only game I’ve played that made playing in slower cars fun. Running a course perfectly in a road legal hot hatch is super satisfying.",
    "annotations": [
      {
        "text": "Shift",
        "start_idx": 44,
        "end_idx": 49
      }
    ]
  },
  {
    "text": "You would need to create a back-end using Node.js, but yes you can do all of that.",
    "annotations": [
      {
        "text": "Node.js",
        "start_idx": 42,
        "end_idx": 49
      }
    ]
  },
  {
    "text": "Also the BW games have unique idle animation for in-battle pokemon, before BW they were motionless and after they were the yucky 3D models.",
    "annotations": [
      {
        "text": "BW games",
        "start_idx": 9,
        "end_idx": 17
      }
    ]
  },
  {
    "text": "Jack Lamberts sports illustrated photo is what I think of when I think of that smash mouth old school football",
    "annotations": [
      {
        "text": "Jack Lamberts sports illustrated photo",
        "start_idx": 0,
        "end_idx": 38
      }
    ]
  },
  {
    "text": "The ice maker freezes to the point where it can’t make ice. It needs to be manually defrosted every week. The defrosting setting in the unit makes a very loud beeping noise for 25 minutes, and I usually have to run it twice. Then I need to clean off the excess ice inside. And it doesn’t even make much ice until it needs to be de-frosted again. So quite a bit of hassle for something that is a non-issue in other refrigerators (and a very “first world problem”). It’s very surprising to see such a silly design from a company that I’d otherwise thought highly of.",
    "annotations": []
  },
  {
    "text": "Shatter Me. It's more of a dystopian vibe but it's really good! I usually don't read books, especially a series like this one, but I loved it right away. You should definitely try it!",
    "annotations": [
      {
        "text": "Shatter Me",
        "start_idx": 0,
        "end_idx": 10
      }
    ]
  },
  {
    "text": "WHAT oh noooo, the Paradise Burger was my favorite!",
    "annotations": [
      {
        "text": "Paradise Burger",
        "start_idx": 19,
        "end_idx": 34
      }
    ]
  },
  {
    "text": "\"It is probably impossible to build this structure with a ribose sugar in place of the deoxyribose sugar\"\n\nIt makes me feel good that even Crick fucked up from time to time.",
    "annotations": []
  },
  {
    "text": "Battery life not really, I can plug it in no issues wherever I go. Weight, I am not looking for a cement block",
    "annotations": []
  },
  {
    "text": "I haven’t watched those yet but I definitely will.  I’m not sure if he’ll do one about the Great War but it would’ve been great if he had done one for the 100 year anniversary of the start of the war.",
    "annotations": []
  },
  {
    "text": "I really loved this documentary. It was totally different from the other drug documentaries.",
    "annotations": []
  },
  {
    "text": "I may or may not create throwaways to give you more upvotes good sir.",
    "annotations": []
  },
  {
    "text": "You should see the emails we get from my mother in law. They practically require a decoder ring. I would say your mom's texting is pretty A+ work. ",
    "annotations": []
  },
  {
    "text": "Me? I'm just bored. I downvoted your posts too, not just this thread.",
    "annotations": []
  },
  {
    "text": "How dare you.\n\nHow come you didn't like it?",
    "annotations": []
  },
  {
    "text": "Depends, what kind of games do you want to play?",
    "annotations": []
  },
  {
    "text": "WTF!",
    "annotations": []
  },
  {
    "text": "My dog Terror. ",
    "annotations": []
  },
  {
    "text": "I just bought some 1901 wayfarers for $25 at Nordstrom. Much better quality than my $10 h&m ones and a lot of different styles! https://m.shop.nordstrom.com/c/mens-sunglasses/1901~6417",
    "annotations": [
      {
        "text": "Nordstrom",
        "start_idx": 45,
        "end_idx": 54
      },
      {
        "text": "h&m",
        "start_idx": 88,
        "end_idx": 91
      }
    ]
  },
  {
    "text": "Thank you for the response, that's exactly what I think of them. They make some very \"edgy\" designs but also have some that are very clean and simple.\n",
    "annotations": []
  },
  {
    "text": "Several years back, I was delivering a pizza to a customer staying on the some-teenth floor of a hotel. While I was waiting for the elevator, a man came up to wait beside me. He looked really familiar, but I couldn't quite place him at first. Then the elevator comes and we step in and he is on the side with the buttons so he asks me what floor I need. I tell him and then it immediately hits me...*dude, it's Screech from Saved by the Bell*. I'm a tad bit starstruck and can't for the life of me think of his actual name so I casually blurt out \"Hey, weren't you Screech?\" He looks me blankly in the eye, says \"Yes.\" in the most joyless annoyed tone I've ever heard in my life, and then turns his entire body to face the elevator wall. We spend another twenty or so seconds riding in utter silence until we reach his floor and he exits in an awkward motion so as to keep his back fully turned to me the entire time, never uttering a sound or glancing back. Then I rode up and delivered the pizza. I'll never forget Dustin Diamond's name again in my life. ",
    "annotations": []
  },
  {
    "text": "Sanjay mishra",
    "annotations": [
      {
        "text": "Sanjay mishra",
        "start_idx": 0,
        "end_idx": 13
      }
    ]
  },
  {
    "text": "i got my dad a chromecast for Christmas and he is able to cast amazon instant through beta Chromecast, which is \"experimental\" and lets you cast your entire screen to the TV.",
    "annotations": [
      {
        "text": "chromecast",
        "start_idx": 15,
        "end_idx": 25
      }
    ]
  },
  {
    "text": "We have 2 large freezers in the basement. You can save money by buying in bulk when stuff is on sale at the store, but be sure to actually keep track and use what you purchase.  It is easy to forget about the bits stowed in the back, especially with a chest freezer. \n\nDuring the summer when produce prices are low, we go to the orchards and buy fruit in bulk. We wash and cut up the fruit, then freeze them for making smoothies and baked treats later in the year. We also cook in bulk and freeze extra servings for rainy days.  That cuts down a lot on the temptation to eat out!\n\nI have not noticed a significant jump in the electric bill.  Modern freezers are very energy efficient.  ",
    "annotations": []
  },
  {
    "text": "I have a basic set ofB and 2H pencils. Never heard of ebony will check them out. \n\nEDIT: the site is brilliant. ",
    "annotations": [
      {
        "text": "ebony",
        "start_idx": 54,
        "end_idx": 59
      }
    ]
  },
  {
    "text": "Candles, blankets, perfumes, jewlery.",
    "annotations": [
      {
        "text": "Candles",
        "start_idx": 0,
        "end_idx": 7
      },
      {
        "text": "blankets",
        "start_idx": 9,
        "end_idx": 17
      },
      {
        "text": "perfumes",
        "start_idx": 19,
        "end_idx": 27
      },
      {
        "text": "jewlery",
        "start_idx": 29,
        "end_idx": 36
      }
    ]
  },
  {
    "text": "when I was about 14 and my dentist explained the importance of flossing, he said that the plaque buildup is a residual combination of acids created by saliva that erode your teeth and eat away at enamel. the white stuff thaat is plaque that you see building up when you don't floss properly is your teeth's attempt to block food particles from infecting it further and the process itself is the equivalent to your teeth taking a dump in you mouth. Yes, that's right he assured me; everytime you don't floss your teeth poop in your mouth. This only scared me into flossing once per week.\n\nTL;DR by not flossing, your teeth will literally shit in your mouth.",
    "annotations": []
  },
  {
    "text": "Are you talking about “triggered” with Joe Rogan?",
    "annotations": [
      {
        "text": "“triggered” with Joe Rogan",
        "start_idx": 22,
        "end_idx": 48
      }
    ]
  },
  {
    "text": "Carrion has led to so many PRs for me",
    "annotations": [
      {
        "text": "Carrion",
        "start_idx": 0,
        "end_idx": 7
      }
    ]
  },
  {
    "text": "Cough cought The Witcher cough cough",
    "annotations": [
      {
        "text": "The Witcher",
        "start_idx": 13,
        "end_idx": 24
      }
    ]
  },
  {
    "text": "New Zealand is not very successful in away matches.",
    "annotations": [
      {
        "text": "New Zealand",
        "start_idx": 0,
        "end_idx": 11
      }
    ]
  },
  {
    "text": "So referencable...\n\n\"My dad always said why buy the cow when you can get the milk for free?\"\n\"Hey rookie, did you just call my girlfriend a cow?\"\n\"I think he called her a slut.\"\n\n\"This is a long range weapon, I need to be further back to use it effectively?\"\n\"Where were you going to shoot him? The fucking moon? If you ran back any further, you would have had to mail him the bullets!\"\n",
    "annotations": []
  },
  {
    "text": "Monster Ultra Paradise",
    "annotations": [
      {
        "text": "Monster Ultra Paradise",
        "start_idx": 0,
        "end_idx": 22
      }
    ]
  },
  {
    "text": "Madoka at #4 and Penguindrum at #38, nice!!!",
    "annotations": [
      {
        "text": "Madoka",
        "start_idx": 0,
        "end_idx": 6
      },
      {
        "text": "Penguindrum",
        "start_idx": 17,
        "end_idx": 28
      }
    ]
  },
  {
    "text": "I think I bought the aluminum frame(blue tint) ones from him directly for about 30-35. \n\nI've only bought [two](http://imgur.com/a/Zec9iQH). One through superbuy and one direct. He sometimes takes a little to ship out(probably ships out a bunch at once instead of by order) so direct is better.",
    "annotations": [
      {
        "text": "superbuy",
        "start_idx": 153,
        "end_idx": 161
      },
      {
        "text": "direct",
        "start_idx": 170,
        "end_idx": 176
      },
      {
        "text": "direct",
        "start_idx": 277,
        "end_idx": 283
      }
    ]
  },
  {
    "text": "My daughter gave me a rock when she was 2. Just a rock from outside. I still have it. I love that rock. ",
    "annotations": []
  },
  {
    "text": "You also have the potential to make some money from pines before the first thinning (~7 years) by harvesting straw, especially with longer needle pines like slash and longleaf. We used to get something like $2 a bale, which was about 64sq of ground cover, sometimes more sometimes less.",
    "annotations": [
      {
        "text": "slash",
        "start_idx": 157,
        "end_idx": 162
      },
      {
        "text": "longleaf",
        "start_idx": 167,
        "end_idx": 175
      }
    ]
  },
  {
    "text": "You can just buy the classic version: https://www.artisan-jp.com/cs-zero-eng.html only difference between this and the FX zero is that this doesn’t have stitched edges; surface is the same.",
    "annotations": [
      {
        "text": "https://www.artisan-jp.com/cs-zero-eng.html",
        "start_idx": 38,
        "end_idx": 81
      },
      {
        "text": "FX zero",
        "start_idx": 119,
        "end_idx": 126
      }
    ]
  },
  {
    "text": "The sequel is a bitter disappointment. Miller died with it unfinished and another author took over. It's nowhere near as good as *Canticle*.",
    "annotations": [
      {
        "text": "sequel",
        "start_idx": 4,
        "end_idx": 10
      },
      {
        "text": "Canticle",
        "start_idx": 130,
        "end_idx": 138
      }
    ]
  },
  {
    "text": "Those clicking sounds that annoy everyone in a 10m radius....  Yummm. ",
    "annotations": []
  },
  {
    "text": "I don't know if he would have been able to capture the nomination but it's pretty hard to argue that he wouldn't have changed the political landscape even if he wouldn't have gotten the nomination and probably ran again in the future. Bobby was such an interesting character, from being the soft spoken shy Kennedy boy, working for McCarthy, leading the justice department and being jack's enforcer to running himself as a politician who really cared about people. I think the party and the country would have been much better off if he had lead in either respects. ",
    "annotations": []
  },
  {
    "text": "Best dining: ft?? Damn how times change",
    "annotations": [
      {
        "text": "ft",
        "start_idx": 13,
        "end_idx": 15
      }
    ]
  },
  {
    "text": "Switch, the others try to hard to be hip with the kids",
    "annotations": [
      {
        "text": "Switch",
        "start_idx": 0,
        "end_idx": 6
      }
    ]
  },
  {
    "text": "Prince of Fools (first book in Red Queen's War trilogy) meets all of your needs I believe. The main character sees many different locales, encounters many battles and narrow escapes, the characters and story are great, there are monsters, and there are magical objects. It seems darker than the other stuff you've read, but other than that, I don't see why it wouldn't be what you're looking for.",
    "annotations": [
      {
        "text": "Prince of Fools",
        "start_idx": 0,
        "end_idx": 15
      }
    ]
  },
  {
    "text": "http://i.imgur.com/dvDfK.jpg",
    "annotations": []
  },
  {
    "text": "just install ubuntu lol",
    "annotations": [
      {
        "text": "ubuntu",
        "start_idx": 13,
        "end_idx": 19
      }
    ]
  },
  {
    "text": "How about a toothbrush 'made with volcanic minerals'? Nothing says it's abrasive, probably just using carbon to get really thin to get in between teeth\n\nI stopped using charcoal toothpaste long ago for your exact reason",
    "annotations": []
  },
  {
    "text": "They nailed the Midwest.  SDC definitely for MO and AR.  WOF definitely for KS and NE.  Adventureland for IA.  👍🏻",
    "annotations": []
  },
  {
    "text": "> hence **it's** exclusion from my list.\n\n*its\n\nWhy don't you consider it an RPG?",
    "annotations": []
  },
  {
    "text": "Ice inhibits flavor, a few drops of water bring it out.",
    "annotations": []
  },
  {
    "text": "Same experience for me as well! Go bruins!",
    "annotations": []
  },
  {
    "text": "Fff - fucking fast file",
    "annotations": []
  },
  {
    "text": "Do you know what a rhetorical question is?",
    "annotations": []
  },
  {
    "text": "I loove the Stuff You Should Know podcasts. I'd highly recommend checking them out. They basically give a 30-50 minute breakdown of certain topics in an easy to understand way. They're not all biology related but they very often do them. You can download their older episodes and download all of the science related ones like me.",
    "annotations": [
      {
        "text": "Stuff You Should Know",
        "start_idx": 12,
        "end_idx": 33
      }
    ]
  },
  {
    "text": "I have a $7 one from Ikea, I'd rather buy a new one every time it dies...which is not that often.",
    "annotations": []
  },
  {
    "text": "This is a great response, thank you. My interest in the cello isn’t waning. I was simply curious about other people’s experiences learning multiple instruments. I thoroughly enjoy playing cello. I wish I was advancing faster, but my teacher had told me on more than one occasion that I’m doing really well and am ahead of other adult student’s he’s taught for the same length of time. I’m on a new book with more and more advanced songs, which means the cello gets harder and more frustrating to learn, but in a good way. \nI think I’m also going to get a clarinet teacher so I can get back to the level I was playing at as a child.",
    "annotations": []
  },
  {
    "text": "Also, \"Even if you're really good at it, people don't always wanna watch.\"",
    "annotations": []
  },
  {
    "text": "It smells like Big Foot's dick!",
    "annotations": []
  },
  {
    "text": "Last nights dinner in a tortilla",
    "annotations": []
  },
  {
    "text": "*Weird Al intensifies",
    "annotations": []
  },
  {
    "text": "Please link!",
    "annotations": []
  },
  {
    "text": "If those were my two options axios for sure.\n\nAnything you create in fetch that has any complexity outside of just making the simplest of call would just be reinventing axios anyway.\n\nIt's lightweight, it's heavily used and well maintained and it keeps your API calls standard and clean.",
    "annotations": [
      {
        "text": "axios",
        "start_idx": 29,
        "end_idx": 34
      }
    ]
  },
  {
    "text": "Kourtney is my fave and over the past few years Khloe my least.",
    "annotations": [
      {
        "text": "Kourtney",
        "start_idx": 0,
        "end_idx": 8
      },
      {
        "text": "Khloe",
        "start_idx": 48,
        "end_idx": 53
      }
    ]
  },
  {
    "text": "# $100-$200\n\n# ",
    "annotations": []
  },
  {
    "text": "Onslaught",
    "annotations": [
      {
        "text": "Onslaught",
        "start_idx": 0,
        "end_idx": 9
      }
    ]
  },
  {
    "text": "The dad may not get it, but I'm sure that girl appreciates it more than you know.",
    "annotations": []
  },
  {
    "text": "Nestle",
    "annotations": [
      {
        "text": "Nestle",
        "start_idx": 0,
        "end_idx": 6
      }
    ]
  },
  {
    "text": "Sachi's milan, they had not only the greatest attacking trio ever (i guess now msn could make that argument) but they also had the greatest defense ever.  ",
    "annotations": [
      {
        "text": "Sachi's milan",
        "start_idx": 0,
        "end_idx": 13
      }
    ]
  },
  {
    "text": "Trump",
    "annotations": [
      {
        "text": "Trump",
        "start_idx": 0,
        "end_idx": 5
      }
    ]
  },
  {
    "text": "Nah Tobey is.",
    "annotations": [
      {
        "text": "Tobey",
        "start_idx": 4,
        "end_idx": 9
      }
    ]
  },
  {
    "text": "This is unexpectedly one of the better subs.  The amount of detail you guys go into gives me a lot of hope for this platform in the future.  I already think mobile gaming is better on the ipad than the switch.",
    "annotations": [
      {
        "text": "ipad",
        "start_idx": 188,
        "end_idx": 192
      },
      {
        "text": "switch",
        "start_idx": 202,
        "end_idx": 208
      }
    ]
  },
  {
    "text": "Look into the hotel tax for your situation. In some jurisdictions, the distinction between renting an apartment (which is not taxed) and renting a hotel room (which is taxed) is the length of the rental period. If you stay in a hotel more than a month, tax might not be due. If so, and the hotel is still charging you, ask them to stop, and to refund as much previous tax as possible.\n\nThey should not mind, since it is not money for them, just money for the government, which is not owed.",
    "annotations": [
      {
        "text": "renting an apartment",
        "start_idx": 91,
        "end_idx": 111
      },
      {
        "text": "renting a hotel room",
        "start_idx": 137,
        "end_idx": 157
      }
    ]
  },
  {
    "text": "no fucking way, either he's Canadian or he doesn't speak a lick of English, because the technical term is *penny pinching jew*",
    "annotations": []
  },
  {
    "text": "Most phones have cameras that easily perform as good as a 100 bucks webcam. I was astonished how good the quality of my huawei p20 lite was.\nA cheap webcam is probably worse than most phones.",
    "annotations": [
      {
        "text": "huawei p20 lite",
        "start_idx": 120,
        "end_idx": 135
      }
    ]
  },
  {
    "text": "Geo...graphy here.",
    "annotations": []
  },
  {
    "text": "Perfect, thanks!",
    "annotations": []
  },
  {
    "text": "The Frugal Zealot, Amy Dacyczyn, recommended that every frugal person should buy one even if they lived in an apartment and had to keep it in the living room.  It is a major money-saver and a foundation for frugal eating.  \n\n1. You can buy in bulk from the produce broker and store fruits and vegetables.\n\n2. You can buy large quantities and take advantage of price fluctuations to buy low and eat out of your freezer while waiting for another sale.\n\n3. If you avoid the frost-free models your frozen foods will last much longer.\n\n4. A chest freezer is an extremely efficient way of storing food.  Cold air is heavier than warm air so very little of your cold air escapes when you open the lid.\n\n5. A chest freezer is so much more efficient than a refrigerator that people have worked on controllers that turn them into refrigerators. Commercial versions are available but are very costly.\n\n6.  With the built-in dividers and baskets available in a typical Kenmore freezer today you can have easier access to the silos of food that the dividers allow.  We also use rectangular lidded buckets (such as certain kitty litters come in) to make for easy storage in the chest freezer.\n\n7. I'd recommend you purchase the largest one that can fit in your home.  You will always find a use for the space.  But if you get a smaller one you can resell it and move up.\n\n8.  A freezer made after 1993 (in the USA) is much more efficient than older models due to increased insulation requirements.\n\n9.  Do not put it in unconditioned space if you can possibly avoid it.  The closer it is to your kitchen the more you will use it, and fighting mother nature takes away efficiency.\n\n10. If you do live in an apartment and need to put it in a visible location outside the kitchen, a creative disguise such as a table cloth will help and give you a temporary work top.  We use the top of our chest freezer all the time for spreading out paper work etc.\n",
    "annotations": []
  },
  {
    "text": "# $100-$200\n\n# ",
    "annotations": []
  },
  {
    "text": "I met a number of social science graduates who went to business school in Sweden and found very good jobs afterwards. They had to learn Swedish pretty well. That's an option.",
    "annotations": []
  },
  {
    "text": "It's funny that you think that someone with insider information and ~10 years in the field is suffering from Dunning Kruger and then link to an article about a lawsuit where none of the allegations have been proven. I see these lawsuits all the time, and 90% of them are meritless because of people like you who think they know how the code works but they don't. Your statements are prime evidence. Did that press release link to any data? Any proof?\nIt even says in the article that the company has been working to address their concerns. What were their concerns and how were they addressed? Seems like it's missing a lot of important details. Or is this again more political posturing?\nYou probably read an article about PII tracking and assumed it was the truth... Did you look at the code, database schemas and access control lists? If there is tracking going on do you know what is being tracked, how it's done, who has access to the data, and who owns it?\nWell whatever, let's just say I disagree with your conclusions and not because of some youtube videos but due to internal documentation and training. This is a learnprogramming subreddit after all and someone asked a question that I felt qualified to answer. Peace :)",
    "annotations": []
  },
  {
    "text": "Hi Ellen. ",
    "annotations": [
      {
        "text": "Ellen",
        "start_idx": 3,
        "end_idx": 8
      }
    ]
  },
  {
    "text": "Uhhh, I dunno. \n         -every dad ever",
    "annotations": []
  },
  {
    "text": "To me a mind-bending movie is a movie that once you finished watching it you spend a not-insignificant amount of time thinking about it, dissecting the movie, trying to figure it out, trying to make sense of everything you just watched.\n\nI didn't have that experience with Interstellar. I thought they explained everything they needed to within the context of the movie and I never once felt the need to go back and watch it again to figure things out.",
    "annotations": [
      {
        "text": "Interstellar",
        "start_idx": 273,
        "end_idx": 285
      }
    ]
  },
  {
    "text": "4 seasons Kyoto",
    "annotations": [
      {
        "text": "4 seasons Kyoto",
        "start_idx": 0,
        "end_idx": 15
      }
    ]
  },
  {
    "text": "Several bloggers listed \"Clannad\" to represent the entire franchise, but they didn't specify which season they like more.  I thought it would be redundant to list both, so I counted \"Clannad\" as a vote for season 1.",
    "annotations": []
  },
  {
    "text": "The Cold Vein by Cannibal Ox. Way ahead of its time",
    "annotations": [
      {
        "text": "The Cold Vein",
        "start_idx": 0,
        "end_idx": 13
      }
    ]
  },
  {
    "text": "Check us out! [ClassCalc.com](https://ClassCalc.com).\n\nWe've bought a free calculator app to the market that teachers let you use in class.\n\nMini-tutorial here: [https://www.youtube.com/watch?v=sR08DXHvtGw&t=2s&list=PLZbP7IPhnt3jFY2xean-hmT\\_CmnL\\_DdB6&index=2](https://www.youtube.com/watch?v=sR08DXHvtGw&t=2s&list=PLZbP7IPhnt3jFY2xean-hmT_CmnL_DdB6&index=2)",
    "annotations": [
      {
        "text": "ClassCalc.com](https://ClassCalc.com",
        "start_idx": 15,
        "end_idx": 51
      }
    ]
  },
  {
    "text": "Thanks! Excellent explanation. I'll be sure to bring this up at my next cleaning.",
    "annotations": []
  },
  {
    "text": "More like lame piece",
    "annotations": []
  },
  {
    "text": "I don’t know why anyone would ever drift through their degree without putting the effort in. It’s a waste of time and stupid amounts of money, no matter what the major is. But yeah, country are you in? Cos in a lot of countries an English lit degree is still seen as being a pretty highly respected degree with broad career prospects in things like sales, advertising, PR, management, journalism and the like. It has a lot of transferable skills like problem solving; research; in depth cultural knowledge and a presumption that you know how to apply it; writing; reading; the art of persuasion; the ability to interpret information at an advanced level. \nI don’t like the fact that a lot of places, especially in North America, seem to have lost all respect for it as a subject. It’s an insulting lack of knowledge about an important subject imo.",
    "annotations": [
      {
        "text": "English lit degree",
        "start_idx": 231,
        "end_idx": 249
      }
    ]
  },
  {
    "text": "I am not a fan of fruity, sweet floral, musky, heavy perfumes. Light, layered, complex scents with fresh vibrant notes are my favorite. I also like to change it up. My current favorite is Forest Essentials Iced Pomegranate. ",
    "annotations": [
      {
        "text": "Forest Essentials Iced Pomegranate",
        "start_idx": 188,
        "end_idx": 222
      }
    ]
  },
  {
    "text": "Yeah, I generally like how they look as a style, but they just don't fit my face either. You have to try everything on first because it's hard to tell how it'll fit and look.",
    "annotations": []
  },
  {
    "text": "When you're done, if you have a bunch of candy left over, just give it to the last trick or treater that comes by your house before you turn off the lights.",
    "annotations": []
  },
  {
    "text": "My only experience with Guy Fieri thus far was cordial. Did a guest presentation for us and took plenty of photos.\n\nBut every time there's a wildfire or other depressing thing going on around here, he has his \"second responder\" crew ready to feed and care for all the first responders.",
    "annotations": [
      {
        "text": "Guy Fieri",
        "start_idx": 24,
        "end_idx": 33
      }
    ]
  },
  {
    "text": "Try Ancillary Justice, by Ann Leckie. It takes that whole \"AI's are not so bad\" thing to a whole new level. Skip the sequels tho.",
    "annotations": [
      {
        "text": "Ancillary Justice",
        "start_idx": 4,
        "end_idx": 21
      }
    ]
  },
  {
    "text": "My understanding is that the amount of zinc required to shorten the duration of a cold  carries the risk of permanent anosmia (cannot smell).  According to up to date which is an American database for docs. Not sure the ratio of harm but anosmia ain't nothing to fuck with. I would recommend sleep, appropriate pain relief and ipratropium nasal spray to help with that runny nose.",
    "annotations": [
      {
        "text": "sleep",
        "start_idx": 292,
        "end_idx": 297
      },
      {
        "text": "appropriate pain relief",
        "start_idx": 299,
        "end_idx": 322
      },
      {
        "text": "ipratropium nasal spray",
        "start_idx": 327,
        "end_idx": 350
      }
    ]
  },
  {
    "text": "Tribe Called Quest - Low End Theory\n\nThe Notorious B.I.G - Ready to Die\n\nEl-P - Cancer 4 Cure\n\nKiller Mike - RAP Music \n\nOutKast - ATLiens \n\nKid Cudi - MOTM 1 & 2 \n\nKanye West - MBDTF",
    "annotations": [
      {
        "text": "Low End Theory",
        "start_idx": 21,
        "end_idx": 35
      },
      {
        "text": "Ready to Die",
        "start_idx": 59,
        "end_idx": 71
      },
      {
        "text": "Cancer 4 Cure",
        "start_idx": 80,
        "end_idx": 93
      },
      {
        "text": "RAP Music",
        "start_idx": 109,
        "end_idx": 118
      },
      {
        "text": "ATLiens",
        "start_idx": 131,
        "end_idx": 138
      },
      {
        "text": "MOTM 1",
        "start_idx": 152,
        "end_idx": 158
      },
      {
        "text": "2",
        "start_idx": 161,
        "end_idx": 162
      },
      {
        "text": "MBDTF",
        "start_idx": 178,
        "end_idx": 183
      }
    ]
  },
  {
    "text": "It’s time to change your hearing partner while using your phone but wait! You shouldn’t have to choose randomly because we are going to make this process worth having for you. Here many you might get confused that why they have to spend their money on the [headsets](https://instantreviewsguide.com/best-lg-bluetooth-headset/) so here is the answer:",
    "annotations": [
      {
        "text": "headsets](https://instantreviewsguide.com/best-lg-bluetooth-headset/",
        "start_idx": 257,
        "end_idx": 325
      }
    ]
  },
  {
    "text": "My advice is be very careful choosing the tree because most of Saint Paul has clay water pipes and tree roots are very well known for getting into these pipes. This can cause your septic to back up and that is never a good time. A friend of mine needs to have his clay lines rooted out almost every year because of tree roots.",
    "annotations": [
      {
        "text": "Saint Paul",
        "start_idx": 63,
        "end_idx": 73
      }
    ]
  },
  {
    "text": "If you come down to the southern half of the state, you should also visit the Desert Museum in Tucson. Despite the name, it's more of an all-desert-wildlife zoo. There are a lot of fascinating and unique animals that live in the desert, and it's a good opportunity to see them all up close. Really close--they do a LOT of live animal demonstrations, so you can get up close and personal with owls and ringtail cats and horned toads and such. ",
    "annotations": [
      {
        "text": "Desert Museum in Tucson",
        "start_idx": 78,
        "end_idx": 101
      }
    ]
  },
  {
    "text": "if you watch the movie, then watch [this](https://www.youtube.com/watch?v=tUzy-xPf0MI) immediately after, it all makes sense.  if that shits not fresh in your mind though, the youtube vid might not make as much sense.  primer was crazy",
    "annotations": [
      {
        "text": "this](https://www.youtube.com/watch?v=tUzy-xPf0MI",
        "start_idx": 36,
        "end_idx": 85
      }
    ]
  },
  {
    "text": "If you are not planning on writing your own macro I'd say any of them. Your local library might have excel install on some machines free of use.",
    "annotations": [
      {
        "text": "excel",
        "start_idx": 101,
        "end_idx": 106
      }
    ]
  },
  {
    "text": "We’re releasing a game in a couple days called HoloVista - no ads, no IAP - one payment of 4.99. I’m biased but I’m really hopeful people enjoy it and I can see it on a list like this one day!",
    "annotations": [
      {
        "text": "HoloVista",
        "start_idx": 47,
        "end_idx": 56
      }
    ]
  },
  {
    "text": "If a 2060 is too much for your budget, you're looking at the 1660 Super.",
    "annotations": [
      {
        "text": "2060",
        "start_idx": 5,
        "end_idx": 9
      },
      {
        "text": "1660 Super",
        "start_idx": 61,
        "end_idx": 71
      }
    ]
  },
  {
    "text": "Buy on Amazon. Spending $1000+ on a phone, don’t cheap out on the case.",
    "annotations": []
  },
  {
    "text": "kylie style before tyga",
    "annotations": []
  },
  {
    "text": "Except the UC's are not fully funded by tax dollars and most of their revenue comes from students that attend the school, contracts and grants, and investment income. \n\nTaxpayers do support the UC's but they are by no means fully funded by California residents and actually receive a large amount of federal funding.",
    "annotations": [
      {
        "text": "UC",
        "start_idx": 11,
        "end_idx": 13
      },
      {
        "text": "UC",
        "start_idx": 194,
        "end_idx": 196
      }
    ]
  },
  {
    "text": "Takes practice.  There are VERY occasional times where it's nice to use something like vifm where you can do visual selection if you don't know exactly what you want to get done before hand.\n\nMost of the time though either you can write up a pretty slick command off the top of your head or redirect stdout to a file then convert it to a shell script (bulk rename for example is just this easy if you've got an editor that's worth a crap) in like 10 seconds.",
    "annotations": [
      {
        "text": "vifm",
        "start_idx": 87,
        "end_idx": 91
      }
    ]
  },
  {
    "text": "The Frugal Zealot, Amy Dacyczyn, recommended that every frugal person should buy one even if they lived in an apartment and had to keep it in the living room.  It is a major money-saver and a foundation for frugal eating.  \n\n1. You can buy in bulk from the produce broker and store fruits and vegetables.\n\n2. You can buy large quantities and take advantage of price fluctuations to buy low and eat out of your freezer while waiting for another sale.\n\n3. If you avoid the frost-free models your frozen foods will last much longer.\n\n4. A chest freezer is an extremely efficient way of storing food.  Cold air is heavier than warm air so very little of your cold air escapes when you open the lid.\n\n5. A chest freezer is so much more efficient than a refrigerator that people have worked on controllers that turn them into refrigerators. Commercial versions are available but are very costly.\n\n6.  With the built-in dividers and baskets available in a typical Kenmore freezer today you can have easier access to the silos of food that the dividers allow.  We also use rectangular lidded buckets (such as certain kitty litters come in) to make for easy storage in the chest freezer.\n\n7. I'd recommend you purchase the largest one that can fit in your home.  You will always find a use for the space.  But if you get a smaller one you can resell it and move up.\n\n8.  A freezer made after 1993 (in the USA) is much more efficient than older models due to increased insulation requirements.\n\n9.  Do not put it in unconditioned space if you can possibly avoid it.  The closer it is to your kitchen the more you will use it, and fighting mother nature takes away efficiency.\n\n10. If you do live in an apartment and need to put it in a visible location outside the kitchen, a creative disguise such as a table cloth will help and give you a temporary work top.  We use the top of our chest freezer all the time for spreading out paper work etc.\n",
    "annotations": []
  },
  {
    "text": "I've never played super battle but I play regular Rhino Hero somewhat frequently and we really have fun with it. We also like Animal Upon Animal. ",
    "annotations": [
      {
        "text": "super battle",
        "start_idx": 18,
        "end_idx": 30
      },
      {
        "text": "Rhino Hero",
        "start_idx": 50,
        "end_idx": 60
      },
      {
        "text": "Animal Upon Animal",
        "start_idx": 126,
        "end_idx": 144
      }
    ]
  },
  {
    "text": "At the pub I'll have wine most of the time. House red because I'm cheap and don't care. \n\nIf it's somewhere a bit fancier or different, I'll try all kinds of cocktails. I like rum or tequila based ones generally, and ones with fruit.",
    "annotations": [
      {
        "text": "wine",
        "start_idx": 21,
        "end_idx": 25
      },
      {
        "text": "rum",
        "start_idx": 176,
        "end_idx": 179
      },
      {
        "text": "tequila",
        "start_idx": 183,
        "end_idx": 190
      }
    ]
  },
  {
    "text": "Tom Holland is really the best out of the three we had. Toby was too much Peter and was a little stale as Spidey, Andrew was too hipster for Peter not have any friends or be a nerd, he was good as Spidey though. Tom gives us the best of both. He's got the nervousness and insecurities that make Peter relatable but those all go away when he becomes Spider-Man. He balances the two personas really well, IMO. ",
    "annotations": [
      {
        "text": "Tom Holland",
        "start_idx": 0,
        "end_idx": 11
      },
      {
        "text": "Toby",
        "start_idx": 56,
        "end_idx": 60
      },
      {
        "text": "Andrew",
        "start_idx": 114,
        "end_idx": 120
      },
      {
        "text": "Tom",
        "start_idx": 212,
        "end_idx": 215
      }
    ]
  },
  {
    "text": "I generally prefer Home Depot, mostly because they carry the tool brands I like (Milwaukee, Bosch, Makita, Ridgid) while the Lowe's near me does not. Although if it's any kind of big project, I am going to the local lumber yard and contractor supply. I've dealt with a few different Lowe's and Home Depot stores on a couple of big projects, and all of them were miserable to deal with when it comes to getting quotes on large orders, scheduling deliveries, etc. The lumber yard and contractors supply were much more professional, and can usually be talked into cutting a small deal that brings the price down to around the same price as it would be at Lowe's or HD. ",
    "annotations": [
      {
        "text": "Home Depot",
        "start_idx": 19,
        "end_idx": 29
      },
      {
        "text": "Lowe's",
        "start_idx": 125,
        "end_idx": 131
      },
      {
        "text": "Lowe's",
        "start_idx": 283,
        "end_idx": 289
      },
      {
        "text": "Home Depot",
        "start_idx": 294,
        "end_idx": 304
      },
      {
        "text": "Lowe's",
        "start_idx": 652,
        "end_idx": 658
      },
      {
        "text": "HD",
        "start_idx": 662,
        "end_idx": 664
      }
    ]
  },
  {
    "text": "1-Rodgers\n\n2-Mahomes\n\n3-Brady\n\n4-Donald\n\n5-Watt\n\n6-Henry\n\n7-Adams\n\n8-Kelce\n\n9-Hopkins\n\n10-Russ",
    "annotations": [
      {
        "text": "1-Rodgers",
        "start_idx": 0,
        "end_idx": 9
      },
      {
        "text": "2-Mahomes",
        "start_idx": 11,
        "end_idx": 20
      },
      {
        "text": "3-Brady",
        "start_idx": 22,
        "end_idx": 29
      },
      {
        "text": "4-Donald",
        "start_idx": 31,
        "end_idx": 39
      },
      {
        "text": "5-Watt",
        "start_idx": 41,
        "end_idx": 47
      },
      {
        "text": "6-Henry",
        "start_idx": 49,
        "end_idx": 56
      },
      {
        "text": "7-Adams",
        "start_idx": 58,
        "end_idx": 65
      },
      {
        "text": "8-Kelce",
        "start_idx": 67,
        "end_idx": 74
      },
      {
        "text": "9-Hopkins",
        "start_idx": 76,
        "end_idx": 85
      },
      {
        "text": "10-Russ",
        "start_idx": 87,
        "end_idx": 94
      }
    ]
  },
  {
    "text": "Hi, I'd go with the Gateway 14.1\" for a budget friendly option, but the only issue is that it isn't well known. Otherwise, the Acer Swift 3 14\" is a good choice if spending more of the budget is fine.",
    "annotations": [
      {
        "text": "Gateway 14.1",
        "start_idx": 20,
        "end_idx": 32
      },
      {
        "text": "Acer Swift 3 14",
        "start_idx": 127,
        "end_idx": 142
      }
    ]
  },
  {
    "text": "The Lark for dinner.\nHonor Bar for lunch.\n",
    "annotations": [
      {
        "text": "The Lark",
        "start_idx": 0,
        "end_idx": 8
      },
      {
        "text": "Honor Bar",
        "start_idx": 21,
        "end_idx": 30
      }
    ]
  },
  {
    "text": "Almost. I’ve got the Ringke Onyx on my 13 Pro Max right now and while it has the bump opposite the cameras, it still rocks a little. Granted, it rocks less than if the bump wasn’t there, but the bump still isn’t tall enough to offset the camera bump. \n\nSame exact experience as last year with the Onyx and 12 Pro Max. But at least Ringke got the Onyx right from the get go this year and it doesn’t show any of the frame around the edges now.",
    "annotations": [
      {
        "text": "Ringke Onyx",
        "start_idx": 21,
        "end_idx": 32
      },
      {
        "text": "Onyx",
        "start_idx": 297,
        "end_idx": 301
      },
      {
        "text": "Onyx",
        "start_idx": 346,
        "end_idx": 350
      }
    ]
  },
  {
    "text": "You're so helpful thanks for sharing all this info ! I'm waiting on my Hayate Otsu v2 as my first artisan. After hearing your opinion that it's super comfortable and the way you describe it performs closely to the Hien and Zero i'm soooooo PUMPED to get mine.\n\nQuick question for you tho. I spend most of my time playing Apex legends, am I \"losing out\" by choosing the Hayate Zero v2 over the Hien for this game ?",
    "annotations": [
      {
        "text": "Hayate Otsu v2",
        "start_idx": 71,
        "end_idx": 85
      },
      {
        "text": "Hien",
        "start_idx": 214,
        "end_idx": 218
      },
      {
        "text": "Zero",
        "start_idx": 223,
        "end_idx": 227
      },
      {
        "text": "Hayate Zero v2",
        "start_idx": 369,
        "end_idx": 383
      },
      {
        "text": "Hien",
        "start_idx": 393,
        "end_idx": 397
      }
    ]
  },
  {
    "text": "1. Xenogears (PS1)\n2. FFVI (FF3 SNES)\n3. Dragon Warrior 4 (NES)\n4. Star Ocean 3 (PS2)\n5. Minecraft (PC)",
    "annotations": [
      {
        "text": "Xenogears",
        "start_idx": 3,
        "end_idx": 12
      },
      {
        "text": "FFVI",
        "start_idx": 22,
        "end_idx": 26
      },
      {
        "text": "Dragon Warrior 4",
        "start_idx": 41,
        "end_idx": 57
      },
      {
        "text": "NES",
        "start_idx": 59,
        "end_idx": 62
      },
      {
        "text": "Star Ocean 3",
        "start_idx": 67,
        "end_idx": 79
      },
      {
        "text": "Minecraft",
        "start_idx": 89,
        "end_idx": 98
      }
    ]
  },
  {
    "text": "Nier: Automata shares the best game of PS5 title for me(God of War is the second). While mostly being a action game with superb story and audio design, it easily fills the RPG void with it's storytelling and atmosphere.",
    "annotations": [
      {
        "text": "Nier: Automata",
        "start_idx": 0,
        "end_idx": 14
      }
    ]
  },
  {
    "text": "Most of my favorites have already been mentioned, like rum, whiskey, and cider.\n\nMead is fantastic as well. There's a local meadery here that I absolutely adore, but I also shell out for the imported stuff. Ribe Mjod is my favorite that isn't local brewed.",
    "annotations": [
      {
        "text": "rum",
        "start_idx": 55,
        "end_idx": 58
      },
      {
        "text": "whiskey",
        "start_idx": 60,
        "end_idx": 67
      },
      {
        "text": "cider",
        "start_idx": 73,
        "end_idx": 78
      },
      {
        "text": "Mead",
        "start_idx": 81,
        "end_idx": 85
      },
      {
        "text": "Ribe Mjod",
        "start_idx": 207,
        "end_idx": 216
      }
    ]
  },
  {
    "text": "> The Witcher 3 should be on there as well IMO\n\nWitcher 3 is, without a shade of doubt, the definitive RPG, but its not a Playstation exclusive. If you're looking for RPGs, and the PS4 is your platform of choice, then Witcher 3 should be the first game recommended. Wasn't there a PS4Pro patch announced for it shortly after the X1X unveil? Should enable a little better than the mere 1080p30 the PS4 delivers now, but I haven't heard much on it since then. ",
    "annotations": [
      {
        "text": "The Witcher 3",
        "start_idx": 2,
        "end_idx": 15
      },
      {
        "text": "Witcher 3",
        "start_idx": 48,
        "end_idx": 57
      },
      {
        "text": "Witcher 3",
        "start_idx": 218,
        "end_idx": 227
      }
    ]
  },
  {
    "text": "\\#1 - The Witcher 3\n\n\\#2 - Mass Effect 2\n\n\\#3 - Fallout: New Vegas\n\n\\#4 - Oblivion\n\n\\#5 - Cyberpunk 2077\n\n\\#6 - Dragon Quest 11 S\n\n\\#7 - Deus Ex: Human Revolution\n\n\\#8 - Skyrim\n\n\\#9 - Persona 5 Royal\n\n\\#10 - The Outer Worlds\n\nI didn't include any games I've not finished yet, so chrono trigger may find its way on here pretty soon.",
    "annotations": [
      {
        "text": "The Witcher 3",
        "start_idx": 6,
        "end_idx": 19
      },
      {
        "text": "Mass Effect 2",
        "start_idx": 27,
        "end_idx": 40
      },
      {
        "text": "Fallout: New Vegas",
        "start_idx": 48,
        "end_idx": 66
      },
      {
        "text": "Oblivion",
        "start_idx": 74,
        "end_idx": 82
      },
      {
        "text": "Cyberpunk 2077",
        "start_idx": 90,
        "end_idx": 104
      },
      {
        "text": "Dragon Quest 11 S",
        "start_idx": 112,
        "end_idx": 129
      },
      {
        "text": "Deus Ex: Human Revolution",
        "start_idx": 137,
        "end_idx": 162
      },
      {
        "text": "Skyrim",
        "start_idx": 170,
        "end_idx": 176
      },
      {
        "text": "Persona 5 Royal",
        "start_idx": 184,
        "end_idx": 199
      },
      {
        "text": "The Outer Worlds",
        "start_idx": 208,
        "end_idx": 224
      },
      {
        "text": "chrono trigger",
        "start_idx": 279,
        "end_idx": 293
      }
    ]
  },
  {
    "text": "Thanks \n\nWhich one would you choose out of this [evoo](https://www.walmart.com/ip/Laptop-FHD-GTX-Windows-Black-Intel-Nvidia-Display-i7-9750H-16GB-Tuned-10-THX-Memory-Home-144Hz-9th-SSD-512GB-EVOO-Gen-Spatial-Audio-Gaming-15-1660Ti/685182150?irgwc=1&sourceid=imp_VxS0XVwqIxyOWsPwUx0Mo3YXUkiyUKzWdUpqTU0&veh=aff&wmlspartner=imp_1883484&clickid=VxS0XVwqIxyOWsPwUx0Mo3YXUkiyUKzWdUpqTU0&sharedid=) at 950 and this [asus](https://www.bhphotovideo.com/c/product/1558021-REG/asus_tuf506iu_es74_tuf_a17_gaming_laptop.html) that's listed at 999\n\nI really envy how discrete and clean the evoo looks, basically same specs all around except the cpu.\nIs asus' cpu Ryzen 7 4800H significantly better than  i7-9750H to make you forego the gamery design of the asus and choose the asus?",
    "annotations": [
      {
        "text": "evoo](https://www.walmart.com/ip/Laptop-FHD-GTX-Windows-Black-Intel-Nvidia-Display-i7-9750H-16GB-Tuned-10-THX-Memory-Home-144Hz-9th-SSD-512GB-EVOO-Gen-Spatial-Audio-Gaming-15-1660Ti/685182150?irgwc=1&sourceid=imp_VxS0XVwqIxyOWsPwUx0Mo3YXUkiyUKzWdUpqTU0&veh=aff&wmlspartner=imp_1883484&clickid=VxS0XVwqIxyOWsPwUx0Mo3YXUkiyUKzWdUpqTU0&sharedid=",
        "start_idx": 49,
        "end_idx": 391
      },
      {
        "text": "asus](https://www.bhphotovideo.com/c/product/1558021-REG/asus_tuf506iu_es74_tuf_a17_gaming_laptop.html",
        "start_idx": 410,
        "end_idx": 512
      },
      {
        "text": "evoo",
        "start_idx": 577,
        "end_idx": 581
      },
      {
        "text": "asus",
        "start_idx": 640,
        "end_idx": 644
      },
      {
        "text": "asus",
        "start_idx": 744,
        "end_idx": 748
      },
      {
        "text": "asus",
        "start_idx": 764,
        "end_idx": 768
      }
    ]
  },
  {
    "text": "Not in any order.\n\n1. Dolce and Gabbana Dolce Shine\n2. Ariana Grande Cloud\n3. YSL Black Opium\n4. Chanel Chance Tendre\n5. Dolce and Gabbana Limperatrice 3\n6. Versace Bright Crystal\n7. Prada Candy\n8. Valentino Donna Born in Roma\n9. Ariana Grande Sweet Like Candy \n10. Zara Red Vanilla",
    "annotations": [
      {
        "text": "Dolce",
        "start_idx": 22,
        "end_idx": 27
      },
      {
        "text": "Gabbana Dolce Shine",
        "start_idx": 32,
        "end_idx": 51
      },
      {
        "text": "Ariana Grande Cloud",
        "start_idx": 55,
        "end_idx": 74
      },
      {
        "text": "YSL Black Opium",
        "start_idx": 78,
        "end_idx": 93
      },
      {
        "text": "Chanel Chance Tendre",
        "start_idx": 97,
        "end_idx": 117
      },
      {
        "text": "Dolce",
        "start_idx": 121,
        "end_idx": 126
      },
      {
        "text": "Gabbana Limperatrice 3",
        "start_idx": 131,
        "end_idx": 153
      },
      {
        "text": "Versace Bright Crystal",
        "start_idx": 157,
        "end_idx": 179
      },
      {
        "text": "Prada Candy",
        "start_idx": 183,
        "end_idx": 194
      },
      {
        "text": "Valentino Donna Born in Roma",
        "start_idx": 198,
        "end_idx": 226
      },
      {
        "text": "Ariana Grande Sweet Like Candy",
        "start_idx": 230,
        "end_idx": 260
      },
      {
        "text": "Zara Red Vanilla",
        "start_idx": 266,
        "end_idx": 282
      }
    ]
  },
  {
    "text": "Along with BU and several other universities within a 10-20 mile radius in the Boston area.\n\nEdit: MIT is number 5, Harvard is 6, BU is 70, Tufts is 169, UMass is 191, Northeastern is 193, Brandeis is 201-250 (not sure why they give a range there), and BC is 301-350.  MIT, Harvard, Northeastern, UMass, BC, and BU are all within 5 miles of each other, Tufts is an extra 5 miles away, and Brandeis is another 5.",
    "annotations": [
      {
        "text": "BU",
        "start_idx": 11,
        "end_idx": 13
      },
      {
        "text": "MIT",
        "start_idx": 99,
        "end_idx": 102
      },
      {
        "text": "Harvard",
        "start_idx": 116,
        "end_idx": 123
      },
      {
        "text": "BU",
        "start_idx": 130,
        "end_idx": 132
      },
      {
        "text": "Tufts",
        "start_idx": 140,
        "end_idx": 145
      },
      {
        "text": "UMass",
        "start_idx": 154,
        "end_idx": 159
      },
      {
        "text": "Northeastern",
        "start_idx": 168,
        "end_idx": 180
      },
      {
        "text": "Brandeis",
        "start_idx": 189,
        "end_idx": 197
      },
      {
        "text": "BC",
        "start_idx": 253,
        "end_idx": 255
      },
      {
        "text": "MIT",
        "start_idx": 269,
        "end_idx": 272
      },
      {
        "text": "Harvard",
        "start_idx": 274,
        "end_idx": 281
      },
      {
        "text": "Northeastern",
        "start_idx": 283,
        "end_idx": 295
      },
      {
        "text": "UMass",
        "start_idx": 297,
        "end_idx": 302
      },
      {
        "text": "BC",
        "start_idx": 304,
        "end_idx": 306
      },
      {
        "text": "BU",
        "start_idx": 312,
        "end_idx": 314
      },
      {
        "text": "Tufts",
        "start_idx": 353,
        "end_idx": 358
      },
      {
        "text": "Brandeis",
        "start_idx": 389,
        "end_idx": 397
      }
    ]
  },
  {
    "text": "There were other, better Roman generals during the Second Punic War. Scipio Africanus just got lucky. A friend on a forum I'm a member of wrote a particularly good essay on three of them. Short, but informative.\n\n>It is a common belief to say that Scipio Africanus, or Publius Cornelius Scipio \"the Younger\" was the greatest general of the 2nd Punic War. I believe otherwise and Authors of books on the Subject also do not believe so. Let me go into detail about who i believe were Romes Saviors during the war with Hannibal.\n\n>Fabius Maximus\n\n>It is commonly believed that because he never won a major battle against Hannibal, he must be a bad General. Yet that is a false belief. He was known as the Buckler of Rome, and was a very intelligent and defensive Consul. He was the only roman Consul of the whole war to be assumed the title \"Dictator\". Just to have been bestowed this title is proof he was an able and trusted warrior. His only mistake was his rigid tactics and he never improved upon them. This was improved upon though.\n\n>Marcus Minucius his \"Master of Horse\" or second in command of all Roman forces, was eventually entrusted with dual-command with Fabius. He was a much more popular Soldier. When Fabius left for Roma, Minucius used the \"Fabian Tactics\" along with an offensive reform to it. He managed to cut off many of Hannibal's foragers and killed supposedly 1/4 of his whole army and managed to attack Hannibal's camp. Luck was on Hannibal's side and when the Foragers returned Minucius was forced to retreat.\n\n>Fabius Maximus did manage to use the new \"Offensive Fabian Tactics\". Fabius constantly skirmished and fought Hannibal on a few different occasions. He was a constant thorn in Hannibal's Side. His most valuable tool was patience, and he used it well.\n\n\n>Marcellus\n\n>Marcellus is known, and was known, as the \"Sword of Rome\". He was a brilliant,and great General. He was blessed with the Patience of Fabius, yet his offensive campaigns were respected by Hannibal. He was a great warrior, and an Ideal Roman. In a battle in Cisalpine Gaul he killed a Gallic King by his own hand and dedicated the spoils to Jupiter in the Capitol. He is the only known Roman to ever do this.\n\n>Marcellus first should be given credit for the Sicilian Campaign. While the War in Italy was at a Standstill, Marcellus lead his legions to Syracuse an put it under siege. Now, think about this. Marcellus had 2 punic Armies facing him outside the city, one Syracusan army inside the City, and 3,000 Numidians lying on his flank. He was surrounded, outnumbered, alone. Syracuse had always had an admirable military and rome had always respected that. The Carthaginians and Numidians had shown themselves to be good warriors as well.\n\n>Marcellus managed to destroy all the armies outside of the city, defeat the \"sally-ing\" army, and capture the City in one battle. That is an achievement. Another of his Achievements was the battle of Nola. In truth, there were three battles of Nola. It is estimated in each battle he killed around 6,000 of Hannibal's men while himself losing less than one thousand. One way to compare Marcellus and Hannibal is to imagine to boxers in a ring. They each take the pain, almost take each other down, and costantly lose and gain the advantage.\n\n>Sadley, Marcellus and the Consul Crispinus were killed in a skirmish with Hannibal's dreaded numidians. Marcellus and Crispinus took 200 horsemen into the woods to scout out the terrain. When the Numidians attacked, Marcellus was pierced by a lance before he could react. That moment, Rome's greatest hope in the war so far died. He was consul four times in the war, and praetor many times as well.\n\n>Claudius Nero\n\n>Possibly one of the most Underestimated men in the Whole war between Rome and Carthage. Yet the role he played was vital to the survival of Roma. Nero was not a Fabius, yet he was not a Marcellus. After Publius Cornelius Scipio was killed in Spain, Nero took over not that long afterwards. Nero knew how to gain alliances and with his Spanish allies managed to defeat Hasdrubal Barca and push him out of the small Roman occupied area of Spain. After this great achievement, Nero managed to push deeply into spain and for awhile it looked as if Carthaginian Spain would fall. Nero pushed as Far as Baetis and was in sight of Carthago Nova when he was replaced by the young Scipio, Publius Cornelius Scipio \"The Younger\". While Scipio was arriving in Spain, and Nero was already called home, Hasdrubal did manage to take back most of Spain.\n\n>Nero was very unpopular with the people and the senate though. So even though his success's were great, they were downplayed and generally tossed aside. Nero would have a time to redeem himself though.\n\n>Scipio conducted his campaign in Spain with the mind of a brilliant general, not a great one. After Scipio defeated Hasdrubal Barca in Southern Spain, he allowed Hasdrubal to escape. This was a mistake which made him unpopular in Rome and he could have caught Hasdrubal too.\n\n>Hasdrubal re-formed his forces and moved into Italy. At this time in the war Rome was as afraid of Hasdrubal as it was Hannibal. This was Scipio's mistake. He had allowed Hadrubal to re-form and march into italy full of African, Spanish, and Gallic forces. These were the men Hannibal had used to defeat the Romans and truly, were the best of the Carthaginian Army.\n\n>If Hasdrubal linked up with Hannibal, then the future was bleak for Rome. Hannibal would have some 70,000-80,000 men under his command. 50,000 of which would be the Heavy Spanish and African infantry. Nero would gain his glory here. Nero would do an astounding 250 mile march in 7 days, a grand feat. The soldiers would march all day and night, the ones that were exhausted and fell asleep were carried in wagons. Once he Arrived in Camp, he told his men they would fight the next day.\n\n>Nero was in overall command at the Battle of Metaurus. It is because he marched so far so fast that the Romans defeated and killed Hasdrubal Barca. After the battle was over, Nero, the Hero of Rome at the time, Marched back to his consular Camp before Hannibal with his chosen 7,000. He had Marched over 500 miles, won the victory of the year, and destroyed the chances for a carthaginian Victory in Italy ; all within 2 weeks. Hannibal didnt even know.\n\nJust to make it clear, this isn't my work. Thank PyrrhusIV from the Total War Center forums.\nSource:http://www.twcenter.net/forums/showthread.php?p=530773#post530773",
    "annotations": [
      {
        "text": "Scipio Africanus",
        "start_idx": 69,
        "end_idx": 85
      },
      {
        "text": "Scipio Africanus",
        "start_idx": 248,
        "end_idx": 264
      },
      {
        "text": "Publius Cornelius Scipio \"the Younger\"",
        "start_idx": 269,
        "end_idx": 307
      },
      {
        "text": "Fabius Maximus",
        "start_idx": 528,
        "end_idx": 542
      },
      {
        "text": "Marcus Minucius",
        "start_idx": 1038,
        "end_idx": 1053
      },
      {
        "text": "Fabius",
        "start_idx": 1166,
        "end_idx": 1172
      },
      {
        "text": "Fabius",
        "start_idx": 1215,
        "end_idx": 1221
      },
      {
        "text": "Minucius",
        "start_idx": 1237,
        "end_idx": 1245
      },
      {
        "text": "Minucius",
        "start_idx": 1502,
        "end_idx": 1510
      },
      {
        "text": "Fabius Maximus",
        "start_idx": 1536,
        "end_idx": 1550
      },
      {
        "text": "Fabius",
        "start_idx": 1605,
        "end_idx": 1611
      },
      {
        "text": "Marcellus",
        "start_idx": 1789,
        "end_idx": 1798
      },
      {
        "text": "Marcellus",
        "start_idx": 1801,
        "end_idx": 1810
      },
      {
        "text": "Marcellus",
        "start_idx": 2210,
        "end_idx": 2219
      },
      {
        "text": "Marcellus",
        "start_idx": 2320,
        "end_idx": 2329
      },
      {
        "text": "Marcellus",
        "start_idx": 2405,
        "end_idx": 2414
      },
      {
        "text": "Marcellus",
        "start_idx": 2744,
        "end_idx": 2753
      },
      {
        "text": "Marcellus",
        "start_idx": 3130,
        "end_idx": 3139
      },
      {
        "text": "Marcellus",
        "start_idx": 3295,
        "end_idx": 3304
      },
      {
        "text": "Consul Crispinus",
        "start_idx": 3313,
        "end_idx": 3329
      },
      {
        "text": "Marcellus",
        "start_idx": 3391,
        "end_idx": 3400
      },
      {
        "text": "Crispinus",
        "start_idx": 3405,
        "end_idx": 3414
      },
      {
        "text": "Marcellus",
        "start_idx": 3503,
        "end_idx": 3512
      },
      {
        "text": "Claudius Nero",
        "start_idx": 3688,
        "end_idx": 3701
      },
      {
        "text": "Nero",
        "start_idx": 3850,
        "end_idx": 3854
      },
      {
        "text": "Fabius",
        "start_idx": 3865,
        "end_idx": 3871
      },
      {
        "text": "Publius Cornelius Scipio",
        "start_idx": 3907,
        "end_idx": 3931
      },
      {
        "text": "Nero",
        "start_idx": 3994,
        "end_idx": 3998
      },
      {
        "text": "Nero",
        "start_idx": 4178,
        "end_idx": 4182
      },
      {
        "text": "Scipio",
        "start_idx": 4376,
        "end_idx": 4382
      },
      {
        "text": "Publius Cornelius Scipio \"The Younger\"",
        "start_idx": 4384,
        "end_idx": 4422
      },
      {
        "text": "Scipio",
        "start_idx": 4430,
        "end_idx": 4436
      },
      {
        "text": "Nero",
        "start_idx": 4464,
        "end_idx": 4468
      },
      {
        "text": "Nero",
        "start_idx": 4545,
        "end_idx": 4549
      },
      {
        "text": "Nero",
        "start_idx": 4698,
        "end_idx": 4702
      },
      {
        "text": "Scipio",
        "start_idx": 4749,
        "end_idx": 4755
      },
      {
        "text": "Scipio",
        "start_idx": 5164,
        "end_idx": 5170
      },
      {
        "text": "Nero",
        "start_idx": 5595,
        "end_idx": 5599
      },
      {
        "text": "Nero",
        "start_idx": 5627,
        "end_idx": 5631
      },
      {
        "text": "Nero",
        "start_idx": 5882,
        "end_idx": 5886
      },
      {
        "text": "Nero",
        "start_idx": 6057,
        "end_idx": 6061
      }
    ]
  },
  {
    "text": "California Republic make some nice pencils. I personally like their [Palomino 2H](http://www.pencils.com/all-brands/palomino/palomino-graphite-orange-pencils-12-ct) for sketching. They have also reproduced the famous [Blackwing](http://www.pencils.com/all-brands/palomino/palomino-blackwing-12-pk). Both are really good.",
    "annotations": [
      {
        "text": "California Republic",
        "start_idx": 0,
        "end_idx": 19
      },
      {
        "text": "Palomino 2H](http://www.pencils.com",
        "start_idx": 69,
        "end_idx": 104
      },
      {
        "text": "Blackwing](http://www.pencils.com",
        "start_idx": 218,
        "end_idx": 251
      }
    ]
  },
  {
    "text": "SFGADV looks a lot better than MM, which looks very overrated. ",
    "annotations": [
      {
        "text": "SFGADV",
        "start_idx": 0,
        "end_idx": 6
      },
      {
        "text": "MM",
        "start_idx": 31,
        "end_idx": 33
      }
    ]
  },
  {
    "text": "The Dirty Picture & Chamatkar supremacy.",
    "annotations": [
      {
        "text": "The Dirty Picture",
        "start_idx": 0,
        "end_idx": 17
      },
      {
        "text": "Chamatkar",
        "start_idx": 20,
        "end_idx": 29
      }
    ]
  },
  {
    "text": "Portable wireless Bluetooth  speaker. Really fun purchase. Makes podcasts, music, and videos more fun with my smartphone. \n\nI have the Oontz Angle Plus and like it. The Ultimate Ears Mini Boom is supposed to be really good too.",
    "annotations": [
      {
        "text": "Oontz Angle Plus",
        "start_idx": 135,
        "end_idx": 151
      },
      {
        "text": "Ultimate Ears Mini Boom",
        "start_idx": 169,
        "end_idx": 192
      }
    ]
  },
  {
    "text": "Hey, Ambrose played 98 tests for 405 wickets at 21 a piece. That's ridiculously consistant. And he had pace too.",
    "annotations": [
      {
        "text": "Ambrose",
        "start_idx": 5,
        "end_idx": 12
      }
    ]
  }
]