{
    "data": [
        {
            "body": "Cool. I tried City of the Living Dead and it didn't click. Makes sense since I had the same from The Pit and the Pendulum."
        },
        {
            "body": "Liked *Anguish* the most out of the both of them. The fever dream sequences reminded me of Ken Russell's style which is great. I've seen *The Lost World* before so that was sorta a trip seeing it in another movie."
        },
        {
            "body": "Or college. ¯\\\\\\_(ツ)_/¯"
        },
        {
            "body": "It came out years after I graduated but it felt like a movie I'd have maybe enjoyed if I saw it in high school."
        },
        {
            "body": "Place beyond the pines\n\nMagnolia \n\nBabel"
        },
        {
            "body": "Same here man, I don't understand its popularity but at least lot of people found 'their' film."
        },
        {
            "body": "Hey, I watched The Place Beyond the Pines last month too! Only I ended up hating it :("
        },
        {
            "body": "The Game (1997)\n\nI watched several movies last month, but this is the only one that really stuck with me. It was brilliant. Had no idea what’s going on until the very end and it surprised me. I also recommended my friends to watch it. Would love to watch more movies like this. Hope someone has suggestions."
        },
        {
            "body": "Not a movie, but undeniable. Squid Game is the best thing I watched, I know I sound basic.\n\nI haven't seen a good movie in a longtime.\n\nI do enjoy movie shorts from the youtube channel Dust.  There are alot of tiny movie makers that will never make money but give their movies for free on the Dust channel.\n\nI recommend Dust on youtube."
        },
        {
            "body": "Sounds good, thanks! The Top 100 list is cool too, lot to check out."
        },
        {
            "body": "Any movie you found to be good. I personally think of that as movies that are 8+/10."
        },
        {
            "body": "👍"
        },
        {
            "body": "Punch Drunk Love (2002)\n\nBody Double (1984)\n\nThe Great Gatsby (2013)\n\nOnce Upon a Time in Hollywood (2019)\n\nPump Up The Volume (1990)\n\nPig (2021)\n\nFirst time voting here, how many can we include? I'll go with these six, so good! Some great fun unseen to me Paul Thomas Anderson, and lots of other greats there like Tarantino, De Palma, and Luhrmann. And some gems!"
        },
        {
            "body": "Of the 46 movies I saw for the first time: \n\n* Mississippi Grind (2015)\n* Lord of War (2005)\n* Can You Ever Forgive Me? (2018)\n* Kajillionaire (2020)\n* The Truffle Hunters (2020)\n* Audition (1999)\n* The Guest (2014)\n* Pig (2021)\n* Lock, Stock, and Two Smoking Barrels (1998)\n* Don't Think Twice (2016)"
        },
        {
            "body": "In the Mouth of Madness (1994)\n\nFear and Loathing in Las Vegas (1998)\n\nFrom Dusk Till Dawn (1996)\n\nThe Killing (1956)\n\nCity of the Living Dead (1980)\n\nThe Silence of the Lambs (1991)\n\nCarrie (1976)\n\nI added Angst and Anguish to my watchlist."
        },
        {
            "body": "After Hours"
        },
        {
            "body": "1. Manchester By The Sea(2016)\n2. The Departed(2006)\n3. Rockstar(2011)\n4. The Squid and The Whale(2005)\n5. Marriage Story(2019)"
        },
        {
            "body": "Memories of Murder\n\nBernie\n\nKiss kiss Bang Bang"
        },
        {
            "body": "1) Shang Chi and the Legend of the Ten Rings *9/10*\n\n2) Free Guy 8*.5/10*\n\n3) Dune *9/10*\n\n4) The Suicide Squad (2021) *8/10*\n\n5) Enola Holmes *7.5/10*"
        },
        {
            "body": "Yeah. ¯\\\\\\_(ツ)_/¯"
        },
        {
            "body": "Le Doulos\n\nDune\n\nThe new world"
        },
        {
            "body": "Kind of sad that someone felt the need to delete their movie suggestion off the back of another's individual opinion."
        },
        {
            "body": "The Many Saints of Newark \n\nDon't understand the hate from some. I thought it was very in tune, respectful and accurate to the show.\n\nMy guess is that a lot of people giving it poor reviews may not be very familiar with the show."
        },
        {
            "body": "Cool, added."
        },
        {
            "body": "Yes sorry, I meant move. I edited it now. The version that I watched was with Denzel, it was great."
        }
    ]
}