[
  {
    "text": "One important thing to note about Visual Studio is that there is a new edition called Community which is free yet it supports extensions and has almost everything Professional edition has, and VS 2015 update 2 is quite close to full C++17 support EDIT: and experimental support for Clang frontend",
    "annotations": [
      {
        "text": "Visual Studio",
        "start_idx": 34,
        "end_idx": 47
      },
      {
        "text": "VS 2015 update 2",
        "start_idx": 193,
        "end_idx": 209
      }
    ]
  },
  {
    "text": "On Linux, eclipse. Better vim emulation than clion and doesn't just work with cmake. Better indexing and features than qtcreator (unless you're actually using Qt, perhaps).",
    "annotations": [
      {
        "text": "eclipse",
        "start_idx": 10,
        "end_idx": 17
      },
      {
        "text": "clion",
        "start_idx": 45,
        "end_idx": 50
      },
      {
        "text": "qtcreator",
        "start_idx": 119,
        "end_idx": 128
      }
    ]
  },
  {
    "text": "The \"best\" IDE on windows is probably Visual Studio.\n\nI do not say that it is perfect.\n\nThere is also free community edition of it.",
    "annotations": [
      {
        "text": "Visual Studio",
        "start_idx": 38,
        "end_idx": 51
      }
    ]
  },
  {
    "text": "    I've found it to be faster than CLion, though it's missing some handy functions that CLion has.\n\nCan you elaborate what are those handy functions?",
    "annotations": [
      {
        "text": "CLion",
        "start_idx": 36,
        "end_idx": 41
      },
      {
        "text": "CLion",
        "start_idx": 89,
        "end_idx": 94
      }
    ]
  },
  {
    "text": "I like a simple setup. I'm using Sublime Text (https://www.sublimetext.com/) for writing and Coati (https://www.coati.io/) for navigation and understanding. They both work on Windows.",
    "annotations": [
      {
        "text": "Sublime Text",
        "start_idx": 33,
        "end_idx": 45
      },
      {
        "text": "Coati",
        "start_idx": 93,
        "end_idx": 98
      }
    ]
  },
  {
    "text": "Did You write java? How does CDT compare to JDT (specifically java EE version)?",
    "annotations": []
  },
  {
    "text": "You don't mention what OS you're using, but some general observations:\n\n    On Windows, Visual Studio is the standard IDE. The Express Community version is free to download and use. Its \"intellisense\" is second to none. The only downside is that the compiler doesn't support the latest standards as well as Clang and GCC.\n\n    I use a Mac, and I can highly recommend CLion by Jetbrains (it's also available for Windows and Linux). The only downside is that it's a paid product (although they do offer a one month free trial).\n\n    QtCreator is another multiplatform IDE that is widely used. I've found it to be faster than CLion, though it's missing some handy functions that CLion has. It is free, though.\n\n    Lastly, if you're using Linux or MacOS then many people swear by Emacs. (Many other people swear at it, though.) It's not an IDE in the traditional sense, but it can be configured to do just about anything, if you're the kind of person who likes tinkering with that sort of thing.",
    "annotations": [
      {
        "text": "Visual Studio",
        "start_idx": 88,
        "end_idx": 101
      },
      {
        "text": "CLion",
        "start_idx": 367,
        "end_idx": 372
      },
      {
        "text": "QtCreator",
        "start_idx": 531,
        "end_idx": 540
      },
      {
        "text": "CLion",
        "start_idx": 623,
        "end_idx": 628
      },
      {
        "text": "CLion",
        "start_idx": 676,
        "end_idx": 681
      },
      {
        "text": "Emacs",
        "start_idx": 777,
        "end_idx": 782
      }
    ]
  },
  {
    "text": "I use Kdevelop as an ide, fast and lots of useful features. Not sure how easy it is to install on windows though",
    "annotations": [
      {
        "text": "Kdevelop",
        "start_idx": 6,
        "end_idx": 14
      }
    ]
  },
  {
    "text": "This comment has been overwritten by an open source script to protect this user's privacy. It was created to help protect users from doxing, stalking, harassment, and profiling for the purposes of censorship.\n\nIf you would also like to protect yourself, add the Chrome extension TamperMonkey, or the Firefox extension GreaseMonkey and add this open source script.\n\nThen simply click on your username on Reddit, go to the comments tab, scroll down as far as possible (hint:use RES), and hit the new OVERWRITE button at the top.",
    "annotations": []
  },
  {
    "text": "Is not a IDE.",
    "annotations": []
  },
  {
    "text": "On Macs xcode is pretty much the standard ide. Not saying that clion is a bad choice there or anywhere else though.",
    "annotations": [
      {
        "text": "xcode",
        "start_idx": 8,
        "end_idx": 13
      },
      {
        "text": "clion",
        "start_idx": 63,
        "end_idx": 68
      }
    ]
  },
  {
    "text": "Vim.",
    "annotations": [
      {
        "text": "Vim",
        "start_idx": 0,
        "end_idx": 3
      }
    ]
  },
  {
    "text": "A link to a good reference;\n\nhttps://m.reddit.com/r/learnprogramming/wiki/tools",
    "annotations": []
  }
]